{
  "culture": "fr",
  "texts": {
    "GetStarted": "Commencer - Modèles de démarrage",
    "Create": "Créer",
    "NewProject": "Nouveau projet",
    "DirectDownload": "Téléchargement direct",
    "ProjectName": "Nom du projet",
    "ProjectType": "Type de projet",
    "DatabaseProvider": "Fournisseur de base de données",
    "DatabaseManagementSystem": "Système de gestion de base de données",
    "NTier": "N-Tier",
    "IncludeUserInterface": "Inclure l'interface utilisateur",
    "CreateNow": "Créer maintenant",
    "TheStartupProject": "Le projet de démarrage",
    "Tutorial": "Didacticiel",
    "UsingCLI": "Utilisation de la CLI",
    "SeeDetails": "Voir les détails",
    "AbpShortDescription": "ABP Framework est une infrastructure complète pour créer des solutions logicielles avec des architectures modernes basées sur la plateforme ASP.NET Core.",
    "SourceCodeUpper": "CODE SOURCE",
    "LatestReleaseLogs": "Derniers journaux de version",
    "Infrastructure": "Infrastructure",
    "Architecture": "Architecture",
    "Modular": "Modulaire",
    "DontRepeatYourself": "Ne vous répétez pas",
    "DeveloperFocused": "Axé sur les développeurs",
    "FullStackApplicationInfrastructure": "Infrastructure d'application complète.",
    "DomainDrivenDesign": "Conception pilotée par le domaine",
    "DomainDrivenDesignExplanation": "Conçu et développé sur la base des modèles et principes DDD. Fournit un modèle en couches pour votre application.",
    "Authorization": "Autorisation",
    "AuthorizationExplanation": "Autorisation avancée avec utilisateur, rôle et système d'autorisation précis. Construit sur la bibliothèque d'identité Microsoft.",
    "MultiTenancy": "Locations multiples",
    "MultiTenancyExplanationShort": "Les applications SaaS simplifiées! Multi-location intégrée de la base de données à l'interface utilisateur.",
    "CrossCuttingConcerns": "Préoccupations transversales",
    "CrossCuttingConcernsExplanationShort": "Infrastructure complète pour l'autorisation, la validation, la gestion des exceptions, la mise en cache, la journalisation d'audit, la gestion des transactions et plus encore.",
    "BuiltInBundlingMinification": "Regroupement et minification intégrés",
    "BuiltInBundlingMinificationExplanation": "Pas besoin d'utiliser des outils externes pour le regroupement et la minimisation. ABP offre un moyen plus simple, dynamique, puissant, modulaire et intégré!",
    "VirtualFileSystem": "Système de fichiers virtuel",
    "VirtualFileSystemExplanation": "Incorporez des vues, des scripts, des styles, des images... dans des packages/bibliothèques et réutilisez-les dans différentes applications.",
    "Theming": "Thème",
    "ThemingExplanationShort": "Utilisez et personnalisez le thème d'interface utilisateur standard basé sur le bootstrap ou créez le vôtre.",
    "BootstrapTagHelpersDynamicForms": "Aide aux balises Bootstrap et formulaires dynamiques",
    "BootstrapTagHelpersDynamicFormsExplanation": "Au lieu d'écrire manuellement les détails répétitifs des composants d'amorçage, utilisez les assistants de balises d'ABP pour le simplifier et tirer parti d'intellisense. Créez rapidement des formulaires d'interface utilisateur basés sur un modèle C# à l'aide de l'assistant de balise de formulaire dynamique.",
    "HTTPAPIsDynamicProxies": "API HTTP et proxys dynamiques",
    "HTTPAPIsDynamicProxiesExplanation": "Exposez automatiquement les services d'application en tant qu'API HTTP de style REST et utilisez-les avec des proxys JavaScript et C# dynamiques.",
    "CompleteArchitectureInfo": "Architecture moderne pour créer des solutions logicielles maintenables.",
    "DomainDrivenDesignBasedLayeringModelExplanation": "Vous aide à implémenter une architecture en couches basée sur DDD et à créer une base de code maintenable.",
    "DomainDrivenDesignBasedLayeringModelExplanationCont": "Fournit des modèles de démarrage, des abstractions, des classes de base, des services, de la documentation et des guides pour vous aider à développer votre application basée sur les modèles et principes DDD.",
    "MicroserviceCompatibleModelExplanation": "Le framework de base et les modules de pré-construction sont conçus avec l'architecture de microservice à l'esprit.",
    "MicroserviceCompatibleModelExplanationCont": "Fournit une infrastructure, des intégrations, des exemples et de la documentation pour mettre en œuvre des solutions de microservices plus facilement, sans apporter de complexité supplémentaire si vous souhaitez une application monolithique.",
    "ModularInfo": "ABP fournit un système de modules qui vous permet de développer des modules d'application réutilisables, de les relier aux événements du cycle de vie des applications et d'exprimer les dépendances entre les parties centrales de votre système.",
    "PreBuiltModulesThemes": "Modules et thèmes prédéfinis",
    "PreBuiltModulesThemesExplanation": "Les modules et thèmes open source et commerciaux sont prêts à être utilisés dans votre application professionnelle.",
    "NuGetNPMPackages": "Packages NuGet et NPM",
    "NuGetNPMPackagesExplanation": "Distribué sous forme de packages NuGet et NPM. Facile à installer et à mettre à jour.",
    "ExtensibleReplaceable": "Extensible/remplaçable",
    "ExtensibleReplaceableExplanation": "Tous les services et modules sont conçus pour l'extensibilité. Vous pouvez remplacer des services, des pages, des styles et des composants.",
    "CrossCuttingConcernsExplanation2": "Réduisez la taille de votre base de code afin de rester concentré sur le code spécifique à votre entreprise.",
    "CrossCuttingConcernsExplanation3": "N'envoyez pas de temps pour mettre en œuvre les exigences d'application communes sur plusieurs projets.",
    "AuthenticationAuthorization": "Autorisation d'authentification",
    "ExceptionHandling": "Gestion des exceptions",
    "Validation": "Validation",
    "DatabaseConnection": "Connexion à la base de données",
    "TransactionManagement": "Gestion des transactions",
    "AuditLogging": "Journalisation d'audit",
    "Caching": "Mise en cache",
    "Multitenancy": "Multi-souscrivants",
    "DataFiltering": "Filtrage des données",
    "ConventionOverConfiguration": "Convention plutôt que configuration",
    "ConventionOverConfigurationExplanation": "ABP implémente par défaut des conventions d'application communes avec une configuration minimale ou nulle.",
    "ConventionOverConfigurationExplanationList1": "Enregistre automatiquement les services connus pour l'injection de dépendances.",
    "ConventionOverConfigurationExplanationList2": "Expose les services d'application en tant qu'API HTTP par des conventions de dénomination.",
    "ConventionOverConfigurationExplanationList3": "Crée des proxys client HTTP dynamiques pour C# et JavaScript.",
    "ConventionOverConfigurationExplanationList4": "Fournit des référentiels par défaut pour vos entités.",
    "ConventionOverConfigurationExplanationList5": "Gère l'unité de travail par demande Web ou méthode de service d'application.",
    "ConventionOverConfigurationExplanationList6": "Publie des événements de création, de mise à jour et de suppression pour vos entités.",
    "BaseClasses": "Classes de base",
    "BaseClassesExplanation": "Classes de base prédéfinies pour les modèles d'application courants.",
    "DeveloperFocusedExplanation": "ABP est destiné aux développeurs.",
    "DeveloperFocusedExplanationCont": "Il vise à simplifier votre développement logiciel quotidien sans vous empêcher d'écrire du code de bas niveau.",
    "SeeAllFeatures": "Voir toutes les fonctionnalités",
    "CLI_CommandLineInterface": "CLI (interface de ligne de commande)",
    "CLI_CommandLineInterfaceExplanation": "Inclut une CLI pour vous aider à automatiser la création de nouveaux projets et l'ajout de nouveaux modules.",
    "StartupTemplates": "Modèles de démarrage",
    "StartupTemplatesExplanation": "Divers modèles de démarrage fournissent une solution entièrement configurée pour démarrer rapidement votre développement.",
    "BasedOnFamiliarTools": "Basé sur des outils familiers",
    "BasedOnFamiliarToolsExplanation": "Construit sur et intégré avec des outils populaires que vous connaissez déjà. Faible courbe d'apprentissage, adaptation facile, développement confortable.",
    "ORMIndependent": "ORM indépendant",
    "ORMIndependentExplanation": "Le framework de base est indépendant de l'ORM/de la base de données et peut fonctionner avec n'importe quelle source de données. Les fournisseurs Entity Framework Core et MongoDB sont déjà disponibles.",
    "Features": "Explorez les fonctionnalités du framework ABP",
    "ABPCLI": "CLI ABP",
    "Modularity": "Modularité",
    "BootstrapTagHelpers": "Assistants de balises Bootstrap",
    "DynamicForms": "Formulaires dynamiques",
    "BundlingMinification": "Regroupement et minification",
    "BackgroundJobs": "Emplois d'arrière-plan",
    "BackgroundJobsExplanation": "Définissez des classes simples pour exécuter les travaux en arrière-plan comme mis en file d'attente. Utilisez le gestionnaire de tâches intégré ou intégrez le vôtre. Les intégrations <a href=\"{0}\"> Hangfire </a> et <a href=\"{1}\"> RabbitMQ </a> sont déjà disponibles.",
    "DDDInfrastructure": "Infrastructure DDD",
    "DomainDrivenDesignInfrastructure": "Infrastructure Domain Driven Design",
    "AutoRESTAPIs": "API REST automatiques",
    "DynamicClientProxies": "Proxys clients dynamiques",
    "DistributedEventBus": "Bus d'événements distribués",
    "DistributedEventBusWithRabbitMQIntegration": "Bus d'événements distribués avec intégration RabbitMQ",
    "TestInfrastructure": "Infrastructure de test",
    "AuditLoggingEntityHistories": "Journalisation d'audit et historiques d'entités",
    "ObjectToObjectMapping": "Mappage d'objet à objet",
    "ObjectToObjectMappingExplanation": "<a href=\"{0}\"> Mappage objet à objet </a> abstraction avec intégration AutoMapper.",
    "EmailSMSAbstractions": "Abstractions par e-mail et SMS",
    "EmailSMSAbstractionsWithTemplatingSupport": "Abstractions par e-mail et SMS avec prise en charge de la création de modèles",
    "Localization": "Localisation",
    "SettingManagement": "Gestion des paramètres",
    "ExtensionMethods": "Méthodes d'extension",
    "ExtensionMethodsHelpers": "Méthodes d'extension et aides",
    "AspectOrientedProgramming": "Programmation orientée aspect",
    "DependencyInjection": "Injection de dépendance",
    "DependencyInjectionByConventions": "Injection de dépendances par conventions",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) est un outil de ligne de commande pour effectuer certaines opérations courantes pour les solutions basées sur ABP.",
    "ModularityExplanation": "ABP fournit une infrastructure complète pour créer vos propres modules d'application qui peuvent avoir des entités, des services, une intégration de base de données, des API, des composants d'interface utilisateur, etc.",
    "MultiTenancyExplanation": "Le framework ABP prend non seulement en charge le développement d'applications multi-souscrivants, mais rend également votre code pratiquement inconscient de la multi-location.",
    "MultiTenancyExplanation2": "Peut déterminer automatiquement le souscrivant actuel, isoler les données de différents locataires les uns des autres.",
    "MultiTenancyExplanation3": "Prend en charge une base de données unique, une base de données par souscrivant et des approches hybrides.",
    "MultiTenancyExplanation4": "Vous vous concentrez sur votre code métier et laissez le framework gérer la multi-souscrivants en votre nom.",
    "BootstrapTagHelpersExplanation": "Au lieu d'écrire manuellement les détails répétitifs des composants Boostrap, utilisez les aides de balises d'ABP pour le simplifier et tirer parti d'intellisense. Vous pouvez certainement utiliser Bootstrap chaque fois que vous en avez besoin.",
    "DynamicFormsExplanation": "Les assistants dynamiques de formulaire et de balise d'entrée peuvent créer le formulaire complet à partir d'une classe C# comme modèle.",
    "AuthenticationAuthorizationExplanation": "Options d'authentification et d'autorisation riches intégrées à ASP.NET Core Identity & OpenIddict. Fournit un système d'autorisation extensible et détaillé.",
    "CrossCuttingConcernsExplanation": "Ne vous répétez pas pour mettre en œuvre toutes ces choses courantes encore et encore. Concentrez-vous sur votre code métier et laissez ABP les automatiser par des conventions.",
    "DatabaseConnectionTransactionManagement": "Connexion à la base de données et gestion des transactions",
    "CorrelationIdTracking": "Suivi des identifiants de corrélation",
    "BundlingMinificationExplanation": "ABP offre un système de regroupement et de minification simple, dynamique, puissant, modulaire et intégré.",
    "VirtualFileSystemnExplanation": "Le système de fichiers virtuel permet de gérer des fichiers qui n'existent pas physiquement sur le système de fichiers (disque). Il est principalement utilisé pour incorporer des fichiers (js, css, image, cshtml...) dans des assemblys et les utiliser comme des fichiers physiques lors de l'exécution.",
    "ThemingExplanation": "Le système de thématisation permet de développer votre application et vos modules indépendamment du thème en définissant un ensemble de bibliothèques et de mises en page de base communes, basées sur le dernier framework Bootstrap.",
    "DomainDrivenDesignInfrastructureExplanation": "Une infrastructure complète pour créer des applications en couches basées sur les modèles et principes de conception pilotée par domaine;",
    "Specification": "spécification",
    "Repository": "Dépôt",
    "DomainService": "Service de domaine",
    "ValueObject": "Objet de valeur",
    "ApplicationService": "Service d'application",
    "DataTransferObject": "Objet de transfert de données",
    "AggregateRootEntity": "Racine agrégée, entité",
    "AutoRESTAPIsExplanation": "ABP peut configurer automatiquement vos services d'application en tant que contrôleurs d'API par convention.",
    "DynamicClientProxiesExplanation": "Utilisez facilement vos API à partir de clients JavaScript et  C# .",
    "DistributedEventBusWithRabbitMQIntegrationExplanation": "Publiez et consommez facilement des événements distribués à l'aide du bus d'événements distribués intégré avec l'intégration RabbitMQ disponible.",
    "TestInfrastructureExplanation": "Le framework a été développé en pensant aux tests unitaires et d'intégration. Vous fournit des classes de base pour vous faciliter la tâche. Les modèles de démarrage sont pré-configurés pour les tests.",
    "AuditLoggingEntityHistoriesExplanation": "Journalisation d'audit intégrée pour les applications stratégiques. Requête, service, journalisation d'audit au niveau de la méthode et historiques d'entités avec des détails au niveau de la propriété.",
    "EmailSMSAbstractionsWithTemplatingSupportExplanation": "Les abstractions IEmailSender et ISmsSender découpent la logique de votre application de l'infrastructure. Le système de modèle de courrier électronique avancé permet de créer et de localiser des modèles de courrier électronique et de les utiliser facilement en cas de besoin.",
    "LocalizationExplanation": "Le système de localisation permet de créer des ressources dans des fichiers JSON simples et de les utiliser pour localiser votre interface utilisateur. Il prend en charge des scénarios avancés tels que l'héritage, les extensions et l'intégration JavaScript tout en étant entièrement compatible avec le système de localisation d'AspNet Core.",
    "SettingManagementExplanation": "Définissez les paramètres de votre application et obtenez des valeurs à l'exécution en fonction de la configuration, du locataire et de l'utilisateur actuels.",
    "ExtensionMethodsHelpersExplanation": "Ne vous répétez pas même pour des parties de code triviales. Les extensions et aides pour les types standard rendent votre code beaucoup plus propre et facile à écrire.",
    "AspectOrientedProgrammingExplanation": "Fournit une infrastructure confortable pour créer des proxys dynamiques et mettre en œuvre la programmation orientée aspect. Interceptez n'importe quelle classe et exécutez votre code avant et après chaque exécution de méthode.",
    "DependencyInjectionByConventionsExplanation": "Inutile d'inscrire manuellement vos classes à l'injection de dépendances. Enregistre automatiquement les types de services courants par convention. Pour les autres types de services, vous pouvez utiliser des interfaces et des attributs pour le rendre plus simple et sur place.",
    "DataFilteringExplanation": "Définissez et utilisez des filtres de données qui sont automatiquement appliqués lorsque vous interrogez des entités de la base de données. Les filtres Soft Delete et MultiTenant sont fournis par défaut lorsque vous implémentez des interfaces simples.",
    "PublishEvents": "Publier des événements",
    "HandleEvents": "Gérer les événements",
    "AndMore": "et plus...",
    "Code": "Code",
    "Result": "Résultat",
    "SeeTheDocumentForMoreInformation": "Consultez le <a href=\"{1}\"> {0} document </a> pour plus d'informations",
    "IndexPageHeroSection": "<span class=\"first-line shine\"><strong>open source</strong></span><span class=\"second-line text-uppercase\">Web Application<br/>Framework </span><span class=\"third-line shine2\"><strong>for asp.net core</strong></span>",
    "UiFramework": "Framework de l'interface utilisateur",
    "EmailAddress": "Adresse e-mail",
    "Mobile": "Mobile",
    "ReactNative": "Réagir natif",
    "Strong": "Fort",
    "Complete": "Compléter",
    "BasedLayeringModel": "Modèle basé sur des couches",
    "Microservice": "Microservice",
    "Compatible": "Compatible",
    "MeeTTheABPCommunityInfo": "Notre mission est de créer un environnement où les développeurs peuvent s'entraider avec des posts, des tutoriels, des études de cas, etc. et rencontrer des personnes partageant les mêmes idées.",
    "JoinTheABPCommunityInfo": "Impliquez-vous dans une communauté dynamique et devenez un contributeur au cadre ABP!",
    "AllPosts": "Tous les posts",
    "SubmitYourPost": "Soumettez votre post",
    "DynamicClientProxyDocument": "Consultez les documentations sur le proxy client dynamique pour <a href=\"{0}\"> JavaScript </a> et <a href=\"{1}\">C#</a>.",
    "EmailSMSAbstractionsDocument": "Consultez les documents <a href=\"{0}\"> e-mail </a> et <a href=\"{1}\"> Envoi de SMS </a> pour plus d'informations.",
    "CreateProjectWizard": "Cet assistant crée un nouveau projet à partir du modèle de démarrage qui est correctement configuré pour démarrer rapidement votre projet.",
    "TieredOption": "Crée une solution à plusieurs niveaux dans laquelle les couches API Web et Http sont physiquement séparées. Si elle n'est pas cochée, crée une solution en couches qui est moins complexe et adaptée à la plupart des scénarios.",
    "SeparateIdentityServerOption": "Sépare le côté serveur en deux applications: la première est pour le serveur d'identité et la seconde pour votre API HTTP côté serveur.",
    "SeparateAuthenticationServerOption": "Sépare le côté serveur en deux applications : la première est destinée au serveur d&#39;authentification et la seconde est destinée à l&#39;API HTTP côté serveur.",
    "ProgressiveWebApplicationOption": "Spécifie le projet en tant qu&#39;application Web progressive",
    "UseslatestPreVersion": "Utilise la dernière version préliminaire",
    "ReadTheDocumentation": "<span class=\"text-primary\"> Lire </span><span class=\"text-success\"> La documentation </span>",
    "Documentation": "Documentation",
    "GettingStartedTutorial": "Tutoriel de mise en route",
    "ApplicationDevelopmentTutorial": "Tutoriel de développement d'applications",
    "TheStartupTemplate": "Le modèle de démarrage",
    "InstallABPCLIInfo": "ABP CLI est le moyen le plus rapide de démarrer une nouvelle solution avec le framework ABP. Installez l'interface de ligne de commande ABP à l'aide d'une fenêtre de ligne de commande:",
    "DifferentLevelOfNamespaces": "Vous pouvez utiliser différents niveaux d'espaces de noms; par exemple. BookStore, Acme.BookStore ou Acme.Retail.BookStore.",
    "ABPCLIExamplesInfo": "La commande <strong> nouvelle </strong> crée une <strong> application MVC en couches </strong> avec <strong> Entity Framework Core </strong> comme fournisseur de base de données. Cependant, il a des options supplémentaires. Exemples:",
    "SeeCliDocumentForMoreInformation": "Consultez le <a href=\"{0}\"> document ABP CLI </a> pour plus d'options ou sélectionnez l'onglet \"Téléchargement direct\" ci-dessus.",
    "Optional": "Optionnel",
    "LocalFrameworkRef": "Conservez la référence de projet locale pour les packages de structure.",
    "BlobStoring": "Stockage BLOB",
    "BlobStoringExplanation": "Le système de stockage BLOB fournit une abstraction pour travailler avec les BLOB. ABP fournit des intégrations de fournisseur de stockage prédéfinies (Azure, AWS, système de fichiers, base de données, etc.) que vous pouvez facilement utiliser dans vos applications.",
    "TextTemplating": "Création de modèles de texte",
    "TextTemplatingExplanation": "La création de modèles de texte est utilisée pour rendre le contenu de manière dynamique en fonction d'un modèle et d'un modèle (un objet de données). Par exemple, vous pouvez l'utiliser pour créer des contenus d'e-mail dynamiques avec un modèle prédéfini.",
    "MultipleUIOptions": "Options d'interface utilisateur multiples",
    "MultipleDBOptions": "Fournisseurs de bases de données multiples",
    "MultipleUIOptionsExplanation": "Le framework de base est conçu comme indépendant de l'interface utilisateur et peut fonctionner avec tout type de système d'interface utilisateur, tandis que plusieurs options prédéfinies et intégrées sont fournies prêtes à l'emploi.",
    "MultipleDBOptionsExplanation": "Le framework peut fonctionner avec n'importe quelle source de données, tandis que les fournisseurs suivants sont officiellement développés et pris en charge;",
    "SelectLanguage": "Choisir la langue",
    "LatestPostOnCommunity": "Dernier post sur la communauté ABP",
    "Register": "S'inscrire",
    "IsDownloadable": "Est téléchargeable",
    "DatabaseOptions": "Options de base de données",
    "BackToPackagesPage": "Retour à la page des forfaits",
    "HowToInstall": "Comment installer",
    "SeeOnNpm": "Voir sur NPM",
    "SeeOnNuget": "Voir sur Nuget",
    "MVCGulpCommandExplanation": "Si vous utilisez l'interface utilisateur MVC (Razor Pages), exécutez la commande \"gulp\" après l'installation du package.",
    "UsingABPCLI": "Utilisation de <a href=\"https://docs.abp.io/en/abp/latest/CLI\">Abp CLI</a>",
    "WithoutABPCLI": "Sans CLI ABP",
    "ABPCLIModuleDependency": "Abp Cli ajoute automatiquement une dépendance de module.",
    "AddModuleDependency": "Ajoutez ensuite une dépendance de module",
    "Packages": "Paquets",
    "NugetPackages": "Forfaits Nuget",
    "NPMPackages": "Paquets NPM",
    "SeeDocs": "Voir la documentation",
    "None": "Rien",
    "Application": "Application",
    "ApplicationExplanation": "Crée une solution entièrement en couches basée sur les pratiques de Domain Driven Design. Recommandé pour les projets à long terme nécessitant une base de code maintenable et extensible.",
    "ApplicationNoLayer": "Application (monocouche)",
    "ApplicationNoLayerExplanation": "Crée une application Web monocouche. Recommandé pour créer une application avec une architecture plus simple et facile à comprendre.",
    "Module": "Module",
    "ModuleExplanation": "Crée une solution de module d&#39;application réutilisable et entièrement en couches. Vous pouvez utiliser cette option pour créer des modules pour votre application modulaire.",
    "PackageName": "Nom du paquet",
    "LicenseURL": "URL de licence",
    "License": "Licence",
    "ProjectCreationSuccessMessage": "Votre projet a été créé avec succès",
    "HowToRunSolution": "Comment exécuter votre solution ?",
    "GettingStartedMessage": "Consultez le document de mise en route pour savoir comment configurer et exécuter votre solution.",
    "WebAppDevTutorial": "Tutoriel de développement d'applications Web",
    "WebAppDevTutorialMessage": "Voir le document du didacticiel de développement d'applications Web pour un exemple de développement étape par étape.",
    "CommunityPosts": "Posts de la communauté",
    "CommunityPostMessage": "Consultez la plate-forme communautaire ABP pour lire des posts utiles pour le cadre ABP.",
    "InvestigateSolutionDetails": "Consultez les détails de la solution",
    "StartupTemplateDocumentationMessage": "Consultez le document de modèle de démarrage d'application pour connaître l'architecture et la structure de votre solution.",
    "ClientSideDevelopment": "Développement côté client",
    "ClientSideDevelopmentDocumentationMessage": "Consultez le document {0} pour connaître les points clés du développement de l'interface utilisateur (côté client).",
    "DatabaseProviderDocumentationMessage": "Voir {0} document pour apprendre les points clés pour le développement de la couche de base de données.",
    "ABPCommercialExplanationMessage": "ABP Commercial fournit des modules, des thèmes, des outils et un support premium pour le framework ABP.",
    "ImplementingDDD": "Implémentation de la conception axée sur le domaine",
    "DDDBookExplanation": "Un guide pratique pour la mise en œuvre du Domain Driven Design avec le framework ABP.",
    "Overview": "Aperçu",
    "DDDBookPracticalGuide": "Il s'agit d'un guide pratique pour la mise en œuvre du Domain Driven Design (DDD). Bien que les détails de l'implémentation soient basés sur l'infrastructure ABP Framework, les concepts, principes et modèles de base peuvent être appliqués à n'importe quelle solution, même s'il ne s'agit pas d'une solution .NET.",
    "TableOfContents": "Table des matières",
    "IntroductionToImplementingDDD": "Introduction à la mise en œuvre de la conception pilotée par domaine",
    "WhatIsDDD": "Qu'est-ce que la conception axée sur le domaine ?",
    "Implementation": "Mise en œuvre",
    "TheBigPicture": "La grande image",
    "TheBuildingBlock": "Le bloc de construction",
    "ExampleUseCase": "Exemple de cas d'utilisation",
    "DomainAndApplicationLogic": "Logique de domaine et logique d'application",
    "Author": "Auteur",
    "Pages": "Pages",
    "PublishedOn": "Publié le",
    "FreeEBook": "Livre électronique gratuit",
    "Download": "Télécharger",
    "EBookSignInForDownload": "Pour télécharger le livre électronique, connectez-vous",
    "SignIn": "S'identifier",
    "Or": "Ou",
    "TellUsAboutYourself": "Parlez-nous un peu de vous",
    "Name": "Nom",
    "Surname": "Nom de famille",
    "CompanyName": "Nom de la compagnie",
    "DoYouAgreePrivacyPolicy": "J'accepte les <a href=\"https://account.abp.io/Account/TermsConditions\">Conditions générales</a> et les <a href=\"https://account.abp.io/Account/Privacy \">Politique de confidentialité</a>.",
    "Free": "Libérer",
    "DDDEBook": "Livre électronique DDD",
    "PracticalGuideForImplementingDDD": "Ce livre est un guide pratique pour la mise en œuvre du Domain Driven Design avec le framework ABP.",
    "IntroducingDDD": "Présentation de la conception axée sur le domaine",
    "DDDLayersAndCleanArchitecture": "Couches DDD et architecture propre",
    "LayeringOfADotnetSolution": "Superposition d'une solution .NET",
    "ImplementingDDDBuildingBlocks": "Implémentation des blocs de construction DDD",
    "DomainVsApplicationLogic": "Logique de domaine vs logique d'application",
    "SamplesAndDiscussions": "Échantillons et discussions",
    "EmailNotValid": "S'il vous plaît, mettez une adresse email valide.",
    "WeWillSendYouADownloadLink": "Un lien pour télécharger le livre électronique a été envoyé à {0}. Vérifiez votre boîte de réception, vos courriers indésirables ou vos spams !",
    "GoHome": "Rentrer chez soi",
    "InvalidFormInputs": "Veuillez saisir les informations valides spécifiées sur le formulaire.",
    "DDDBookEmailBody": "Merci. <br /> Pour télécharger votre livre, <a href=\"{0}\">cliquez ici</a>.",
    "SubscribeToNewsletter": "Abonnez-vous à la newsletter pour obtenir des informations sur les événements de la plate-forme ABP.IO, comme les nouvelles versions, posts, offres, etc.",
    "FirstEdition": "Première édition",
    "ThankYou": "Merci!",
    "CheckboxMandatory": "Vous devez vérifier cela pour continuer !",
    "UserInterface": "Interface utilisateur",
    "APIGateway": "Passerelle API",
    "Database": "Base de données",
    "Saas": "Saas",
    "OpenSourceWebApp": "Open <span class=\"forever\">source</span><br/> application Web",
    "Framework": "Cadre",
    "AuditLoggingExplanation": "Suivez automatiquement toutes les opérations et modifications de données dans votre système.",
    "AbpNewCommandExplanation": "Crée de nouvelles solutions à l&#39;aide des modèles de démarrage ABP.",
    "AbpAddModuleCommandExplanation": "Installe des modules d&#39;application prédéfinis sur votre solution",
    "AbpUpdateCommandExplanation": "Met automatiquement à jour tous les packages NuGet et NPM liés à ABP dans votre solution.",
    "ExploreAllCLICommands": "Explorez toutes les commandes CLI",
    "ExploreDocumentationAndGuides": "Explorez la documentation et les guides complets.",
    "Documentations": "Documentation",
    "Views": "Vues",
    "EnterYouEmailToGetNews": "Entrez votre e-mail pour recevoir les dernières nouvelles sur le cadre ABP",
    "Tiered": "À plusieurs niveaux",
    "SeparateIdentityServer": "Serveur d&#39;identité séparé",
    "SeparateAuthenticationServer": "Serveur d&#39;authentification séparé",
    "ProgressiveWebApplication": "Application Web progressive",
    "Preview": "Aperçu",
    "CreateANewSolution": "Créer une nouvelle solution",
    "FrameworkFeatures": "<span class=\"gradient-framework\">Fonctionnalités</span> du cadre ABP",
    "Commercial": "Commercial",
    "ThirdPartyTools": "Outils tiers",
    "Back": "Dos",
    "Community": "Communauté",
    "SeeMore": "Voir plus",
    "DetailsOfTheEBook": "Détails du livre électronique",
    "JoinOurMarketingNewsletter": "Rejoignez notre newsletter marketing",
    "FrameworkNewsletterConfirmationMessage": "J&#39;accepte les <a class=\"text-white fw-6 text-decoration-underline opacity-50\" href=\"https://commercial.abp.io/TermsConditions\">conditions générales</a> et <a  class=\"text-white fw-6 text-decoration-underline opacity-50\" href=\"https://commercial.abp.io/Privacy\">la politique de confidentialité</a> .",
    "GetYourFreeEBook": "Obtenez votre <span class=\"gradient-framework d-block\">livre électronique DDD gratuit</span>",
    "EverythingYouNeedToKnow": "Tout ce que tu as besoin de savoir.",
    "PreOrderNow": "Pré commandez maintenant",
    "UITheming": "Thème de l&#39;interface utilisateur",
    "UIThemingExplanation": "Créez des thèmes et des mises en page d&#39;interface utilisateur réutilisables ou utilisez l&#39;un des thèmes d&#39;interface utilisateur prédéfinis.",
    "DataFilteringExplanation2": "Filtrez automatiquement les requêtes de la base de données pour implémenter facilement des modèles tels que la suppression logicielle et la multi-location.",
    "NeedHelp": "Besoin d&#39;aide?",
    "GiveYourProjectAName": "Donnez un nom à votre projet",
    "SelectProjectType": "Sélectionnez le type de projet",
    "SelectUIFramework": "Sélectionnez le cadre d&#39;interface utilisateur",
    "SelectDatabaseProvider": "Sélectionnez le fournisseur de base de données",
    "SelectDatabaseManagementSystem": "Sélectionnez le système de gestion de base de données",
    "InstallingTheABPCLI": "Installation de l&#39;ABP-CLI",
    "CreateYourProjectNow": "Créez votre projet maintenant",
    "OrderOn": "Commandez le {0}",
    "DownloadFreeDDDBook": "Téléchargez le livre DDD gratuit",
    "WhatIsABPFramework": "Qu’est-ce que le cadre ABP ?",
    "TenantDatabase": "Base de données du locataire {0}",
    "SharedDatabase": "Base de données partagée",
    "ConnectionResolver": "Résolveur de connexion",
    "TenantBasedDataFilter": "Filtre de données basé sur le locataire",
    "ApplicationCode": "Code de demande",
    "TenantResolution": "Résolution des locataires",
    "TenantUser": "Locataire {0} Utilisateur",
    "CardTitle": "Titre de la carte",
    "View": "Voir",
    "Model": "Modèle",
    "Email": "E-mail",
    "Password": "Mot de passe",
    "Address": "Adresse",
    "Gender": "Genre",
    "Male": "Mâle",
    "Female": "Femelle",
    "Submit": "Soumettre",
    "Unspecified": "Non spécifié",
    "StaticFileMiddleware": "Middleware de fichiers statiques",
    "RazorViewEngine": "Moteur de vue Razor",
    "PhysicalFiles": "Fichiers physiques (wwwroot)",
    "EmbeddedFiles": "Fichiers intégrés (DLL)",
    "DynamicFiles": "Fichiers dynamiques (mémoire)",
    "BuildSolutionsWithAbp": "Créez des solutions .NET maintenables en suivant les meilleures pratiques de développement logiciel à l’aide d’ABP.",
    "BuyOnAmazon": "Acheter sur Amazon",
    "BuyOnPackt": "Acheter sur Packt",
    "Discounted": "À prix réduit",
    "MasteringAbpFramework_Book_KeyFeatures": "Principales caractéristiques",
    "MasteringAbpFramework_Book_Key_Features_Description_1": "Créez des solutions logicielles robustes, maintenables, modulaires et évolutives à l’aide d’ABP Framework.",
    "MasteringAbpFramework_Book_Key_Features_Description_2": "Découvrez comment mettre en œuvre les principes SOLID et la conception axée sur le domaine dans vos applications Web.",
    "MasteringAbpFramework_Book_Key_Features_Description_3": "Découvrez comment ABP Framework accélère votre cycle de développement en automatisant les tâches répétitives.",
    "MasteringAbpFramework_Book_Description": "Description du livre",
    "MasteringAbpFramework_Book_Description_Details_1": "ABP Framework est une infrastructure complète pour créer des applications Web modernes en suivant les meilleures pratiques et conventions de développement du logiciel \n . Grâce au cadre et à l&#39;écosystème de haut niveau d&#39;ABP, vous pouvez \n implémenter le principe Don&#39;t Repeat Yourself (DRY) et vous concentrer sur votre code métier.",
    "MasteringAbpFramework_Book_Description_Details_2": "Écrit par le créateur d&#39;ABP Framework, ce livre vous aidera à acquérir une compréhension complète du framework \n et des techniques modernes de développement d&#39;applications Web. Avec des explications étape par étape des concepts essentiels \n et des exemples pratiques, vous comprendrez les exigences d&#39;une solution Web moderne et comment ABP \n Framework rend agréable le développement de vos propres solutions. Vous découvrirez les exigences courantes du développement d’applications Web d’entreprise \n et explorerez l’infrastructure fournie par ABP. Tout au long du livre \n , vous découvrirez les meilleures pratiques de développement logiciel pour créer des solutions Web \n maintenables et modulaires.",
    "MasteringAbpFramework_Book_Description_Details_3": "À la fin de ce livre, vous serez en mesure de créer une solution Web complète facile à développer, à maintenir et à tester par \n .",
    "MasteringAbpFramework_Book_WhatYouWillLearn": "Ce que vous apprendrez",
    "MasteringAbpFramework_Book_What_You_Will_Learn_1": "Configurez l’environnement de développement et démarrez avec ABP Framework.",
    "MasteringAbpFramework_Book_What_You_Will_Learn_2": "Travaillez avec Entity Framework Core et MongoDB pour développer votre couche d&#39;accès aux données.",
    "MasteringAbpFramework_Book_What_You_Will_Learn_3": "Comprendre les préoccupations transversales et comment ABP automatise les tâches répétitives.",
    "MasteringAbpFramework_Book_What_You_Will_Learn_4": "Familiarisez-vous avec la mise en œuvre de la conception axée sur le domaine avec ABP Framework.",
    "MasteringAbpFramework_Book_What_You_Will_Learn_5": "Créez des pages et des composants d&#39;interface utilisateur avec ASP.NET Core MVC (Razor Pages) et Blazor.",
    "MasteringAbpFramework_Book_What_You_Will_Learn_6": "Travaillez en multilocation pour créer des applications Web modulaires.",
    "MasteringAbpFramework_Book_What_You_Will_Learn_7": "Comprendre la modularité et créer des modules d&#39;application réutilisables.",
    "MasteringAbpFramework_Book_What_You_Will_Learn_8": "Écrivez des tests unitaires, d&#39;intégration et d&#39;interface utilisateur à l&#39;aide d&#39;ABP Framework.",
    "MasteringAbpFramework_Book_WhoIsThisBookFor": "À qui est destiné ce livre",
    "MasteringAbpFramework_Book_WhoIsThisBookFor_Description": "Ce livre est destiné aux développeurs Web qui souhaitent apprendre les architectures logicielles et les meilleures pratiques pour créer des solutions Web maintenables \n à l&#39;aide des technologies Microsoft et du framework ABP. Une connaissance de base de C# \n et d&#39;ASP.NET Core est nécessaire pour démarrer avec ce livre.",
    "ComputersAndTechnology": "Informatique et technologie",
    "BuildingMicroserviceSolutions": "Création de solutions de microservices",
    "MicroserviceBookPracticalGuide": "Ce livre est un guide de référence pour le développement et la gestion d&#39;applications basées sur des microservices à l&#39;aide du framework ABP. Il fait référence à l&#39; <strong>exemple d&#39;application de référence de microservice .NET</strong> : eShopOnContainers et discute des approches de conception architecturale et de mise en œuvre à l&#39;aide du framework ABP. À la fin de ce livre, vous apprendrez comment ABP aborde les complexités courantes des microservices telles que l&#39;autorisation, les transactions distribuées, les communications inter-microservices, le déploiement, etc.",
    "IntroducingTheSolution": "Présentation de la solution eShopOnAbp",
    "RunningTheSolution": "Exécuter la solution",
    "UnderstandingTheAuthenticationSystem": "Comprendre le système d&#39;authentification",
    "ExploringTheApplications": "Explorer les applications",
    "UnderstandingTheAPIGateways": "Comprendre les passerelles API",
    "DevelopingTheMicroservices": "Développer les microservices",
    "UnderstandingTheInfrastructure": "Comprendre l&#39;infrastructure",
    "DiggingInTheUseCases": "Creuser les cas d&#39;utilisation",
    "DeployingTheSolution": "Déployer la solution",
    "ThisBookIsInDraftStageAndIsNotCompletedYet": "Ce livre est au stade de projet et n’est pas encore terminé.",
    "Authors": "Auteurs",
    "MicroserviceEBook": "Livre électronique sur les microservices",
    "SelectUITheme": "Sélectionnez le thème de l'interface utilisateur",
    "LeptonXLiteTheme": "Thème LeptonX Lite",
    "BasicTheme": "Thème de base",
    "LeptonXLiteThemeInfo": "Un thème d&#39;interface utilisateur Bootstrap moderne et élégant. Idéal si vous souhaitez disposer d’un thème d’interface utilisateur prêt pour la production. Il s&#39;agit du thème le plus récent et celui par défaut.",
    "BasicThemeInfo": "Thème d&#39;interface utilisateur minimaliste avec des couleurs et des styles Bootstrap simples. Idéal si vous souhaitez créer votre propre thème d&#39;interface utilisateur.",
    "SeeDocumentation": "Voir <a href='{0}' target='_blank'>la documentation</a> .",
    "SeeFullScreen": "<a href='{0}' target='_blank'>🖼️ Voir la capture d&#39;écran</a>",
    "BuildingMicroserviceSolutionsShortDescription": "Ce livre est un guide de référence pour le développement et la gestion d&#39;applications basées sur des microservices à l&#39;aide du framework ABP.",
    "InstallAbpCliMessage": "Installez l&#39;ABP CLI dans un terminal de ligne de commande, si vous ne l&#39;avez pas encore installé :",
    "Terminal": "Terminal",
    "Copy": "Copie",
    "RunTheFollowingCommand": "Exécutez la commande suivante dans un terminal de ligne de commande :",
    "ChangeSolutionOptionsBelow": "Vous pouvez modifier les options de solution ci-dessous.",
    "MultiLayerApplication": "Multicouche<br> Application",
    "MultiLayerApplicationExplanation1": "Crée une solution entièrement en couches basée sur les pratiques de Domain Driven Design.",
    "MultiLayerApplicationExplanation2": "Recommandé pour les projets à long terme nécessitant une base de code maintenable et extensible.",
    "SingleLayerApplication": "Une seule couche<br> Application",
    "SingleLayerApplicationExplanation1": "Crée une application Web monocouche.",
    "SingleLayerApplicationExplanation2": "Recommandé pour créer une application avec une architecture plus simple et facile à comprendre.",
    "ApplicationModule": "Application<br> Module",
    "SeeTheScreenshot": "Voir la capture d&#39;écran",
    "ApplicationModuleExplanation1": "Crée une solution de module d&#39;application réutilisable et entièrement en couches.",
    "ApplicationModuleExplanation2": "Vous pouvez utiliser cette option pour créer des modules pour votre application modulaire.",
    "Expert_": "Expert",
    "Partner_": "Partenariat",
    "WebSite": "Site web",
    "Expert_Year": "Année d&#39;expertise",
    "CompanyInfo": "Information d&#39;entreprise",
    "Date": "Date",
    "WhoWeAre_Partner": "Qui nous sommes",
    "WhoWeAre_Expert": "Sur moi",
    "CreateSolutionFolder": "Créer un dossier de solutions",
    "CreateSolutionFolderOption": "Spécifie si le projet sera dans un nouveau dossier dans le dossier de sortie ou directement dans le dossier de sortie.",
    "BooksPageTitle": "Livres ABP",
    "PackageDetailPage_NuGetPackageInstallationOptions": "Il existe trois façons d&#39;installer le package <code>{0}</code> NuGet sur votre projet",
    "PackageDetailPage_InstallingWithABPCLI": "1 : Installation avec l&#39;ABP CLI",
    "PackageDetailPage_InstallingWithABPCLIDescription1": "Si vous n&#39;avez pas installé l&#39; <a href=\"https://docs.abp.io/en/abp/latest/CLI\">ABP CLI</a> , installez-la d&#39;abord en exécutant la commande suivante dans un terminal de ligne de commande",
    "PackageDetailPage_InstallingWithABPCLIDescription2": "Une fois que vous avez installé l&#39;ABP CLI, ouvrez un terminal de ligne de commande à l&#39;emplacement du projet (fichier <code>.csproj</code> ) que vous souhaitez installer et exécutez la commande suivante",
    "PackageDetailPage_InstallingWithABPCLIDescription3": "Il ajoutera la référence du package <code>{0}</code> à votre projet et la dépendance <code>{1}</code> à votre classe de module.",
    "PackageDetailPage_ManualInstallation": "2 : Installation avec la CLI Dotnet",
    "PackageDetailPage_ManualInstallationDescription1": "Ajoutez <code>{0}</code> la référence du package NuGet à votre projet à l&#39;aide de votre IDE ou en exécutant la commande suivante",
    "PackageDetailPage_ManualInstallationDescription2": "Ajoutez ensuite la dépendance <code>{0}</code> à votre <a href=\"https://docs.abp.io/en/abp/latest/Module-Development-Basics\">classe de module</a> comme indiqué dans l&#39;exemple suivant",
    "PackageDetailPage_SeeDocumentation": "<a href=\"{0}\">Consultez la documentation</a> pour savoir comment utiliser ce package dans vos applications.",
    "PackageDetailPage_InstallingUsingPMC": "3 : Installation avec la console du gestionnaire de packages",
    "PackageDetailPage_InstallingUsingPMCDescription1": "Ouvrez la <strong>console du gestionnaire de packages</strong> dans Visual Studio (Outils -&gt; Nuget Package Manager -&gt; Package Manager Console) et exécutez la commande suivante",
    "UIOptions": "Options de l&#39;interface utilisateur",
    "Testimonials": "Témoignages",
    "CoolestCompaniesUseABPFramework": "Les entreprises les plus cool utilisent <span class=\"fw-bold\">le cadre ABP</span>",
    "Index_Page_Testimonial_1": "ABP Framework n&#39;est pas seulement un outil mais un catalyseur qui a accéléré ma croissance en tant que développeur. Cela m&#39;a permis de créer de nouvelles fonctionnalités plus rapidement que jamais, rappelant les expériences d&#39;autres utilisateurs. Le modèle de codage unifié a rationalisé mes projets, me donnant plus de temps pour me concentrer sur la création plutôt que sur le dépannage. \n Je dirais que l&#39;ABP Framework a été la pierre angulaire de mes débuts professionnels. Cela a facilité ma transition d&#39;un développeur en herbe à un professionnel confiant, prêt à laisser sa marque dans le monde du logiciel. J&#39;attends avec impatience les projets passionnants qui m&#39;attendent, sachant qu&#39;ABP sera là pour me guider. C&#39;est plus qu&#39;un simple produit ; c&#39;est un partenaire de réussite.",
    "Index_Page_Testimonial_2": "ABP Framework n&#39;est pas seulement un framework, c&#39;est aussi un guide pour le développement/gestion de projets, car il propose des formations DDD, GenericRepository, DI, Microservice, Modularité. Même si vous n&#39;utilisez pas le framework lui-même, vous pouvez vous développer avec docs.abp.io qui est bien préparé de manière professionnelle. (OpenIddict, Redis, Quartz, etc.) \n Parce que de nombreux éléments sont pré-construits, cela réduit considérablement le temps de développement du projet. (Tels que la page de connexion, la gestion des exceptions, le filtrage-ensemencement des données, la journalisation d&#39;audit, la localisation, le contrôleur API automatique, etc.) \n À titre d&#39;exemple de notre application, j&#39;ai utilisé Local Event Bus pour le contrôle des stocks. Ainsi, je suis capable de gérer les mouvements de commandes en écrivant stock handler. \n C&#39;est merveilleux de ne pas perdre de temps pour CreationTime, CreatorId. Ils sont remplis automatiquement.",
    "VideosLoginAndRegisterMessage": "Vous devez vous connecter pour regarder des vidéos. Vous pouvez créer un compte pour regarder si vous ne l&#39;avez pas encore fait.",
    "Filter": "Filtre",
    "VideoCourses": "Vidéos essentielles",
    "TestimonialText": "Votre témoignage",
    "Position": "Poste",
    "ExperienceYear": "Années d'expérience",
    "FullName": "Nom complet",
    "CompanySize": "Taille de l'entreprise",
    "Image": "Votre photo de profil",
    "TestimonialTitle": "Écoutons votre témoignage",
    "TestimonialInfo": "Ce que disent nos clients est important ! Parlez-nous de votre expérience avec notre produit et service. Il est recommandé de rédiger le témoignage en anglais pour toucher un public plus large.",
    "Country": "Pays",
    "TestimonialTextPlaceholder": "Rédigez une brève histoire sur la manière dont ABP vous a aidé à construire et livrer votre projet.",
    "PositionPlaceholder": "Votre poste dans votre entreprise.",
    "SelectExperienceYearPlaceholder": "Combien d'années avez-vous d'expérience dans le domaine du logiciel ?",
    "FullNamePlaceholder": "Votre nom complet.",
    "CompanyNamePlaceholder": "Nom de votre entreprise.",
    "SelectCompanySizePlaceholder": "Nombre d'employés",
    "ImagePlaceholder": "Votre image.",
    "SelectCountryPlaceholder": "Votre pays.",
    "YouAreNotAuthorizedToWriteTestimonial": "Pour pouvoir écrire un témoignage, vous devez être connecté(e).",
    "UnAuthorizeTestimonialInfo": "Votre avis compte ! Connectez-vous pour le partager.",
    "TheFileIsTooLargeForImage": "Votre photo de profil ne peut pas dépasser 1 Mo.",
    "ThisExtensionIsNotAllowedForImage": "Cette extension n'est pas autorisée.",
    "FileUploadError": "Erreur lors du téléchargement du fichier",
    "TestimonialSend": "Merci ! Nous avons bien reçu votre témoignage. Nous le passerons en revue et prendrons la prochaine étape bientôt.",
    "Title": "Titre",
    "TitlePlaceholder": "Développeur de logiciels, CTO, etc.",
    "Characters": "caractères",
    "ABPTestimonialDescription": "ABP Framework : Écoutons votre témoignage",
    "LeaveUsReview": "Laissez-nous votre avis",
    "DocumentationButtonTitle": "Documentation",
    "ABPVideoCoursesDescription": "Apprenez les bases du framework ABP grâce à des cours vidéo créés par l'équipe ABP.",
    "ABPVideoCoursesPageDescription": "Apprenez les bases du framework ABP à travers des cours vidéo créés par l'équipe ABP. Dans cette série de vidéos, vous apprendrez les sujets essentiels du framework ABP. Les nombres sur chaque vidéo sont écrits en fonction du flux d'apprentissage.",
    "ABPVideoCoursesTitle": "Vidéos essentielles du ABP"
  }
}