{
  "culture": "hi",
  "texts": {
    "GetStarted": "प्रारंभ करें - स्टार्टअप टेम्पलेट",
    "Create": "सृजन करना",
    "NewProject": "नया काम",
    "DirectDownload": "प्रत्यक्षत: डाउनलोड",
    "ProjectName": "परियोजना का नाम",
    "ProjectType": "प्रोजेक्ट का प्रकार",
    "DatabaseProvider": "डेटाबेस प्रदाता",
    "DatabaseManagementSystem": "डेटाबेस प्रबंधन प्रणाली",
    "NTier": "n स्तरीय",
    "IncludeUserInterface": "उपयोगकर्ता इंटरफ़ेस शामिल करें",
    "CreateNow": "अब बनाओ",
    "TheStartupProject": "स्टार्टअप प्रोजेक्ट",
    "Tutorial": "ट्यूटोरियल",
    "UsingCLI": "सीएलआई का उपयोग करना",
    "SeeDetails": "विवरण देखें",
    "AbpShortDescription": "एबीपी फ्रेमवर्क सॉफ्टवेयर विकास सर्वोत्तम प्रथाओं और सम्मेलनों का पालन करके आधुनिक वेब एप्लिकेशन बनाने के लिए एक पूर्ण बुनियादी ढांचा है।",
    "SourceCodeUpper": "सोर्स कोड",
    "LatestReleaseLogs": "नवीनतम रिलीज़ लॉग",
    "Infrastructure": "भूमिकारूप व्यवस्था",
    "Architecture": "आर्किटेक्चर",
    "Modular": "मॉड्यूलर",
    "DontRepeatYourself": "खुद को दोहराएं नहीं",
    "DeveloperFocused": "डेवलपर ने फोकस किया",
    "FullStackApplicationInfrastructure": "पूर्ण स्टैक अनुप्रयोग अवसंरचना।",
    "DomainDrivenDesign": "डोमेन संचालित डिजाइन",
    "DomainDrivenDesignExplanation": "डीडीडी पैटर्न और सिद्धांतों के आधार पर डिजाइन और विकसित। आपके आवेदन के लिए एक स्तरित मॉडल प्रदान करता है।",
    "Authorization": "प्राधिकार",
    "AuthorizationExplanation": "उपयोगकर्ता, भूमिका और ठीक-ठीक अनुमति प्रणाली के साथ उन्नत प्राधिकरण। Microsoft पहचान लाइब्रेरी पर बनाया गया।",
    "MultiTenancy": "बहु किरायेदारी",
    "MultiTenancyExplanationShort": "सास अनुप्रयोगों आसान बना दिया! यूआई के लिए डेटाबेस से एकीकृत मल्टी-टेनेंसी।",
    "CrossCuttingConcerns": "फिल्म आदि में दृश्यों के संपादन संबंधी चिंताएं",
    "CrossCuttingConcernsExplanationShort": "प्राधिकरण, सत्यापन, अपवाद से निपटने, कैशिंग, ऑडिट लॉगिंग, लेनदेन प्रबंधन और बहुत कुछ के लिए पूरा बुनियादी ढांचा।",
    "BuiltInBundlingMinification": "अंतर्निहित बंडलिंग और न्यूनतम",
    "BuiltInBundlingMinificationExplanation": "बंडलिंग और लघुकरण के लिए बाहरी उपकरणों का उपयोग करने की आवश्यकता नहीं है। ABP एक सरल, गतिशील, शक्तिशाली, मॉड्यूलर और बिल्ट-इन तरीका प्रदान करता है!",
    "VirtualFileSystem": "वर्चुअल फाइल सिस्टम",
    "VirtualFileSystemExplanation": "पैकेज, पुस्तकालयों में विचार, स्क्रिप्ट, शैली, चित्र एम्बेड करें और विभिन्न अनुप्रयोगों में उनका पुन: उपयोग करें।",
    "Theming": "थीम",
    "ThemingExplanationShort": "बूटस्ट्रैप-आधारित मानक UI थीम का उपयोग करें और अनुकूलित करें या अपना स्वयं का बनाएं।",
    "BootstrapTagHelpersDynamicForms": "बूटस्ट्रैप टैग हेल्पर्स और डायनामिक फॉर्म",
    "BootstrapTagHelpersDynamicFormsExplanation": "बूटस्ट्रैप घटकों के दोहराए गए विवरणों को मैन्युअल रूप से लिखने के बजाय, इसे सरल बनाने और अंतरंगता का लाभ उठाने के लिए एबीपी के टैग सहायकों का उपयोग करें। डायनामिक फॉर्म टैग हेल्पर का उपयोग करके C# मॉडल के आधार पर जल्दी से UI फॉर्म का निर्माण करें।",
    "HTTPAPIsDynamicProxies": "HTTP एपीआई और डायनेमिक प्रॉक्सी",
    "HTTPAPIsDynamicProxiesExplanation": "REST शैली HTTP API के रूप में एप्लिकेशन सेवाओं को स्वचालित रूप से उजागर करें, और उन्हें गतिशील जावास्क्रिप्ट और C# प्रॉक्सी के साथ उपभोग करें।",
    "CompleteArchitectureInfo": "बनाए रखने योग्य सॉफ़्टवेयर समाधान बनाने के लिए आधुनिक वास्तुकला।",
    "DomainDrivenDesignBasedLayeringModelExplanation": "डीडीडी आधारित स्तरित वास्तुकला को लागू करने और बनाए रखने योग्य कोड आधार बनाने में आपकी सहायता करता है।",
    "DomainDrivenDesignBasedLayeringModelExplanationCont": "DDD पैटर्न और सिद्धांतों के आधार पर आपके एप्लिकेशन को विकसित करने में मदद करने के लिए स्टार्टअप टेम्प्लेट, सार, आधार कक्षाएं, सेवाएं, प्रलेखन और मार्गदर्शिका प्रदान करता है।",
    "MicroserviceCompatibleModelExplanation": "कोर फ्रेमवर्क और प्री-बिल्ड मॉड्यूल को दिमाग में माइक्रोसैस आर्किटेक्चर के साथ डिजाइन किया गया है।",
    "MicroserviceCompatibleModelExplanationCont": "यदि आप एक अखंड आवेदन चाहते हैं, तो यह आसान नहीं है कि माइक्रोसॉफ़्ट समाधानों को लागू करने के लिए बुनियादी ढाँचा, एकीकरण, नमूने और प्रलेखन प्रदान करता है।",
    "ModularInfo": "एबीपी एक मॉड्यूल प्रणाली प्रदान करता है जो आपको पुन: प्रयोज्य एप्लिकेशन मॉड्यूल विकसित करने, एप्लिकेशन जीवन चक्र घटनाओं में टाई करने और आपके सिस्टम के मुख्य भागों के बीच निर्भरता व्यक्त करने की अनुमति देता है।",
    "PreBuiltModulesThemes": "पूर्व निर्मित मॉड्यूल और थीम",
    "PreBuiltModulesThemesExplanation": "ओपन सोर्स और वाणिज्यिक मॉड्यूल और थीम आपके व्यावसायिक अनुप्रयोग में उपयोग करने के लिए तैयार हैं।",
    "NuGetNPMPackages": "NuGet और NPM पैकेज",
    "NuGetNPMPackagesExplanation": "NuGet और NPM पैकेज के रूप में वितरित। स्थापित करने और अपग्रेड करने में आसान।",
    "ExtensibleReplaceable": "एक्स्टेंसिबल/बदली",
    "ExtensibleReplaceableExplanation": "सभी सेवाओं और मॉड्यूल को ध्यान में रखते हुए डिजाइन किया गया है। आप सेवाओं, पृष्ठों, शैलियों और घटकों को बदल सकते हैं।",
    "CrossCuttingConcernsExplanation2": "अपना कोडबेस छोटा रखें ताकि आप उस कोड पर ध्यान केंद्रित कर सकें जो आपके व्यवसाय के लिए विशिष्ट है।",
    "CrossCuttingConcernsExplanation3": "कई परियोजनाओं पर सामान्य आवेदन आवश्यकताओं को लागू करने का समय न भेजें।",
    "AuthenticationAuthorization": "प्रमाणीकरण प्राधिकरण",
    "ExceptionHandling": "संचालन अपवाद",
    "Validation": "मान्यकरण",
    "DatabaseConnection": "डेटाबेस कनेक्शन",
    "TransactionManagement": "आदान - प्रदान प्रबंधन",
    "AuditLogging": "ऑडिट लॉगिंग",
    "Caching": "कैशिंग",
    "Multitenancy": "बहु किरायेदारी",
    "DataFiltering": "डेटा फ़िल्टरिंग",
    "ConventionOverConfiguration": "कॉन्फिगरेशन पर सम्मलेन",
    "ConventionOverConfigurationExplanation": "ABP न्यूनतम या शून्य कॉन्फ़िगरेशन के साथ डिफ़ॉल्ट रूप से सामान्य अनुप्रयोग सम्मेलनों को लागू करता है।",
    "ConventionOverConfigurationExplanationList1": "ऑटो निर्भरता इंजेक्शन के लिए सेवाओं को पंजीकृत करता है।",
    "ConventionOverConfigurationExplanationList2": "नामकरण सम्मेलनों द्वारा HTTP APIs के रूप में अनुप्रयोग सेवाओं का प्रस्ताव है।",
    "ConventionOverConfigurationExplanationList3": " C#  और JavaScript के लिए गतिशील HTTP क्लाइंट प्रॉक्सी बनाता है।",
    "ConventionOverConfigurationExplanationList4": "आपकी संस्थाओं के लिए डिफ़ॉल्ट रिपॉजिटरी प्रदान करता है।",
    "ConventionOverConfigurationExplanationList5": "वेब अनुरोध या एप्लिकेशन सेवा पद्धति के अनुसार कार्य की इकाई का प्रबंधन।",
    "ConventionOverConfigurationExplanationList6": "आपकी संस्थाओं के लिए ईवेंट बनाएं, अपडेट करें और हटाएं।",
    "BaseClasses": "आधार वर्ग",
    "BaseClassesExplanation": "सामान्य अनुप्रयोग पैटर्न के लिए पूर्व-निर्मित आधार कक्षाएं।",
    "DeveloperFocusedExplanation": "एबीपी डेवलपर्स के लिए है।",
    "DeveloperFocusedExplanationCont": "यह आपके दैनिक सॉफ्टवेयर विकास को सरल बनाने का लक्ष्य रखता है जबकि आपको निम्न स्तर के कोड लिखने से प्रतिबंधित नहीं करता है।",
    "SeeAllFeatures": "सभी सुविधाएँ देखें",
    "CLI_CommandLineInterface": "सीएलआई (कमांड लाइन इंटरफ़ेस)",
    "CLI_CommandLineInterfaceExplanation": "नई परियोजनाओं के निर्माण और नए मॉड्यूल को जोड़ने में मदद करने के लिए एक CLI शामिल है।",
    "StartupTemplates": "स्टार्टअप टेम्पलेट",
    "StartupTemplatesExplanation": "विभिन्न स्टार्टअप टेम्प्लेट आपके विकास को शुरू करने के लिए पूरी तरह से कॉन्फ़िगर समाधान प्रदान करते हैं।",
    "BasedOnFamiliarTools": "परिचित उपकरणों के आधार पर",
    "BasedOnFamiliarToolsExplanation": "आप पहले से ही जानते हैं कि लोकप्रिय उपकरणों के साथ निर्मित और एकीकृत। कम सीखने की अवस्था, आसान अनुकूलन, आरामदायक विकास।",
    "ORMIndependent": "ORM स्वतंत्र",
    "ORMIndependentExplanation": "कोर फ्रेमवर्क ORM/डेटाबेस स्वतंत्र है और किसी भी डेटा स्रोत के साथ काम कर सकता है। इकाई फ्रेमवर्क कोर और MongoDB प्रदाता पहले से ही उपलब्ध हैं।",
    "Features": "ABP फ्रेमवर्क सुविधाओं का अन्वेषण करें",
    "ABPCLI": "एबीपी सीएलआई",
    "Modularity": "प्रतिरूपकता",
    "BootstrapTagHelpers": "बूटस्ट्रैप टैग हेल्पर्स",
    "DynamicForms": "गतिशील रूप",
    "BundlingMinification": "बंडलिंग और न्यूनतमकरण",
    "BackgroundJobs": "बैकग्राउंड जॉब्स",
    "BackgroundJobsExplanation": "कतारबद्ध के रूप में पृष्ठभूमि में कार्य निष्पादित करने के लिए सरल वर्गों को परिभाषित करें। बिल्ट-इन जॉब मैनेजर का उपयोग करें या अपना खुद का एकीकृत करें। <a href=\"{0}\">Hangfire</a> और <a href=\"{1}\">RabbitMQ</a> एकीकरण पहले से ही उपलब्ध हैं।",
    "DDDInfrastructure": "डीडीडी इन्फ्रास्ट्रक्चर",
    "DomainDrivenDesignInfrastructure": "डोमेन संचालित डिज़ाइन इन्फ्रास्ट्रक्चर",
    "AutoRESTAPIs": "ऑटो रीस्ट एपीआई",
    "DynamicClientProxies": "गतिशील ग्राहक प्रॉक्सी",
    "DistributedEventBus": "वितरित इवेंट बस",
    "DistributedEventBusWithRabbitMQIntegration": "रैबिटएमक्यू इंटीग्रेशन वाली इवेंट बस वितरित की",
    "TestInfrastructure": "टेस्ट इन्फ्रास्ट्रक्चर",
    "AuditLoggingEntityHistories": "ऑडिट लॉगिंग और इकाई इतिहास",
    "ObjectToObjectMapping": "ऑब्जेक्ट टू ऑब्जेक्ट मैपिंग",
    "ObjectToObjectMappingExplanation": "ऑटोमैपर एकीकरण के साथ <a href=\"{0}\">ऑब्जेक्ट टू ऑब्जेक्ट मैपिंग</a> एब्स्ट्रैक्शन।",
    "EmailSMSAbstractions": "ईमेल और एसएमएस अंश",
    "EmailSMSAbstractionsWithTemplatingSupport": "ईमेल और एसएमएस अंशांकन समर्थन के साथ",
    "Localization": "स्थानीयकरण",
    "SettingManagement": "प्रबंधन की स्थापना",
    "ExtensionMethods": "एक्सटेंशन के तरीके",
    "ExtensionMethodsHelpers": "एक्सटेंशन के तरीके और मददगार",
    "AspectOrientedProgramming": "पहलू आधारित प्रोग्रामिंग",
    "DependencyInjection": "निर्भरता अन्तःक्षेपण",
    "DependencyInjectionByConventions": "सम्मेलनों द्वारा निर्भरता इंजेक्शन",
    "ABPCLIExplanation": "ABP CLI (कमांड लाइन इंटरफेस) ABP आधारित समाधानों के लिए कुछ सामान्य ऑपरेशन करने के लिए एक कमांड लाइन टूल है।",
    "ModularityExplanation": "ABP अपने स्वयं के एप्लिकेशन मॉड्यूल बनाने के लिए एक पूर्ण बुनियादी ढांचा प्रदान करता है जिनके पास इकाइयाँ, सेवाएँ, डेटाबेस एकीकरण, API, UI घटक और इतने पर हो सकता है।",
    "MultiTenancyExplanation": "एबीपी फ्रेमवर्क न केवल बहु-किरायेदार अनुप्रयोगों को विकसित करने का समर्थन करता है, बल्कि आपके कोड को बहु-किरायेदारी से अनजान बनाता है।",
    "MultiTenancyExplanation2": "वर्तमान किरायेदार को स्वचालित रूप से निर्धारित कर सकते हैं, एक दूसरे से अलग किरायेदारों के डेटा को अलग कर सकते हैं।",
    "MultiTenancyExplanation3": "एकल डेटाबेस, डेटाबेस प्रति किरायेदार और हाइब्रिड दृष्टिकोण का समर्थन करता है।",
    "MultiTenancyExplanation4": "आप अपने व्यवसाय कोड पर ध्यान केंद्रित करते हैं और आपकी ओर से मल्टी-टेनेंसी को संभालने की रूपरेखा तैयार करते हैं।",
    "BootstrapTagHelpersExplanation": "बूटस्ट्रैप घटकों के दोहराए गए विवरणों को मैन्युअल रूप से लिखने के बजाय, इसे सरल बनाने और अंतरंगता का लाभ उठाने के लिए एबीपी के टैग सहायकों का उपयोग करें। जब भी आपको जरूरत हो आप बूटस्ट्रैप का इस्तेमाल जरूर कर सकते हैं।",
    "DynamicFormsExplanation": "डायनामिक फॉर्म और इनपुट टैग हेल्पर्स मॉडल के रूप में C# क्लास से पूरा फॉर्म बना सकते हैं।",
    "AuthenticationAuthorizationExplanation": "रिच प्रमाणीकरण और प्राधिकरण विकल्प ASP.NET कोर आइडेंटिटी और आइडेंटिटी सेवर 4 को एकीकृत करता है। एक एक्स्टेंसिबल और विस्तृत अनुमति प्रणाली प्रदान करता है।",
    "CrossCuttingConcernsExplanation": "इन सभी सामान्य चीज़ों को बार-बार लागू करने के लिए अपने आप को दोहराएं नहीं। अपने व्यवसाय कोड पर ध्यान दें और एबीपी को उन्हें सम्मेलनों द्वारा स्वचालित करें।",
    "DatabaseConnectionTransactionManagement": "डेटाबेस कनेक्शन और लेनदेन प्रबंधन",
    "CorrelationIdTracking": "सहसंबंध-आईडी ट्रैकिंग",
    "BundlingMinificationExplanation": "ABP एक सरल, गतिशील, शक्तिशाली, मॉड्यूलर और बिल्ट-इन बंडलिंग और मिनिफिकेशन सिस्टम प्रदान करता है।",
    "VirtualFileSystemnExplanation": "वर्चुअल फ़ाइल सिस्टम उन फ़ाइलों को प्रबंधित करना संभव बनाता है जो फ़ाइल सिस्टम (डिस्क) पर भौतिक रूप से मौजूद नहीं हैं। यह मुख्य रूप से विधानसभाओं में (js, css, image, cshtml...) फ़ाइलों को एम्बेड करने और रनटाइम के दौरान भौतिक फ़ाइलों की तरह उपयोग करने के लिए उपयोग किया जाता है।",
    "ThemingExplanation": "थिमिंग सिस्टम नवीनतम बूटस्ट्रैप ढांचे के आधार पर, सामान्य आधार पुस्तकालयों और लेआउट के एक सेट को परिभाषित करके आपके एप्लिकेशन और मॉड्यूल विषय को विकसित करने की अनुमति देता है।",
    "DomainDrivenDesignInfrastructureExplanation": "डोमेन संचालित डिज़ाइन पैटर्न और सिद्धांतों के आधार पर स्तरित अनुप्रयोगों के निर्माण के लिए एक पूर्ण बुनियादी ढांचा;",
    "Specification": "विनिर्देश",
    "Repository": "कोष",
    "DomainService": "डोमेन सेवा",
    "ValueObject": "मान वस्तु",
    "ApplicationService": "आवेदन सेवा",
    "DataTransferObject": "डेटा ट्रांसफर ऑब्जेक्ट",
    "AggregateRootEntity": "एग्रिगेट रूट, एंटिटी",
    "AutoRESTAPIsExplanation": "एबीपी कन्वेंशन द्वारा एपीआई कंट्रोलर के रूप में आपकी एप्लिकेशन सेवाओं को स्वचालित रूप से कॉन्फ़िगर कर सकता है।",
    "DynamicClientProxiesExplanation": "आसानी से जावास्क्रिप्ट और सी # क्लाइंट से अपने एपीआई का उपभोग करें।",
    "DistributedEventBusWithRabbitMQIntegrationExplanation": "बिल्ट-इन डिस्ट्रीब्यूटेड इवेंट बस का उपयोग करके आसानी से प्रकाशित और उपभोग की गई घटनाओं को उपलब्ध करें।",
    "TestInfrastructureExplanation": "फ्रेमवर्क को यूनिट और एकीकरण परीक्षण को ध्यान में रखते हुए विकसित किया गया है। यह आसान बनाने के लिए आपको आधार कक्षाएं प्रदान करता है। स्टार्टअप टेम्प्लेट परीक्षण के लिए पूर्व-कॉन्फ़िगर के साथ आते हैं।",
    "AuditLoggingEntityHistoriesExplanation": "व्यावसायिक महत्वपूर्ण अनुप्रयोगों के लिए अंतर्निहित ऑडिट लॉगिंग। संपत्ति स्तर के विवरण के साथ अनुरोध, सेवा, विधि स्तर ऑडिट लॉगिंग और इकाई इतिहास।",
    "EmailSMSAbstractionsWithTemplatingSupportExplanation": "IEmailSender और ISmsSender अमूर्त बुनियादी ढांचे से आपके आवेदन के तर्क को विघटित करते हैं। उन्नत ईमेल टेम्प्लेट सिस्टम ईमेल टेम्प्लेट बनाने और स्थानीय बनाने और जब भी आवश्यकता हो आसानी से उपयोग करने की अनुमति देता है।",
    "LocalizationExplanation": "स्थानीयकरण प्रणाली सादे JSON फ़ाइलों में संसाधन बनाने और उन्हें आपके UI को स्थानीय बनाने के लिए उपयोग करने की अनुमति देती है। यह वंशानुक्रम, एक्सटेंशन और जावास्क्रिप्ट एकीकरण जैसे उन्नत परिदृश्यों का समर्थन करता है, जबकि यह AspNet Core के स्थानीयकरण प्रणाली के साथ पूरी तरह से संगत है।",
    "SettingManagementExplanation": "अपने आवेदन के लिए सेटिंग्स को परिभाषित करें और वर्तमान कॉन्फ़िगरेशन, किरायेदार और उपयोगकर्ता के आधार पर रनटाइम पर मान प्राप्त करें।",
    "ExtensionMethodsHelpersExplanation": "तुच्छ कोड भागों के लिए भी अपने आप को दोहराएं नहीं। मानक प्रकारों के लिए एक्सटेंशन और हेल्पर्स आपके कोड को बहुत क्लीनर और लिखने में आसान बनाते हैं।",
    "AspectOrientedProgrammingExplanation": "गतिशील परदे के पीछे बनाने और पहलू ओरिएंटेड प्रोग्रामिंग को लागू करने के लिए एक आरामदायक बुनियादी ढांचा प्रदान करता है। किसी भी वर्ग को इंटरसेप्ट करें और हर विधि के निष्पादन से पहले और बाद में अपने कोड को निष्पादित करें।",
    "DependencyInjectionByConventionsExplanation": "मैन्युअल रूप से निर्भरता इंजेक्शन के लिए अपनी कक्षाओं को पंजीकृत करने की आवश्यकता नहीं है। कन्वेंशन द्वारा स्वचालित रूप से आम सेवा प्रकारों को पंजीकृत करता है। अन्य प्रकार की सेवाओं के लिए, आप इसे आसान और सरल बनाने के लिए इंटरफेस और विशेषताओं का उपयोग कर सकते हैं।",
    "DataFilteringExplanation": "उन डेटा फ़िल्टर को परिभाषित और उपयोग करें जो डेटाबेस से क्वेरी करने पर स्वचालित रूप से लागू होते हैं। जब आप साधारण इंटरफ़ेस लागू करते हैं, तो सॉफ्ट डिलीट और मल्टीटेन्नेर फिल्टर बॉक्स से बाहर दिए जाते हैं।",
    "PublishEvents": "घटनाक्रम प्रकाशित करें",
    "HandleEvents": "घटनाएँ संभालें",
    "AndMore": "और अधिक...",
    "Code": "कोड",
    "Result": "परिणाम",
    "SeeTheDocumentForMoreInformation": "अधिक जानकारी के लिए <a href=\"{1}\">{0} दस्तावेज़</a> देखें",
    "IndexPageHeroSection": "<span class=\"first-line shine\"><strong>open source</strong></span><span class=\"second-line text-uppercase\">Web Application<br/>Framework </span><span class=\"third-line shine2\"><strong>for asp.net core</strong></span>",
    "UiFramework": "यूआई फ्रेमवर्क",
    "EmailAddress": "ईमेल पता",
    "Mobile": "मोबाइल",
    "ReactNative": "प्रतिक्रियाशील मूलनिवासी",
    "Strong": "मजबूत",
    "Complete": "पूर्ण",
    "BasedLayeringModel": "आधारित लेयरिंग मॉडल",
    "Microservice": "माइक्रो सर्विस",
    "Compatible": "संगत",
    "MeeTTheABPCommunityInfo": "हमारा मिशन एक ऐसा वातावरण बनाना है जहां डेवलपर्स लेख, ट्यूटोरियल, केस स्टडी आदि के साथ एक-दूसरे की मदद कर सकें और समान विचारधारा वाले लोगों से मिल सकें।",
    "JoinTheABPCommunityInfo": "एक जीवंत समुदाय के साथ शामिल हों और ABP फ्रेमवर्क में योगदानकर्ता बनें!",
    "AllPosts": "सभी चीज़ें",
    "SubmitYourPost": "अपना लेख प्रस्तुत करें",
    "DynamicClientProxyDocument": "<a href=\"{0}\">JavaScript</a> और <a href=\"{1}\">C#</a> के लिए गतिशील क्लाइंट प्रॉक्सी दस्तावेज़ देखें।",
    "EmailSMSAbstractionsDocument": "अधिक जानकारी के लिए <a href=\"{0}\">ईमेलिंग</a> और <a href=\"{1}\">एसएमएस भेजना</a> दस्तावेज़ देखें।",
    "CreateProjectWizard": "यह विज़ार्ड स्टार्टअप टेम्प्लेट से एक नई परियोजना बनाता है जो आपकी परियोजना को शुरू करने के लिए ठीक से कॉन्फ़िगर किया गया है।",
    "TieredOption": "एक ऐसा समाधान तैयार करता है जहाँ वेब और Http API परतें शारीरिक रूप से अलग हो जाती हैं। यदि जांच नहीं की जाती है, तो एक स्तरित समाधान बनाता है जो कम जटिल है और अधिकांश परिदृश्यों के लिए उपयुक्त है।",
    "SeparateIdentityServerOption": "सर्वर एप्लिकेशन को दो अनुप्रयोगों में अलग करता है: पहला पहचान सर्वर के लिए है और दूसरा आपके सर्वर साइड HTTP एपीआई के लिए है।",
    "UseslatestPreVersion": "नवीनतम पूर्व-रिलीज़ संस्करण का उपयोग करता है",
    "ReadTheDocumentation": "<span class=\"text-primary\">पढ़ें</span><span class=\"text-success\">दस्तावेज़ीकरण</span>",
    "Documentation": "प्रलेखन",
    "GettingStartedTutorial": "स्टार्टिंग ट्यूटोरियल",
    "ApplicationDevelopmentTutorial": "अनुप्रयोग विकास ट्यूटोरियल",
    "TheStartupTemplate": "स्टार्टअप टेम्पलेट",
    "InstallABPCLIInfo": "एबीपी सीएलआई एबीपी ढांचे के साथ एक नया समाधान शुरू करने का सबसे तेज़ तरीका है। कमांड लाइन विंडो का उपयोग करके ABP CLI स्थापित करें:",
    "DifferentLevelOfNamespaces": "आप विभिन्न स्तरों के नामस्थानों का उपयोग कर सकते हैं; जैसे BookStore, Acme.BookStore या Acme.Retail.BookStore।",
    "ABPCLIExamplesInfo": "<strong> नया </ strong> कमांड डेटाबेस प्रदाता के रूप में <strong> एंटिटी फ्रेमवर्क कोर </ strong> के साथ <strong> स्तरित MVC एप्लिकेशन </ strong> बनाता है। हालांकि, इसके पास अतिरिक्त विकल्प हैं। उदाहरण:",
    "SeeCliDocumentForMoreInformation": "अधिक विकल्पों के लिए <a href=\"{0}\">ABP CLI दस्तावेज़</a> देखें या ऊपर \"डायरेक्ट डाउनलोड\" टैब चुनें।",
    "Optional": "ऐच्छिक",
    "LocalFrameworkRef": "फ्रेमवर्क पैकेज के लिए स्थानीय प्रोजेक्ट संदर्भ रखें।",
    "BlobStoring": "ब्लॉब भंडारण",
    "BlobStoringExplanation": "BLOB भंडारण प्रणाली BLOBs के साथ काम करने के लिए एक अमूर्तता प्रदान करती है। एबीपी कुछ प्री-बिल्ट स्टोरेज प्रोवाइडर इंटीग्रेशन (एज़्योर, एडब्ल्यूएस, फाइल सिस्टम, डेटाबेस इत्यादि) प्रदान करता है जिन्हें आप आसानी से अपने अनुप्रयोगों में उपयोग कर सकते हैं।",
    "TextTemplating": "पाठ अस्थायी",
    "TextTemplatingExplanation": "टेम्प्लेट टेम्प्लेटिंग का उपयोग टेम्प्लेट और मॉडल (डेटा ऑब्जेक्ट) के आधार पर सामग्री को गतिशील रूप से प्रस्तुत करने के लिए किया जाता है। उदाहरण के लिए, आप पूर्व-निर्मित टेम्पलेट के साथ गतिशील ईमेल सामग्री बनाने के लिए इसका उपयोग कर सकते हैं।",
    "MultipleUIOptions": "एकाधिक यूआई विकल्प",
    "MultipleDBOptions": "एकाधिक डेटाबेस प्रदाता",
    "MultipleUIOptionsExplanation": "कोर फ्रेमवर्क को यूआई स्वतंत्र के रूप में डिज़ाइन किया गया है और यह किसी भी प्रकार के यूआई सिस्टम के साथ काम कर सकता है, जबकि कई पूर्व-निर्मित और एकीकृत विकल्प बॉक्स से बाहर प्रदान किए गए हैं।",
    "MultipleDBOptionsExplanation": "रूपरेखा किसी भी डेटा स्रोत के साथ काम कर सकती है, जबकि निम्नलिखित प्रदाता आधिकारिक रूप से विकसित और समर्थित हैं;",
    "SelectLanguage": "भाषा का चयन करें",
    "LatestPostOnCommunity": "एबीपी समुदाय पर नवीनतम लेख",
    "Register": "रजिस्टर करें",
    "IsDownloadable": "डाउनलोड करने योग्य है",
    "DatabaseOptions": "डेटाबेस विकल्प",
    "BackToPackagesPage": "पैकेज पेज पर वापस जाएं",
    "HowToInstall": "स्थापित करने के लिए कैसे",
    "SeeOnNpm": "एनपीएम . पर देखें",
    "SeeOnNuget": "Nuget . पर देखें",
    "MVCGulpCommandExplanation": "यदि आप MVC (रेजर पेज) UI का उपयोग कर रहे हैं, तो पैकेज इंस्टालेशन के बाद \"गल्प\" कमांड चलाएँ।",
    "UsingABPCLI": "<a href=\"https://docs.abp.io/en/abp/latest/CLI\">Abp CLI</a> का उपयोग करना",
    "WithoutABPCLI": "एबीपी सीएलआई के बिना",
    "ABPCLIModuleDependency": "एबीपी क्ली स्वचालित रूप से मॉड्यूल निर्भरता जोड़ता है।",
    "AddModuleDependency": "फिर मॉड्यूल निर्भरता जोड़ें",
    "Packages": "संकुल",
    "NugetPackages": "नुगेट पैकेज",
    "NPMPackages": "एनपीएम पैकेज",
    "SeeDocs": "डॉक्स देखें",
    "None": "कोई नहीं",
    "Application": "आवेदन",
    "Module": "मापांक",
    "PackageName": "पैकेज का नाम",
    "LicenseURL": "लाइसेंस यूआरएल",
    "License": "लाइसेंस",
    "ProjectCreationSuccessMessage": "आपका प्रोजेक्ट सफलतापूर्वक बनाया गया है",
    "HowToRunSolution": "अपना समाधान कैसे चलाएं?",
    "GettingStartedMessage": "अपने समाधान को कॉन्फ़िगर और चलाने का तरीका जानने के लिए आरंभ करना दस्तावेज़ देखें।",
    "WebAppDevTutorial": "वेब ऐप देव ट्यूटोरियल",
    "WebAppDevTutorialMessage": "चरण-दर-चरण विकास नमूने के लिए वेब अनुप्रयोग विकास ट्यूटोरियल दस्तावेज़ देखें।",
    "CommunityPosts": "सामुदायिक लेख",
    "CommunityPostMessage": "एबीपी फ्रेमवर्क के लिए उपयोगी लेख पढ़ने के लिए एबीपी कम्युनिटी प्लेटफॉर्म देखें।",
    "InvestigateSolutionDetails": "समाधान विवरण देखें",
    "StartupTemplateDocumentationMessage": "अपने समाधान की संरचना और संरचना जानने के लिए एप्लिकेशन स्टार्टअप टेम्प्लेट दस्तावेज़ देखें।",
    "ClientSideDevelopment": "क्लाइंट साइड डेवलपमेंट",
    "ClientSideDevelopmentDocumentationMessage": "उपयोगकर्ता इंटरफ़ेस (क्लाइंट पक्ष) के विकास के मुख्य बिंदुओं को जानने के लिए {0} दस्तावेज़ देखें।",
    "DatabaseProviderDocumentationMessage": "डेटाबेस परत विकास के प्रमुख बिंदुओं को जानने के लिए {0} दस्तावेज़ देखें।",
    "ABPCommercialExplanationMessage": "एबीपी कमर्शियल एबीपी फ्रेमवर्क के लिए प्रीमियम मॉड्यूल, थीम, टूलिंग और समर्थन प्रदान करता है।",
    "ImplementingDDD": "डोमेन संचालित डिजाइन को लागू करना",
    "DDDBookExplanation": "एबीपी फ्रेमवर्क के साथ डोमेन संचालित डिजाइन को लागू करने के लिए एक व्यावहारिक गाइड।",
    "Overview": "अवलोकन",
    "DDDBookPracticalGuide": "यह डोमेन संचालित डिजाइन (डीडीडी) को लागू करने के लिए एक व्यावहारिक मार्गदर्शिका है। जबकि कार्यान्वयन विवरण एबीपी फ्रेमवर्क बुनियादी ढांचे पर आधारित हैं, बुनियादी अवधारणाओं, सिद्धांतों और मॉडलों को किसी भी समाधान पर लागू किया जा सकता है, भले ही वह .NET समाधान न हो।",
    "TableOfContents": "विषयसूची",
    "IntroductionToImplementingDDD": "डोमेन संचालित डिजाइन को लागू करने का परिचय",
    "WhatIsDDD": "डोमेन संचालित डिजाइन क्या है?",
    "Implementation": "कार्यान्वयन",
    "TheBigPicture": "बड़ी तस्वीर",
    "TheBuildingBlock": "बिल्डिंग ब्लॉक",
    "ExampleUseCase": "उदाहरण उपयोग केस",
    "DomainAndApplicationLogic": "डोमेन तर्क और अनुप्रयोग तर्क",
    "Author": "लेखक",
    "Pages": "पृष्ठों",
    "PublishedOn": "पर प्रकाशित",
    "FreeEBook": "मुफ्त ई-बुक",
    "Download": "डाउनलोड",
    "EBookSignInForDownload": "ई-बुक साइन इन डाउनलोड करने के लिए",
    "SignIn": "साइन इन करें",
    "Or": "या",
    "TellUsAboutYourself": "हमें अपने बारे में थोड़ा बताएं",
    "Name": "नाम",
    "Surname": "उपनाम",
    "CompanyName": "कंपनी का नाम",
    "DoYouAgreePrivacyPolicy": "I agree to the <a href=\"https://account.abp.io/Account/TermsConditions\">Terms & Conditions</a> and <a href=\"https://account.abp.io/Account/Privacy\">Privacy Policy</a>.",
    "Free": "नि: शुल्क",
    "DDDEBook": "डीडीडी ई-बुक",
    "PracticalGuideForImplementingDDD": "यह पुस्तक एबीपी फ्रेमवर्क के साथ डोमेन संचालित डिजाइन को लागू करने के लिए एक व्यावहारिक मार्गदर्शिका है।",
    "IntroducingDDD": "पेश है डोमेन ड्रिवेन डिज़ाइन",
    "DDDLayersAndCleanArchitecture": "डीडीडी परतें और स्वच्छ वास्तुकला",
    "LayeringOfADotnetSolution": "एक .NET समाधान की लेयरिंग",
    "ImplementingDDDBuildingBlocks": "डीडीडी बिल्डिंग ब्लॉक्स को लागू करना",
    "DomainVsApplicationLogic": "डोमेन लॉजिक बनाम एप्लिकेशन लॉजिक",
    "SamplesAndDiscussions": "नमूने और चर्चा",
    "EmailNotValid": "कृपया एक मान्य ईमेल पता प्रविष्ट करें।",
    "WeWillSendYouADownloadLink": "ई-किताब डाउनलोड करने के लिए एक लिंक {0} को भेज दिया गया है। अपना इनबॉक्स, जंक या स्पैम बॉक्स चेक करें!",
    "GoHome": "घर जाओ",
    "InvalidFormInputs": "कृपया, फॉर्म पर निर्दिष्ट मान्य जानकारी टाइप करें।",
    "DDDBookEmailBody": "धन्यवाद। <br /> अपनी पुस्तक डाउनलोड करने के लिए, <a href=\"{0}\">यहां क्लिक करें</a>।",
    "SubscribeToNewsletter": "ABP.IO प्लेटफ़ॉर्म में होने वाली घटनाओं, जैसे नई रिलीज़, लेख, ऑफ़र, आदि के बारे में जानकारी प्राप्त करने के लिए न्यूज़लेटर की सदस्यता लें।",
    "FirstEdition": "प्रथम संस्करण",
    "ThankYou": "शुक्रिया!",
    "CheckboxMandatory": "आगे बढ़ने के लिए आपको इसे जांचना होगा!"
  }
}