{
  "culture": "it",
  "texts": {
    "GetStarted": "Inizia - Modelli di avvio",
    "Create": "Crea",
    "NewProject": "Nuovo progetto",
    "DirectDownload": "Download diretto",
    "ProjectName": "Nome del progetto",
    "ProjectType": "Tipo di progetto",
    "DatabaseProvider": "Provider di database",
    "DatabaseManagementSystem": "Sistema di gestione del database",
    "NTier": "N-Tier",
    "IncludeUserInterface": "Includi l'interfaccia utente",
    "CreateNow": "Crea adesso",
    "TheStartupProject": "Il progetto di avvio",
    "Tutorial": "Tutorial",
    "UsingCLI": "Utilizzo della CLI",
    "SeeDetails": "Vedi i dettagli",
    "AbpShortDescription": "ABP Framework è un'infrastruttura completa per la creazione di soluzioni software con architetture moderne basate sulla piattaforma ASP.NET Core.",
    "SourceCodeUpper": "CODICE SORGENTE",
    "LatestReleaseLogs": "Ultimi note di rilascio",
    "Infrastructure": "Infrastruttura",
    "Architecture": "Architettura",
    "Modular": "Modulare",
    "DontRepeatYourself": "Non ripetere te stesso",
    "DeveloperFocused": "Incentrato sullo sviluppatore",
    "FullStackApplicationInfrastructure": "Infrastruttura applicativa full stack.",
    "DomainDrivenDesign": "Domain Driven Design",
    "DomainDrivenDesignExplanation": "Progettato e sviluppato sulla base di modelli e principi DDD. Fornisce un modello a più livelli per la tua applicazione.",
    "Authorization": "Autorizzazione",
    "AuthorizationExplanation": "Autorizzazione avanzata con utente, ruolo e sistema di autorizzazioni granulare. Basato sulla libreria Microsoft Identity.",
    "MultiTenancy": "Multi-Tenancy",
    "MultiTenancyExplanationShort": "Applicazioni SaaS rese facili! Multi-tenancy integrato dal database all'interfaccia utente.",
    "CrossCuttingConcerns": "Questioni trasversali",
    "CrossCuttingConcernsExplanationShort": "Infrastruttura completa per autorizzazione, convalida, gestione delle eccezioni, memorizzazione nella cache, registrazione di audit, gestione delle transazioni e altro ancora.",
    "BuiltInBundlingMinification": "Raggruppamento e minimizzazione incorporati",
    "BuiltInBundlingMinificationExplanation": "Non è necessario utilizzare strumenti esterni per raggruppare e minimizzare. ABP offre un modo più semplice, dinamico, potente, modulare e integrato!",
    "VirtualFileSystem": "File system virtuale",
    "VirtualFileSystemExplanation": "Incorpora viste, script, stili, immagini... in pacchetti/librerie e riutilizzali in diverse applicazioni.",
    "Theming": "Personalizzazione tema",
    "ThemingExplanationShort": "Usa e personalizza il tema dell'interfaccia utente standard basato su bootstrap o creane uno tuo.",
    "BootstrapTagHelpersDynamicForms": "Bootstrap Tag Helpers e moduli dinamici",
    "BootstrapTagHelpersDynamicFormsExplanation": "Invece di scrivere manualmente i dettagli ripetuti dei componenti bootstrap, usa i tag helper di ABP per semplificarlo e sfruttare intellisense. Crea rapidamente moduli dell'interfaccia utente basati su un modello C# utilizzando l'helper tag del modulo dinamico.",
    "HTTPAPIsDynamicProxies": "API HTTP e proxy dinamici",
    "HTTPAPIsDynamicProxiesExplanation": "Esponi automaticamente i servizi dell'applicazione come API HTTP in stile REST e utilizzali con JavaScript dinamici e proxy  C# .",
    "CompleteArchitectureInfo": "Architettura moderna per creare soluzioni software manutenibili.",
    "DomainDrivenDesignBasedLayeringModelExplanation": "Aiuta a implementare un'architettura a strati basata su DDD e a costruire una base di codice gestibile.",
    "DomainDrivenDesignBasedLayeringModelExplanationCont": "Fornisce modelli di avvio, astrazioni, classi di base, servizi, documentazione e guide per aiutarti a sviluppare la tua applicazione in base a modelli e principi DDD.",
    "MicroserviceCompatibleModelExplanation": "Il framework principale ed i moduli predefiniti sono progettati pensando all'architettura dei microservizi.",
    "MicroserviceCompatibleModelExplanationCont": "Fornisce infrastruttura, integrazioni, campioni e documentazione per implementare più facilmente soluzioni di microservizi, mentre non apporta ulteriore complessità se si desidera un'applicazione monolitica.",
    "ModularInfo": "ABP fornisce un sistema di moduli che consente di sviluppare moduli applicativi riutilizzabili, collegarsi agli eventi del ciclo di vita dell'applicazione ed esprimere le dipendenze tra le parti principali del sistema.",
    "PreBuiltModulesThemes": "Moduli e temi predefiniti",
    "PreBuiltModulesThemesExplanation": "Moduli e temi open source e commerciali sono pronti per l'uso nella tua applicazione aziendale.",
    "NuGetNPMPackages": "Pacchetti NuGet e NPM",
    "NuGetNPMPackagesExplanation": "Distribuito come pacchetti NuGet e NPM. Facile da installare e aggiornare.",
    "ExtensibleReplaceable": "Estensibile/sostituibile",
    "ExtensibleReplaceableExplanation": "Tutti i servizi e i moduli sono progettati tenendo conto dell'estensibilità. Puoi sostituire servizi, pagine, stili e componenti.",
    "CrossCuttingConcernsExplanation2": "Mantieni la tua base di codice più piccola in modo da poter concentrarti sul codice specifico per la tua attività.",
    "CrossCuttingConcernsExplanation3": "Non dedicare tempo all'implementazione dei requisiti delle applicazioni comuni su più progetti.",
    "AuthenticationAuthorization": "Autenticazione e autorizzazione",
    "ExceptionHandling": "La gestione delle eccezioni",
    "Validation": "Validazione",
    "DatabaseConnection": "Connessione al database",
    "TransactionManagement": "Gestione delle transazioni",
    "AuditLogging": "Registri di controllo",
    "Caching": "Caching",
    "Multitenancy": "Multitenancy",
    "DataFiltering": "Filtraggio dei dati",
    "ConventionOverConfiguration": "Configurazione su convenzioni",
    "ConventionOverConfigurationExplanation": "ABP implementa convenzioni di applicazioni comuni per impostazione predefinita con una configurazione minima o zero.",
    "ConventionOverConfigurationExplanationList1": "Registra automaticamente i servizi noti per l'inserimento delle dipendenze.",
    "ConventionOverConfigurationExplanationList2": "Espone i servizi dell'applicazione come API HTTP mediante convenzioni di denominazione.",
    "ConventionOverConfigurationExplanationList3": "Crea proxy client HTTP dinamici per C# e JavaScript.",
    "ConventionOverConfigurationExplanationList4": "Fornisce archivi predefiniti per le tue entità.",
    "ConventionOverConfigurationExplanationList5": "Gestisce l'UnitofWork per richieste Web o per i metodi dei servizi dell'applicazione.",
    "ConventionOverConfigurationExplanationList6": "Pubblica gli eventi creazione, aggiornamento ed eliminazione per le tue entità.",
    "BaseClasses": "Classi di base",
    "BaseClassesExplanation": "Classi di base predefinite per modelli di applicazioni comuni.",
    "DeveloperFocusedExplanation": "ABP è per gli sviluppatori.",
    "DeveloperFocusedExplanationCont": "Ha lo scopo di semplificare lo sviluppo quotidiano del software senza impedirti di scrivere codice di basso livello.",
    "SeeAllFeatures": "Visualizza tutte le funzionalità",
    "CLI_CommandLineInterface": "CLI (Command Line Interface)",
    "CLI_CommandLineInterfaceExplanation": "Include una CLI per aiutarti ad automatizzare la creazione di nuovi progetti e l'aggiunta di nuovi moduli.",
    "StartupTemplates": "Modelli di avvio",
    "StartupTemplatesExplanation": "Vari modelli di avvio forniscono una soluzione completamente configurata per avviare rapidamente lo sviluppo.",
    "BasedOnFamiliarTools": "Basato su strumenti familiari",
    "BasedOnFamiliarToolsExplanation": "Costruito e integrato con strumenti popolari che già conosci. Bassa curva di apprendimento, facile adattamento, sviluppo confortevole.",
    "ORMIndependent": "ORM indipendente",
    "ORMIndependentExplanation": "Il framework principale è indipendente da ORM/database e può funzionare con qualsiasi origine dati. I provider di Entity Framework Core e MongoDB sono già disponibili.",
    "Features": "Esplora le funzionalità di ABP Framework",
    "ABPCLI": "ABP CLI",
    "Modularity": "Modularità",
    "BootstrapTagHelpers": "Bootstrap Tag Helpers",
    "DynamicForms": "Moduli dinamici",
    "BundlingMinification": "Raggruppamento e minimizzazione",
    "BackgroundJobs": "Operazioni in background",
    "BackgroundJobsExplanation": "Definire classi semplici per eseguire Operazioni in background come in coda. Usa il gestore dei lavori integrato o integra il tuo. Le integrazioni <a href=\"{0}\"> Hangfire </a> e <a href=\"{1}\"> RabbitMQ </a> sono già disponibili.",
    "DDDInfrastructure": "Infrastruttura DDD",
    "DomainDrivenDesignInfrastructure": "Infrastruttura Domain Driven Design",
    "AutoRESTAPIs": "API REST automatiche",
    "DynamicClientProxies": "Proxy client dinamici",
    "DistributedEventBus": "Bus Eventi Distribuito",
    "DistributedEventBusWithRabbitMQIntegration": "Bus Eventi Distribuito con integrazione RabbitMQ",
    "TestInfrastructure": "Infrastruttura di test",
    "AuditLoggingEntityHistories": "Registrazione di audit e cronologie delle entità",
    "ObjectToObjectMapping": "Mappatura da oggetto a oggetto",
    "ObjectToObjectMappingExplanation": "Astrazione della <a href=\"{0}\"> mappatura da oggetto a oggetto </a> con integrazione AutoMapper.",
    "EmailSMSAbstractions": "Astrazioni tramite e-mail e SMS",
    "EmailSMSAbstractionsWithTemplatingSupport": "Astrazioni tramite posta elettronica e SMS con supporto per i modelli",
    "Localization": "Localizzazione",
    "SettingManagement": "Gestione delle impostazioni",
    "ExtensionMethods": "Metodi estensione",
    "ExtensionMethodsHelpers": "Metodi estensione e assistenti",
    "AspectOrientedProgramming": "Programmazione orientata agli aspetti",
    "DependencyInjection": "Iniezione delle dipendenze",
    "DependencyInjectionByConventions": "Inserimento delle dipendenze mediante convenzioni",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) è uno strumento a riga di comando per eseguire alcune operazioni comuni per soluzioni basate su ABP.",
    "ModularityExplanation": "ABP fornisce un'infrastruttura completa per creare i propri moduli applicativi che possono avere entità, servizi, integrazione di database, API, componenti dell'interfaccia utente e così via.",
    "MultiTenancyExplanation": "Il framework ABP non solo supporta lo sviluppo di applicazioni multi-tenant, ma rende anche il tuo codice per lo più inconsapevole del multi-tenancy.",
    "MultiTenancyExplanation2": "Può determinare automaticamente il tenant corrente, isolare i dati dei diversi tenant l'uno dall'altro.",
    "MultiTenancyExplanation3": "Supporta database singolo, database per tenant e approcci ibridi.",
    "MultiTenancyExplanation4": "Ti concentri sul tuo codice aziendale e lasci che il framework gestisca il multi-tenancy per tuo conto.",
    "BootstrapTagHelpersExplanation": "Invece di scrivere manualmente i dettagli ripetuti dei componenti bootstrap, usa gli helper tag di ABP per semplificarlo e sfruttare intellisense. Puoi sicuramente usare Bootstrap ogni volta che ne hai bisogno.",
    "DynamicFormsExplanation": "Gli helper dei moduli dinamici e dei tag di input possono creare il modulo completo da una classe C# come modello.",
    "AuthenticationAuthorizationExplanation": "Ricche opzioni di autenticazione e autorizzazione integrate in ASP.NET Core Identity & OpenIddict. Fornisce un sistema di autorizzazione estensibile e dettagliato.",
    "CrossCuttingConcernsExplanation": "Non ripetere te stesso per implementare tutte queste cose comuni ancora e ancora. Concentrati sul tuo codice aziendale e lascia che ABP li automatizzi secondo le convenzioni.",
    "DatabaseConnectionTransactionManagement": "Connessione al database e gestione delle transazioni",
    "CorrelationIdTracking": "Monitoraggio dell'ID di correlazione",
    "BundlingMinificationExplanation": "ABP offre un sistema di raggruppamento e minimizzazione semplice, dinamico, potente, modulare e integrato.",
    "VirtualFileSystemnExplanation": "Il Virtual File System consente di gestire file che non esistono fisicamente nel file system (disco). Viene utilizzato principalmente per incorporare file (js, css, immagine, cshtml...) negli assembly e utilizzarli come file fisici in runtime.",
    "ThemingExplanation": "Il sistema di temi consente di sviluppare applicazioni e moduli indipendentemente dal tema definendo un set di librerie e layout di base comuni, basati sul più recente framework Bootstrap.",
    "DomainDrivenDesignInfrastructureExplanation": "Un'infrastruttura completa per creare applicazioni a più livelli basate sui modelli e sui principi di Domain Driven Design;",
    "Specification": "Specificazione",
    "Repository": "Repository",
    "DomainService": "Servizio di dominio",
    "ValueObject": "Oggetto valore",
    "ApplicationService": "Servizio applicazione",
    "DataTransferObject": "Oggetto trasferimento dati",
    "AggregateRootEntity": "Aggregate Root, entità",
    "AutoRESTAPIsExplanation": "ABP può configurare automaticamente i servizi dell'applicazione come controller API per convenzione.",
    "DynamicClientProxiesExplanation": "Utilizza facilmente le tue API da client JavaScript e  C# .",
    "DistributedEventBusWithRabbitMQIntegrationExplanation": "Pubblica e utilizza facilmente eventi distribuiti utilizzando Distributed Event Bus integrato con integrazione RabbitMQ disponibile.",
    "TestInfrastructureExplanation": "Il framework è stato sviluppato in mente per test di unità e integrazione. Fornisce classi di base per renderlo più facile. I modelli di avvio vengono forniti preconfigurati per i test.",
    "AuditLoggingEntityHistoriesExplanation": "Registrazione di audit integrata per applicazioni business-critical. Richiesta, servizio, registrazione di controllo a livello di metodo e cronologie di entità con dettagli a livello di proprietà.",
    "EmailSMSAbstractionsWithTemplatingSupportExplanation": "Le astrazioni di IEmailSender e ISmsSender separano la logica dell'applicazione dall'infrastruttura. Il sistema avanzato di modelli di posta elettronica consente di creare e localizzare modelli di posta elettronica e di utilizzarli facilmente quando necessario.",
    "LocalizationExplanation": "Il sistema di localizzazione consente di creare risorse in semplici file JSON e utilizzarli per localizzare la tua interfaccia utente. Supporta scenari avanzati come ereditarietà, estensioni e integrazione JavaScript mentre è completamente compatibile con il sistema di localizzazione di AspNet Core.",
    "SettingManagementExplanation": "Definisci le impostazioni per la tua applicazione e ottieni i valori in fase di esecuzione in base alla configurazione, al tenant e all'utente correnti.",
    "ExtensionMethodsHelpersExplanation": "Non ripeterti nemmeno per parti di codice banali. Le estensioni e gli helper per i tipi standard rendono il codice molto più pulito e facile da scrivere.",
    "AspectOrientedProgrammingExplanation": "Fornisce una comoda infrastruttura per creare proxy dinamici e implementare la programmazione orientata agli aspetti. Intercetta qualsiasi classe ed esegui il codice prima e dopo l'esecuzione di ogni metodo.",
    "DependencyInjectionByConventionsExplanation": "Non è necessario registrare manualmente le classi per l'inserimento delle dipendenze. Registra automaticamente i tipi di servizio comuni per convenzione. Per altri tipi di servizi, puoi utilizzare interfacce e attributi per renderlo più semplice e sul posto.",
    "DataFilteringExplanation": "Definisci e utilizza i filtri di dati che vengono applicati automaticamente quando esegui query sulle entità dal database. Quando si implementano interfacce semplici, vengono forniti filtri Soft Delete e MultiTenant.",
    "PublishEvents": "Pubblica eventi",
    "HandleEvents": "Gestisci eventi",
    "AndMore": "e altro ancora...",
    "Code": "Codice",
    "Result": "Risultato",
    "SeeTheDocumentForMoreInformation": "Consulta il <a href=\"{1}\"> {0} documento </a> per ulteriori informazioni",
    "IndexPageHeroSection": "<span class=\"first-line shine\"><strong>open source</strong></span><span class=\"second-line text-uppercase\">Framework <br/>applicazione web</span><span class=\"third-line shine2\"><strong>per asp.net core</strong></span>",
    "UiFramework": "Framework dell'interfaccia utente",
    "EmailAddress": "Indirizzo e-mail",
    "Mobile": "Mobile",
    "ReactNative": "React Native",
    "Strong": "Forte",
    "Complete": "Completa",
    "BasedLayeringModel": "Modello di stratificazione basato",
    "Microservice": "Microservizio",
    "Compatible": "Compatibile",
    "MeeTTheABPCommunityInfo": "La nostra missione è creare un ambiente in cui gli sviluppatori possano aiutarsi a vicenda con articoli, tutorial, casi di studio, ecc. E incontrare persone che la pensano allo stesso modo.",
    "JoinTheABPCommunityInfo": "Fatti coinvolgere da una vivace comunità e diventa un collaboratore di ABP Framework!",
    "AllPosts": "Tutti gli articoli",
    "SubmitYourPost": "Invia il tuo articolo",
    "DynamicClientProxyDocument": "Consulta la documentazione relativa al proxy del client dinamico per <a href=\"{0}\">JavaScript</a> e <a href=\"{1}\">C#</a>.",
    "EmailSMSAbstractionsDocument": "Per ulteriori informazioni, consulta i documenti di <a href=\"{0}\">invio di email</a> e <a href=\"{1}\">invio di SMS</a>.",
    "CreateProjectWizard": "Questa procedura guidata crea un nuovo progetto dal modello di avvio che è configurato correttamente per avviare rapidamente il progetto.",
    "TieredOption": "Crea una soluzione a più livelli in cui i livelli API Web e Http sono fisicamente separati. Se non selezionata, crea una soluzione a più livelli meno complessa e adatta alla maggior parte degli scenari.",
    "SeparateIdentityServerOption": "Separa il lato server in due applicazioni: la prima è per il server di identità e la seconda è per l'API HTTP lato server.",
    "SeparateAuthenticationServerOption": "Separa il lato server in due applicazioni: la prima è per il server di autenticazione e la seconda è per l&#39;API HTTP lato server.",
    "ProgressiveWebApplicationOption": "Specifica il progetto come applicazione Web progressiva",
    "UseslatestPreVersion": "Utilizza l'ultima versione pre-rilascio",
    "ReadTheDocumentation": "<span class=\"text-primary\">Leggi</span><span class=\"text-success\">La documentazione</span>",
    "Documentation": "Documentazione",
    "GettingStartedTutorial": "Tutorial introduttivo",
    "ApplicationDevelopmentTutorial": "Tutorial sullo sviluppo di applicazioni",
    "TheStartupTemplate": "Il modello di avvio",
    "InstallABPCLIInfo": "ABP CLI è il modo più veloce per avviare una nuova soluzione con il framework ABP. Installa ABP CLI utilizzando una finestra della riga di comando:",
    "DifferentLevelOfNamespaces": "È possibile utilizzare diversi livelli di spazi dei nomi; per esempio. BookStore, Acme.BookStore o Acme.Retail.BookStore.",
    "ABPCLIExamplesInfo": "Il comando <strong>nuovo</strong> crea un '<strong>applicazione MVC a più livelli</strong> con <strong>Entity Framework Core</strong> come provider di database. Tuttavia, ha opzioni aggiuntive. Esempi:",
    "SeeCliDocumentForMoreInformation": "Consulta la <a href=\"{0}\">documentazione ABP CLI</a> per ulteriori opzioni o seleziona la scheda \"Download diretto\" in alto.",
    "Optional": "Opzionale",
    "LocalFrameworkRef": "Mantieni il riferimento al progetto locale per i pacchetti del framework.",
    "BlobStoring": "Archiviazione BLOB",
    "BlobStoringExplanation": "Il sistema di archiviazione BLOB fornisce un'astrazione per lavorare con i BLOB. ABP fornisce alcune integrazioni di provider di archiviazione predefinite (Azure, AWS, File System, Database e così via) che puoi facilmente utilizzare nelle tue applicazioni.",
    "TextTemplating": "Modelli di testo",
    "TextTemplatingExplanation": "La creazione di modelli di testo viene utilizzata per eseguire il rendering dinamico dei contenuti in base a un modello e un modello (un oggetto dati). Ad esempio, puoi utilizzarlo per creare contenuti di posta elettronica dinamici con un modello predefinito.",
    "MultipleUIOptions": "Molteplici opzioni di interfaccia utente",
    "MultipleDBOptions": "Più provider per database",
    "MultipleUIOptionsExplanation": "Il framework principale è progettato come indipendente dall'interfaccia utente e può funzionare con qualsiasi tipo di sistema di interfaccia utente, mentre sono disponibili più opzioni predefinite e integrate.",
    "MultipleDBOptionsExplanation": "Il framework può funzionare con qualsiasi fonte di dati, mentre i seguenti provider sono ufficialmente sviluppati e supportati;",
    "SelectLanguage": "Seleziona la lingua",
    "LatestPostOnCommunity": "Ultimo articolo sulla comunità ABP",
    "Register": "Registrati",
    "IsDownloadable": "È scaricabile",
    "DatabaseOptions": "Opzioni Database",
    "BackToPackagesPage": "Torna alla Pagina Pacchetti",
    "HowToInstall": "Come Installare",
    "SeeOnNpm": "Vedi su NPM",
    "SeeOnNuget": "Vedi su Nuget",
    "MVCGulpCommandExplanation": "Se stai usando UI MVC (Razor Pages), esegui il comando \"gulp\" dopo l'installazione del pacchetto.",
    "UsingABPCLI": "Usa <a href=\"https://docs.abp.io/en/abp/latest/CLI\">Abp CLI</a>",
    "WithoutABPCLI": "Senza ABP CLI",
    "ABPCLIModuleDependency": "ABP CLI aggiunge automaticamente le dipendenze del modulo.",
    "AddModuleDependency": "Quindi aggiunge le dipendenze del modulo",
    "Packages": "Pacchetti",
    "NugetPackages": "Pacchetti Nuget",
    "NPMPackages": "Pacchetti NPM",
    "SeeDocs": "Vedi Documentazione",
    "None": "Nessuno",
    "Application": "Applicazione",
    "ApplicationExplanation": "Crea una soluzione completamente stratificata basata su pratiche di progettazione guidata dal dominio. Consigliato per progetti a lungo termine che necessitano di una base di codice gestibile ed estensibile.",
    "ApplicationNoLayer": "Applicazione (strato singolo)",
    "ApplicationNoLayerExplanation": "Crea un&#39;applicazione Web a livello singolo. Consigliato per creare un&#39;applicazione con un&#39;architettura più semplice e di facile comprensione.",
    "Module": "Moduli",
    "ModuleExplanation": "Crea una soluzione di moduli applicativi riutilizzabili e completamente stratificati. Puoi utilizzare questa opzione per creare moduli per la tua applicazione modulare.",
    "PackageName": "Nome Pacchetto",
    "LicenseURL": "URL Licenza",
    "License": "Licenza",
    "ProjectCreationSuccessMessage": "Il tuo progetto è stato creato con successo",
    "HowToRunSolution": "Come Eseguire la Tua Soluzione?",
    "GettingStartedMessage": "Guarda la documentazione su come iniziare per imparare a configurare ed eseguire la tua soluzione.",
    "WebAppDevTutorial": "Tutorial Sviluppo Web App",
    "WebAppDevTutorialMessage": "Guarda tutorial sviluppo applicazione web per un esempio di sviluppo passo passo.",
    "CommunityPosts": "Articoli Comunità",
    "CommunityPostMessage": "Verifica la piattaforma Comunità ABP per leggere articoli utili su ABP Framework.",
    "InvestigateSolutionDetails": "Vedi Dettagli della Soluzione",
    "StartupTemplateDocumentationMessage": "Guarda il modello di avvio dell'applicazione per imparare l'architettura e la struttura della tua soluzione.",
    "ClientSideDevelopment": "Sviluppo Lato Client",
    "ClientSideDevelopmentDocumentationMessage": "Guarda il documento {0} per imparare i punti chiave dello sviluppo dell'interfaccia utente (lato client).",
    "DatabaseProviderDocumentationMessage": "Guarda il documento {0} per imparare i punti chiave dello sviluppo dello strato database",
    "ABPCommercialExplanationMessage": "ABP Commercial fornisce moduli premium, temi, strumenti e supporto per ABP Framework.",
    "ImplementingDDD": "Implementazione Domain Driven Design",
    "DDDBookExplanation": "Una guida pratica per l'implementazione del Domain Driven Design con ABP Framework.",
    "Overview": "Panoramica",
    "DDDBookPracticalGuide": "Questa a una guida pratica per implementare Domain Driven Design (DDD). Mentre i dettagli per l'implementazione sono basati sull'infrastruttura di ABP Framework, i concetti base, principi e modelli possono essere applicati a qualsiasi soluzione, anche se non è una soluzione .NET.",
    "TableOfContents": "Sommario",
    "IntroductionToImplementingDDD": "Introduzione all'implementazione del Domain Driven Design",
    "WhatIsDDD": "Cos'è il Domain Driven Design?",
    "Implementation": "Implementazione",
    "TheBigPicture": "Il Quadro Generale",
    "TheBuildingBlock": "Le Fondamenta",
    "ExampleUseCase": "Esempio d'uso",
    "DomainAndApplicationLogic": "Logica di Dominio e Logica Applicazione",
    "Author": "Autore",
    "Pages": "Pagine",
    "PublishedOn": "Pubblicato il",
    "FreeEBook": "E-Book Gratuito",
    "Download": "Scarica",
    "EBookSignInForDownload": "Accedi per scaricare l'e-book",
    "SignIn": "Accedi",
    "Or": "O",
    "TellUsAboutYourself": "Dicci qualcosa di te",
    "Name": "Nome",
    "Surname": "Cognome",
    "CompanyName": "Nome Azienda",
    "DoYouAgreePrivacyPolicy": "Acconsento ai <a href=\"https://account.abp.io/Account/TermsConditions\">Termini e Condizioni</a> ed alla <a href=\"https://account.abp.io/Account/Privacy\">Politica Privacy</a>.",
    "Free": "Gratuito",
    "DDDEBook": "DDD E-Book",
    "PracticalGuideForImplementingDDD": "Questo libro è una guida pratica per l'implementazione del Domain Driven Design con ABP Framework.",
    "IntroducingDDD": "Introduzione al Domain Driven Design",
    "DDDLayersAndCleanArchitecture": "DDD Strati e Architettura Pulita",
    "LayeringOfADotnetSolution": "Stratificazione di una Soluzione .NET",
    "ImplementingDDDBuildingBlocks": "Implementazione delle Fondamenta del DDD",
    "DomainVsApplicationLogic": "Logica di Dominio contro Logica Applicazione",
    "SamplesAndDiscussions": "Esempi e Discussioni",
    "EmailNotValid": "Per favore inserisci un indirizzo email valido.",
    "WeWillSendYouADownloadLink": "Un link per scaricare il libro e-book è stato spedito a {0}.<br/> Controlla nella posta in arrivo, indesiderata o spam!",
    "GoHome": "Vai alla Home",
    "InvalidFormInputs": "Per favore, digita le informazioni valide specificate nel modulo",
    "DDDBookEmailBody": "Grazie. <br /> Per scaricare il tuo libro, <a href=\"{0}\">clicca qui</a>.",
    "SubscribeToNewsletter": "Sottiscrivi la nostra newsletter per ricevere informazione su cosa accade nella Piattaforma ABP.IO, come nuove versioni, articoli, offerte ed altro ancora.",
    "FirstEdition": "Prima Edizione",
    "ThankYou": "Grazie!",
    "CheckboxMandatory": "Devi mettere la spunta su questo per procedere!",
    "UserInterface": "Interfaccia utente",
    "APIGateway": "Gateway API",
    "Database": "Banca dati",
    "Saas": "Saas",
    "OpenSourceWebApp": "<span class=\"forever\">Fonte</span> aperta<br/> applicazione web",
    "Framework": "Struttura",
    "AuditLoggingExplanation": "Traccia automaticamente tutte le operazioni e le modifiche ai dati nel tuo sistema.",
    "AbpNewCommandExplanation": "Crea nuove soluzioni utilizzando i modelli di avvio ABP.",
    "AbpAddModuleCommandExplanation": "Installa moduli applicativi predefiniti nella tua soluzione",
    "AbpUpdateCommandExplanation": "Aggiorna automaticamente tutti i pacchetti NuGet e NPM correlati a ABP nella soluzione.",
    "ExploreAllCLICommands": "Esplora tutti i comandi CLI",
    "ExploreDocumentationAndGuides": "Esplora la documentazione e le guide complete.",
    "Documentations": "Documentazione",
    "Views": "Visualizzazioni",
    "EnterYouEmailToGetNews": "Inserisci la tua email per ricevere le ultime novità sull&#39;ABP Framework",
    "Tiered": "Stanco",
    "SeparateIdentityServer": "Server di identità separato",
    "SeparateAuthenticationServer": "Server di autenticazione separato",
    "ProgressiveWebApplication": "Applicazione Web progressiva",
    "Preview": "Anteprima",
    "CreateANewSolution": "Creare una nuova soluzione",
    "FrameworkFeatures": "<span class=\"gradient-framework\">Caratteristiche</span> della struttura ABP",
    "Commercial": "Commerciale",
    "ThirdPartyTools": "Strumenti di terze parti",
    "Back": "Indietro",
    "Community": "Comunità",
    "SeeMore": "Vedi altro",
    "DetailsOfTheEBook": "Dettagli dell&#39;e-book",
    "JoinOurMarketingNewsletter": "Iscriviti alla nostra newsletter di marketing",
    "FrameworkNewsletterConfirmationMessage": "Accetto i <a class=\"text-white fw-6 text-decoration-underline opacity-50\" href=\"https://commercial.abp.io/TermsConditions\">Termini e Condizioni</a> e <a  class=\"text-white fw-6 text-decoration-underline opacity-50\" href=\"https://commercial.abp.io/Privacy\">l&#39;Informativa sulla Privacy</a> .",
    "GetYourFreeEBook": "Ottieni il tuo <span class=\"gradient-framework d-block\">e-book DDD gratuito</span>",
    "EverythingYouNeedToKnow": "Tutto quello che devi sapere",
    "PreOrderNow": "Preordinalo ora",
    "UITheming": "Temi dell&#39;interfaccia utente",
    "UIThemingExplanation": "Crea temi e layout dell&#39;interfaccia utente riutilizzabili o utilizza uno dei temi dell&#39;interfaccia utente predefiniti.",
    "DataFilteringExplanation2": "Filtra automaticamente le query dal database per implementare facilmente modelli come l&#39;eliminazione temporanea e la multi-tenancy.",
    "NeedHelp": "Ho bisogno di aiuto?",
    "GiveYourProjectAName": "Dai un nome al tuo progetto",
    "SelectProjectType": "Seleziona Tipo di progetto",
    "SelectUIFramework": "Seleziona Struttura dell&#39;interfaccia utente",
    "SelectDatabaseProvider": "Seleziona Fornitore di database",
    "SelectDatabaseManagementSystem": "Seleziona Sistema di gestione del database",
    "InstallingTheABPCLI": "Installazione della CLI ABP",
    "CreateYourProjectNow": "Crea il tuo progetto ora",
    "OrderOn": "Ordina su {0}",
    "DownloadFreeDDDBook": "Scarica il libro DDD gratuito",
    "WhatIsABPFramework": "Cos&#39;è il quadro ABP?",
    "TenantDatabase": "Database inquilino {0}",
    "SharedDatabase": "Banca dati condivisa",
    "ConnectionResolver": "Risolutore di connessione",
    "TenantBasedDataFilter": "Filtro dati basato sul tenant",
    "ApplicationCode": "Codice dell&#39;applicazione",
    "TenantResolution": "Risoluzione dell&#39;inquilino",
    "TenantUser": "Utente tenant {0}",
    "CardTitle": "Titolo della carta",
    "View": "Visualizzazione",
    "Model": "Modello",
    "Email": "E-mail",
    "Password": "Parola d&#39;ordine",
    "Address": "Indirizzo",
    "Gender": "Genere",
    "Male": "Maschio",
    "Female": "Femmina",
    "Submit": "Invia",
    "Unspecified": "Non specificato",
    "StaticFileMiddleware": "Middleware di file statici",
    "RazorViewEngine": "Motore di visualizzazione Razor",
    "PhysicalFiles": "File fisici (wwwroot)",
    "EmbeddedFiles": "File incorporati (DLL)",
    "DynamicFiles": "File dinamici (memoria)",
    "BuildSolutionsWithAbp": "Crea soluzioni .NET gestibili seguendo le migliori pratiche di sviluppo software utilizzando ABP.",
    "BuyOnAmazon": "Acquista su Amazon",
    "BuyOnPackt": "Acquista su Packt",
    "Discounted": "Scontato",
    "MasteringAbpFramework_Book_KeyFeatures": "Caratteristiche principali",
    "MasteringAbpFramework_Book_Key_Features_Description_1": "Crea soluzioni software robuste, manutenibili, modulari e scalabili utilizzando ABP Framework.",
    "MasteringAbpFramework_Book_Key_Features_Description_2": "Scopri come implementare i principi SOLID e la progettazione basata sul dominio nelle tue applicazioni web.",
    "MasteringAbpFramework_Book_Key_Features_Description_3": "Scopri come ABP Framework accelera il ciclo di sviluppo automatizzando le attività ripetitive.",
    "MasteringAbpFramework_Book_Description": "Descrizione del libro",
    "MasteringAbpFramework_Book_Description_Details_1": "ABP Framework è un&#39;infrastruttura completa per la creazione di applicazioni Web moderne seguendo le migliori pratiche e convenzioni di sviluppo del software \n . Con il framework e l&#39;ecosistema di alto livello di ABP, puoi \n implementare il principio Don&#39;t Repeat Yourself (DRY) e concentrarti sul codice aziendale.",
    "MasteringAbpFramework_Book_Description_Details_2": "Scritto dal creatore di ABP Framework, questo libro ti aiuterà ad acquisire una comprensione completa del framework \n e delle moderne tecniche di sviluppo di applicazioni web. Con spiegazioni dettagliate dei concetti essenziali di \n ed esempi pratici, comprenderai i requisiti di una soluzione Web moderna e in che modo ABP \n Framework rende divertente lo sviluppo delle tue soluzioni. Scoprirai i requisiti comuni dello sviluppo di applicazioni Web aziendali \n ed esplorerai l&#39;infrastruttura fornita da ABP. Nel libro \n verranno illustrate le migliori pratiche di sviluppo software per la creazione di soluzioni Web \n manutenibili e modulari.",
    "MasteringAbpFramework_Book_Description_Details_3": "Entro la fine di questo libro sarai in grado di creare una soluzione Web completa facile da sviluppare, mantenere e testare \n .",
    "MasteringAbpFramework_Book_WhatYouWillLearn": "Cosa imparerai",
    "MasteringAbpFramework_Book_What_You_Will_Learn_1": "Configura l&#39;ambiente di sviluppo e inizia a utilizzare ABP Framework.",
    "MasteringAbpFramework_Book_What_You_Will_Learn_2": "Collabora con Entity Framework Core e MongoDB per sviluppare il tuo livello di accesso ai dati.",
    "MasteringAbpFramework_Book_What_You_Will_Learn_3": "Comprendere le preoccupazioni trasversali e il modo in cui l&#39;ABP automatizza le attività ripetitive.",
    "MasteringAbpFramework_Book_What_You_Will_Learn_4": "Impara a implementare la progettazione basata sul dominio con ABP Framework.",
    "MasteringAbpFramework_Book_What_You_Will_Learn_5": "Crea pagine e componenti dell&#39;interfaccia utente con ASP.NET Core MVC (Razor Pages) e Blazor.",
    "MasteringAbpFramework_Book_What_You_Will_Learn_6": "Lavora con multi-tenancy per creare applicazioni web modulari.",
    "MasteringAbpFramework_Book_What_You_Will_Learn_7": "Comprendere la modularità e creare moduli applicativi riutilizzabili.",
    "MasteringAbpFramework_Book_What_You_Will_Learn_8": "Scrivi test unitari, di integrazione e dell&#39;interfaccia utente utilizzando ABP Framework.",
    "MasteringAbpFramework_Book_WhoIsThisBookFor": "Per chi è questo libro",
    "MasteringAbpFramework_Book_WhoIsThisBookFor_Description": "Questo libro è rivolto agli sviluppatori Web che desiderano apprendere le architetture software e le migliori pratiche per creare soluzioni basate sul Web gestibili \n utilizzando le tecnologie Microsoft e ABP Framework. Per iniziare a leggere questo libro è necessaria una conoscenza di base di C# \n e ASP.NET Core.",
    "ComputersAndTechnology": "Computer e tecnologia",
    "BuildingMicroserviceSolutions": "Creazione di soluzioni di microservizi",
    "MicroserviceBookPracticalGuide": "Questo libro è una guida di riferimento per lo sviluppo e la gestione di applicazioni basate su microservizi utilizzando il framework ABP. Fa riferimento <strong>all&#39;applicazione di riferimento di esempio di microservizi .NET</strong> : eShopOnContainers e illustra la progettazione dell&#39;architettura e gli approcci di implementazione utilizzando il framework ABP. Alla fine di questo libro imparerai come ABP affronta le complessità comuni dei microservizi come l&#39;autorizzazione, le transazioni distribuite, le comunicazioni tra microservizi, la distribuzione e così via.",
    "IntroducingTheSolution": "Presentazione della soluzione eShopOnAbp",
    "RunningTheSolution": "Esecuzione della soluzione",
    "UnderstandingTheAuthenticationSystem": "Comprendere il sistema di autenticazione",
    "ExploringTheApplications": "Esplorare le applicazioni",
    "UnderstandingTheAPIGateways": "Comprendere i gateway API",
    "DevelopingTheMicroservices": "Sviluppo dei microservizi",
    "UnderstandingTheInfrastructure": "Comprendere l&#39;infrastruttura",
    "DiggingInTheUseCases": "Scavando nei casi d&#39;uso",
    "DeployingTheSolution": "Distribuzione della soluzione",
    "ThisBookIsInDraftStageAndIsNotCompletedYet": "Questo libro è in fase di bozza e non è ancora stato completato.",
    "Authors": "Autori",
    "MicroserviceEBook": "E-book sui microservizi",
    "SelectUITheme": "Seleziona Tema dell'interfaccia utente",
    "LeptonXLiteTheme": "Tema LeptonX Lite",
    "BasicTheme": "Tema di base",
    "LeptonXLiteThemeInfo": "Un tema dell&#39;interfaccia utente Bootstrap moderno ed elegante. Ideale se desideri avere un tema dell&#39;interfaccia utente pronto per la produzione. Questo è il tema più recente ed è quello predefinito.",
    "BasicThemeInfo": "Tema dell&#39;interfaccia utente minimalista con colori e stili Bootstrap semplici. Ideale se costruirai il tuo tema dell&#39;interfaccia utente.",
    "SeeDocumentation": "Vedi <a href='{0}' target='_blank'>la documentazione</a> .",
    "SeeFullScreen": "<a href='{0}' target='_blank'>🖼️ Guarda lo screenshot</a>",
    "BuildingMicroserviceSolutionsShortDescription": "Questo libro è una guida di riferimento per lo sviluppo e la gestione di applicazioni basate su microservizi utilizzando il framework ABP.",
    "InstallAbpCliMessage": "Installa la CLI ABP in un terminale della riga di comando, se non l&#39;hai mai installata prima:",
    "Terminal": "terminale",
    "Copy": "copia",
    "RunTheFollowingCommand": "Esegui il seguente comando in un terminale della riga di comando:",
    "ChangeSolutionOptionsBelow": "Puoi modificare le opzioni della soluzione di seguito.",
    "MultiLayerApplication": "Multistrato<br> Applicazione",
    "MultiLayerApplicationExplanation1": "Crea una soluzione completamente stratificata basata su pratiche di progettazione guidata dal dominio.",
    "MultiLayerApplicationExplanation2": "Consigliato per progetti a lungo termine che necessitano di una base di codice gestibile ed estensibile.",
    "SingleLayerApplication": "Singolo strato<br> Applicazione",
    "SingleLayerApplicationExplanation1": "Crea un&#39;applicazione Web a livello singolo.",
    "SingleLayerApplicationExplanation2": "Consigliato per creare un&#39;applicazione con un&#39;architettura più semplice e di facile comprensione.",
    "ApplicationModule": "Applicazione<br> Modulo",
    "SeeTheScreenshot": "Guarda lo screenshot",
    "ApplicationModuleExplanation1": "Crea una soluzione di moduli applicativi riutilizzabili e completamente stratificati.",
    "ApplicationModuleExplanation2": "Puoi utilizzare questa opzione per creare moduli per la tua applicazione modulare.",
    "Expert_": "Esperto",
    "Partner_": "Associazione",
    "WebSite": "Sito web",
    "Expert_Year": "Anno di competenza",
    "CompanyInfo": "Informazioni sull&#39;azienda",
    "Date": "Data",
    "WhoWeAre_Partner": "Chi siamo",
    "WhoWeAre_Expert": "Su di me",
    "CreateSolutionFolder": "Crea cartella della soluzione",
    "CreateSolutionFolderOption": "Specifica se il progetto si troverà in una nuova cartella nella cartella di output o direttamente nella cartella di output.",
    "BooksPageTitle": "Libri ABP",
    "PackageDetailPage_NuGetPackageInstallationOptions": "Esistono tre modi per installare il pacchetto NuGet <code>{0}</code> nel tuo progetto",
    "PackageDetailPage_InstallingWithABPCLI": "1: Installazione con la CLI ABP",
    "PackageDetailPage_InstallingWithABPCLIDescription1": "Se non hai installato la <a href=\"https://docs.abp.io/en/abp/latest/CLI\">CLI ABP</a> , installala innanzitutto eseguendo il seguente comando in un terminale della riga di comando",
    "PackageDetailPage_InstallingWithABPCLIDescription2": "Dopo aver installato la CLI ABP, apri un terminale della riga di comando nella posizione del progetto (file <code>.csproj</code> ) che desideri installarlo ed esegui il comando seguente",
    "PackageDetailPage_InstallingWithABPCLIDescription3": "Aggiungerà il riferimento al pacchetto <code>{0}</code> al tuo progetto e la dipendenza <code>{1}</code> alla classe del tuo modulo.",
    "PackageDetailPage_ManualInstallation": "2: installazione con la CLI di Dotnet",
    "PackageDetailPage_ManualInstallationDescription1": "Aggiungi <code>{0}</code> riferimento al pacchetto NuGet al tuo progetto utilizzando l&#39;IDE o eseguendo il comando seguente",
    "PackageDetailPage_ManualInstallationDescription2": "Quindi aggiungi la dipendenza <code>{0}</code> alla <a href=\"https://docs.abp.io/en/abp/latest/Module-Development-Basics\">classe del tuo modulo</a> come mostrato nell&#39;esempio seguente",
    "PackageDetailPage_SeeDocumentation": "<a href=\"{0}\">Consulta la documentazione</a> per sapere come utilizzare questo pacchetto nelle tue applicazioni.",
    "PackageDetailPage_InstallingUsingPMC": "3: installazione con la console di gestione pacchetti",
    "PackageDetailPage_InstallingUsingPMCDescription1": "Aprire la <strong>console di gestione pacchetti</strong> in Visual Studio (Strumenti -&gt; Gestione pacchetti Nuget -&gt; Console di gestione pacchetti) ed eseguire il comando seguente",
    "UIOptions": "Opzioni dell&#39;interfaccia utente",
    "Testimonials": "Testimonianze",
    "CoolestCompaniesUseABPFramework": "Le aziende più interessanti utilizzano <span class=\"fw-bold\">il framework ABP</span>",
    "Index_Page_Testimonial_1": "ABP Framework non è solo uno strumento ma un catalizzatore che ha accelerato la mia crescita come sviluppatore. Mi ha permesso di creare nuove funzionalità più velocemente che mai, ricordando le esperienze di altri utenti. Il modello di codifica unificato ha semplificato i miei progetti, dandomi più tempo per concentrarmi sulla creazione piuttosto che sulla risoluzione dei problemi. \n Direi che il framework ABP è stato la pietra angolare del mio primo percorso professionale. Ha facilitato la mia transizione da aspirante sviluppatore a professionista fiducioso pronto a lasciare un segno nel mondo del software. Attendo con ansia gli entusiasmanti progetti che mi aspettano, sapendo che ABP sarà lì per guidarmi. È più di un semplice prodotto; è un partner di successo.",
    "Index_Page_Testimonial_2": "ABP Framework non è solo un framework, è anche una guida per lo sviluppo/gestione del progetto, poiché fornisce corsi di formazione su DDD, GenericRepository, DI, Microservice e Modularità. Anche se non utilizzerai il framework stesso, puoi svilupparti con docs.abp.io che è ben preparato e professionalmente. (OpenIddict, Redis, Quartz ecc.) \n Poiché molte cose sono precostruite, riduce significativamente i tempi di sviluppo del progetto. (Come pagina di accesso, gestione delle eccezioni, seeding del filtraggio dei dati, registrazione di controllo, localizzazione, controller API automatico ecc.) \n Come esempio tratto dalla nostra app, ho utilizzato Local Event Bus per il controllo delle scorte. Quindi, sono in grado di gestire i movimenti degli ordini scrivendo stock handler. \n È meraviglioso non perdere tempo con CreationTime, CreatorId. Si riempiono automaticamente.",
    "VideosLoginAndRegisterMessage": "Devi accedere per guardare i video. Se non lo hai già fatto, puoi creare un account per Watch.",
    "Filter": "Filtro",
    "VideoCourses": "Video essenziali",
    "TestimonialText": "La tua testimonianza",
    "Position": "Posizione",
    "ExperienceYear": "Anni di esperienza",
    "FullName": "Nome e cognome",
    "CompanySize": "Dimensione aziendale",
    "Image": "La tua immagine del profilo",
    "TestimonialTitle": "Ascoltiamo la tua testimonianza",
    "TestimonialInfo": "Ciò che dicono i nostri clienti è importante! Raccontaci la tua esperienza con il nostro prodotto e servizio. Si consiglia di scrivere la testimonianza in inglese per raggiungere un pubblico più ampio.",
    "Country": "Paese",
    "TestimonialTextPlaceholder": "Scrivi una breve storia su come ABP ti ha aiutato a costruire e realizzare il tuo progetto. ",
    "PositionPlaceholder": "La tua posizione nella tua azienda.",
    "SelectExperienceYearPlaceholder": "Da quanti anni ti occupi di software?",
    "FullNamePlaceholder": "Il tuo nome completo.",
    "CompanyNamePlaceholder": "Il nome della tua azienda.",
    "SelectCompanySizePlaceholder": "Conteggio dei dipendenti",
    "ImagePlaceholder": "La tua immagine.",
    "SelectCountryPlaceholder": "Il tuo paese.",
    "YouAreNotAuthorizedToWriteTestimonial": "Per poter scrivere una lettera di testimonianza, devi effettuare l'accesso.",
    "UnAuthorizeTestimonialInfo": "La tua opinione conta! Accedi per condividerla.",
    "TheFileIsTooLargeForImage": "La tua immagine del profilo non può essere più di 1 MB",
    "ThisExtensionIsNotAllowedForImage": "Questa estensione non è consentita.",
    "FileUploadError": "Errore nel caricamento del file",
    "TestimonialSend": "Grazie! ",
    "Title": "Titolo",
    "TitlePlaceholder": "Sviluppatore di software, CTO ecc.",
    "Characters": "caratteri",
    "ABPTestimonialDescription": "ABP Framework: Ascoltiamo la tua testimonianza",
    "LeaveUsReview": "Lasciaci una recensione",
    "DocumentationButtonTitle": "Documentazione",
    "ABPVideoCoursesDescription": "Apprendi le basi del Framework ABP attraverso corsi video creati dal team ABP.",
    "ABPVideoCoursesPageDescription": "Apprendi le basi dell'ABP Framework attraverso corsi video creati dal team ABP. In questa serie di video imparerai gli argomenti essenziali dell'ABP Framework. I numeri su ciascun video sono scritti in base al flusso di apprendimento.",
    "ABPVideoCoursesTitle": "Video essenziali ABP"
  }
}