{
  "culture": "ru",
  "texts": {
    "GetStarted": "Начало работы - шаблоны запуска",
    "Create": "Создавать",
    "NewProject": "Новый проект",
    "DirectDownload": "Прямая загрузка",
    "ProjectName": "Название проекта",
    "ProjectType": "Тип проекта",
    "DatabaseProvider": "Поставщик базы данных",
    "DatabaseManagementSystem": "Система управления базами данных",
    "NTier": "N-уровень",
    "IncludeUserInterface": "Включить пользовательский интерфейс",
    "CreateNow": "Создать сейчас",
    "TheStartupProject": "Стартап-проект",
    "Tutorial": "Руководство",
    "UsingCLI": "Использование CLI",
    "SeeDetails": "Смотрите подробности",
    "AbpShortDescription": "ABP Framework - это полная инфраструктура для создания современных веб-приложений с соблюдением лучших практик и соглашений в области разработки программного обеспечения.",
    "SourceCodeUpper": "ИСХОДНЫЙ КОД",
    "LatestReleaseLogs": "Журналы последних выпусков",
    "Infrastructure": "Инфраструктура",
    "Architecture": "Архитектура",
    "Modular": "Модульный",
    "DontRepeatYourself": "Не повторяйся",
    "DeveloperFocused": "Ориентация на разработчиков",
    "FullStackApplicationInfrastructure": "Инфраструктура приложений полного стека.",
    "DomainDrivenDesign": "Доменно-ориентированный дизайн",
    "DomainDrivenDesignExplanation": "Разработан и разработан на основе шаблонов и принципов DDD. Предоставляет многоуровневую модель для вашего приложения.",
    "Authorization": "Авторизация",
    "AuthorizationExplanation": "Расширенная авторизация с пользователем, ролью и детальной системой разрешений. Создан на основе библиотеки Microsoft Identity.",
    "MultiTenancy": "Мульти аренды",
    "MultiTenancyExplanationShort": "Приложения SaaS - это просто! Интегрированная мультитенантность от базы данных до пользовательского интерфейса.",
    "CrossCuttingConcerns": "Перекрестные опасения",
    "CrossCuttingConcernsExplanationShort": "Полная инфраструктура для авторизации, проверки, обработки исключений, кэширования, ведения журнала аудита, управления транзакциями и многого другого.",
    "BuiltInBundlingMinification": "Встроенная упаковка и минификация",
    "BuiltInBundlingMinificationExplanation": "Нет необходимости использовать внешние инструменты для объединения и минификации. ABP предлагает более простой, динамичный, мощный, модульный и встроенный способ!",
    "VirtualFileSystem": "Виртуальная файловая система",
    "VirtualFileSystemExplanation": "Встраивайте представления, сценарии, стили, изображения ... в пакеты/библиотеки и повторно используйте их в различных приложениях.",
    "Theming": "Тематика",
    "ThemingExplanationShort": "Используйте и настройте стандартную тему пользовательского интерфейса на основе начальной загрузки или создайте свою собственную.",
    "BootstrapTagHelpersDynamicForms": "Вспомогательные функции тегов Bootstrap и динамические формы",
    "BootstrapTagHelpersDynamicFormsExplanation": "Вместо того, чтобы вручную писать повторяющиеся детали компонентов начальной загрузки, используйте помощники тегов ABP, чтобы упростить его и воспользоваться преимуществами intellisense. Быстро создавайте формы пользовательского интерфейса на основе модели C # с помощью помощника тега динамической формы.",
    "HTTPAPIsDynamicProxies": "HTTP API и динамические прокси",
    "HTTPAPIsDynamicProxiesExplanation": "Автоматически предоставлять сервисы приложений как HTTP API в стиле REST и использовать их с помощью динамических прокси-серверов JavaScript и C #.",
    "CompleteArchitectureInfo": "Современная архитектура для создания поддерживаемых программных решений.",
    "DomainDrivenDesignBasedLayeringModelExplanation": "Помогает реализовать многоуровневую архитектуру на основе DDD и создать удобную для сопровождения базу кода.",
    "DomainDrivenDesignBasedLayeringModelExplanationCont": "Предоставляет шаблоны запуска, абстракции, базовые классы, службы, документацию и руководства, которые помогут вам разработать приложение на основе шаблонов и принципов DDD.",
    "MicroserviceCompatibleModelExplanation": "Базовая структура и модули предварительной сборки разработаны с учетом микросервисной архитектуры.",
    "MicroserviceCompatibleModelExplanationCont": "Предоставляет инфраструктуру, интеграции, образцы и документацию для упрощения внедрения микросервисных решений, при этом не привнося дополнительных сложностей, если вам нужно монолитное приложение.",
    "ModularInfo": "ABP предоставляет модульную систему, которая позволяет разрабатывать повторно используемые модули приложений, связывать их с событиями жизненного цикла приложений и выражать зависимости между основными частями вашей системы.",
    "PreBuiltModulesThemes": "Готовые модули и темы",
    "PreBuiltModulesThemesExplanation": "Открытые и коммерческие модули и темы готовы к использованию в вашем бизнес-приложении.",
    "NuGetNPMPackages": "Пакеты NuGet и NPM",
    "NuGetNPMPackagesExplanation": "Распространяется в виде пакетов NuGet и NPM. Легко установить и обновить.",
    "ExtensibleReplaceable": "Расширяемый/заменяемый",
    "ExtensibleReplaceableExplanation": "Все сервисы и модули разработаны с учетом возможности расширения. Вы можете заменять сервисы, страницы, стили и компоненты.",
    "CrossCuttingConcernsExplanation2": "Сделайте свою кодовую базу меньше, чтобы вы могли сосредоточиться на коде, специфичном для вашего бизнеса.",
    "CrossCuttingConcernsExplanation3": "Не тратьте время на реализацию общих требований к приложениям в нескольких проектах.",
    "AuthenticationAuthorization": "Аутентификация и авторизация",
    "ExceptionHandling": "Обработка исключений",
    "Validation": "Проверка",
    "DatabaseConnection": "Подключение к базе данных",
    "TransactionManagement": "Управление транзакциями",
    "AuditLogging": "Ведение журнала аудита",
    "Caching": "Кеширование",
    "Multitenancy": "Мульти аренды",
    "DataFiltering": "Фильтрация данных",
    "ConventionOverConfiguration": "Соглашение важнее конфигурации",
    "ConventionOverConfigurationExplanation": "В ABP по умолчанию реализованы общие соглашения о приложениях с минимальной или нулевой конфигурацией.",
    "ConventionOverConfigurationExplanationList1": "Автоматически регистрирует известные службы для внедрения зависимостей.",
    "ConventionOverConfigurationExplanationList2": "Предоставляет сервисы приложений как HTTP API посредством соглашений об именах.",
    "ConventionOverConfigurationExplanationList3": "Создает динамические клиентские прокси HTTP для C # и JavaScript.",
    "ConventionOverConfigurationExplanationList4": "Предоставляет репозитории по умолчанию для ваших сущностей.",
    "ConventionOverConfigurationExplanationList5": "Управляет единицей работы для каждого веб-запроса или метода службы приложения.",
    "ConventionOverConfigurationExplanationList6": "Публикует события создания, обновления и удаления для ваших организаций.",
    "BaseClasses": "Базовые классы",
    "BaseClassesExplanation": "Готовые базовые классы для общих шаблонов приложений.",
    "DeveloperFocusedExplanation": "ABP для разработчиков.",
    "DeveloperFocusedExplanationCont": "Он направлен на упрощение вашей повседневной разработки программного обеспечения, не ограничивая вас в написании низкоуровневого кода.",
    "SeeAllFeatures": "Просмотреть все функции",
    "CLI_CommandLineInterface": "CLI (интерфейс командной строки)",
    "CLI_CommandLineInterfaceExplanation": "Включает интерфейс командной строки, который поможет вам автоматизировать создание новых проектов и добавление новых модулей.",
    "StartupTemplates": "Шаблоны запуска",
    "StartupTemplatesExplanation": "Различные шаблоны запуска предоставляют полностью настроенное решение для быстрого старта разработки.",
    "BasedOnFamiliarTools": "На основе знакомых инструментов",
    "BasedOnFamiliarToolsExplanation": "Создан на основе уже знакомых вам популярных инструментов и интегрирован с ними. Низкая кривая обучения, легкая адаптация, комфортное развитие.",
    "ORMIndependent": "ORM Независимый",
    "ORMIndependentExplanation": "Базовая структура не зависит от ORM/базы данных и может работать с любым источником данных. Поставщики Entity Framework Core и MongoDB уже доступны.",
    "Features": "Изучите особенности ABP Framework",
    "ABPCLI": "ABP CLI",
    "Modularity": "Модульность",
    "BootstrapTagHelpers": "Вспомогательные функции тегов Bootstrap",
    "DynamicForms": "Динамические формы",
    "BundlingMinification": "Объединение и минификация",
    "BackgroundJobs": "Фоновые задания",
    "BackgroundJobsExplanation": "Определите простые классы для выполнения заданий в фоновом режиме как в очереди. Используйте встроенный менеджер заданий или интегрируйте свой собственный. Уже доступны интеграции с <a href=\"{0}\"> Hangfire </a> и <a href=\"{1}\"> RabbitMQ </a>.",
    "DDDInfrastructure": "Инфраструктура DDD",
    "DomainDrivenDesignInfrastructure": "Инфраструктура проектирования на основе доменов",
    "AutoRESTAPIs": "API Auto REST",
    "DynamicClientProxies": "Динамические клиентские прокси",
    "DistributedEventBus": "Распределенная шина событий",
    "DistributedEventBusWithRabbitMQIntegration": "Распределенная шина событий с интеграцией RabbitMQ",
    "TestInfrastructure": "Инфраструктура тестирования",
    "AuditLoggingEntityHistories": "Ведение журнала аудита и истории сущностей",
    "ObjectToObjectMapping": "Сопоставление объекта с объектом",
    "ObjectToObjectMappingExplanation": "Абстракция <a href=\"{0}\"> объект для сопоставления объектов </a> с интеграцией AutoMapper.",
    "EmailSMSAbstractions": "Абстракции по электронной почте и SMS",
    "EmailSMSAbstractionsWithTemplatingSupport": "Абстракции по электронной почте и SMS с поддержкой шаблонов",
    "Localization": "Локализация",
    "SettingManagement": "Управление настройками",
    "ExtensionMethods": "Методы расширения",
    "ExtensionMethodsHelpers": "Методы расширения и помощники",
    "AspectOrientedProgramming": "Аспектно-ориентированное программирование",
    "DependencyInjection": "Внедрение зависимости",
    "DependencyInjectionByConventions": "Внедрение зависимостей по соглашениям",
    "ABPCLIExplanation": "ABP CLI (интерфейс командной строки) - это инструмент командной строки для выполнения некоторых общих операций для решений на основе ABP.",
    "ModularityExplanation": "ABP предоставляет полную инфраструктуру для создания ваших собственных модулей приложения, которые могут содержать сущности, службы, интеграцию с базами данных, API, компоненты пользовательского интерфейса и т. Д.",
    "MultiTenancyExplanation": "Фреймворк ABP не только поддерживает разработку мультитенантных приложений, но и делает ваш код практически незаметным для мультитенантности.",
    "MultiTenancyExplanation2": "Может автоматически определять текущего арендатора, изолировать данные разных арендаторов друг от друга.",
    "MultiTenancyExplanation3": "Поддерживает единую базу данных, базу данных для каждого клиента и гибридные подходы.",
    "MultiTenancyExplanation4": "Вы сосредотачиваетесь на своем бизнес-коде и позволяете фреймворку обрабатывать мультитенантность от вашего имени.",
    "BootstrapTagHelpersExplanation": "Вместо того, чтобы вручную писать повторяющиеся детали компонентов начальной загрузки, используйте помощники тегов ABP, чтобы упростить его и воспользоваться преимуществами intellisense. Вы определенно можете использовать Bootstrap, когда вам это нужно.",
    "DynamicFormsExplanation": "Помощники динамических форм и тегов ввода могут создавать полную форму из класса C # в качестве модели.",
    "AuthenticationAuthorizationExplanation": "Расширенные возможности аутентификации и авторизации, интегрированные в ASP.NET Core Identity и IdentityServer4. Предоставляет расширяемую и подробную систему разрешений.",
    "CrossCuttingConcernsExplanation": "Не повторяйте себя, чтобы реализовать все эти обычные вещи снова и снова. Сосредоточьтесь на своем бизнес-коде и позвольте ABP автоматизировать их по соглашениям.",
    "DatabaseConnectionTransactionManagement": "Подключение к базе данных и управление транзакциями",
    "CorrelationIdTracking": "Отслеживание корреляционных идентификаторов",
    "BundlingMinificationExplanation": "ABP предлагает простую, динамичную, мощную, модульную и встроенную систему связывания и минификации.",
    "VirtualFileSystemnExplanation": "Виртуальная файловая система позволяет управлять файлами, которые физически не существуют в файловой системе (на диске). В основном он используется для встраивания файлов (js, css, image, cshtml ...) в сборки и использования их как физических файлов во время выполнения.",
    "ThemingExplanation": "Система тем позволяет разрабатывать тему приложения и модулей независимо, определяя набор общих базовых библиотек и макетов на основе последней версии Bootstrap.",
    "DomainDrivenDesignInfrastructureExplanation": "Полная инфраструктура для создания многоуровневых приложений на основе шаблонов и принципов доменного проектирования;",
    "Specification": "Технические характеристики",
    "Repository": "Репозиторий",
    "DomainService": "Доменная служба",
    "ValueObject": "Объект значения",
    "ApplicationService": "Служба приложений",
    "DataTransferObject": "Объект передачи данных",
    "AggregateRootEntity": "Совокупный корень, сущность",
    "AutoRESTAPIsExplanation": "ABP может автоматически настраивать службы вашего приложения как контроллеры API по соглашению.",
    "DynamicClientProxiesExplanation": "Легко используйте свои API из клиентов JavaScript и C #.",
    "DistributedEventBusWithRabbitMQIntegrationExplanation": "Легко публикуйте и потребляйте распределенные события с помощью встроенной распределенной шины событий с доступной интеграцией RabbitMQ.",
    "TestInfrastructureExplanation": "Фреймворк был разработан с учетом модульного и интеграционного тестирования. Предоставляет вам базовые классы, чтобы упростить задачу. Шаблоны запуска предварительно настроены для тестирования.",
    "AuditLoggingEntityHistoriesExplanation": "Встроенный журнал аудита для критически важных бизнес-приложений. Журнал аудита на уровне запросов, услуг, методов и истории сущностей с подробностями на уровне свойств.",
    "EmailSMSAbstractionsWithTemplatingSupportExplanation": "Абстракции IEmailSender и ISmsSender отделяют логику вашего приложения от инфраструктуры. Расширенная система шаблонов электронной почты позволяет создавать и локализовать шаблоны электронной почты и легко использовать их при необходимости.",
    "LocalizationExplanation": "Система локализации позволяет создавать ресурсы в простых файлах JSON и использовать их для локализации вашего пользовательского интерфейса. Он поддерживает расширенные сценарии, такие как наследование, расширения и интеграцию JavaScript, и полностью совместим с системой локализации AspNet Core.",
    "SettingManagementExplanation": "Определите настройки для своего приложения и получите значения во время выполнения на основе текущей конфигурации, клиента и пользователя.",
    "ExtensionMethodsHelpersExplanation": "Не повторяйтесь даже для тривиальных частей кода. Расширения и помощники для стандартных типов делают ваш код более чистым и легким для написания.",
    "AspectOrientedProgrammingExplanation": "Предоставляет удобную инфраструктуру для создания динамических прокси и реализации аспектно-ориентированного программирования. Перехватывайте любой класс и выполняйте свой код до и после выполнения каждого метода.",
    "DependencyInjectionByConventionsExplanation": "Нет необходимости вручную регистрировать классы для внедрения зависимостей. Автоматически регистрирует общие типы услуг по соглашению. Для других типов сервисов вы можете использовать интерфейсы и атрибуты, чтобы упростить работу и сделать это на месте.",
    "DataFilteringExplanation": "Определите и используйте фильтры данных, которые автоматически применяются при запросе сущностей из базы данных. Мягкое удаление и фильтры MultiTenant предоставляются по умолчанию при реализации простых интерфейсов.",
    "PublishEvents": "Опубликовать события",
    "HandleEvents": "Обработка событий",
    "AndMore": "и более...",
    "Code": "Код",
    "Result": "Результат",
    "SeeTheDocumentForMoreInformation": "Дополнительную информацию см. В <a href=\"{1}\"> {0} документе </a>.",
    "IndexPageHeroSection": "<span class=\"first-line shine\"> <strong> с открытым исходным кодом </strong> </span> <span class=\"second-line text-uppercase\"> веб-приложение <br /> Framework </span> <span class=\"third-line shine2\"> <strong> для ядра asp.net </strong> </span>",
    "UiFramework": "UI Framework",
    "EmailAddress": "Адрес электронной почты",
    "Mobile": "Мобильный",
    "ReactNative": "React Native",
    "Strong": "Сильный",
    "Complete": "Полный",
    "BasedLayeringModel": "Модель слоев на основе",
    "Microservice": "Микросервис",
    "Compatible": "Совместимый",
    "MeeTTheABPCommunityInfo": "Наша миссия - создать среду, в которой разработчики могут помогать друг другу статьями, учебными пособиями, тематическими исследованиями и т. Д. И встречаться с единомышленниками.",
    "JoinTheABPCommunityInfo": "Присоединяйтесь к активному сообществу и станьте участником ABP Framework!",
    "AllPosts": "Все статьи",
    "SubmitYourPost": "Отправьте свою статью",
    "DynamicClientProxyDocument": "См. Документацию по динамическому клиентскому прокси для <a href=\"{0}\"> JavaScript </a> и <a href=\"{1}\"> C # </a>.",
    "EmailSMSAbstractionsDocument": "Дополнительную информацию см. В документах <a href=\"{0}\"> электронная почта </a> и <a href=\"{1}\"> отправка SMS </a>.",
    "CreateProjectWizard": "Этот мастер создает новый проект из шаблона запуска, который правильно настроен для быстрого старта вашего проекта.",
    "TieredOption": "Создает многоуровневое решение, в котором уровни Web и Http API физически разделены. Если не отмечено, создается многоуровневое решение, которое менее сложно и подходит для большинства сценариев.",
    "SeparateIdentityServerOption": "Разделяет серверную часть на два приложения: первое - для сервера идентификации, а второе - для HTTP API на стороне сервера.",
    "UseslatestPreVersion": "Используется последняя предварительная версия",
    "ReadTheDocumentation": "<span class=\"text-primary\"> Прочтите </span> <span class=\"text-success\"> Документацию </span>",
    "Documentation": "Документация",
    "GettingStartedTutorial": "Руководство по началу работы",
    "ApplicationDevelopmentTutorial": "Учебник по разработке приложений",
    "TheStartupTemplate": "Шаблон запуска",
    "InstallABPCLIInfo": "ABP CLI - это самый быстрый способ начать новое решение с помощью инфраструктуры ABP. Установите ABP CLI с помощью окна командной строки:",
    "DifferentLevelOfNamespaces": "Вы можете использовать разные уровни пространств имен; например BookStore, Acme.BookStore или Acme.Retail.BookStore.",
    "ABPCLIExamplesInfo": "Команда <strong> new </strong> создает <strong> многоуровневое приложение MVC </strong> с <strong> Entity Framework Core </strong> в качестве поставщика базы данных. Однако у него есть дополнительные возможности. Примеры:",
    "SeeCliDocumentForMoreInformation": "Дополнительные параметры см. В <a href=\"{0}\"> документе интерфейса командной строки ABP </a> или выберите вкладку «Прямая загрузка» выше.",
    "Optional": "По желанию",
    "LocalFrameworkRef": "Сохраните ссылку на локальный проект для пакетов фреймворка.",
    "BlobStoring": "Хранение BLOB",
    "BlobStoringExplanation": "Система хранения BLOB предоставляет абстракцию для работы с BLOB. ABP предоставляет несколько встроенных интеграций с поставщиками хранилищ (Azure, AWS, файловая система, база данных и т. Д.), Которые вы можете легко использовать в своих приложениях.",
    "TextTemplating": "Шаблоны текста",
    "TextTemplatingExplanation": "Шаблоны текста используются для динамического отображения содержимого на основе шаблона и модели (объекта данных). Например, вы можете использовать его для создания динамического содержимого электронной почты с помощью предварительно созданного шаблона.",
    "MultipleUIOptions": "Несколько вариантов пользовательского интерфейса",
    "MultipleDBOptions": "Несколько поставщиков баз данных",
    "MultipleUIOptionsExplanation": "Основная структура разработана как независимая от пользовательского интерфейса и может работать с любым типом пользовательской системы, в то время как есть несколько встроенных и интегрированных опций, предоставляемых из коробки.",
    "MultipleDBOptionsExplanation": "Фреймворк может работать с любым источником данных, при этом официально разработаны и поддерживаются следующие поставщики;",
    "SelectLanguage": "Выбрать язык",
    "LatestPostOnCommunity": "Последняя статья о сообществе ABP",
    "Register": "регистр",
    "IsDownloadable": "Можно скачать",
    "DatabaseOptions": "Параметры базы данных",
    "BackToPackagesPage": "Вернуться на страницу пакетов",
    "HowToInstall": "Как установить",
    "SeeOnNpm": "Смотрите на NPM",
    "SeeOnNuget": "Смотрите на Nuget",
    "MVCGulpCommandExplanation": "Если вы используете пользовательский интерфейс MVC (Razor Pages), запустите команду «gulp» после установки пакета.",
    "UsingABPCLI": "Использование <a href=\"https://docs.abp.io/en/abp/latest/CLI\"> Abp CLI </a>",
    "WithoutABPCLI": "Без ABP CLI",
    "ABPCLIModuleDependency": "Abp Cli автоматически добавляет зависимость модуля.",
    "AddModuleDependency": "Затем добавьте зависимость модуля",
    "Packages": "Пакеты",
    "NugetPackages": "Пакеты Nuget",
    "NPMPackages": "Пакеты NPM",
    "SeeDocs": "См. Документы",
    "None": "Никто",
    "Application": "заявка",
    "Module": "Модуль",
    "PackageName": "Имя пакета",
    "LicenseURL": "URL лицензии",
    "License": "Лицензия",
    "ProjectCreationSuccessMessage": "Ваш проект успешно создан",
    "HowToRunSolution": "Как запустить свое решение?",
    "GettingStartedMessage": "См. Документ «Начало работы», чтобы узнать, как настроить и запустить решение.",
    "WebAppDevTutorial": "Руководство разработчика веб-приложений",
    "WebAppDevTutorialMessage": "См. Руководство по разработке веб-приложений для получения пошагового примера разработки.",
    "CommunityPosts": "Статьи Сообщества",
    "CommunityPostMessage": "Посетите платформу сообщества ABP, чтобы прочитать полезные статьи о платформе ABP.",
    "InvestigateSolutionDetails": "Ознакомьтесь с подробностями решения",
    "StartupTemplateDocumentationMessage": "См. Документ шаблона запуска приложения, чтобы узнать об архитектуре и структуре вашего решения.",
    "ClientSideDevelopment": "Клиентская разработка",
    "ClientSideDevelopmentDocumentationMessage": "См. Документ {0}, чтобы узнать об основных моментах разработки пользовательского интерфейса (на стороне клиента).",
    "DatabaseProviderDocumentationMessage": "См. Документ {0}, чтобы узнать об основных моментах разработки уровня базы данных.",
    "ABPCommercialExplanationMessage": "ABP Commercial предоставляет премиальные модули, темы, инструменты и поддержку для ABP Framework.",
    "ImplementingDDD": "Внедрение доменно-ориентированного дизайна",
    "DDDBookExplanation": "Практическое руководство по реализации предметно-ориентированного дизайна с помощью ABP Framework.",
    "Overview": "Обзор",
    "DDDBookPracticalGuide": "Это практическое руководство по реализации Domain Driven Design (DDD). Хотя детали реализации основаны на инфраструктуре ABP Framework, основные концепции, принципы и модели могут быть применены к любому решению, даже если это не решение .NET.",
    "TableOfContents": "Оглавление",
    "IntroductionToImplementingDDD": "Введение в реализацию предметно-ориентированного дизайна",
    "WhatIsDDD": "Что такое доменно-ориентированный дизайн?",
    "Implementation": "Реализация",
    "TheBigPicture": "Большая картинка",
    "TheBuildingBlock": "Строительный блок",
    "ExampleUseCase": "Пример использования",
    "DomainAndApplicationLogic": "Логика домена и логика приложения",
    "Author": "Автор",
    "Pages": "Страницы",
    "PublishedOn": "Опубликован в",
    "FreeEBook": "Бесплатная электронная книга",
    "Download": "Скачать",
    "EBookSignInForDownload": "Чтобы скачать электронную книгу, войдите в систему",
    "SignIn": "Войти",
    "Or": "Или",
    "TellUsAboutYourself": "Расскажи немного о себе",
    "Name": "Имя",
    "Surname": "Фамилия",
    "CompanyName": "Название компании",
    "DoYouAgreePrivacyPolicy": "Я согласен с <a href=\"https://account.abp.io/Account/TermsConditions\"> Условиями использования </a> и <a href=\"https://account.abp.io/Account/Privacy \"> Политика конфиденциальности </a>.",
    "Free": "Бесплатно",
    "DDDEBook": "Электронная книга DDD",
    "PracticalGuideForImplementingDDD": "Эта книга представляет собой практическое руководство по реализации предметно-ориентированного дизайна с помощью ABP Framework.",
    "IntroducingDDD": "Знакомство с доменно-ориентированным дизайном",
    "DDDLayersAndCleanArchitecture": "Уровни DDD и чистая архитектура",
    "LayeringOfADotnetSolution": "Уровни решения .NET",
    "ImplementingDDDBuildingBlocks": "Реализация строительных блоков DDD",
    "DomainVsApplicationLogic": "Логика домена против логики приложения",
    "SamplesAndDiscussions": "Образцы и обсуждения",
    "EmailNotValid": "Пожалуйста, введите действительный адрес электронной почты.",
    "WeWillSendYouADownloadLink": "Ссылка для загрузки электронной книги была отправлена на {0}. Проверьте свой почтовый ящик, нежелательную почту или спам!",
    "GoHome": "Иди домой",
    "InvalidFormInputs": "Пожалуйста, введите действительную информацию, указанную в форме.",
    "DDDBookEmailBody": "Спасибо. <br /> Чтобы скачать книгу, <a href=\"{0}\"> нажмите здесь </a>.",
    "SubscribeToNewsletter": "Подпишитесь на информационный бюллетень, чтобы получать информацию о событиях на платформе ABP.IO, например о новых выпусках, статьях, предложениях и многом другом.",
    "FirstEdition": "Первое издание",
    "ThankYou": "Спасибо!",
    "CheckboxMandatory": "Вам необходимо проверить это, чтобы продолжить!"
  }
}