{
  "culture": "vi",
  "texts": {
    "GetStarted": "Bắt đầu - Mẫu Khởi động",
    "Create": "Tạo ra",
    "NewProject": "Dự án mới",
    "DirectDownload": "Tải trực tiếp",
    "ProjectName": "Tên dự án",
    "ProjectType": "Loại dự án",
    "DatabaseProvider": "Nhà cung cấp cơ sở dữ liệu",
    "DatabaseManagementSystem": "Hệ thống quản lý cơ sở dữ liệu",
    "NTier": "N-Tier",
    "IncludeUserInterface": "Bao gồm giao diện người dùng",
    "CreateNow": "Hãy tạo ngay",
    "TheStartupProject": "Dự án khởi nghiệp",
    "Tutorial": "Hướng dẫn",
    "UsingCLI": "Sử dụng CLI",
    "SeeDetails": "Xem chi tiết",
    "AbpShortDescription": "ABP Framework là cơ sở hạ tầng hoàn chỉnh để tạo ra các giải pháp phần mềm có kiến trúc hiện đại dựa trên nền tảng ASP.NET Core.",
    "SourceCodeUpper": "MÃ NGUỒN",
    "LatestReleaseLogs": "Nhật ký phát hành mới nhất",
    "Infrastructure": "Cơ sở hạ tầng",
    "Architecture": "Ngành kiến trúc",
    "Modular": "Mô-đun",
    "DontRepeatYourself": "Đừng lặp lại chính mình",
    "DeveloperFocused": "Tập trung vào nhà phát triển",
    "FullStackApplicationInfrastructure": "Cơ sở hạ tầng ứng dụng ngăn xếp đầy đủ.",
    "DomainDrivenDesign": "Thiết kế theo hướng miền",
    "DomainDrivenDesignExplanation": "Được thiết kế và phát triển dựa trên các mẫu và nguyên tắc DDD. Cung cấp một mô hình phân lớp cho ứng dụng của bạn.",
    "Authorization": "Ủy quyền",
    "AuthorizationExplanation": "Ủy quyền nâng cao với người dùng, vai trò và hệ thống cấp phép chi tiết. Được xây dựng trên thư viện Microsoft Identity.",
    "MultiTenancy": "Thuê nhiều kiểu",
    "MultiTenancyExplanationShort": "Ứng dụng SaaS được thực hiện dễ dàng! Tích hợp đa thuê nhà từ cơ sở dữ liệu đến giao diện người dùng.",
    "CrossCuttingConcerns": "Mối quan tâm xuyên suốt",
    "CrossCuttingConcernsExplanationShort": "Hoàn thiện cơ sở hạ tầng để ủy quyền, xác thực, xử lý ngoại lệ, bộ nhớ đệm, ghi nhật ký kiểm tra, quản lý giao dịch và hơn thế nữa.",
    "BuiltInBundlingMinification": "Tích hợp gói & tối thiểu hóa",
    "BuiltInBundlingMinificationExplanation": "Không cần sử dụng các công cụ bên ngoài để đóng gói và thu nhỏ. ABP cung cấp một cách đơn giản hơn, năng động, mạnh mẽ, mô-đun và tích hợp sẵn!",
    "VirtualFileSystem": "Hệ thống tệp ảo",
    "VirtualFileSystemExplanation": "Nhúng các khung nhìn, tập lệnh, kiểu, hình ảnh ... vào các gói/thư viện và sử dụng lại chúng trong các ứng dụng khác nhau.",
    "Theming": "Chủ đề",
    "ThemingExplanationShort": "Sử dụng và tùy chỉnh chủ đề giao diện người dùng tiêu chuẩn dựa trên bootstrap hoặc tạo chủ đề của riêng bạn.",
    "BootstrapTagHelpersDynamicForms": "Trình trợ giúp thẻ Bootstrap & Biểu mẫu động",
    "BootstrapTagHelpersDynamicFormsExplanation": "Thay vì viết thủ công các chi tiết lặp lại của các thành phần bootstrap, Sử dụng trình trợ giúp thẻ của ABP để đơn giản hóa nó và tận dụng lợi thế của intellisense. Nhanh chóng tạo biểu mẫu giao diện người dùng dựa trên mô hình C # bằng cách sử dụng trình trợ giúp thẻ biểu mẫu động.",
    "HTTPAPIsDynamicProxies": "API HTTP & proxy động",
    "HTTPAPIsDynamicProxiesExplanation": "Tự động hiển thị các dịch vụ ứng dụng dưới dạng các API HTTP kiểu REST và sử dụng chúng với các proxy động và JavaScript.",
    "CompleteArchitectureInfo": "Kiến trúc hiện đại để tạo ra các giải pháp phần mềm có thể bảo trì.",
    "DomainDrivenDesignBasedLayeringModelExplanation": "Giúp bạn triển khai kiến trúc phân lớp dựa trên DDD và xây dựng cơ sở mã có thể bảo trì.",
    "DomainDrivenDesignBasedLayeringModelExplanationCont": "Cung cấp các mẫu khởi động, phần tóm tắt, lớp cơ sở, dịch vụ, tài liệu và hướng dẫn để giúp bạn phát triển ứng dụng của mình dựa trên các mẫu & nguyên tắc DDD.",
    "MicroserviceCompatibleModelExplanation": "Khung cốt lõi & mô-đun tiền xây dựng được thiết kế với kiến trúc microservice.",
    "MicroserviceCompatibleModelExplanationCont": "Cung cấp cơ sở hạ tầng, tích hợp, mẫu và tài liệu để triển khai các giải pháp microservice dễ dàng hơn, đồng thời không gây thêm phức tạp nếu bạn muốn có một ứng dụng nguyên khối.",
    "ModularInfo": "ABP cung cấp một hệ thống mô-đun cho phép bạn phát triển các mô-đun ứng dụng có thể tái sử dụng, liên kết với các sự kiện vòng đời ứng dụng và thể hiện sự phụ thuộc giữa các phần cốt lõi trong hệ thống của bạn.",
    "PreBuiltModulesThemes": "Chủ đề & Mô-đun được xây dựng sẵn",
    "PreBuiltModulesThemesExplanation": "Các mô-đun & chủ đề mã nguồn mở và thương mại đã sẵn sàng để sử dụng trong ứng dụng kinh doanh của bạn.",
    "NuGetNPMPackages": "Gói NuGet & NPM",
    "NuGetNPMPackagesExplanation": "Được phân phối dưới dạng gói NuGet & NPM. Dễ dàng cài đặt và nâng cấp.",
    "ExtensibleReplaceable": "Có thể mở rộng/có thể thay thế",
    "ExtensibleReplaceableExplanation": "Tất cả các dịch vụ và mô-đun được thiết kế có tính đến khả năng mở rộng. Bạn có thể thay thế các dịch vụ, trang, kiểu và thành phần.",
    "CrossCuttingConcernsExplanation2": "Giữ cho cơ sở mã của bạn nhỏ hơn để bạn có thể duy trì sự tập trung vào mã cụ thể cho doanh nghiệp của bạn.",
    "CrossCuttingConcernsExplanation3": "Không gửi thời gian thực hiện các yêu cầu ứng dụng chung cho nhiều dự án.",
    "AuthenticationAuthorization": "Uỷ quyền xác thực",
    "ExceptionHandling": "Xử lý ngoại lệ",
    "Validation": "Thẩm định",
    "DatabaseConnection": "Kết nối cơ sở dữ liệu",
    "TransactionManagement": "Quản lý giao dịch",
    "AuditLogging": "Ghi nhật ký kiểm tra",
    "Caching": "Bộ nhớ đệm",
    "Multitenancy": "Thuê nhiều kiểu",
    "DataFiltering": "Lọc dữ liệu",
    "ConventionOverConfiguration": "Quy ước về cấu hình",
    "ConventionOverConfigurationExplanation": "ABP thực hiện các quy ước ứng dụng chung theo mặc định với cấu hình tối thiểu hoặc bằng không.",
    "ConventionOverConfigurationExplanationList1": "Tự động đăng ký các dịch vụ đã biết để tiêm phụ thuộc.",
    "ConventionOverConfigurationExplanationList2": "Hiển thị các dịch vụ ứng dụng dưới dạng API HTTP bằng các quy ước đặt tên.",
    "ConventionOverConfigurationExplanationList3": "Tạo proxy ứng dụng khách HTTP động cho C # và JavaScript.",
    "ConventionOverConfigurationExplanationList4": "Cung cấp kho lưu trữ mặc định cho các thực thể của bạn.",
    "ConventionOverConfigurationExplanationList5": "Quản lý Đơn vị Công việc theo yêu cầu web hoặc phương thức dịch vụ ứng dụng.",
    "ConventionOverConfigurationExplanationList6": "Nhà xuất bản tạo, cập nhật và xóa sự kiện cho các tổ chức của bạn.",
    "BaseClasses": "Các lớp cơ sở",
    "BaseClassesExplanation": "Các lớp cơ sở được xây dựng trước cho các mẫu ứng dụng phổ biến.",
    "DeveloperFocusedExplanation": "ABP dành cho các nhà phát triển.",
    "DeveloperFocusedExplanationCont": "Nó nhằm mục đích đơn giản hóa việc phát triển phần mềm hàng ngày của bạn trong khi không hạn chế bạn viết mã cấp thấp.",
    "SeeAllFeatures": "Xem tất cả các tính năng",
    "CLI_CommandLineInterface": "CLI (Giao diện dòng lệnh)",
    "CLI_CommandLineInterfaceExplanation": "Bao gồm CLI để giúp bạn tự động tạo các dự án mới và bổ sung các mô-đun mới.",
    "StartupTemplates": "Mẫu khởi động",
    "StartupTemplatesExplanation": "Các mẫu khởi động khác nhau cung cấp một giải pháp được định cấu hình đầy đủ để bắt đầu quá trình phát triển của bạn.",
    "BasedOnFamiliarTools": "Dựa trên các công cụ quen thuộc",
    "BasedOnFamiliarToolsExplanation": "Được xây dựng dựa trên và tích hợp với các công cụ phổ biến mà bạn đã biết. Đường cong học tập thấp, dễ dàng thích nghi, phát triển thoải mái.",
    "ORMIndependent": "ORM độc lập",
    "ORMIndependentExplanation": "Khung cốt lõi là ORM/cơ sở dữ liệu độc lập và có thể hoạt động với bất kỳ nguồn dữ liệu nào. Các nhà cung cấp Entity Framework Core và MongoDB đã có sẵn.",
    "Features": "Khám phá các Tính năng Khung ABP",
    "ABPCLI": "ABP CLI",
    "Modularity": "Môđun",
    "BootstrapTagHelpers": "Trình trợ giúp thẻ Bootstrap",
    "DynamicForms": "Hình thức động",
    "BundlingMinification": "Bó & nhỏ",
    "BackgroundJobs": "Công việc cơ bản",
    "BackgroundJobsExplanation": "Xác định các lớp đơn giản để thực thi các công việc trong nền như được xếp hàng đợi. Sử dụng trình quản lý công việc tích hợp sẵn hoặc tích hợp trình quản lý công việc của riêng bạn. Tích hợp <a href=\"{0}\"> Hangfire </a> và <a href=\"{1}\"> RabbitMQ </a> đã có sẵn.",
    "DDDInfrastructure": "Cơ sở hạ tầng DDD",
    "DomainDrivenDesignInfrastructure": "Cơ sở hạ tầng thiết kế theo hướng miền",
    "AutoRESTAPIs": "API REST tự động",
    "DynamicClientProxies": "Proxy khách hàng động",
    "DistributedEventBus": "Xe buýt sự kiện phân tán",
    "DistributedEventBusWithRabbitMQIntegration": "Xe buýt sự kiện phân tán với tích hợp RabbitMQ",
    "TestInfrastructure": "Cơ sở hạ tầng thử nghiệm",
    "AuditLoggingEntityHistories": "Kiểm tra Nhật ký & Lịch sử Thực thể",
    "ObjectToObjectMapping": "Ánh xạ đối tượng thành đối tượng",
    "ObjectToObjectMappingExplanation": "Sự trừu tượng hóa <a href=\"{0}\"> ánh xạ đối tượng thành đối tượng </a> với tích hợp AutoMapper.",
    "EmailSMSAbstractions": "Tóm tắt email & SMS",
    "EmailSMSAbstractionsWithTemplatingSupport": "Tóm tắt email & SMS với Hỗ trợ tạo mẫu",
    "Localization": "Bản địa hóa",
    "SettingManagement": "Cài đặt quản lý",
    "ExtensionMethods": "Phương pháp mở rộng",
    "ExtensionMethodsHelpers": "Phương pháp mở rộng & Trình trợ giúp",
    "AspectOrientedProgramming": "Lập trình hướng theo khía cạnh",
    "DependencyInjection": "Tiêm phụ thuộc",
    "DependencyInjectionByConventions": "Tiêm phụ thuộc theo quy ước",
    "ABPCLIExplanation": "ABP CLI (Giao diện dòng lệnh) là một công cụ dòng lệnh để thực hiện một số hoạt động phổ biến cho các giải pháp dựa trên ABP.",
    "ModularityExplanation": "ABP cung cấp một cơ sở hạ tầng hoàn chỉnh để xây dựng các mô-đun ứng dụng của riêng bạn, những mô-đun này có thể có thực thể, dịch vụ, tích hợp cơ sở dữ liệu, API, thành phần giao diện người dùng, v.v.",
    "MultiTenancyExplanation": "Khung ABP không chỉ hỗ trợ phát triển các ứng dụng nhiều người thuê, mà còn làm cho mã của bạn hầu như không biết về việc cho thuê nhiều người.",
    "MultiTenancyExplanation2": "Có thể tự động xác định người thuê hiện tại, cách ly dữ liệu của những người thuê khác nhau với nhau.",
    "MultiTenancyExplanation3": "Hỗ trợ cơ sở dữ liệu đơn lẻ, cơ sở dữ liệu cho mỗi người thuê và các phương pháp tiếp cận kết hợp.",
    "MultiTenancyExplanation4": "Bạn tập trung vào mã doanh nghiệp của mình và để khuôn khổ xử lý việc thuê nhiều người thay cho bạn.",
    "BootstrapTagHelpersExplanation": "Thay vì viết thủ công các chi tiết lặp lại của các thành phần bootstrap, hãy sử dụng trình trợ giúp thẻ của ABP để đơn giản hóa nó và tận dụng lợi thế của intellisense. Bạn chắc chắn có thể sử dụng Bootstrap bất cứ khi nào bạn cần.",
    "DynamicFormsExplanation": "Trình trợ giúp biểu mẫu động & thẻ nhập có thể tạo biểu mẫu hoàn chỉnh từ lớp C # làm mô hình.",
    "AuthenticationAuthorizationExplanation": "Các tùy chọn xác thực & ủy quyền phong phú được tích hợp vào ASP.NET Core Identity & OpenIddict. Cung cấp hệ thống quyền chi tiết và có thể mở rộng.",
    "CrossCuttingConcernsExplanation": "Đừng lặp lại chính mình để thực hiện lại tất cả những thứ phổ biến này. Tập trung vào mã doanh nghiệp của bạn và để ABP tự động hóa chúng theo quy ước.",
    "DatabaseConnectionTransactionManagement": "Kết nối cơ sở dữ liệu & Quản lý giao dịch",
    "CorrelationIdTracking": "Theo dõi Id tương quan",
    "BundlingMinificationExplanation": "ABP cung cấp một hệ thống đóng gói & thu nhỏ đơn giản, năng động, mạnh mẽ, mô-đun và được tích hợp sẵn.",
    "VirtualFileSystemnExplanation": "Hệ thống tệp ảo giúp bạn có thể quản lý các tệp không tồn tại thực tế trên hệ thống tệp (đĩa). Nó chủ yếu được sử dụng để nhúng các tệp (js, css, image, cshtml ...) vào các tập hợp và sử dụng chúng như các tệp vật lý trong thời gian chạy.",
    "ThemingExplanation": "Hệ thống Theming cho phép phát triển chủ đề ứng dụng & mô-đun của bạn một cách độc lập bằng cách xác định một tập hợp các bố cục và thư viện cơ sở chung, dựa trên khung Bootstrap mới nhất.",
    "DomainDrivenDesignInfrastructureExplanation": "Cơ sở hạ tầng hoàn chỉnh để xây dựng các ứng dụng phân lớp dựa trên các nguyên tắc & mẫu Thiết kế theo hướng miền;",
    "Specification": "Sự chỉ rõ",
    "Repository": "Kho",
    "DomainService": "Dịch vụ miền",
    "ValueObject": "Đối tượng giá trị",
    "ApplicationService": "Dịch vụ ứng dụng",
    "DataTransferObject": "Đối tượng truyền dữ liệu",
    "AggregateRootEntity": "Gốc tổng hợp, thực thể",
    "AutoRESTAPIsExplanation": "ABP có thể tự động định cấu hình các dịch vụ ứng dụng của bạn dưới dạng Bộ điều khiển API theo quy ước.",
    "DynamicClientProxiesExplanation": "Dễ dàng sử dụng các API của bạn từ các ứng dụng khách JavaScript và C #.",
    "DistributedEventBusWithRabbitMQIntegrationExplanation": "Dễ dàng xuất bản và sử dụng các sự kiện được phân phối bằng cách sử dụng Xe buýt sự kiện phân tán được tích hợp sẵn với tích hợp RabbitMQ.",
    "TestInfrastructureExplanation": "Khung đã được phát triển đơn vị và thử nghiệm tích hợp. Cung cấp cho bạn các lớp cơ sở để làm cho nó dễ dàng hơn. Các mẫu khởi động được cấu hình sẵn để thử nghiệm.",
    "AuditLoggingEntityHistoriesExplanation": "Ghi nhật ký kiểm tra tích hợp cho các ứng dụng quan trọng trong kinh doanh. Yêu cầu, dịch vụ, ghi nhật ký kiểm tra cấp phương pháp và lịch sử thực thể với chi tiết cấp thuộc tính.",
    "EmailSMSAbstractionsWithTemplatingSupportExplanation": "Các bản tóm tắt của IEmailSender và ISmsSender tách rời logic ứng dụng của bạn khỏi cơ sở hạ tầng. Hệ thống mẫu email tiên tiến cho phép tạo & bản địa hóa các mẫu email và dễ dàng sử dụng bất cứ khi nào cần.",
    "LocalizationExplanation": "Hệ thống bản địa hóa cho phép tạo tài nguyên trong các tệp JSON thuần túy và sử dụng chúng để bản địa hóa giao diện người dùng của bạn. Nó hỗ trợ các kịch bản nâng cao như kế thừa, tiện ích mở rộng và tích hợp JavaScript trong khi hoàn toàn tương thích với hệ thống bản địa hóa của AspNet Core.",
    "SettingManagementExplanation": "Xác định cài đặt cho ứng dụng của bạn và nhận các giá trị trong thời gian chạy dựa trên cấu hình, đối tượng thuê và người dùng hiện tại.",
    "ExtensionMethodsHelpersExplanation": "Đừng lặp lại chính mình ngay cả đối với các phần mã tầm thường. Tiện ích mở rộng & trình trợ giúp cho các loại tiêu chuẩn giúp mã của bạn sạch và dễ viết hơn nhiều.",
    "AspectOrientedProgrammingExplanation": "Cung cấp cơ sở hạ tầng tiện nghi để tạo proxy động và triển khai Lập trình hướng theo khía cạnh. Chặn bất kỳ lớp nào và thực thi mã của bạn trước và sau mỗi lần thực thi phương thức.",
    "DependencyInjectionByConventionsExplanation": "Không cần phải đăng ký các lớp học của bạn để tiêm phụ thuộc theo cách thủ công. Tự động đăng ký các loại dịch vụ phổ biến theo quy ước. Đối với các loại dịch vụ khác, bạn có thể sử dụng các giao diện và thuộc tính để làm cho nó dễ dàng hơn và tại chỗ.",
    "DataFilteringExplanation": "Xác định và sử dụng các bộ lọc dữ liệu được áp dụng tự động khi bạn truy vấn các thực thể từ cơ sở dữ liệu. Bộ lọc Soft Delete & MultiTenant được cung cấp ngay khi bạn triển khai các giao diện đơn giản.",
    "PublishEvents": "Xuất bản sự kiện",
    "HandleEvents": "Xử lý sự kiện",
    "AndMore": "và hơn thế nữa...",
    "Code": "Mã số",
    "Result": "Kết quả",
    "SeeTheDocumentForMoreInformation": "Xem <a href=\"{1}\"> {0} tài liệu </a> để biết thêm thông tin",
    "IndexPageHeroSection": "<span class=\"first-line shine\"> <strong> mã nguồn mở </strong> </span> <span class=\"second-line text-uppercase\"> Khung <br /> ứng dụng web </span> <span class=\"third-line shine2\"> <strong> cho lõi asp.net </strong> </span>",
    "UiFramework": "Khung giao diện người dùng",
    "EmailAddress": "Địa chỉ email",
    "Mobile": "Di động",
    "ReactNative": "React Native",
    "Strong": "Mạnh",
    "Complete": "Hoàn thành",
    "BasedLayeringModel": "Mô hình phân lớp dựa trên",
    "Microservice": "Microservice",
    "Compatible": "Tương thích",
    "MeeTTheABPCommunityInfo": "Nhiệm vụ của chúng tôi là tạo ra một môi trường nơi các nhà phát triển có thể giúp đỡ nhau bằng các bài báo, hướng dẫn, nghiên cứu điển hình, v.v. và gặp gỡ những người cùng chí hướng.",
    "JoinTheABPCommunityInfo": "Tham gia với một cộng đồng sôi động và trở thành người đóng góp cho Khung ABP!",
    "AllPosts": "Tất cả bài báo",
    "SubmitYourPost": "Gửi bài viết của bạn",
    "DynamicClientProxyDocument": "Xem tài liệu proxy ứng dụng khách động cho <a href=\"{0}\"> JavaScript </a> & <a href=\"{1}\"> C # </a>.",
    "EmailSMSAbstractionsDocument": "Xem tài liệu <a href=\"{0}\"> gửi email </a> và <a href=\"{1}\"> gửi SMS </a> để biết thêm thông tin.",
    "CreateProjectWizard": "Trình hướng dẫn này tạo một dự án mới từ mẫu khởi động được định cấu hình thích hợp để bắt đầu dự án của bạn.",
    "TieredOption": "Tạo ra một giải pháp phân cấp trong đó các lớp API Web và Http được tách biệt về mặt vật lý. Nếu không được chọn, hãy tạo một giải pháp phân lớp ít phức tạp hơn và phù hợp với hầu hết các tình huống.",
    "SeparateIdentityServerOption": "Tách phía máy chủ thành hai ứng dụng: Ứng dụng đầu tiên dành cho máy chủ nhận dạng và ứng dụng thứ hai dành cho API HTTP phía máy chủ của bạn.",
    "SeparateAuthenticationServerOption": "Tách phía máy chủ thành hai ứng dụng: Ứng dụng thứ nhất dành cho máy chủ xác thực và ứng dụng thứ hai dành cho API HTTP phía máy chủ của bạn.",
    "ProgressiveWebApplicationOption": "Chỉ định dự án là Ứng dụng web lũy tiến",
    "UseslatestPreVersion": "Sử dụng phiên bản phát hành trước mới nhất",
    "ReadTheDocumentation": "<span class=\"text-primary\"> Đọc </span> <span class=\"text-success\"> Tài liệu </span>",
    "Documentation": "Tài liệu",
    "GettingStartedTutorial": "Hướng dẫn Bắt đầu",
    "ApplicationDevelopmentTutorial": "Hướng dẫn phát triển ứng dụng",
    "TheStartupTemplate": "Mẫu khởi động",
    "InstallABPCLIInfo": "ABP CLI là cách nhanh nhất để bắt đầu một giải pháp mới với khuôn khổ ABP. Cài đặt ABP CLI bằng cửa sổ dòng lệnh:",
    "DifferentLevelOfNamespaces": "Bạn có thể sử dụng các cấp độ không gian tên khác nhau; ví dụ. BookStore, Acme.BookStore hoặc Acme.Retail.BookStore.",
    "ABPCLIExamplesInfo": "Lệnh <strong> new </strong> tạo <strong> ứng dụng MVC nhiều lớp </strong> với <strong> Entity Framework Core </strong> là nhà cung cấp cơ sở dữ liệu. Tuy nhiên, nó có các tùy chọn bổ sung. Ví dụ:",
    "SeeCliDocumentForMoreInformation": "Xem <a href=\"{0}\"> tài liệu ABP CLI </a> để có thêm tùy chọn hoặc chọn tab \"Tải xuống trực tiếp\" ở trên.",
    "Optional": "Không bắt buộc",
    "LocalFrameworkRef": "Giữ tham chiếu dự án địa phương cho các gói khuôn khổ.",
    "BlobStoring": "Lưu trữ BLOB",
    "BlobStoringExplanation": "Hệ thống lưu trữ BLOB cung cấp một bản tóm tắt để làm việc với BLOB. ABP cung cấp một số tích hợp nhà cung cấp dịch vụ lưu trữ được xây dựng trước (Azure, AWS, Hệ thống tệp, Cơ sở dữ liệu, v.v.) mà bạn có thể dễ dàng sử dụng trong các ứng dụng của mình.",
    "TextTemplating": "Tạo văn bản",
    "TextTemplatingExplanation": "Tạo mẫu văn bản được sử dụng để hiển thị động nội dung dựa trên mẫu và mô hình (một đối tượng dữ liệu). Ví dụ: bạn có thể sử dụng nó để tạo nội dung email động với mẫu được tạo sẵn.",
    "MultipleUIOptions": "Nhiều tùy chọn giao diện người dùng",
    "MultipleDBOptions": "Nhiều nhà cung cấp cơ sở dữ liệu",
    "MultipleUIOptionsExplanation": "Khung cốt lõi được thiết kế độc lập với giao diện người dùng và có thể hoạt động với bất kỳ loại hệ thống giao diện người dùng nào, trong khi có nhiều tùy chọn tích hợp và được xây dựng trước được cung cấp sẵn.",
    "MultipleDBOptionsExplanation": "Khung có thể hoạt động với bất kỳ nguồn dữ liệu nào, trong khi các nhà cung cấp sau được chính thức phát triển và hỗ trợ;",
    "SelectLanguage": "Chọn ngôn ngữ",
    "LatestPostOnCommunity": "Bài viết mới nhất về Cộng đồng ABP",
    "Register": "Đăng ký",
    "IsDownloadable": "Có thể tải xuống",
    "DatabaseOptions": "Tùy chọn cơ sở dữ liệu",
    "BackToPackagesPage": "Quay lại Trang Gói",
    "HowToInstall": "Cài đặt thế nào",
    "SeeOnNpm": "Xem trên NPM",
    "SeeOnNuget": "Xem trên Nuget",
    "MVCGulpCommandExplanation": "Nếu bạn đang sử dụng giao diện người dùng MVC (Razor Pages), hãy chạy lệnh \"gulp\" sau khi cài đặt gói.",
    "UsingABPCLI": "Sử dụng <a href=\"https://docs.abp.io/en/abp/latest/CLI\"> Abp CLI </a>",
    "WithoutABPCLI": "Không có ABP CLI",
    "ABPCLIModuleDependency": "Abp Cli tự động thêm phần phụ thuộc vào mô-đun.",
    "AddModuleDependency": "Sau đó, thêm phụ thuộc vào mô-đun",
    "Packages": "Các gói",
    "NugetPackages": "Gói Nuget",
    "NPMPackages": "Gói NPM",
    "SeeDocs": "Xem tài liệu",
    "None": "Không có",
    "Application": "Ứng dụng",
    "ApplicationExplanation": "Tạo giải pháp phân lớp đầy đủ dựa trên thực tiễn Thiết kế theo hướng miền. Được đề xuất cho các dự án dài hạn cần cơ sở mã có thể mở rộng và bảo trì.",
    "ApplicationNoLayer": "Ứng dụng (một lớp)",
    "ApplicationNoLayerExplanation": "Tạo một ứng dụng web một lớp. Được đề xuất để xây dựng một ứng dụng có kiến trúc đơn giản và dễ hiểu hơn.",
    "Module": "Mô-đun",
    "ModuleExplanation": "Tạo ra một giải pháp mô-đun ứng dụng được phân lớp đầy đủ, có thể tái sử dụng. Bạn có thể sử dụng tùy chọn này để tạo mô-đun cho ứng dụng mô-đun của mình.",
    "PackageName": "Tên gói hàng",
    "LicenseURL": "URL giấy phép",
    "License": "Giấy phép",
    "ProjectCreationSuccessMessage": "Dự án của bạn đã được tạo thành công",
    "HowToRunSolution": "Làm thế nào để chạy giải pháp của bạn?",
    "GettingStartedMessage": "Xem tài liệu bắt đầu để tìm hiểu cách định cấu hình và chạy giải pháp của bạn.",
    "WebAppDevTutorial": "Hướng dẫn dành cho nhà phát triển ứng dụng web",
    "WebAppDevTutorialMessage": "Xem tài liệu hướng dẫn phát triển ứng dụng web để biết mẫu phát triển từng bước.",
    "CommunityPosts": "Bài viết cộng đồng",
    "CommunityPostMessage": "Kiểm tra ABP Community Platform để đọc các bài viết hữu ích về ABP Framework.",
    "InvestigateSolutionDetails": "Kiểm tra chi tiết giải pháp",
    "StartupTemplateDocumentationMessage": "Xem tài liệu mẫu khởi động ứng dụng để tìm hiểu kiến trúc và cấu trúc của giải pháp của bạn.",
    "ClientSideDevelopment": "Phát triển phía khách hàng",
    "ClientSideDevelopmentDocumentationMessage": "Xem tài liệu {0} để tìm hiểu các điểm chính để phát triển giao diện người dùng (phía máy khách).",
    "DatabaseProviderDocumentationMessage": "Xem tài liệu {0} để tìm hiểu các điểm chính để phát triển lớp cơ sở dữ liệu.",
    "ABPCommercialExplanationMessage": "ABP Commercial cung cấp các mô-đun, chủ đề, công cụ và hỗ trợ cao cấp cho Khung ABP.",
    "ImplementingDDD": "Triển khai thiết kế theo hướng miền",
    "DDDBookExplanation": "Hướng dẫn thực tế để triển khai Thiết kế theo hướng miền với Khung ABP.",
    "Overview": "Tổng quat",
    "DDDBookPracticalGuide": "Đây là hướng dẫn thực tế để triển khai Thiết kế theo hướng miền (DDD). Mặc dù chi tiết triển khai dựa trên cơ sở hạ tầng ABP Framework, các khái niệm, nguyên tắc và mô hình cơ bản có thể được áp dụng cho bất kỳ giải pháp nào, ngay cả khi nó không phải là giải pháp .NET.",
    "TableOfContents": "Mục lục",
    "IntroductionToImplementingDDD": "Giới thiệu về triển khai thiết kế theo hướng miền",
    "WhatIsDDD": "Thiết kế theo hướng miền là gì?",
    "Implementation": "Thực hiện",
    "TheBigPicture": "Bức tranh lớn",
    "TheBuildingBlock": "Khối xây dựng",
    "ExampleUseCase": "Trường hợp sử dụng mẫu",
    "DomainAndApplicationLogic": "Logic miền & Logic ứng dụng",
    "Author": "Tác giả",
    "Pages": "Các trang",
    "PublishedOn": "Được xuất bản trên",
    "FreeEBook": "Sách điện tử miễn phí",
    "Download": "Tải xuống",
    "EBookSignInForDownload": "Để tải xuống sách điện tử, hãy đăng nhập",
    "SignIn": "Đăng nhập",
    "Or": "Hoặc",
    "TellUsAboutYourself": "Hãy cho chúng tôi biết một chút về bạn",
    "Name": "Tên",
    "Surname": "Họ",
    "CompanyName": "Tên công ty",
    "DoYouAgreePrivacyPolicy": "Tôi đồng ý với <a href=\"https://account.abp.io/Account/TermsConditions\"> Điều khoản & điều kiện </a> và <a href=\"https://account.abp.io/Account/Privacy \"> Chính sách Bảo mật </a>.",
    "Free": "Miễn phí",
    "DDDEBook": "Sách điện tử DDD",
    "PracticalGuideForImplementingDDD": "Cuốn sách này là hướng dẫn thực tế để triển khai Thiết kế theo hướng miền với Khung ABP.",
    "IntroducingDDD": "Giới thiệu thiết kế theo hướng miền",
    "DDDLayersAndCleanArchitecture": "Lớp DDD & Kiến trúc sạch",
    "LayeringOfADotnetSolution": "Phân lớp của Giải pháp .NET",
    "ImplementingDDDBuildingBlocks": "Triển khai khối xây dựng DDD",
    "DomainVsApplicationLogic": "Logic miền so với Logic ứng dụng",
    "SamplesAndDiscussions": "Mẫu & Thảo luận",
    "EmailNotValid": "Vui lòng nhập một địa chỉ email hợp lệ.",
    "WeWillSendYouADownloadLink": "Một liên kết để tải xuống sách điện tử đã được gửi tới {0}. Kiểm tra hộp thư đến của bạn, hộp thư rác hoặc hộp thư rác!",
    "GoHome": "Về nhà",
    "InvalidFormInputs": "Vui lòng nhập thông tin hợp lệ được chỉ định trên biểu mẫu.",
    "DDDBookEmailBody": "Cảm ơn bạn. <br /> Để tải xuống sách của bạn, hãy <a href=\"{0}\"> nhấp vào đây </a>.",
    "SubscribeToNewsletter": "Đăng ký bản tin để nhận thông tin về các diễn biến trong Nền tảng ABP.IO, chẳng hạn như các bản phát hành, bài báo, ưu đãi mới và hơn thế nữa.",
    "FirstEdition": "Ấn bản đầu tiên",
    "ThankYou": "Cảm ơn bạn!",
    "CheckboxMandatory": "Bạn cần kiểm tra điều này để tiếp tục!",
    "UserInterface": "Giao diện người dùng",
    "APIGateway": "Cổng API",
    "Database": "Cơ sở dữ liệu",
    "Saas": "Saas",
    "OpenSourceWebApp": "Mã <span class=\"forever\">nguồn</span> mở<br/> ứng dụng web",
    "Framework": "Khung",
    "AuditLoggingExplanation": "Tự động theo dõi tất cả các hoạt động và thay đổi dữ liệu trong hệ thống của bạn.",
    "AbpNewCommandExplanation": "Tạo các giải pháp mới bằng cách sử dụng các mẫu khởi động ABP.",
    "AbpAddModuleCommandExplanation": "Cài đặt các mô-đun ứng dụng dựng sẵn vào giải pháp của bạn",
    "AbpUpdateCommandExplanation": "Tự động cập nhật tất cả các gói NuGet và NPM liên quan đến ABP trong giải pháp của bạn.",
    "ExploreAllCLICommands": "Khám phá tất cả các lệnh CLI",
    "ExploreDocumentationAndGuides": "Khám phá các tài liệu và hướng dẫn toàn diện.",
    "Documentations": "Tài liệu",
    "Views": "Lượt xem",
    "EnterYouEmailToGetNews": "Nhập email của bạn để nhận tin tức mới nhất về ABP Framework",
    "Tiered": "theo cấp bậc",
    "SeparateIdentityServer": "Máy chủ nhận dạng riêng biệt",
    "SeparateAuthenticationServer": "Máy chủ xác thực riêng biệt",
    "ProgressiveWebApplication": "Ứng dụng web tiến bộ",
    "Preview": "Xem trước",
    "CreateANewSolution": "Tạo một giải pháp mới",
    "FrameworkFeatures": "<span class=\"gradient-framework\">Tính năng</span> của khung ABP",
    "Commercial": "Thuộc về thương mại",
    "ThirdPartyTools": "Công cụ của bên thứ ba",
    "Back": "Mặt sau",
    "Community": "Cộng đồng",
    "SeeMore": "Xem thêm",
    "DetailsOfTheEBook": "Chi tiết về Sách điện tử",
    "JoinOurMarketingNewsletter": "Tham gia bản tin tiếp thị của chúng tôi",
    "FrameworkNewsletterConfirmationMessage": "Tôi đồng ý với <a class=\"text-white fw-6 text-decoration-underline opacity-50\" href=\"https://commercial.abp.io/TermsConditions\">Điều khoản &amp; Điều kiện</a> và <a  class=\"text-white fw-6 text-decoration-underline opacity-50\" href=\"https://commercial.abp.io/Privacy\">Chính sách quyền riêng tư</a> .",
    "GetYourFreeEBook": "Nhận <span class=\"gradient-framework d-block\">sách điện tử DDD miễn phí</span> của bạn",
    "EverythingYouNeedToKnow": "Mọi thư bạn cân biêt.",
    "PreOrderNow": "Đặt mua ngay",
    "UITheming": "Chủ đề giao diện người dùng",
    "UIThemingExplanation": "Tạo các chủ đề và bố cục giao diện người dùng có thể sử dụng lại hoặc sử dụng một trong các chủ đề giao diện người dùng được tạo sẵn.",
    "DataFilteringExplanation2": "Tự động lọc truy vấn từ cơ sở dữ liệu để dễ dàng triển khai các mẫu như xóa mềm và nhiều bên thuê.",
    "NeedHelp": "Cần giúp đỡ?",
    "GiveYourProjectAName": "Đặt tên cho dự án của bạn",
    "SelectProjectType": "Chọn loại dự án",
    "SelectUIFramework": "Chọn khung giao diện người dùng",
    "SelectDatabaseProvider": "Chọn nhà cung cấp cơ sở dữ liệu",
    "SelectDatabaseManagementSystem": "Chọn hệ thống quản lý cơ sở dữ liệu",
    "InstallingTheABPCLI": "Cài đặt ABP CLI",
    "CreateYourProjectNow": "Tạo dự án của bạn ngay bây giờ",
    "OrderOn": "Đặt hàng trên {0}",
    "DownloadFreeDDDBook": "Tải xuống sách DDD miễn phí",
    "WhatIsABPFramework": "Khung ABP là gì?",
    "TenantDatabase": "Cơ sở dữ liệu về người thuê {0}",
    "SharedDatabase": "Cơ sở dữ liệu dùng chung",
    "ConnectionResolver": "Trình giải quyết kết nối",
    "TenantBasedDataFilter": "Bộ lọc dữ liệu dựa trên đối tượng thuê",
    "ApplicationCode": "Mã ứng dụng",
    "TenantResolution": "Giải pháp của người thuê nhà",
    "TenantUser": "Người thuê {0} người dùng",
    "CardTitle": "Tiêu đề thẻ",
    "View": "Xem",
    "Model": "Người mẫu",
    "Email": "E-mail",
    "Password": "Mật khẩu",
    "Address": "Địa chỉ",
    "Gender": "Giới tính",
    "Male": "Nam giới",
    "Female": "Nữ giới",
    "Submit": "Nộp",
    "Unspecified": "Không xác định",
    "StaticFileMiddleware": "Phần mềm trung gian tệp tĩnh",
    "RazorViewEngine": "Công cụ xem dao cạo",
    "PhysicalFiles": "Tệp vật lý (wwwroot)",
    "EmbeddedFiles": "Tệp nhúng (DLL)",
    "DynamicFiles": "Tệp động (Bộ nhớ)",
    "BuildSolutionsWithAbp": "Xây dựng các giải pháp .NET có thể bảo trì bằng cách làm theo các phương pháp hay nhất về phát triển phần mềm bằng cách sử dụng ABP.",
    "BuyOnAmazon": "Mua trên Amazon",
    "BuyOnPackt": "Mua trên Packt",
    "Discounted": "Giảm giá",
    "MasteringAbpFramework_Book_KeyFeatures": "Các tính năng chính",
    "MasteringAbpFramework_Book_Key_Features_Description_1": "Xây dựng các giải pháp phần mềm mạnh mẽ, có thể bảo trì, mô-đun và có thể mở rộng bằng ABP Framework.",
    "MasteringAbpFramework_Book_Key_Features_Description_2": "Tìm hiểu cách triển khai các nguyên tắc RẮN và thiết kế theo hướng miền trong các ứng dụng web của bạn.",
    "MasteringAbpFramework_Book_Key_Features_Description_3": "Khám phá cách ABP Framework tăng tốc chu kỳ phát triển của bạn bằng cách tự động hóa các tác vụ lặp đi lặp lại.",
    "MasteringAbpFramework_Book_Description": "Mô tả cuốn sách",
    "MasteringAbpFramework_Book_Description_Details_1": "ABP Framework là một cơ sở hạ tầng hoàn chỉnh để tạo các ứng dụng web hiện đại bằng cách tuân theo các quy ước và thực tiễn tốt nhất về phát triển phần mềm \n . Với khuôn khổ và hệ sinh thái cấp cao của ABP, bạn có thể \n triển khai nguyên tắc Đừng lặp lại chính mình (DRY) và tập trung vào mã doanh nghiệp của mình.",
    "MasteringAbpFramework_Book_Description_Details_2": "Được viết bởi người tạo ra ABP Framework, cuốn sách này sẽ giúp bạn có được sự hiểu biết đầy đủ về khung \n và các kỹ thuật phát triển ứng dụng web hiện đại. Với phần giải thích từng bước về các khái niệm \n thiết yếu và các ví dụ thực tế, bạn sẽ hiểu các yêu cầu của giải pháp web hiện đại và cách ABP \n Framework khiến việc phát triển các giải pháp của riêng bạn trở nên thú vị như thế nào. Bạn sẽ khám phá các yêu cầu chung của việc phát triển ứng dụng web doanh nghiệp \n và khám phá cơ sở hạ tầng do ABP cung cấp. Xuyên suốt cuốn sách \n , bạn sẽ nắm bắt được các phương pháp hay nhất về phát triển phần mềm để xây dựng các giải pháp web \n theo mô-đun và có thể bảo trì.",
    "MasteringAbpFramework_Book_Description_Details_3": "Đến cuối cuốn sách này, bạn sẽ có thể tạo một giải pháp web hoàn chỉnh, dễ phát triển, bảo trì và thử nghiệm \n .",
    "MasteringAbpFramework_Book_WhatYouWillLearn": "Bạn sẽ học được gì",
    "MasteringAbpFramework_Book_What_You_Will_Learn_1": "Thiết lập môi trường phát triển và bắt đầu với ABP Framework.",
    "MasteringAbpFramework_Book_What_You_Will_Learn_2": "Làm việc với Entity Framework Core và MongoDB để phát triển lớp truy cập dữ liệu của bạn.",
    "MasteringAbpFramework_Book_What_You_Will_Learn_3": "Hiểu các mối quan tâm xuyên suốt và cách ABP tự động hóa các nhiệm vụ lặp đi lặp lại.",
    "MasteringAbpFramework_Book_What_You_Will_Learn_4": "Nắm bắt được cách triển khai thiết kế hướng miền với ABP Framework.",
    "MasteringAbpFramework_Book_What_You_Will_Learn_5": "Xây dựng các trang và thành phần giao diện người dùng với ASP.NET Core MVC (Trang dao cạo) và Blazor.",
    "MasteringAbpFramework_Book_What_You_Will_Learn_6": "Làm việc với nhiều bên thuê để tạo các ứng dụng web mô-đun.",
    "MasteringAbpFramework_Book_What_You_Will_Learn_7": "Hiểu tính mô-đun và tạo các mô-đun ứng dụng có thể tái sử dụng.",
    "MasteringAbpFramework_Book_What_You_Will_Learn_8": "Viết các bài kiểm tra đơn vị, tích hợp và giao diện người dùng bằng ABP Framework.",
    "MasteringAbpFramework_Book_WhoIsThisBookFor": "Cuốn sách này dành cho ai",
    "MasteringAbpFramework_Book_WhoIsThisBookFor_Description": "Cuốn sách này dành cho các nhà phát triển web muốn tìm hiểu kiến trúc phần mềm và các phương pháp hay nhất để xây dựng các giải pháp dựa trên web có thể bảo trì \n bằng cách sử dụng các công nghệ của Microsoft và ABP Framework. Kiến thức cơ bản về C# \n và ASP.NET Core là cần thiết để bắt đầu với cuốn sách này.",
    "ComputersAndTechnology": "Máy tính &amp; Công nghệ",
    "BuildingMicroserviceSolutions": "Xây dựng giải pháp microservice",
    "MicroserviceBookPracticalGuide": "Cuốn sách này là hướng dẫn tham khảo để phát triển và quản lý các ứng dụng dựa trên vi dịch vụ bằng Khung ABP. Nó tham khảo <strong>Ứng dụng tham chiếu mẫu .NET Microservice</strong> : eShopOnContainers và thảo luận về các phương pháp triển khai và thiết kế kiến trúc bằng cách sử dụng ABP Framework. Đến cuối cuốn sách này, bạn sẽ tìm hiểu cách ABP tiếp cận các vấn đề phức tạp phổ biến của vi dịch vụ như ủy quyền, giao dịch phân tán, liên lạc giữa các vi dịch vụ, triển khai, v.v.",
    "IntroducingTheSolution": "Giới thiệu Giải pháp eShopOnAbp",
    "RunningTheSolution": "Chạy giải pháp",
    "UnderstandingTheAuthenticationSystem": "Hiểu hệ thống xác thực",
    "ExploringTheApplications": "Khám phá các ứng dụng",
    "UnderstandingTheAPIGateways": "Hiểu các cổng API",
    "DevelopingTheMicroservices": "Phát triển microservice",
    "UnderstandingTheInfrastructure": "Hiểu cơ sở hạ tầng",
    "DiggingInTheUseCases": "Đào sâu vào các trường hợp sử dụng",
    "DeployingTheSolution": "Triển khai giải pháp",
    "ThisBookIsInDraftStageAndIsNotCompletedYet": "Cuốn sách này đang ở giai đoạn phác thảo và chưa hoàn thiện.",
    "Authors": "tác giả",
    "MicroserviceEBook": "Sách điện tử microservice",
    "SelectUITheme": "Chọn chủ đề giao diện người dùng",
    "LeptonXLiteTheme": "Chủ đề LeptonX Lite",
    "BasicTheme": "Chủ đề cơ bản",
    "LeptonXLiteThemeInfo": "Một chủ đề giao diện người dùng Bootstrap hiện đại và phong cách. Lý tưởng nếu bạn muốn có một chủ đề giao diện người dùng sẵn sàng cho sản xuất. Đây là chủ đề mới nhất và là chủ đề mặc định.",
    "BasicThemeInfo": "Chủ đề giao diện người dùng tối giản với màu sắc và kiểu dáng Bootstrap đơn giản. Lý tưởng nếu bạn xây dựng chủ đề giao diện người dùng của riêng mình.",
    "SeeDocumentation": "Xem <a href='{0}' target='_blank'>tài liệu</a> .",
    "SeeFullScreen": "<a href='{0}' target='_blank'>🖼️ Xem ảnh chụp màn hình</a>",
    "BuildingMicroserviceSolutionsShortDescription": "Cuốn sách này là hướng dẫn tham khảo để phát triển và quản lý các ứng dụng dựa trên vi dịch vụ bằng Khung ABP.",
    "InstallAbpCliMessage": "Cài đặt ABP CLI trong thiết bị đầu cuối dòng lệnh, nếu bạn chưa cài đặt nó trước đó:",
    "Terminal": "Phần cuối",
    "Copy": "Sao chép",
    "RunTheFollowingCommand": "Chạy lệnh sau trong thiết bị đầu cuối dòng lệnh:",
    "ChangeSolutionOptionsBelow": "Bạn có thể thay đổi các tùy chọn giải pháp bên dưới.",
    "MultiLayerApplication": "Nhiều lớp<br> Ứng dụng",
    "MultiLayerApplicationExplanation1": "Tạo giải pháp phân lớp đầy đủ dựa trên thực tiễn Thiết kế theo hướng miền.",
    "MultiLayerApplicationExplanation2": "Được đề xuất cho các dự án dài hạn cần cơ sở mã có thể mở rộng và bảo trì.",
    "SingleLayerApplication": "Lớp đơn<br> Ứng dụng",
    "SingleLayerApplicationExplanation1": "Tạo một ứng dụng web một lớp.",
    "SingleLayerApplicationExplanation2": "Được đề xuất để xây dựng một ứng dụng có kiến trúc đơn giản và dễ hiểu hơn.",
    "ApplicationModule": "Ứng dụng<br> mô-đun",
    "SeeTheScreenshot": "Xem ảnh chụp màn hình",
    "ApplicationModuleExplanation1": "Tạo ra một giải pháp mô-đun ứng dụng được phân lớp đầy đủ, có thể tái sử dụng.",
    "ApplicationModuleExplanation2": "Bạn có thể sử dụng tùy chọn này để tạo mô-đun cho ứng dụng mô-đun của mình.",
    "Expert_": "Chuyên gia",
    "Partner_": "quan hệ đối tác",
    "WebSite": "Trang mạng",
    "Expert_Year": "Năm chuyên môn",
    "CompanyInfo": "Thông tin công ty",
    "Date": "Ngày",
    "WhoWeAre_Partner": "Chúng ta là ai",
    "WhoWeAre_Expert": "Về tôi",
    "CreateSolutionFolder": "Tạo thư mục giải pháp",
    "CreateSolutionFolderOption": "Chỉ định xem dự án sẽ nằm trong một thư mục mới trong thư mục đầu ra hay trực tiếp trong thư mục đầu ra.",
    "BooksPageTitle": "Sách ABP",
    "PackageDetailPage_NuGetPackageInstallationOptions": "Có ba cách để cài đặt gói NuGet <code>{0}</code> vào dự án của bạn",
    "PackageDetailPage_InstallingWithABPCLI": "1: Cài đặt bằng ABP CLI",
    "PackageDetailPage_InstallingWithABPCLIDescription1": "Nếu bạn chưa cài đặt <a href=\"https://docs.abp.io/en/abp/latest/CLI\">ABP CLI</a> , trước tiên hãy cài đặt bằng cách thực hiện lệnh sau trong thiết bị đầu cuối dòng lệnh",
    "PackageDetailPage_InstallingWithABPCLIDescription2": "Sau khi bạn đã cài đặt ABP CLI, hãy mở một thiết bị đầu cuối dòng lệnh ở vị trí của dự án (tệp <code>.csproj</code> ) mà bạn muốn cài đặt và thực hiện lệnh sau",
    "PackageDetailPage_InstallingWithABPCLIDescription3": "Nó sẽ thêm tham chiếu gói <code>{0}</code> vào dự án của bạn và phần phụ thuộc <code>{1}</code> vào lớp mô-đun của bạn.",
    "PackageDetailPage_ManualInstallation": "2: Cài đặt bằng Dotnet CLI",
    "PackageDetailPage_ManualInstallationDescription1": "Thêm tham chiếu gói NuGet <code>{0}</code> vào dự án của bạn bằng IDE hoặc thực thi lệnh sau",
    "PackageDetailPage_ManualInstallationDescription2": "Sau đó thêm phần phụ thuộc <code>{0}</code> vào <a href=\"https://docs.abp.io/en/abp/latest/Module-Development-Basics\">lớp mô-đun</a> của bạn như trong ví dụ sau",
    "PackageDetailPage_SeeDocumentation": "<a href=\"{0}\">Xem tài liệu</a> để tìm hiểu cách sử dụng gói này trong ứng dụng của bạn.",
    "PackageDetailPage_InstallingUsingPMC": "3: Cài đặt bằng Bảng điều khiển quản lý gói",
    "PackageDetailPage_InstallingUsingPMCDescription1": "Mở <strong>Bảng điều khiển quản lý gói</strong> trong Visual Studio (Công cụ -&gt; Trình quản lý gói Nuget -&gt; Bảng điều khiển quản lý gói) và thực hiện lệnh sau",
    "UIOptions": "Tùy chọn giao diện người dùng",
    "Testimonials": "Lời chứng thực",
    "CoolestCompaniesUseABPFramework": "Các công ty tuyệt vời nhất sử dụng <span class=\"fw-bold\">ABP Framework</span>",
    "Index_Page_Testimonial_1": "ABP Framework không chỉ là một công cụ mà còn là chất xúc tác đã thúc đẩy sự phát triển của tôi với tư cách là một nhà phát triển. Nó giúp tôi có thể xây dựng các tính năng mới nhanh hơn bao giờ hết, gợi nhớ đến trải nghiệm của những người dùng khác. Mẫu mã hóa hợp nhất đã sắp xếp hợp lý các dự án của tôi, giúp tôi có nhiều thời gian hơn để tập trung vào việc tạo thay vì xử lý sự cố. \n Tôi có thể nói rằng Khung ABP đã là nền tảng cho hành trình chuyên nghiệp ban đầu của tôi. Nó đã tạo điều kiện thuận lợi cho quá trình chuyển đổi của tôi từ một nhà phát triển đầy tham vọng trở thành một chuyên gia tự tin, sẵn sàng tạo dấu ấn trong thế giới phần mềm. Tôi rất mong chờ những dự án thú vị đang chờ đợi mình vì biết rằng ABP sẽ ở đó để hướng dẫn tôi. Nó không chỉ là một sản phẩm; đó là một đối tác trong sự thành công.",
    "Index_Page_Testimonial_2": "ABP Framework không chỉ là một framework mà còn là một hướng dẫn để phát triển/quản lý dự án vì nó cung cấp các khóa đào tạo về DDD, GenericRepository, DI, Microservice, moduleity. Ngay cả khi bạn không sử dụng framework, bạn vẫn có thể tự phát triển với docs.abp.io được chuẩn bị kỹ lưỡng và chuyên nghiệp. (OpenIddict, Redis, Quartz, v.v.) \n Bởi vì có nhiều thứ được xây dựng sẵn nên nó rút ngắn đáng kể thời gian phát triển dự án. (Chẳng hạn như trang đăng nhập, xử lý ngoại lệ, lọc dữ liệu, ghi nhật ký kiểm tra, bản địa hóa, bộ điều khiển api tự động, v.v.) \n Là một ví dụ từ ứng dụng của chúng tôi, tôi đã sử dụng Local Event Bus để kiểm soát hàng tồn kho. Vì vậy, tôi có thể quản lý việc di chuyển đơn hàng bằng cách viết trình xử lý hàng tồn kho. \n Thật tuyệt vời khi không lãng phí thời gian cho CreationTime, CreatorId. Chúng được điền tự động.",
    "VideosLoginAndRegisterMessage": "Bạn phải đăng nhập để xem video. Bạn có thể tạo một tài khoản để xem nếu chưa có.",
    "Filter": "Lọc",
    "VideoCourses": "Video cần thiết",
    "TestimonialText": "Lời chứng thực của bạn",
    "Position": "Chức vụ",
    "ExperienceYear": "Số năm kinh nghiệm",
    "FullName": "Họ và tên",
    "CompanySize": "Quy mô công ty",
    "Image": "Hình ảnh cá nhân của bạn",
    "TestimonialTitle": "Hãy nghe lời chứng thực của bạn",
    "TestimonialInfo": "Những gì khách hàng nói là quan trọng! Hãy cho chúng tôi biết về trải nghiệm của bạn với sản phẩm và dịch vụ của chúng tôi. Bạn nên viết lời chứng thực bằng tiếng Anh để tiếp cận nhiều đối tượng hơn.",
    "Country": "Quốc gia",
    "TestimonialTextPlaceholder": "Viết một câu chuyện ngắn gọn về cách ABP đã giúp bạn xây dựng và thực hiện dự án của mình. ",
    "PositionPlaceholder": "Vị trí của bạn tại công ty của bạn.",
    "SelectExperienceYearPlaceholder": "Bạn đã làm việc trong lĩnh vực phần mềm được bao nhiêu năm",
    "FullNamePlaceholder": "Tên đầy đủ của bạn.",
    "CompanyNamePlaceholder": "Tên công ty của bạn.",
    "SelectCompanySizePlaceholder": "Số nhân viên",
    "ImagePlaceholder": "Hình ảnh của bạn.",
    "SelectCountryPlaceholder": "Quốc gia của bạn.",
    "YouAreNotAuthorizedToWriteTestimonial": "Để có thể viết thư chứng thực, bạn phải đăng nhập.",
    "UnAuthorizeTestimonialInfo": "Ý kiến của bạn rất quan trọng! ",
    "TheFileIsTooLargeForImage": "Ảnh hồ sơ của bạn không thể lớn hơn 1 MB",
    "ThisExtensionIsNotAllowedForImage": "Phần mở rộng này không được phép.",
    "FileUploadError": "Lỗi tải tập tin lên",
    "TestimonialSend": "Cảm ơn! ",
    "Title": "Tiêu đề",
    "TitlePlaceholder": "Nhà phát triển phần mềm, CTO, v.v.",
    "Characters": "Ký tự",
    "ABPTestimonialDescription": "Khung ABP: Hãy nghe lời chứng thực của bạn",
    "LeaveUsReview": "Để lại cho chúng tôi xem xét",
    "DocumentationButtonTitle": "Tài liệu",
    "ABPVideoCoursesDescription": "Tìm hiểu những kiến ​​thức cơ bản về Khung ABP thông qua các khóa học video do nhóm ABP tạo.",
    "ABPVideoCoursesPageDescription": "Tìm hiểu những kiến ​​thức cơ bản về Khung ABP thông qua các khóa học video do nhóm ABP tạo ra. Trong loạt video này, bạn sẽ tìm hiểu các chủ đề thiết yếu của Khung ABP. Các con số trên mỗi video được viết theo quy trình học tập.",
    "ABPVideoCoursesTitle": "Video cần thiết của ABP"
  }
}