{
  "culture": "cs",
  "texts": {
    "OrganizationManagement": "Řízení organizace",
    "OrganizationList": "Seznam organizací",
    "Volo.AbpIo.Commercial:010003": "Nejste vlastníkem této organizace!",
    "OrganizationNotFoundMessage": "Nebyla nalezena žádná organizace!",
    "DeveloperCount": "Alokovaní/celkový počet vývojářů",
    "QuestionCount": "Zbývající/celkový počet otázek",
    "Unlimited": "Neomezený",
    "Owners": "Vlastníci",
    "Owner": "Majitel",
    "AddMember": "Přidat člena",
    "AddNewOwner": "Přidat nového vlastníka",
    "AddNewDeveloper": "Přidat nového vývojáře",
    "UserName": "uživatelské jméno",
    "Name": "název",
    "EmailAddress": "Emailová adresa",
    "Developers": "Vývojáři",
    "LicenseType": "Typ licence",
    "Manage": "Spravovat",
    "SetDefault": "Nastavit jako výchozí",
    "DefaultOrganization": "Výchozí",
    "StartDate": "Datum začátku",
    "EndDate": "Datum ukončení",
    "Modules": "Moduly",
    "LicenseExtendMessage": "Datum ukončení vaší licence je prodlouženo na {0}",
    "LicenseUpgradeMessage": "Vaše licence je upgradována na {0}",
    "LicenseExtendAdnUpgradeMessage": "Vaše licence byla prodloužena do {0} a váš licenční plán je upgradován na {1}.",
    "LicenseAddDeveloperMessage": "Do vaší licence bylo přidáno {0} vývojářů",
    "Volo.AbpIo.Commercial:010004": "Nelze najít zadaného uživatele! Uživatel musí být již zaregistrován.",
    "MyOrganizations": "Moje organizace",
    "ApiKey": "API klíč",
    "UserNameNotFound": "Neexistuje žádný uživatel s uživatelským jménem {0}",
    "SuccessfullyAddedToNewsletter": "Děkujeme, že jste se přihlásili k odběru našeho newsletteru!",
    "MyProfile": "Můj profil",
    "EmailNotValid": "Prosím zadejte platnou emailovou adresu.",
    "JoinOurMarketingNewsletter": "Připojte se k našemu marketingovému zpravodaji",
    "WouldLikeToReceiveMarketingMaterials": "Chci dostávat marketingové materiály, jako jsou nabídky produktů a speciální nabídky.",
    "StartUsingYourLicenseNow": "Začněte používat svou licenci nyní!",
    "WelcomePage": "Uvítací stránka",
    "UnsubscriptionExpireEmail": "Odhlásit odběr e-mailů s připomenutím data vypršení platnosti licence",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Toto e-mailové předplatné obsahuje pouze připomenutí data vypršení platnosti vaší licence.",
    "UnsubscribeFromLicenseExpireEmails": "Pokud si nepřejete dostávat e-maily o datu vypršení platnosti vaší licence, můžete se kdykoli odhlásit.",
    "Unsubscribe": "Odhlásit odběr",
    "NotOrganizationMember": "Nejste členem žádné organizace.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Úspěšně odhlášeno",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Již nebudete dostávat e-maily s upozorněním na datum vypršení platnosti licence.",
    "IndexPageHeroSection": "<span class=\"first-line\">Kompletní</span><span class=\"second-line\"> platforma pro vývoj webu</span><span class=\"third-line\">vestavěná na <img src= \"{0}\" width=\"110\" class=\"ml-1\" /> framework</span>",
    "AbpCommercialShortDescription": "ABP Commercial poskytuje předpřipravené aplikační moduly, nástroje pro rychlý vývoj aplikací, profesionální témata uživatelského rozhraní, prémiovou podporu a další.",
    "LiveDemo": "Živá ukázka",
    "LiveDemoLead": "<a href=\"{0}\">{1}</a> pomocí vašeho účtu ABP,  <a href=\"{2}\">{3}</a> na abp.io.<br/>Nebo vyplňte níže uvedený formulář a vytvořte si nyní živou ukázku",
    "ThereIsAlreadyAnAccountWithTheGivenEmailAddress": "Zadaná e-mailová adresa <b>{0}</b> je již registrována.<br/> Můžete se přihlásit se svým účtem a pokračovat.",
    "GetLicence": "Získejte licenci",
    "Application": "aplikace",
    "StartupTemplates": "Spouštěcí šablony",
    "Startup": "Spuštění",
    "Templates": "Šablony",
    "Developer": "Vývojář",
    "Tools": "Nástroje",
    "Premium": "Pojistné",
    "PremiumSupport": "Prémiová podpora",
    "PremiumForumSupport": "Prémiová podpora fóra",
    "UI": "UI",
    "Themes": "Témata",
    "JoinOurNewsletter": "Připojte se k našemu zpravodaji",
    "Send": "Poslat",
    "WhatIsABPFramework": "CO JE RÁMEC ABP?",
    "OpenSourceBaseFramework": "Open Source Base Framework",
    "ABPFrameworkExplanation": "<p class=\"lead\">ABP Commercial je založeno na ABP Framework, open source a komunitou řízeném webovém aplikačním frameworku pro ASP.NET Core.</p><p>ABP Framework poskytuje vynikající infrastrukturu pro psaní udržitelných a rozšiřitelných a testovatelný kód s osvědčenými postupy.</p><p>Postaveno a integrováno do oblíbených nástrojů, které již znáte. Nízká křivka učení, snadná adaptace, pohodlný vývoj.</p>",
    "Modular": "Modulární",
    "MicroserviceCompatible": "Kompatibilní s mikroservisy",
    "DomainDrivenDesignInfrastructure": "Domain Driven Design Infrastructure",
    "MultiTenancy": "Vícenásobný nájem",
    "DistributedMessaging": "Distribuované zasílání zpráv",
    "DynamicProxying": "Dynamické proxy",
    "BackgroundJobs": "Práce na pozadí",
    "AuditLogging": "Protokolování auditu",
    "BLOBStoring": "Ukládání BLOB",
    "BundlingMinification": "Sdružování a minifikace",
    "AdvancedLocalization": "Pokročilá lokalizace",
    "ManyMore": "Mnoho dalších",
    "ExploreTheABPFramework": "Prozkoumejte rámec ABP",
    "WhyUseTheABPCommercial": "Proč používat ABP Commercial?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\">Vytváření webových aplikací na podnikové úrovni může být složité a časově náročné.</p><p>ABP Commercial nabízí perfektní základní infrastrukturu nezbytnou pro všechna moderní ASP.NET Core podnikové třídy založená řešení. Od návrhu až po nasazení je celý vývojový cyklus podpořen vestavěnými funkcemi a moduly ABP.</p>",
    "StartupTemplatesShortDescription": "Spouštěcí šablony vám umožní spustit projekt během několika sekund.",
    "UIFrameworksOptions": "možnosti rámců uživatelského rozhraní;",
    "DatabaseProviderOptions": "Možnosti poskytovatele databáze;",
    "PreBuiltApplicationModules": "Předem postavené aplikační moduly",
    "PreBuiltApplicationModulesShortDescription": "Většina běžných požadavků na aplikace je pro vás již vyvinuta jako opakovaně použitelné moduly.",
    "Account": "Účet",
    "Blogging": "Blogování",
    "Identity": "Identita",
    "IdentityServer": "Server identity",
    "Saas": "Saas",
    "LanguageManagement": "Správa jazyků",
    "TextTemplateManagement": "Správa šablony textu",
    "See All Modules": "SeeAllModules",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "ABP Suite je doplňkovým nástrojem k ABP Commercial.",
    "AbpSuiteExplanation": "Umožňuje vám vytvořit webové stránky během několika minut. Je to globální nástroj .NET Core, který lze nainstalovat z příkazového řádku. Dokáže vytvořit nové řešení ABP, generovat stránky CRUD z databáze do front-endu.",
    "Details": "Podrobnosti",
    "LeptonTheme": "Téma Lepton",
    "ProfessionalModernUIThemes": "Profesionální, moderní témata uživatelského rozhraní",
    "LeptonThemeExplanation": "Lepton poskytuje řadu témat pro správu Bootstrap, která slouží jako pevný základ pro jakýkoli projekt vyžadující řídicí panel správce.",
    "DefaultTheme": "Výchozí téma",
    "MaterialTheme": "Materiálové téma",
    "Default2Theme": "Výchozí 2 motiv",
    "DarkTheme": "Tmavé téma",
    "DarkBlueTheme": "Tmavě modré téma",
    "LightTheme": "Světlé téma",
    "ProudToWorkWith": "S hrdostí pracovat",
    "OurConsumers": "Na ABP Commercial spoléhají tisíce podniků a vývojářů ve více než 70 zemích světa.",
    "JoinOurConsumers": "Připojte se k nim a rychle vytvářejte úžasné produkty.",
    "AdditionalServicesExplanation": "Potřebujete doplňkové nebo zakázkové služby? <strong>My a naši partneři můžeme poskytnout;</strong>",
    "CustomProjectDevelopment": "Vývoj projektů na zakázku",
    "CustomProjectDevelopmentExplanation": "Specializovaní vývojáři pro vaše zakázkové projekty.",
    "PortingExistingProjects": "Portování stávajících projektů",
    "PortingExistingProjectsExplanation": "Migrace vašich starších projektů na platformu ABP.",
    "LiveSupport": "Živá podpora",
    "LiveSupportExplanation": "Možnost živé vzdálené podpory, když ji potřebujete.",
    "Training": "Výcvik",
    "TrainingExplanation": "Specializované školení pro vaše vývojáře.",
    "OnBoarding": "Přihlášení",
    "OnBoardingExplanation": "Pomozte nastavit vývojové prostředí, prostředí CI a CD.",
    "PrioritizedTechnicalSupport": "Prioritní technická podpora",
    "PremiumSupportExplanation": "Kromě skvělé komunitní podpory rámce ABP odpovídá náš tým podpory s vysokou prioritou na technické otázky a problémy komerčních uživatelů.",
    "SeeTheSupportOptions": "Viz Možnosti podpory",
    "Contact": "Kontakt",
    "TellUsWhatYouNeed": "Řekněte nám, co potřebujete.",
    "YourMessage": "Vaše zpráva",
    "YourFullName": "Vaše celé jméno",
    "FirstNameField": "Jméno",
    "LastNameField": "Příjmení",
    "EmailField": "Emailová adresa",
    "YourEmailAddress": "Vaše emailová adresa",
    "ValidEmailAddressIsRequired": "Je vyžadována platná e-mailová adresa.",
    "HowMayWeHelpYou": "Jak vám můžeme pomoci?",
    "SendMessage": "Poslat zprávu",
    "Success": "Úspěch",
    "WeWillReplyYou": "Obdrželi jsme vaši zprávu a brzy se vám ozveme.",
    "GoHome": "Jdi domů",
    "CreateLiveDemo": "Vytvořit živé demo",
    "CreateLiveDemoDescription": "Po odeslání tohoto formuláře obdržíte e-mail obsahující odkaz na vaši ukázku.",
    "RegisterToTheNewsletter": "Zaregistrujte se k odběru newsletteru a získejte informace o ABP.IO, včetně nových verzí atd.",
    "EnterYourEmailOrLogin": "Chcete-li vytvořit ukázku, zadejte svou e-mailovou adresu nebo se <a href=\"{0}\">přihlaste</a> pomocí svého stávajícího účtu.",
    "ApplicationTemplate": "Šablona aplikace",
    "ApplicationTemplateExplanation": "Šablona spuštění aplikace se používá k vytvoření nové webové aplikace.",
    "EfCoreProvider": "Entity Framework (podporuje SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\">a další</a>)",
    "AlreadyIncludedInTemplateModules": "V této šabloně jsou již zahrnuty a nakonfigurovány následující moduly:",
    "ApplicationTemplateArchitecture": "Tato šablona aplikace také podporuje vrstvenou architekturu, kde jsou vrstva uživatelského rozhraní, vrstva API a ověřovací služba fyzicky odděleny.",
    "SeeTheGuideOrGoToTheLiveDemo": "Technické informace o této šabloně najdete v příručce pro vývojáře nebo přejděte na živou ukázku.",
    "DeveloperGuide": "Příručka pro vývojáře",
    "ModuleTemplate": "Šablona modulu",
    "ModuleTemplateExplanation1": "Chcete vytvořit modul a znovu jej použít v různých aplikacích? Tato spouštěcí šablona připraví vše pro spuštění vytvoření opakovaně použitelného <strong>aplikačního modulu</strong> nebo <strong>mikroslužby</strong>.",
    "ModuleTemplateExplanation2": "<p>Můžete podporovat jeden nebo více rámců uživatelského rozhraní, jednoho nebo více poskytovatelů databází pro jeden modul. Spouštěcí šablona je nakonfigurována tak, aby kromě infrastruktury pro testování jednotek a integrace spouštěla a <strong>testovala váš modul</strong> v minimální aplikaci. </p> <p>Technické informace o této šabloně naleznete v příručce pro vývojáře.</p>",
    "WithAllStyleOptions": "se všemi stylovými možnostmi",
    "Demo": "Demo",
    "SeeAllModules": "Viz Všechny moduly",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) je nástroj příkazového řádku pro provádění některých běžných operací pro řešení založená na ABP.",
    "ABPSuiteEasilyCURD": "ABP Suite je nástroj, který vám umožní snadno vytvářet stránky CRUD",
    "WeAreHereToHelp": "Jsme tu, abychom vám <span class=\"zero-text\">Pomohli</span>",
    "BrowseOrAskQuestion": "Můžete procházet naše témata nápovědy nebo vyhledávat v často kladených dotazech, případně nám můžete položit otázku pomocí <a href=\"{0}\" class=\"text-success\">kontaktního formuláře</a>.",
    "SearchQuestionPlaceholder": "Hledejte v často kladených otázkách",
    "WhatIsTheABPCommercial": "Co je ABP Commercial?",
    "WhatAreDifferencesThanAbpFramework": "Jaké jsou rozdíly mezi open source ABP Framework a ABP Commercial?",
    "AbpCommercialMetaTitle": "{0} | ABP Commercial",
    "AbpCommercialMetaDescription": "Komplexní platforma pro vývoj webu na ABP Framework s předpřipravenými moduly, spouštěcími šablonami, rychlými vývojovými nástroji, profesionálními tématy uživatelského rozhraní a prémiovou podporou.",
    "ABPCommercialExplanation": "ABP Commercial je sada prémiových modulů, nástrojů, témat a služeb postavených na open source <a target=\"_blank\" href=\"{0}\">rámci ABP</a>. ABP Commercial je vyvíjen a podporován stejným týmem za rámcem ABP.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\">rámec ABP</a> je modulární, tematicky kompatibilní rámec pro vývoj aplikací kompatibilní s mikroslužbami pro ASP.NET Core. Poskytuje kompletní architekturu a silnou infrastrukturu, abyste se mohli soustředit na svůj vlastní obchodní kód, než abyste se opakovali u každého nového projektu. Je založen na osvědčených postupech vývoje softwaru a oblíbených nástrojích, které již znáte. </p> <p> ABP framework je zcela zdarma, open source a řízený komunitou. Poskytuje také bezplatné téma a některé předpřipravené moduly (např. správa identit a správa tenantů).</p>",
    "VisitTheFrameworkVSCommercialDocument": "Další informace <a href=\"{0}\" target=\"_blank\"> {1} </a> naleznete na následujícím odkazu",
    "ABPCommercialFollowingBenefits": "ABP Commercial přidává k rámci ABP následující výhody;",
    "Professional": "Profesionální",
    "UIThemes": "Témata uživatelského rozhraní",
    "EnterpriseModules": "Předem připravené <a href=\"{0}\">aplikační moduly</a> připravené pro podniky, bohaté na funkce (např. správa Identity Server, správa SaaS, správa jazyků)",
    "ToolingToSupport": "Nástroje pro podporu vaší produktivity vývoje (např. <a href=\"{0}\">ABP Suite</a>)",
    "PremiumSupportLink": "Prémiová <a href=\"{0}\" target=\"_blank\">podpora</a>",
    "WhatDoIDownloadABPCommercial": "Co si stáhnu, když zakoupím ABP Commercial?",
    "CreateUnlimitedSolutions": "Jakmile si zakoupíte licenci ABP Commercial, budete moci vytvářet neomezená řešení, jak je popsáno v dokumentu <a href=\"{0}\">Začínáme</a>.",
    "ABPCommercialSolutionExplanation": "Když vytvoříte novou aplikaci, získáte řešení Visual Studio (spouštěcí šablonu) na základě vašich preferencí. Stažené řešení má již nainstalované a nakonfigurované komerční moduly a motivy. Pokud chcete, můžete odebrat předinstalovaný modul nebo přidat další modul. Všechny moduly a motivy se ve výchozím nastavení používají jako balíčky NuGet/NPM.",
    "StartDevelopWithTutorials": "Stažené řešení je dobře navrženo a zdokumentováno. Podle <a href=\"{0}\">výukových programů</a> můžete začít vyvíjet svůj vlastní obchodní kód na jeho základě",
    "TryTheCommercialDemo": "Můžete vyzkoušet <a href=\"{0}\">ukázku</a> a prohlédnout si ukázkovou aplikaci vytvořenou pomocí startovací šablony ABP Commercial.",
    "HowManyProducts": "Kolik různých produktů/řešení mohu vytvořit pomocí ABP Commercial?",
    "HowManyProductsExplanation": "Neexistuje žádný limit pro vytvoření projektu ABP. Můžete vytvořit tolik projektů, kolik chcete, vyvinout je a nahrát je na různé servery.",
    "HowManyDevelopers": "Kolik vývojářů může pracovat na ABP Commercial?",
    "HowManyDevelopersExplanation": "Licence ABP Commercial jsou na vývojáře. Různé typy licencí mají různé limity pro vývojáře. K jakémukoli typu licence však můžete kdykoli přidat další vývojáře. Na stránce <a href=\"{0}\">ceny</a> najdete typy licencí, limity pro vývojáře a další náklady na vývojáře.",
    "ChangingLicenseType": "Mohu upgradovat svůj typ licence později?",
    "ChangingLicenseTypeExplanation": "Můžete upgradovat na vyšší licenci zaplacením rozdílu během období aktivní licence. Když upgradujete na vyšší licenční plán, získáte výhody nového plánu, ale upgrade licence nezmění datum vypršení licence. Kromě toho můžete ke své stávající licenci přidat také nová vývojářská místa, viz \"Kolik vývojářů může pracovat na ABP Commercial?\"",
    "LicenseExtendUpgradeDiff": "Jaký je rozdíl mezi rozšířením licence a upgradem?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Rozšíření:</strong> Rozšířením/obnovením licence budete i nadále získávat prémiovou podporu a získávat větší či menší aktualizace pro moduly a motivy. Kromě toho budete moci pokračovat ve vytváření nových projektů. A stále budete moci používat ABP Suite, který urychluje váš vývoj. Když prodloužíte licenci, k datu vypršení platnosti licence se přičte 1 rok.<hr/> <strong>Upgrade:</strong> Upgradem vaší licence budete povýšeni na vyšší licenční plán, který vám umožní získat další výhody. Podívejte se na <a href=\"/pricing\">tabulku porovnání licencí</a> , abyste viděli rozdíly mezi licenčními plány. <strong>Na druhou stranu, když upgradujete, datum vypršení platnosti vaší licence se nezmění!</strong> Chcete-li prodloužit datum ukončení licence, musíte prodloužit licenci.",
    "LicenseRenewalCost": "Kolik stojí obnovení licence po 1 roce?",
    "LicenseRenewalCostExplanation": "Cena za obnovení (prodloužení) standardní týmové licence je ${0}, standardní obchodní licence je ${1} a standardní podnikové licence je ${2}. Pokud již jste zákazníkem, <a href='{3}' target='_blank'>přihlaste se ke svému účtu</a> a zkontrolujte dostupné ceny za obnovení.",
    "HowDoIRenewMyLicense": "Jak obnovím licenci?",
    "HowDoIRenewMyLicenseExplanation": "Licenci můžete obnovit tak, že přejdete na <a href='{0}' target='_blank'>stránku správy organizace</a>. Abyste mohli využít našich zvýhodněných sazeb za předčasné obnovení, ujistěte se, že jste licenci obnovili před vypršením platnosti. Nebojte se však, že byste nevěděli, kdy vaše příležitost k předčasnému obnovení skončí. Před vypršením předplatného obdržíte 3 e-maily s upomínkou. Odešleme je 30 dní, 7 dní a 1 den před vypršením platnosti.",
    "IsSourceCodeIncluded": "Obsahuje moje licence zdrojový kód komerčních modulů a témat?",
    "IsSourceCodeIncludedExplanation1": "Závisí na typu zakoupené licence:",
    "IsSourceCodeIncludedExplanation2": "<strong>Tým</strong>: Vaše řešení používá moduly a témata jako balíčky NuGet a NPM. Nezahrnuje jejich zdrojový kód. Tímto způsobem můžete snadno upgradovat tyto moduly a motivy, kdykoli je k dispozici nová verze. Nemůžete však získat zdrojový kód modulů a témat.",
    "IsSourceCodeIncludedExplanation3": "<strong>Business/Enterprise</strong>: Kromě týmové licence si můžete stáhnout zdrojový kód libovolného modulu nebo motivu, který potřebujete. Můžete dokonce odstranit odkazy na balíček NuGet/NPM pro konkrétní modul a přidat jeho zdrojový kód přímo do vašeho řešení, abyste jej plně změnili.",
    "IsSourceCodeIncludedExplanation4": "<p>Zahrnutí zdrojového kódu modulu do vašeho řešení vám dává maximální svobodu přizpůsobit daný modul. Poté však nebude možné modul automaticky upgradovat při vydání nové verze.</p><p>Žádná z licencí neobsahuje zdrojový kód ABP Suite, což je externí nástroj, který za vás generuje kód a pomáhá k vašemu vývoji.</p><p>Další rozdíly mezi typy licencí naleznete na stránce <a href=\"{0}\">ceny</a>.</p>",
    "ChangingDevelopers": "Mohu v budoucnu změnit registrované vývojáře své organizace?",
    "ChangingDevelopersExplanation": "Kromě přidání nových vývojářů do vaší licence můžete také změnit stávající vývojáře (můžete odebrat vývojáře a přidat nového na stejné místo) bez jakýchkoli dalších nákladů.",
    "WhatHappensWhenLicenseEnds": "Co se stane po skončení licenčního období?",
    "WhatHappensWhenLicenseEndsExplanation1": "Komerční licence ABP je <a href=\"{0}\" target=\"_blank\">trvalá licence</a>. Po vypršení platnosti licence můžete pokračovat ve vývoji svého projektu. A nejste povinni licenci obnovovat. Vaše licence je dodávána s ročním plánem aktualizací a podpory již v balení. Abyste mohli i nadále získávat nové funkce, vylepšení výkonu, opravy chyb, podporu a pokračovat v používání sady ABP Suite, musíte svou licenci obnovit. Po vypršení platnosti licence;",
    "WhatHappensWhenLicenseEndsExplanation2": "Pomocí ABP Commercial nemůžete vytvářet nová řešení, ale můžete navždy pokračovat ve vývoji stávajících aplikací.",
    "WhatHappensWhenLicenseEndsExplanation3": "Aktualizace modulů a témat budete moci získat v rámci své verze MINOR (kromě verzí RC nebo Preview). Například: pokud používáte modul ve verzi 3.2.0, můžete stále získávat aktualizace pro verzi 3.2.x (v3.2.1, v3.2.5... atd.) tohoto modulu. Nemůžete však získat aktualizace pro další hlavní nebo vedlejší verzi (např. v3.3.0, v3.3.3, 4.x.x... atd.). Například když vám vypršela licence, poslední verze byla v4.4.3 a později byla zveřejněna jak verze 4.4.4, tak verze 4.5.0, měli byste přístup k verzi v4.4.X, ale k verzi v4.5.X byste přístup neměli.",
    "WhatHappensWhenLicenseEndsExplanation4": "Po skončení platnosti licence nelze instalovat nové moduly a motivy přidané do platformy ABP Commercial.",
    "WhatHappensWhenLicenseEndsExplanation5": "Sadu ABP Suite nelze použít.",
    "WhatHappensWhenLicenseEndsExplanation6": "Již nelze získat <a href=\"{0}\">prémiovou podporu</a>.",
    "WhatHappensWhenLicenseEndsExplanation7": "Pokud chcete i nadále využívat tyto výhody, můžete svou licenci prodloužit (obnovit). Pokud prodloužíte licenci do <strong>{3} dní</strong> po vypršení platnosti licence, budou uplatněny následující slevy: Týmová licence {0}; Obchodní licence {1}; Enterprise Licence {2}.",
    "discountForYears": "{0}% sleva po dobu {1} let",
    "WhatHappensWhenLicenseEndsExplanation8": "Projekty ABP, které jste vygenerovali, nejsou uloženy na našich serverech. Proto je vaší odpovědností uchovat si zdrojový kód, který stahujete. Když vyprší platnost vaší licence, neexistuje způsob, jak získat zdrojový kód vygenerovaného projektu ABP.",
    "WhenShouldIRenewMyLicense": "Kdy bych měl obnovit licenci?",
    "WhenShouldIRenewMyLicenseExplanation": "Pokud si licenci obnovíte do <strong>{3} dní</strong> po vypršení platnosti licence, budou uplatněny následující slevy: Týmová licence {0}; Obchodní licence {1}; Enterprise Licence {2}. Pokud však licenci obnovíte po <strong>{3} měsíci</strong> od data vypršení platnosti vaší licence, cena za obnovení bude stejná jako cena za zakoupení licence a na obnovení nebude poskytnuta žádná sleva.",
    "TrialPlan": "Máte zkušební plán?",
    "TrialPlanExplanation": "Ano, pro zahájení bezplatné zkušební verze kontaktujte <a href=\"mailto:marketing@volosoft.com?subject=ABP Commercial — Trial License Request\">marketing@volosoft.com</a> . Nabízíme také 30denní záruku vrácení peněz za týmovou licenci, žádné otázky! Během prvních 30 dnů od zakoupení licence můžete požádat o vrácení celé částky. Za licence Business a Enterprise poskytujeme vrácení 60 % do 30 dnů. Je to proto, že licence Business a Enterprise obsahují úplný zdrojový kód všech modulů a témat.",
    "DoYouAcceptBankWireTransfer": "Přijímáte bankovní převod?",
    "DoYouAcceptBankWireTransferExplanation": "Ano, přijímáme bankovní převod.<br />Po zaslání licenčního poplatku bankovním převodem nám zašlete e-mail na adresu accounting@abp.io potvrzení a požadovaný typ licence. Informace o našem mezinárodním bankovním účtu:",
    "HowToUpgrade": "Jak upgradovat stávající aplikace, když je k dispozici nová verze?",
    "HowToUpgradeExplanation1": "Když vytvoříte novou aplikaci pomocí ABP Commercial, všechny moduly a téma se použijí jako balíčky NuGet a NPM. Takže můžete snadno upgradovat balíčky, když je k dispozici nová verze.",
    "HowToUpgradeExplanation2": "Kromě standardních upgradů NuGet/NPM poskytuje <a href=\"{0}\">ABP CLI</a> aktualizační příkaz, který automaticky vyhledá a upgraduje všechny balíčky související s ABP ve vašem řešení.",
    "DatabaseSupport": "Které databázové systémy jsou podporovány?",
    "DatabaseSupportExplanation": "Samotný ABP Framework je databázový agnostik a může ze své podstaty spolupracovat s jakýmkoliv poskytovatelem databáze. Seznam aktuálně implementovaných poskytovatelů naleznete v <a href=\"{0}\" target=\"_blank\">dokumentu o přístupu k datům</a>.",
    "UISupport": "Které rámce uživatelského rozhraní jsou podporovány?",
    "Supported": "Podporováno",
    "UISupportExplanation": "Samotný ABP Framework je agnostik UI frameworku a může pracovat s jakýmkoli UI frameworkem. Spouštěcí šablony, uživatelská rozhraní modulů a motivy však nebyly implementovány pro všechny rámce uživatelského rozhraní. Aktuální seznam možností uživatelského rozhraní naleznete v <a href=\"{0}\">dokumentu Začínáme</a>.",
    "MicroserviceSupport": "Podporuje architekturu mikroslužeb?",
    "MicroserviceSupportExplanation1": "Jedním z hlavních cílů rámce ABP je poskytnout pohodlnou infrastrukturu pro vytváření řešení mikroslužeb. Podívejte se na dokument <a href=\"{0}\">architektura mikroslužeb</a>, abyste pochopili, jak pomáhá vytvářet systémy mikroslužeb.",
    "MicroserviceSupportExplanation2": "Všechny komerční moduly ABP jsou navrženy tak, aby podporovaly scénáře nasazení mikroslužeb (s vlastním rozhraním API a databází) podle dokumentu <a href=\"{0}\">doporučené postupy pro vývoj modulů</a>.",
    "MicroserviceSupportExplanation3": "Poskytujeme ukázkové <a href=\"{0}\">demonstrační řešení mikroslužeb</a>, které demonstruje implementaci architektury mikroslužeb, které vám pomůže vytvořit si vlastní řešení.",
    "MicroserviceSupportExplanation4": "Krátká odpověď je tedy „<strong>ano, podporuje architekturu mikroslužeb</strong>“.",
    "MicroserviceSupportExplanation5": "Systém mikroslužeb je však řešením a každé řešení bude mít jiné požadavky, topologii sítě, komunikační scénáře, možnosti autentizace, rozhodnutí o oddělení/sdílení databáze, konfiguraci běhu, integraci systémů třetích stran a mnoho dalších.",
    "MicroserviceSupportExplanation6": "ABP Framework a ABP Commercial poskytují infrastrukturu pro scénáře mikroslužeb, moduly kompatibilní s mikroslužbami, vzorky a dokumentaci, které vám pomohou vytvořit si vlastní řešení. Neočekávejte však, že si přímo stáhnete své vysněné řešení předem vytvořené pro vás. Budete tomu muset porozumět a některé části spojit dohromady na základě vašich požadavků.",
    "WhereCanIDownloadSourceCode": "Kde si mohu stáhnout zdrojový kód?",
    "WhereCanIDownloadSourceCodeExplanation": "Zdrojový kód všech modulů ABP, balíčků Angular a témat si můžete stáhnout prostřednictvím ABP Suite nebo ABP CLI. Viz <a href=\"{0}\">Jak stáhnout zdrojový kód?</a>",
    "ComputerLimitation": "Kolik počítačů se může vývojář přihlásit při vývoji ABP?",
    "ComputerLimitationExplanation": "Výslovně povolujeme <strong>{0} počítače</strong> na jednotlivého/licencovaného vývojáře. Kdykoli je potřeba, aby vývojář vyvíjel produkty ABP Commercial na třetím počítači, měl by být zaslán e-mail na adresu license@abp.io s vysvětlením situace a my poté v našem systému provedeme příslušnou alokaci.",
    "RefundPolicy": "Máte zásady pro vrácení peněz?",
    "RefundPolicyExplanation": "O vrácení peněz můžete požádat do <strong>30 dnů</strong> od zakoupení licence. Typy licencí Business a Enterprise mají možnost stažení zdrojového kódu, proto nejsou refundace dostupné pro Business a Enterprise (a žádné licence, které zahrnují právo na získání zdrojového kódu). Kromě toho se za obnovení a nákupy druhé licence nevrací žádné peníze.",
    "HowCanIRefundVat": "Jak mohu vrátit DPH?",
    "HowCanIRefundVatExplanation1": "Pokud jste platbu provedli pomocí 2Checkout, můžete vrátit DPH prostřednictvím svého účtu 2Checkout:",
    "HowCanIRefundVatExplanation2": "Přihlaste se ke svému účtu <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\">2Checkout</a>",
    "HowCanIRefundVatExplanation3": "Najděte příslušnou objednávku a stiskněte „Vrácení opožděné DPH“ (zadejte své DIČ)",
    "HowCanIGetMyInvoice": "Jak mohu získat fakturu?",
    "HowCanIGetMyInvoiceExplanation": "Pro zakoupení licence existují 2 platební brány: Iyzico a 2Checkout. Pokud si zakoupíte licenci prostřednictvím brány 2Checkout, odešle se faktura ve formátu PDF na vaši e-mailovou adresu, viz <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How- do-invoices-work\">2Fakturace Checkout.</a> Pokud nakupujete prostřednictvím brány Iyzico, s vlastním nákupním odkazem nebo bankovním převodem, připravíme a zašleme vaši fakturu. Fakturu si můžete vyžádat nebo stáhnout na <a href=\"{0}\">stránce správy organizace</a>. Než nás budete kontaktovat ohledně faktury, zkontrolujte stránku správy vaší organizace!",
    "Forum": "Fórum",
    "SupportExplanation": "Licence ABP Commercial poskytuje prémiovou podporu fóra týmem složeným z odborníků na ABP Framework.",
    "PrivateTicket": "Soukromá vstupenka",
    "PrivateTicketExplanation": "Enterprise License také zahrnuje soukromou podporu s e-mailovým a lístkovým systémem.",
    "AbpSuiteExplanation1": "ABP Suite vám umožňuje vytvářet webové stránky během několika minut. Je to globální nástroj .NET Core, který lze nainstalovat z příkazového řádku.",
    "AbpSuiteExplanation2": "Dokáže vytvořit nové řešení ABP, generovat stránky CRUD z databáze do front-endu. Technický přehled naleznete v <a href=\"{0}\">dokumentu</a>",
    "FastEasy": "Rychlé a snadné",
    "AbpSuiteExplanation3": "ABP Suite vám umožňuje snadno vytvářet stránky CRUD. Stačí definovat vaši entitu a její vlastnosti, zbytek nechte na ABP Suite za vás! ABP Suite vygeneruje veškerý potřebný kód pro vaši stránku CRUD během několika sekund. Podporuje uživatelská rozhraní Angular, MVC a Blazor.",
    "RichOptions": "Bohaté možnosti",
    "AbpSuiteExplanation4": "ABP Suite podporuje více možností uživatelského rozhraní, jako jsou <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\">Razor Pages</a> a <a href=\"https:/ /angular.io\">Angular</a>. Podporuje také více databází jako <a href=\"https://www.mongodb.com\">MongoDB</a> a všechny databáze podporované <strong>EntityFramework Core< /strong> (MS SQL Server, Oracle, MySql, PostgreSQL a <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\">další </a>).",
    "AbpSuiteExplanation5": "Dobrá věc je, že se o tyto možnosti nemusíte starat. ABP Suite rozumí typu vašeho projektu a vygeneruje kód pro váš projekt a umístí vygenerovaný kód na správné místo ve vašem projektu.",
    "SourceCode": "Zdrojový kód",
    "AbpSuiteExplanation6": "ABP Suite vygeneruje zdrojový kód za vás! Negeneruje magické soubory pro generování webové stránky. ABP Suite generuje zdrojový kód pro <strong>Entity, Repository, Application Service, Code First Migration, JavaScript/TypeScript a CSHTML/HTML</strong> a také nezbytná rozhraní. ABP Suite také generuje kód podle <strong>Best Practices</strong> vývoje softwaru, takže se nemusíte starat o kvalitu generovaného kódu.",
    "AbpSuiteExplanation7": "Protože máte zdrojový kód stavebních bloků vygenerované stránky CRUD ve správných aplikačních vrstvách, můžete snadno upravit zdrojový kód a vložit do vygenerovaného kódu svou vlastní/obchodní logiku.",
    "CrossPlatform": "Křížová platforma",
    "AbpSuiteExplanation8": "ABP Suite je vytvořen s .NET Core a je multiplatformní. Funguje jako webová aplikace na vašem místním počítači. Můžete jej spustit na <strong>Windows</strong>, <strong>Mac</strong> a <strong>Linuxu</strong>",
    "OtherFeatures": "Další funkce",
    "OtherFeatures1": "Snadno aktualizujte balíčky <strong>NuGet</strong> a <strong>NPM</strong> ve vašem řešení.",
    "OtherFeatures2": "Regeneruje již vygenerované stránky od začátku.",
    "OtherFeatures3": "Vytváří nová řešení",
    "ThanksForCreatingProject": "Děkujeme za vytvoření vašeho projektu!",
    "HotToRunSolution": "Jak spustit vaše řešení?",
    "HotToRunSolutionExplanation": "V dokumentu Začínáme se dozvíte, jak nakonfigurovat a spustit řešení.",
    "GettingStarted": "Začínáme",
    "WebAppDevTutorial": "Výukový program pro vývojáře webových aplikací",
    "WebAppDevTutorialExplanation": "Ukázku vývoje krok za krokem najdete v dokumentu výukového programu pro vývoj webových aplikací.",
    "Document": "Dokument",
    "UsingABPSuiteToCURD": "Použití ABP Suite pro generování stránek CRUD a nástroje",
    "SeeABPSuiteDocument": "Informace o použití ABP Suite naleznete v dokumentu ABP Suite.",
    "AskQuestionsOnSupport": "Otázky můžete klást na komerční podpoře ABP.",
    "Documentation": "Dokumentace",
    "SeeModulesDocument": "Seznam všech komerčních(pro) modulů a jejich dokumentů najdete v dokumentu modulů.",
    "Pricing": "Ceny",
    "PricingExplanation": "Vyberte si vlastnosti a funkce, které vaše firma dnes potřebuje. Snadno upgradujte, jak vaše firma roste.",
    "Team": "tým",
    "Business": "podnikání",
    "Enterprise": "Podnik",
    "Custom": "Zvyk",
    "IncludedDeveloperLicenses": "Zahrnuté vývojářské licence",
    "CustomLicenceOrAdditionalServices": "Potřebujete vlastní licenci nebo doplňkové služby?",
    "CustomOrVolumeLicense": "Vlastní nebo objemová licence",
    "LiveTrainingSupport": "Živé školení a podpora",
    "AndMore": "a více",
    "AdditionalDeveloperLicense": "Dodatečná licence pro vývojáře",
    "ProjectCount": "Počet projektů",
    "AllProModules": "Všechny profi moduly",
    "AllProThemes": "Všechna profesionální témata",
    "AllProStartupTemplates": "Všechny pro startovací šablony",
    "SourceCodeOfAllModules": "Zdrojový kód všech modulů",
    "SourceCodeOfAllThemes": "Zdrojový kód všech témat",
    "PerpetualLicense": "Trvalé povolení",
    "UnlimitedServerDeployment": "Neomezené nasazení serveru",
    "YearUpgrade": "1 rok upgrade",
    "YearPremiumForumSupport": "1 rok prémiové podpory fóra",
    "ForumSupportIncidentCountYear": "Počet incidentů podpory fóra/rok",
    "PrivateTicketEmailSupport": "Soukromá vstupenka a e-mailová podpora",
    "BuyNow": "Kup nyní",
    "PayViaAmexCard": "Jak mohu platit kartou AMEX?",
    "PayViaAmexCardDescription": "Výchozí platební brána „Iyzico“ může z důvodu bezpečnostních opatření odmítnout některé kreditní karty AMEX. V tomto případě můžete platit prostřednictvím alternativní platební brány '2Checkout'.",
    "ThankYou": "Děkuji",
    "InvalidReCaptchaErrorMessage": "Při ověřování reCAPTCHA došlo k chybě. Prosím zkuste to znovu.",
    "CompanyName": "Jméno společnosti",
    "YourCompanyName": "Název vaší společnosti",
    "FirstName": "Jméno",
    "LastName": "Příjmení",
    "Optional": "Volitelný",
    "YourFirstName": "Vaše jméno",
    "YourLastName": "Tvoje příjmení",
    "SpecialOffer": "Speciální nabídka",
    "SpecialOfferMessage": "Pospěš si! Ceny jsou platné po omezenou dobu.",
    "DiscountRequest": "Žádost o slevu",
    "DiscountRequestDescribeCustomerQuestion": "Která z následujících možností vás vystihuje?",
    "DiscountRequestStudentEmailMessage": "E-mailová adresa musí obsahovat 'edu'.",
    "DiscountRequestDeveloperCount": "Kolik je vás vývojářů?",
    "DiscountRequestDeveloperCountExceedMessage": "Neposkytujeme zlevněné licence pro společnosti, které mají více než {0} vývojářů.",
    "DiscountRequestOrganizationName": "Název společnosti/organizace/školy",
    "Website": "webová stránka",
    "GithubUsername": "Uživatelské jméno GitHub",
    "PhoneNumber": "Telefonní číslo",
    "Country": "Země",
    "DescribeABPCommercialUsage": "Popište projekt, který plánujete vyvinout na základě APB Commercial",
    "DiscountRequestCertifyInformationMessage": "Potvrzuji, že všechny údaje jsou pravdivé a správné.",
    "DiscountRequestReceived": "Obdrželi jsme vaši žádost o slevu.",
    "DiscountRequestStatusMessage": "Po kontrole informací, které jste nám poskytli, vám odpovíme.",
    "MVCOrRazorPages": "MVC (Razor Pages)",
    "Angular": "Hranatý",
    "Blazor": "Blazor",
    "New": "Nový",
    "MongoDB": "MongoDB",
    "EBookDDD": "Design řízený doménou elektronické knihy",
    "PracticalGuideForImplementingDDD": "Tato kniha je praktickým průvodcem pro implementaci Domain Driven Design s ABP Framework.",
    "IntroducingDDD": "Představujeme Domain Driven Design",
    "DDDLayersAndCleanArchitecture": "DDD vrstvy a čistá architektura",
    "LayeringOfADotnetSolution": "Vrstvení řešení .NET",
    "ImplementingDDDBuildingBlocks": "Implementace stavebních bloků DDD",
    "DomainVsApplicationLogic": "Doménová logika versus aplikační logika",
    "SamplesAndDiscussions": "Ukázky a diskuze",
    "Free": "Volný, uvolnit",
    "Download": "Stažení",
    "DDDEBook": "E-kniha DDD",
    "ImplementingDDD": "Implementace návrhu řízeného doménou",
    "DDDBookExplanation": "Praktická příručka pro implementaci Domain Driven Design s ABP Framework.",
    "Overview": "Přehled",
    "DDDBookPracticalGuide": "Toto je praktický průvodce pro implementaci Domain Driven Design (DDD). Zatímco detaily implementace spoléhají na infrastrukturu ABP Framework, základní koncepty, principy a vzory jsou použitelné v jakémkoli druhu řešení, i když se nejedná o řešení .NET.",
    "TableOfContents": "Obsah",
    "IntroductionToImplementingDDD": "Úvod do implementace doménově řízeného designu",
    "WhatIsDDD": "Co je to doménou řízený design?",
    "Implementation": "Implementace",
    "TheBigPicture": "Velký obraz",
    "TheBuildingBlock": "Stavební blok",
    "ExampleUseCase": "Příklad případu použití",
    "DomainAndApplicationLogic": "Doménová logika a aplikační logika",
    "Author": "Autor",
    "PublishedOn": "Zveřejněno dne",
    "Page": "Strana",
    "FreeEBook": "E-kniha zdarma",
    "EBookSignInForDownload": "Chcete-li stáhnout e-knihu, přihlaste se",
    "SignIn": "Přihlásit se",
    "Or": "Nebo",
    "TellUsAboutYourself": "Řekni nám něco o sobě",
    "Surname": "Příjmení",
    "DoYouAgreePrivacyPolicy": "Souhlasím se <a href=\"/TermsConditions\">Smluvními podmínkami<a/> a <a href=\"/Privacy\">Zásadami ochrany osobních údajů</a>.",
    "VolosoftMarketingInformationMessage": "Chci informace, tipy a nabídky o řešeních pro podniky a organizace a dalších produktech a službách Volosoft.",
    "VolosoftSharingInformationMessage": "Chtěl bych, aby Volosoft sdílel mé informace s vybranými partnery, abych mohl dostávat relevantní informace o jejich produktech a službách.",
    "WeWillSendYouADownloadLink": "Odkaz ke stažení e-knihy byl odeslán na adresu {0}.<br/> Zkontrolujte svou doručenou poštu/nevyžádané/spamové schránky!",
    "InvalidFormInputs": "Zadejte prosím platné informace uvedené ve formuláři.",
    "DDDBookEmailBody": "Děkuji. <br /> Chcete-li si knihu stáhnout, <a href=\"{0}\">klikněte sem</a>.",
    "StartFree": "Začněte zdarma",
    "FreeTrial": "Zkušební verze zdarma",
    "AcceptsMarketingCommunications": " Ano, chci dostávat komerční marketingová sdělení ABP.",
    "PurposeOfUsage": "Účel použití",
    "Choose": "- Vybrat -",
    "CompanyOrganizationName": "Název společnosti/organizace",
    "CompanySize": "Velikost společnosti",
    "Next": "další",
    "StartTrial": "Spusťte bezplatnou zkušební verzi",
    "ContactUsQuestions": "V případě dotazů nás kontaktujte",
    "TrialActivatedWarning": "Uživatel má nárok pouze na 1 bezplatné zkušební období. Zkušební období jste již využili.",
    "ActivationRequirement": "Jste poslední krok od zahájení zkušebního období.<br> Po kontrole vašich údajů vaši licenci aktivujeme. Jakmile bude vaše licence aktivována, zašleme vám e-mail na adresu <b>{0}</b> . Nebojte se, tento proces nebude trvat dlouho!",
    "SaveAndDownload": "Uložit a stáhnout",
    "CompanyNameValidationMessage": "Název společnosti je příliš dlouhý!",
    "AddressValidationMessage": "Adresa je příliš dlouhá!",
    "TaxNoValidationMessage": "Číslo daně/DPH je příliš dlouhé!",
    "NotesValidationMessage": "Pole poznámek je příliš dlouhé!",
    "CheckYourBillingInfo": "Fakturu můžete vytvořit pouze jednou! Před vytvořením faktury zkontrolujte své fakturační údaje.",
    "StartYourFreeTrial": "Začít bezplatnou zkušební verzi",
    "TrialLicenseModelInvalidErrorMessage": "Jedno z následujících polí je neplatné: Název země, Velikost společnosti, Odvětví nebo Účel použití.",
    "Trial": "zkušební",
    "Purchased": "Zakoupeno",
    "PurchaseNow": "Koupit nyní",
    "PurchaseTrialLicenseMessage": "Datum vypršení platnosti vaší licence je {0}. <br> Chcete-li nadále používat projekty, které jste vytvořili během bezplatného zkušebního období, musíte změnit licenční klíče ve svých souborech <code>appsettings.secrets.json</code>. Zde je váš licenční klíč:",
    "TrialLicenseExpireMessage": "Používáte zkušební licenci a platnost vaší zkušební licence vyprší dne {0}.",
    "TryForFree": "Zkus zadarmo",
    "TrialLicenseExpiredInfo": "Vaše zkušební licenční období vypršelo!",
    "DowngradeLicensePlan": "Mohu v budoucnu přejít na nižší licenční plán?",
    "DowngradeLicensePlanExplanation": "Stávající licenční plán nelze snížit. Můžete si však zakoupit nový nižší licenční plán a pokračovat ve vývoji s novou licencí. Po zakoupení nižší licence se stačí přihlásit k novému licenčnímu plánu pomocí příkazu ABP CLI: abp login <uživatelské jméno> -o <organizace> `.",
    "LicenseTransfer": "Lze licenci převést z jednoho vývojáře na druhého?",
    "LicenseTransferExplanation": "Ano! Zakoupením licence se stáváte jejím držitelem, a proto budete mít přístup na stránku pro správu organizace. Organizace má role vlastníka a vývojáře. Vlastníci mohou spravovat místa pro vývojáře a přiřazovat vývojáře. Každý přidělený vývojář se do systému přihlásí pomocí příkazu ABP CLI a bude mít oprávnění k vývoji a podpoře.",
    "UserOwnerDescription": "„Vlastník“ organizace je správcem tohoto účtu. Řídí organizaci nákupem licencí a přidělováním vývojářů. „Vlastník“ nemůže psát kód do komerčních projektů ABP, nemůže stáhnout vzorové projekty ABP a nemůže klást otázky na webu podpory. Pokud to všechno chcete udělat, musíte se přidat také jako vývojář.",
    "UserDeveloperDescription": "„Vývojáři“ mohou psát kód do komerčních projektů ABP, stahovat vzorové projekty ABP a klást otázky na webu podpory. Na druhou stranu „Vývojáři“ nemohou tuto organizaci řídit.",
    "RemoveCurrentUserFromOrganizationWarningMessage": "Odebíráte se ze své vlastní organizace. Tuto organizaci již nebudete moci spravovat, potvrzujete?",
    "RenewExistingOrganizationOrCreateNewOneMessage": "Licenci své organizace (organizací) můžete obnovit kliknutím na níže uvedená tlačítka „Prodloužit nyní“ a tím prodloužit datum vypršení platnosti licence o 1 rok. Pokud budete pokračovat v pokladně, budete mít novou organizaci. Chcete pokračovat s novou organizací?",
    "PurchaseTrialOrganizationOrCreateNewOneMessage": "Máte zkušební licenci. Chcete-li zakoupit zkušební licenci, klikněte na tlačítko Koupit nyní. Pokud budete pokračovat v pokladně, budete mít novou organizaci. Chcete pokračovat s novou organizací?",
    "ExtendNow": "Prodloužit nyní",
    "CreateNewOrganization": "Vytvořte novou organizaci",
    "RenewLicenseEarly": "Pokud si předčasně obnovím licenci, dostanu celý rok?",
    "RenewLicenseEarylExplanation": "Když obnovíte licenci před datem vypršení platnosti licence, bude k datu vypršení platnosti licence přidán 1 rok. Pokud například platnost vaší licence vyprší dne {0}-06-06 a obnovíte ji dne {0}-01-01, bude vaše nové datum vypršení platnosti licence {1}-06-06.",
    "OpenSourceWebApplication": "Open source webová aplikace",
    "CompleteWebDevelopment": "Kompletní vývoj webu",
    "ABPFrameworkDescription": "ABP Framework je kompletní infrastruktura pro vytváření moderních webových aplikací dodržováním osvědčených postupů vývoje softwaru a konvencí.",
    "CommunityDescription": "Podělte se o své zkušenosti s ABP Framework!",
    "GetStarted": "Začít",
    "Views": "pohledy",
    "LatestPosts": "Nejnovější příspěvky",
    "PreBuiltApplication": "Předem postavená aplikace",
    "DatabaseProviders": "Poskytovatelé databází",
    "UIFrameworks": "UI Frameworks",
    "UsefulLinks": "užitečné odkazy",
    "Platform": "Plošina",
    "CoolestCompaniesUseABPCommercial": "Nejlepší společnosti již používají <span class=\"fw-bold\">ABP Commercial.</span>",
    "UserInterface": "Uživatelské rozhraní",
    "APIGateway": "Brána API",
    "Microservice": "Mikroservis",
    "Database": "Databáze",
    "Architecture": "Architektura",
    "MicroserviceArchitectureExplanation": "Jedná se o kompletní architekturu řešení, která se skládá z více aplikací, API bran, mikroslužeb a databází pro vytvoření škálovatelného řešení mikroslužeb s nejnovějšími technologiemi.",
    "BusinessLogic": "Obchodní logika",
    "DataAccessLayer": "Vrstva pro přístup k datům",
    "Monolith": "Monolit",
    "ModularArchitectureExplanation": "Tato spouštěcí šablona poskytuje vrstvenou, modulární architekturu řešení založenou na DDD pro vytvoření čisté a udržovatelné kódové základny.",
    "SeeDetails": "Prohlednout detaily",
    "SeeDocumentation": "Podívejte se na Dokumentaci",
    "Bs5Compatible": "Profesionální téma kompatibilní s Bootstrap 5, ideální pro váš web správce.",
    "LeptonXTheme": "Téma LeptonX",
    "LeptonXDark": "LeptonX tmavý",
    "LeptonXLight": "Světlo LeptonX",
    "LeptonXSemiDark": "LeptonX polotmavý",
    "BuiltOnBs5Library": "Postaveno na knihovně Bootstrap 5",
    "FullyCompatibleWithBs5": "100% kompatibilní se strukturou HTML Bootstrap 5 a třídami CSS",
    "ResponsiveAndMobileCompatible": "Responzivní, mobilní kompatibilní, podpora RTL",
    "ProvidesStylesForDatatables": "Poskytuje styly pro datové tabulky",
    "MultipleLayoutOptions": "Více možností rozložení",
    "EasilyInstallAndUpgrade": "Snadná instalace a upgrade",
    "SupportForum": "Fórum podpory",
    "TrustedBy": "Trusted By",
    "OurPricing": "Naše <span class=\"gradient-commercial\">ceny</span>",
    "Plans": "Plány",
    "NameSurname": "Jméno Příjmení",
    "Unspecified": "Nespecifikováno",
    "LicenceType": "Typ licence",
    "LicenseDiscountWarning": "TATO SLEVOVÁ STRÁNKA POUŽÍVÁ VÝCHOZÍ SLEVOVÝ KÓD A PRO VÝVOJÁŘE VOLOSOFT. ODKAZY NA NÁKUP NÍŽE NEFUNGUJÍ.",
    "DiscountedLicenseExplanation": "Tyto ceny licencí jsou pro malé startupy, individuální vývojáře, studenty, neziskové organizace a projekty!",
    "General": "Všeobecné",
    "License": "Licence",
    "Development": "Rozvoj",
    "Payment": "Způsob platby",
    "WatchExplainerVideo": "Pojďme se setkat! Podívejte se na Vysvětlující video",
    "LightDarkAndSemiDarkThemes": "Světlé, tmavé a polotmavé",
    "LeptonXThemeExplanation": "Lepton Theme může změnit váš motiv podle nastavení vašeho systému.",
    "PRO": "PRO",
    "WelcomeToABPCommercial": "Vítejte v <span class=\"gradient-commercial\">ABP Commercial!</span>",
    "YourAccountDetails": "Podrobnosti o vašem účtu",
    "OrganizationName": "Název organizace",
    "AddDevelopers": "Přidat vývojáře",
    "StartDevelopment": "Začněte s vývojem",
    "CreateAndRunApplicationUsingStartupTemplate": "Naučte se, jak vytvořit a spustit novou webovou aplikaci pomocí spouštěcí šablony ABP Commercial.",
    "CommunityDescription2": "<span class=\"fw-6\">community.abp.io</span> je místo, kde mohou lidé sdílet články související s ABP. Hledejte články, návody, ukázky kódu, případové studie a seznamujte se s lidmi ve stejném pruhu jako vy.",
    "UseABPSuiteExplanation": "Použijte ABP Suite ke stažení zdrojového kódu modulů a témat.",
    "ManageModulesWithSuite": "Své moduly ABP můžete také spravovat pomocí sady Suite.",
    "LearnHowToInstallSuite": "Přečtěte si, jak nainstalovat a používat ABP Suite.",
    "SeeMore": "Vidět víc",
    "SeeLess": "Viz Méně",
    "LayeredSolutionStructure": "Struktura vrstveného řešení",
    "LayeredSolutionStructureExplanation": "Řešení je vrstvené na základě principů a vzorů Domain Driven Design, aby izolovalo vaši obchodní logiku od infrastruktury a integrací a maximalizovalo udržovatelnost kódu a jeho opětovné použití. ABP Framework již poskytuje abstrakce, základní třídy a průvodce pro skutečnou implementaci DDD pro vaši aplikaci.",
    "MultipleUIOptions": "Více možností uživatelského rozhraní",
    "MultipleUIOptionsExplanation": "Milujeme různé způsoby vytváření uživatelského rozhraní. Toto spouštěcí řešení poskytuje tři různé možnosti rozhraní uživatelského rozhraní pro vaši obchodní aplikaci.",
    "MultipleDatabaseOptions": "Více možností databáze",
    "MultipleDatabaseOptionsExplanation": "Máte dvě možnosti poskytovatele databáze (kromě použití obou v jedné aplikaci). Použijte Entity Framework Core pro práci s jakoukoli relační databází a volitelně použijte Dapper, když potřebujete psát nízkoúrovňové dotazy pro lepší výkon. MongoDB je další možností, pokud potřebujete použít databázi NoSQL založenou na dokumentech. I když jsou tito poskytovatelé dobře integrovaní, abstrahovaní a předkonfigurovaní, můžete skutečně pracovat s jakýmkoli databázovým systémem, který můžete použít s .NET.",
    "ModularArchitectureExplanation2": "Modularita je prvotřídní občan v platformě ABP.IO. Všechny funkce aplikace jsou rozděleny do dobře izolovaných volitelných modulů. Startovací řešení již přichází s předinstalovanými základními <a href=\"/modules\" class=\"text-primary\">komerčními moduly ABP</a> . Můžete si také vytvořit své vlastní moduly a vytvořit tak modulární systém pro svou vlastní aplikaci.",
    "MultiTenancyForSaasBusiness": "Multi-Tenancy pro vaše podnikání SaaS",
    "MultiTenancyForSaasBusinessExplanation": "ABP Commercial poskytuje kompletní komplexní systém pro více nájemců pro vytváření vašich systémů SaaS (Software-as-a-Service). Umožňuje nájemcům sdílet nebo mít vlastní databáze pomocí systému vytváření a migrace databází on-the-fly.",
    "MicroserviceStartupSolution": "Microservice Startup Solution",
    "MicroserviceArchitectureExplanation2": "Můžete jej získat pro svůj další mikroservisní systém, abyste mohli využít výhod předem připraveného základního řešení a destilovaných zkušeností.",
    "PreIntegratedTools": "Předem integrováno do oblíbených nástrojů",
    "PreIntegratedToolsExplanation": "Řešení je již integrováno do standardních nástrojů a technologií, přičemž je můžete kdykoli změnit a integrovat do svých oblíbených nástrojů.",
    "SingleSignOnAuthenticationServer": "Ověřovací server pro jednotné přihlášení",
    "SingleSignOnAuthenticationServerExplanation": "Řešení obsahuje aplikaci ověřovacího serveru, kterou ostatní aplikace používají jako server pro jednotné přihlášení s funkcemi správy přístupu k rozhraní API. Je založen na IdentityServeru.",
    "WebAppsWithGateways": "2 webová aplikace se 2 bránami API",
    "WebAppsWithGatewaysExplanation": "Řešení obsahuje dvě webové aplikace, každá má vyhrazenou API bránu (BFF - Backend For Frontend pattern).",
    "BackOfficeApplication": "Aplikace Back Office",
    "BackOfficeApplicationExplanation": "Skutečná webová aplikace vašeho systému s více možnostmi rámce uživatelského rozhraní. Můžete vytvořit jakýkoli druh obchodní aplikace.",
    "LandingWebsite": "Vstupní web",
    "LandingWebsiteExplanation": "Obecný vstupní/veřejný web, který lze použít k několika účelům, jako je představení vaší společnosti, prodej vašich produktů atd.",
    "ABPFrameworkEBook": "E-kniha Mastering ABP Framework",
    "MasteringAbpFrameworkEBookDescription": "Zahrnuto ve vaší komerční licenci ABP",
    "FullName": "Celé jméno",
    "LicenseTypeNotCorrect": "Typ licence není správný!",
    "Trainings": "Tréninky",
    "ChooseTrainingPlaceholder": "Vyberte si školení...",
    "DoYouNeedTrainings": "Potřebujete jedno z těchto školení?",
    "DoYouNeedTraining": "Potřebujete školení {0}?",
    "GetInTouchUs": "Kontaktujte nás",
    "ForMoreInformationClickHere": "Pro více informací klikněte <a href='{0}'>sem.</a>",
    "ForMoreInformationClickHereByClass": "<span class=\"{1}\">Pro více informací klikněte</span> <a href='{0}'>sem.</a>",
    "IsGetOnboardingTraining": "Chtěli byste absolvovat školení týkající se onboardingu a vývoje webových aplikací?",
    "OnboardingWebApplicationDevelopmentTrainingMessage": "Chcete-li naplánovat kalendář školení, po vytvoření organizace kontaktujte {0}",
    "CustomPurchaseMessage": "Pro další krok klikněte na {0} a kontaktujte nás.",
    "Note": "Poznámka",
    "AdditionalNote": "Dodatečná poznámka",
    "OnboardingTrainingFaqTitle": "Máte školení ABP onboarding?",
    "OnboardingTrainingFaqExplanation": "Ano, máme školicí služby ABP, které vám pomohou rychle zahájit váš projekt ABP. Dozvíte se o ABP od hlavního člena týmu ABP a získáte dovednosti pro zahájení vašeho projektu ABP. Na onboarding školení si vysvětlíme, jak nastavit vaše vývojové prostředí, nainstalovat požadované nástroje, vytvořit plně funkční stránku CRUD. Školení bude probíhat živě a bude se používat aplikace Zoom a jsme otevřeni využití dalších online platforem pro setkávání. Jazykem školení bude angličtina. Během sezení můžete také klást otázky týkající se ABP. Pro obě strany bude naplánován vhodný čas a datum. Chcete-li získat další informace, kontaktujte nás na adrese <a href=\"mailto:info@abp.io\">info@abp.io</a>.",
    "AddBasket": "Přidat do košíku",
    "SendTrainingRequest": "Odeslat žádost o školení",
    "OnlyEnglishVersionOfThisDocumentIsTheRecentAndValid": "* Anglická verze tohoto dokumentu je nejaktuálnější a v jakémkoli sporu bude rozhodující anglická verze.",
    "Pricing_Page_Title": "Ceny a plány",
    "Pricing_Page_Description": "Vyberte si vlastnosti a funkce, které vaše firma dnes potřebuje. Kupte si licenci ABP Commercial a vytvářejte neomezené projekty.",
    "Pricing_Page_HurryUp": "Pospěš si!",
    "Pricing_Page_BuyLicense": "Kupte si licenci za <strong>ceny 2021</strong> do 16. ledna!",
    "Pricing_Page_ValidForExistingCustomers": "Platí také pro stávající zákazníky a prodlužování licencí.",
    "Pricing_Page_Hint1": "Cena licence zahrnuje určitý počet vývojářských míst. Pokud máte více vývojářů, můžete si vždy zakoupit další místa.",
    "Pricing_Page_Hint2": "Nyní nebo v budoucnu si můžete zakoupit další vývojářské licence. Licence jsou založené na sedadlech, takže si můžete přenést sedadlo z jednoho vývojáře na druhého.",
    "Pricing_Page_Hint3": "S vaší licencí můžete vyvíjet neomezený počet různých produktů.",
    "Pricing_Page_Hint4": "ABP Suite je nástroj, který vám pomůže při vývoji a zvýší vaši produktivitu. Podporuje generování stránek CRUD a vytváření nových projektů.",
    "Pricing_Page_Hint5": "Ve svých aplikacích můžete použít všechny předpřipravené moduly.",
    "Pricing_Page_Hint6": "Ve svých aplikacích můžete použít všechna předpřipravená témata.",
    "Pricing_Page_Hint7": "Spouštěcí šablona je řešení sady Visual Studio, které vám umožní rychle spustit projekt. Všechny základní moduly jsou přidány a předkonfigurovány pro vás.",
    "Pricing_Page_Hint8": "E-kniha Mastering ABP Framework vysvětluje, jak implementovat řešení .NET s osvědčenými postupy. Prodává se na Amazon.com a knihu si můžete stáhnout zdarma s vaší licencí.",
    "Pricing_Page_Hint9": "Můžete si stáhnout zdrojový kód libovolného modulu. Možná budete chtít přidat zdrojový kód do svého řešení, abyste mohli provést radikální změny, nebo si jej z bezpečnostních důvodů nechat pro sebe.",
    "Pricing_Page_Hint10": "Licence jsou na celý život. To znamená, že můžete pokračovat ve vývoji své aplikace navždy. Přístup k nejnovější verzi a získání podpory jsou poskytovány během licenčního období (1 rok, pokud si ji neobnovíte).",
    "Pricing_Page_Hint11": "Bez omezení nasazení! Můžete nasadit na tolik serverů, kolik chcete, včetně cloudových služeb nebo místních.",
    "Pricing_Page_Hint12": "Během aktivního licenčního období můžete aktualizovat moduly, motivy a nástroje na nejnovější verzi. Po vypršení platnosti vaší licence je třeba ji obnovit, abyste mohli nadále získávat aktualizace pro opravy chyb, nové funkce a vylepšení.",
    "Pricing_Page_Hint13": "Prémiovou podporu můžete získat na jeden rok (prodloužení licence můžete obnovit).",
    "Pricing_Page_Hint14": "Týmové a obchodní licence mají limit počtu incidentů/otázek. Pokud si zakoupíte další vývojářské licence, zvýší se váš limit incidentů o {0} (u týmové licence) nebo {1} (u obchodní licence) na vývojáře.",
    "Pricing_Page_Hint15": "Pouze Enterprise License zahrnuje soukromou podporu. Můžete poslat e-mail přímo týmu ABP nebo klást otázky na support.abp.io s možností soukromé vstupenky. Soukromé vstupenky nejsou viditelné pro veřejnost.",
    "Pricing_Page_Hint16": "Můžete si stáhnout zdrojový kód všech témat ABP. Možná budete chtít přidat zdrojový kód do svého řešení, abyste mohli provést radikální změny, nebo si jej z bezpečnostních důvodů nechat pro sebe.",
    "Pricing_Page_Testimonial_1": "Společnost ABP Commercial umožnila společnosti SC Ventures dodat platformu SaaS s vícenájemci silo-databáze na bankovní úrovni za 9 měsíců na podporu financování pohledávek / závazků dodavatelského řetězce faktur s významnou hodnotou z několika integrovaných kotev. Modularita ABP umožnila týmu dodávat v rekordním čase, projít všemi VAPT a nasadit zásobník kontejnerových mikroslužeb prostřednictvím plného CI/CD a potrubí do výroby.",
    "Pricing_Page_Testimonial_2": "Vidíme hodnotu použití ABP Commercial ke snížení režie projektů vlastního vývoje. Tým je schopen sjednotit vzor kódu v různých proudech projektu. V rámci vidíme větší potenciál pro rychlejší vytváření nových funkcí než dříve. Věříme, že budeme neustále vidět hodnotu využití ABP Commercial.",
    "Pricing_Page_Testimonial_3": "Milujeme ABP. Nemusíme psát všechno od začátku. Vycházíme z předem připravených funkcí a soustředíme se jen na to, co skutečně potřebujeme napsat. ABP má také dobrou architekturu a kód je vysoce kvalitní s menším počtem chyb. Kdybychom měli vše potřebné napsat sami, možná bychom museli strávit roky. Ještě jedna věc, která se nám líbí, je, že nová verze, oprava problémů nebo vylepšení vychází velmi brzy každý druhý týden. Nečekáme příliš dlouho.",
    "Pricing_Page_Testimonial_4": "ABP Commercial je fantastický produkt, který bych doporučil. Komerční produkty na trh pro naše zákazníky na jediné konfigurovatelné platformě. Skok začíná, že rámec a nástroje, které poskytuje každý tým, stojí za každý cent. ABP Commercial nejlépe vyhovovala našim potřebám.",
    "Pricing_Page_Testimonial_5": "ABP Framework není jen rámec, ale je také průvodcem pro vývoj/řízení projektů, protože poskytuje školení DDD, GenericRepository, DI, Microservice a Modularity. I když samotný framework nebudete používat, můžete se vyvíjet s docs.abp.io, který je dobře a profesionálně připraven (OpenIddict, Redis, Quartz atd.). Protože je mnoho věcí předpřipravených, výrazně to zkracuje dobu vývoje projektu (jako je přihlašovací stránka, zpracování výjimek, filtrování dat, seedování, protokolování auditu, lokalizace, automatický řadič API atd.). Jako příklad z naší aplikace jsem použil místní sběrnici událostí pro řízení zásob. Takže jsem schopen řídit pohyby objednávek psaním skladového manipulátoru. Je úžasné neztrácet čas pro CreationTime, CreatorId. Plní se automaticky.",
    "Pricing_Page_Testimonial_6": "ABP Framework je dobrý rámec, ale potřebuje čas na pochopení různých vrstev, tříd a knihoven, které používá (zejména ABP). Strávil jsem spoustu času čtením kódové základny, ale ABP Commercial nám ušetřil čas při vytváření speciálních entit projektu (AR) a úložiště propojeného s každou z nich. Líbil se mi také přístup používaný v ABP je velmi vyspělý; víme, že je založen na DDD a monolitu.",
    "Pricing_Page_Testimonial_7": "Jako startup potřebujeme rychle iterovat a věnovat minimální čas standardním a vedlejším funkcím. \n Naši inženýři se pohybují od vysoce zkušených až po juniorské inženýry a potřebovali jsme společné porozumění a způsob, jak sdílet technické a doménové znalosti. ABP nám to umožnila díky jejich skvělým průvodcům a dokumentaci. \n Jsou věci, o které jsme se nemuseli starat, protože fungují hned po vybalení s ABP. \n ABP nám pomohl zefektivnit rychlé prototypování a vývoj, a to za méně než 4 týdny od zahájení funkce po výrobu. Se všemi svými prémiovými funkcemi zahrnutými v licenci nám společnost ABP poskytla „Spuštění v krabici“ na straně softwarového inženýrství.",
    "Pricing_Page_Testimonial_8": "ABP commercial bych doporučil všem, kteří chtějí rozšířit nabídku produktů dostupných svým zákazníkům. Je to fantastické, když potřebujete použít distribuované podnikové prostředí (Angular, WPF, Win&amp;Linux). Kromě jejich produktů milujeme i jejich podporu, která nám urychluje a usnadňuje práci. Již nyní víme, že jsme našli skvělého partnera do budoucna, který nás podpoří v rozšiřování našeho podnikání.",
    "Pricing_Page_Testimonial_9": "Jsme společnost se 2 zaměstnanci, která působí na trhu již více než 20 let. \n Pokud jde o naše zkušenosti s ABP Commercial, oslovil nás klient s žádostí o vývoj nové personální aplikace v moderním prostředí, která by nahradila jejich 25 let starou Access aplikaci. Rozhodli jsme se přejít z desktopového řešení na webové. \n \n V té době jsme měli velmi málo znalostí o webových aplikacích a .NET, ale narazili jsme na ABP Commercial a s pomocí ABP Framework, technické dokumentace a ABP Suite jsme byli schopni nejen vyvinout aplikaci specifikace klienta, ale také úspěšně fungují v prostředí .NET do jednoho roku.",
    "AbpBookDownloadArea_ClaimYourEBook": "Získejte svou elektronickou knihu <span class='gradient-framework'>Mastering ABP Framework</span>",
    "AddMemberModal_Warning_1": "Pokud <strong>uživatelské jméno</strong> , které se pokoušíte přidat, v systému neexistuje, požádejte člena týmu, aby se zaregistroval na <a href='{0}/Account/Register'>{0}</a> a sdílel s vámi uživatelské jméno svého účtu.",
    "MyOrganizations_Detail_WelcomeMessage": "Vítejte ve své organizaci, {0}",
    "MyOrganizations_Detail_OrganizationManagement": "<span class=\"gradient-commercial\">Řízení</span> organizace",
    "OrganizationDisplayName": "Zobrazovaný název organizace",
    "MyOrganizations_Detail_EditDisplayName": "Upravit zobrazovaný název",
    "MyOrganizations_Detail_UpgradeYourLicense": "Upgradujte svou licenci",
    "MyOrganizations_Detail_LicenseStartAndExpiryDate": "Datum zahájení licence – datum vypršení platnosti",
    "MyOrganizations_Detail_OwnerRightInfo": "Využíváte {0} ze svých {1} vlastnických práv.",
    "MyOrganizations_Detail_CopyApiKey": "Zkopírujte klíč",
    "MyOrganizations_Detail_ApiKeyDescription": "Klíč API je token balíčků PRO hostovaných na <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{1}.</a>",
    "MyOrganizations_Detail_YourPrivateNugetSource": "Váš soukromý zdroj NuGet je <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{0}</a>",
    "MyOrganizations_Detail_PrivateNugetSourceWarning": "To se automaticky přidá jako zdroj do vašeho NuGet.Config ve vašem řešení ABP. Nesdílejte svůj soukromý klíč s neoprávněnými uživateli!",
    "MyOrganizations_Detail_DeveloperSeatInfo": "Používáte {0} ze svých {1} míst pro vývojáře.",
    "NeedMoreSeatsForYourTeam": "Potřebujete více míst pro váš tým?",
    "MyOrganizations_Detail_PricePerYear": "{0} / za rok",
    "MyOrganizations_Detail_PurchaseDeveloperSeats": "Kupte si křesla pro vývojáře",
    "Invoices": "Faktury",
    "RequestInvoice": "Vyžádejte si fakturu",
    "OrderNumber": "Číslo objednávky",
    "Date": "datum",
    "Products": "produkty",
    "TotalPrice": "Celková cena",
    "ThereIsNoInvoice": "Neexistuje žádná faktura",
    "MyOrganizations_Detail_PaymentProviderInfo": "Pokud jste licenci zakoupili prostřednictvím brány <i>{0}</i> , odešle fakturu ve formátu PDF na vaši e-mailovou adresu, viz <a href=\"{1}\" target=\"_blank\">fakturace {0}.</a>",
    "MyOrganizations_Detail_PayUInfo": "Pokud jste nakoupili přes bránu <i>Iyzico</i> , klikněte na tlačítko „Vyžádat fakturu“ a vyplňte fakturační údaje.",
    "MyOrganizations_Detail_ConclusionInfo": "Vaše žádost o fakturu bude uzavřena do {0} pracovních dnů.",
    "ExtendYourLicense": "Prodlužte svou licenci <span class=\"text-primary\">{0}</span>",
    "Continue": "Pokračovat",
    "PurchaseLicense": "Zakoupit licenci {0}",
    "DownloadInvoiceModal_DownloadInvoice": "Stáhnout fakturu",
    "DownloadInvoiceModal_SaveInformationOnlyOnce": "Své fakturační údaje můžete uložit pouze jednou.",
    "InvoiceModal_EnterCompanyName": "Zadejte název vaší společnosti...",
    "InvoiceModal_EnterCompanyAddress": "Zadejte oficiální adresu společnosti...",
    "InvoiceModal_EnterTaxNumber": "Zadejte své DIČ/DIČ, pokud je k dispozici...",
    "RequestInvoiceModal_EnterNotes": "Zadejte další zprávu o vaší faktuře...",
    "PrePayment_PayWithIyzico": "Budete platit přes Iyzico",
    "ContinueToCheckout": "Pokračujte k pokladně",
    "PrePayment_IyzicoRedirectionInfo": "Budete přesměrováni na platební bránu Iyzico, abyste bezpečně dokončili svůj nákup.",
    "PrePayment_IyzicoAcceptVisaAndMasterCard": "Iyzico přijímá karty Visa a MasterCard.",
    "Purchase": "Nákup",
    "AcceptTermsAndConditions": "Přečetl jsem, rozumím a přijímám <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">zásady ochrany osobních údajů</a> , <a href=\"{1}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">podmínky a smlouvu</a> <a href=\"{2}\" target=\"_blank\" class=\"text-primary\">EULA.</a>",
    "AcceptTermsAndConditionsWarningMessage": "Přijměte prosím zásady ochrany osobních údajů a podmínky",
    "SelectGatewayToContinue": "Chcete-li pokračovat, vyberte bránu!",
    "GatewaySelection_SelectGateway": "Vyberte platební bránu",
    "GatewaySelection_RedirectionMessage": "Dále budete přesměrováni na web vybrané platební brány pro transakci.",
    "PaymentSucceed_PaymentSuccessMessage": "Platba byla úspěšná",
    "PaymentSucceed_ThanksForPurchase": "Děkuji za Váš nákup!",
    "PaymentSucceed_CreateYourOrganization": "Vytvořte svou organizaci",
    "PaymentSucceed_AddMeAsDeveloper": "Jsem také vývojář, přidejte mě jako vývojáře do své organizace.",
    "PaymentSucceed_CreateOrganization": "Vytvořit organizaci",
    "PaymentSucceed_OrganizationDescription": "Organizace se skládá z vývojářů a vlastníků. Vývojáři jsou uživatelé, kteří píší kód do projektu ABP a budou mít prospěch z webu <a href=\"{0}\" target=\"_blank\">{1}</a> . Vlastníci jsou uživatelé, kteří přidělují místa pro vývojáře a spravují licencování.",
    "PaymentSucceed_ViewOrganization": "Kliknutím sem zobrazíte organizaci",
    "Purchase_TotalAnnualPrice": "TOTAL <small class=\"opacity-50\">(roční poplatek)</small>",
    "Purchase_TrainingPrice": "Cena školení",
    "Purchase_OnboardingTraining": "Živé školení onboardingu a vývoje webových aplikací",
    "TotalDeveloperPrice": "Celková cena vývojáře",
    "Purchase_PricePerDeveloper": "<span>{0} {1}</span> na vývojáře",
    "Purchase_IncludedDeveloperInfo": "{0} {1} v ceně.",
    "Purchase_LicenseExtraDeveloperPurchaseMessage": "<span class=\"fw-bold\">Licence {0}</span> zahrnuje {1} vývojářů. Můžete přidat další vývojáře.",
    "StartupTemplates_Page_Title": "ABP Startup Templates",
    "StartupTemplates_Page_Description": "ABP Commercial vám umožňuje vytvářet řešení s jakoukoli úrovní složitosti. Poskytuje dvě hlavní předpřipravená spouštěcí řešení. Můžete si vybrat ten, který se blíží vašim požadavkům, a postavit si na něj vlastní řešení na míru.",
    "MicroserviceStartupSolutionForDotnet": "Microservice Startup Solution for .NET",
    "MonolithSolutionForDotnet": "Monolitické (modulární) řešení pro .NET",
    "TrainingDetailsHeaderInfo_TrainingHour": "{0} hodin",
    "Trainings_Content": "Obsah školení",
    "Trial_Page_StartYourFreeTrial": "Začněte <span class=\"gradient-commercial\">bezplatnou zkušební verzi</span>",
    "TrialLicenseFeatures": "Budete moci těžit ze všech komerčních funkcí ABP",
    "TrialPeriodDays": "Budete mít týmovou licenci na {0} dní",
    "TrialForumSupportIncident": "Budete mít {0} incidentů podpory fóra",
    "Contact_Page_Title": "Kontaktujte vývojový tým ABP",
    "Contact_Page_Description": "Kontaktujte vývojový tým ABP, pokud potřebujete pomoc nebo se podělte o své myšlenky a názory! Tým podpory ABP je připraven pomoci.",
    "Demo_Page_Title": "Vytvořte demo",
    "Demo_Page_Description": "Vytvořte bezplatnou ukázku, abyste viděli ukázkovou aplikaci vytvořenou pomocí spouštěcí šablony ABP Commercial. Neopakujte se pro běžné aplikační požadavky.",
    "Discounted_Page_Title": "Zvýhodněná cena",
    "Discounted_Page_Description": "Vyberte si vlastnosti a funkce, které vaše firma dnes potřebuje. Kupte si licenci ABP Commercial a vytvářejte neomezené projekty",
    "Faq_Page_Title": "Často kladené otázky (FAQ)",
    "Faq_Page_Description": "Máte nějaké dotazy? Hledejte často kladené otázky nebo nám položte otázku pomocí kontaktního formuláře.",
    "Faq_Page_SwiftCode": "SWIFT kód",
    "Faq_Page_BankName": "Jméno banky",
    "Faq_Page_AccountName": "Jméno účtu",
    "Faq_Page_AccountNumber": "Číslo účtu",
    "Faq_Page_Currency": "Měna",
    "Faq_Page_VatNumber": "DIČ",
    "Faq_Page_OtherCurrenciesInfo": "Pro ostatní měny viz <a href='{0}'>všechny účty</a>",
    "ProjectCreatedSuccess_Page_Title": "Váš projekt byl vytvořen",
    "ProjectCreatedSuccess_Page_Description": "Váš projekt ABP byl úspěšně vytvořen!",
    "Suite_Page_Title": "ABP Suite",
    "Suite_Page_Description": "ABP Commercial poskytuje nástroje pro rychlý vývoj aplikací pro zvýšení produktivity vývojářů. ABP Suite vám umožňuje snadno vytvářet stránky CRUD.",
    "Themes_Page_Title": "Témata ABP",
    "Themes_Page_Description": "ABP Commercial poskytuje několik profesionálních, moderních témat uživatelského rozhraní. Vytvořte si bezplatné demo, abyste měli rychlý přehled o tom, jak uživatelské rozhraní vypadá.",
    "Tools_Page_Title": "Nástroje pro rychlý vývoj aplikací",
    "Tools_Page_Description": "ABP Commercial poskytuje nástroje pro rychlý vývoj aplikací pro zvýšení produktivity vývojářů. ABP Suite vám umožňuje snadno vytvářet stránky CRUD.",
    "DeveloperPrice": "Cena pro vývojáře",
    "AdditionalDeveloperPaymentInfoSection_AdditionalDevelopers": "{0} <small>vývojářů</small>",
    "LicenseRemainingDays": "po dobu <span>{0}</span> dnů",
    "ExtendPaymentInfoSection_Description": "Prodloužením/obnovením licence budete i nadále získávat <a href=\"{0}\" target=\"_blank\">prémiovou podporu</a> . Budete také moci získat větší nebo menší aktualizace pro moduly a témata. Budete moci pokračovat ve vytváření nových projektů. A stále budete moci používat <a href=\"{1}\" target=\"_blank\">ABP Suite</a> , který urychlí váš vývoj.",
    "LicenseRenewalPrice": "Cena za obnovení licence",
    "LicensePrice": "Cena licence",
    "TrialLicensePaymentInfoSection_Description": "<strong>Zakoupit licenci:</strong> Zakoupením licence získáte i nadále <a href=\"{0}\" target=\"_blank\" rel=\"noopener\">prémiovou podporu</a> . Budete také moci získat větší nebo menší aktualizace pro moduly a témata. Budete moci pokračovat ve vytváření nových projektů. A stále budete moci používat <a href=\"{1}\" target=\"_blank\" rel=\"noopener\">ABP Suite</a> , který urychlí váš vývoj.<br> Rozdíly mezi typy licencí naleznete v <a href=\"{2}\" target=\"_blank\" rel=\"noopener\">tabulce porovnání licencí</a> .",
    "SelectTargetLicense": "Vyberte možnost Cílová licence",
    "UpgradePaymentInfoSection_ExtendMyLicenseForOneYear": "Ano, prodloužit datum vypršení platnosti licence o 1 rok.",
    "UpgradePaymentInfoSection_WantToExtendLicense": "Chcete si prodloužit licenci o další 1 rok?",
    "UpgradePaymentInfoSection_UpgradingWillNotExtendLicense": "Upgrade neprodlouží datum vypršení platnosti vaší licence!",
    "UpgradePaymentInfoSection_LicenseUpgradeDescription": "Upgradem vaší licence budete povýšeni na vyšší typ licence, což vám umožní získat další výhody. Rozdíly mezi typy licencí naleznete v <a href=\"/Pricing\" target=\"_blank\">tabulce porovnání licencí</a> .",
    "Landing_Page_CustomerStories": "Příběhy zákazníků",
    "Landing_Page_OurGreatCustomers": "Naši skvělí zákazníci",
    "Landing_Page_WebApplicationFramework": "Web Application Framework",
    "Landing_Page_WebDevelopmentPlatform": "Platforma pro vývoj webu",
    "Landing_Page_CompleteWebDevelopmentPlatform": "Kompletní platforma pro vývoj webu",
    "Landing_Page_TryFreeDemo": "Vyzkoušejte bezplatné demo",
    "Landing_Page_StartingPointForWebApplications": "Výchozí bod pro webové aplikace založené na ASP.NET Core! Je založen na ABP Framework pro nejlepší vývoj webu.",
    "Landing_Page_AbpProvidesSoftwareInfrastructure": "ABP Framework poskytuje softwarovou infrastrukturu pro vývoj vynikajících webových aplikací s osvědčenými postupy.",
    "Landing_Page_MicroserviceCompatibleArchitecture": "Architektura kompatibilní s mikroslužbami",
    "Landing_Page_PreBuiltApplicationModulesAndThemes": "Předpřipravené aplikační moduly a motivy",
    "Landing_Page_MultiTenantArchitecture": "Architektura pro více nájemců",
    "Landing_Page_MultiTenancyDescription": "Aplikace SaaS snadno! Integrovaný multi-tenancy z databáze do uživatelského rozhraní.",
    "Landing_Page_DDDIntroduction": "Navrženo a vyvinuto na základě vzorů a principů DDD. Poskytuje vrstvený model pro vaši aplikaci.",
    "Landing_Page_CrossCuttingConcernsInfo": "Kompletní infrastruktura pro autorizaci, ověřování, zpracování výjimek, ukládání do mezipaměti, protokolování auditu, správu transakcí a další.",
    "Landing_Page_PreBuiltApplicationModules": "Předem vytvořené aplikační moduly, které zahrnují nejběžnější požadavky na webové aplikace.",
    "Landing_Page_ChatModule": "Povídat si",
    "Landing_Page_DocsModule": "Docs",
    "Landing_Page_FileManagementModule": "Správa souborů",
    "Landing_Page_CustomerStory_1": "Společnost ABP Commercial umožnila společnosti SC Ventures dodat platformu SaaS s vícenájemci silo-databáze na bankovní úrovni za 9 měsíců na podporu financování pohledávek / závazků dodavatelského řetězce faktur s významnou hodnotou z několika integrovaných kotev. Modularita ABP umožnila týmu dodávat v rekordním čase, projít všemi VAPT a nasadit zásobník kontejnerových mikroslužeb prostřednictvím plného CI/CD a potrubí do výroby.",
    "Landing_Page_CustomerStory_2": "Vidíme hodnotu použití ABP Commercial ke snížení režie projektů vlastního vývoje. Tým může sjednotit vzor kódu v různých proudech projektu. V rámci vidíme větší potenciál pro rychlejší vytváření nových funkcí než dříve. Věříme, že budeme neustále vidět hodnotu využití ABP Commercial.",
    "Landing_Page_CustomerStory_3": "Milujeme ABP. Nemusíme psát všechno od začátku. Vycházíme z předem připravených funkcí a soustředíme se jen na to, co skutečně potřebujeme napsat. ABP má také dobrou architekturu a kód je vysoce kvalitní s menším počtem chyb. Kdybychom měli vše potřebné napsat sami, možná bychom museli strávit roky. Ještě jedna věc, která se nám líbí, je, že nová verze nebo oprava problému nebo vylepšení vychází velmi brzy \n každý druhý týden. Nečekáme příliš dlouho.",
    "Landing_Page_CustomerStory_4": "ABP Commercial je fantastický produkt, který bych doporučil. Komerční produkty uváděné na trh pro naše zákazníky na jediné konfigurovatelné platformě. Skok začíná, že rámec a nástroje, které poskytuje každý tým, stojí za každý cent. ABP Commercial nejlépe vyhovovala našim potřebám.",
    "Landing_Page_AdditionalServices": "Vlastní nebo objemová licence, onboarding, živá školení a podpora, vlastní vývoj projektů, portování stávajících projektů a další...",
    "Landing_Page_IncludedDeveloperLicenses": "Zahrnuto <strong>{0}</strong> licencí pro vývojáře",
    "Landing_Page_SeeOnDemo": "Viz Demo",
    "Landing_Page_LeptonThemes": "LeptonThemes",
    "Landing_Page_AccountModuleDescription_1": "Tento modul implementuje autentizační systém pro aplikaci;",
    "Landing_Page_AccountModuleDescription_2": "Poskytuje <strong>přihlašovací</strong> stránku s uživatelským jménem a heslem",
    "Landing_Page_AccountModuleDescription_3": "Poskytuje <strong>registrační</strong> stránku pro vytvoření nového účtu.",
    "Landing_Page_AccountModuleDescription_4": "Poskytuje stránku <strong>se zapomenutým heslem</strong> pro odeslání odkazu <strong>pro obnovení hesla</strong> e-mailem.",
    "Landing_Page_AccountModuleDescription_5": "Poskytuje funkci <strong>potvrzení e-mailu</strong> s uživatelským rozhraním.",
    "Landing_Page_AccountModuleDescription_6": "Implementuje <strong>dvoufaktorovou</strong> autentizaci (SMS a e-mail).",
    "Landing_Page_AccountModuleDescription_7": "Implementuje <strong>uzamčení uživatele</strong> (uzamkne účet na nastavenou dobu, pokud dojde k určitému počtu neúspěšných přihlášení z důvodu neplatných přihlašovacích údajů v určitém časovém intervalu).",
    "Landing_Page_AccountModuleDescription_8": "Implementuje uživatelské rozhraní a funkčnost ověřovacího serveru <strong>Identity Server</strong> .",
    "Landing_Page_AccountModuleDescription_9": "Umožňuje <strong>přepínat mezi nájemci</strong> v prostředí s více nájemci.",
    "Landing_Page_AccountModuleDescription_10": "Umožňuje změnit <strong>jazyk uživatelského rozhraní</strong> aplikace.",
    "Landing_Page_AuditLoggingModuleDescription_1": "Tento modul poskytuje uživatelské rozhraní hlášení protokolu auditu pro infrastrukturu auditu. Umožňuje vyhledávat, filtrovat a zobrazovat záznamy protokolu auditu a protokoly změn entit.",
    "Landing_Page_AuditLoggingModuleDescription_2": "Záznam protokolu auditu obsahuje kritická data o každém požadavku klienta:",
    "Landing_Page_AuditLoggingModuleDescription_3": "URL, prohlížeč, IP adresa, jméno klienta",
    "Landing_Page_AuditLoggingModuleDescription_4": "Uživatel",
    "Landing_Page_AuditLoggingModuleDescription_5": "Metoda HTTP, návratový stavový kód HTTP",
    "Landing_Page_AuditLoggingModuleDescription_6": "Úspěch/neúspěch, podrobnosti o výjimce, pokud jsou k dispozici",
    "Landing_Page_AuditLoggingModuleDescription_7": "Doba realizace požadavku",
    "Landing_Page_AuditLoggingModuleDescription_8": "Entity byly v tomto požadavku vytvořeny, odstraněny nebo aktualizovány (se změněnými vlastnostmi).",
    "Landing_Page_BloggingModuleDescription_1": "Tento modul přidá do vaší aplikace ABP jednoduchý blog;",
    "Landing_Page_BloggingModuleDescription_2": "Umožňuje vytvářet více blogů v jedné aplikaci.",
    "Landing_Page_BloggingModuleDescription_3": "Podporuje formát Markdown.",
    "Landing_Page_BloggingModuleDescription_4": "Umožňuje napsat komentář k příspěvku.",
    "Landing_Page_BloggingModuleDescription_5": "Umožňuje přiřadit tagy k příspěvkům na blogu.",
    "Landing_Page_BloggingModuleDescription_6": "Podívejte se na web <a href=\"blog.abp.io\">blog.abp.io</a> jako živý příklad modulu blogování.",
    "Landing_Page_ChatModuleDescription_1": "Tento modul se používá pro zasílání zpráv v reálném čase mezi uživateli v aplikaci.",
    "Landing_Page_ChatModuleDescription_2": "Zprávy v reálném čase na stránce chatu.",
    "Landing_Page_ChatModuleDescription_3": "Vyhledejte uživatele v aplikaci pro nové konverzace.",
    "Landing_Page_ChatModuleDescription_4": "Seznam kontaktů pro nedávné konverzace.",
    "Landing_Page_ChatModuleDescription_5": "Upozornění na nové zprávy, když se uživatel dívá na jinou stránku.",
    "Landing_Page_ChatModuleDescription_6": "Odznak celkového počtu nepřečtených zpráv na ikoně nabídky.",
    "Landing_Page_ChatModuleDescription_7": "Počet nepřečtených zpráv pro každou konverzaci.",
    "Landing_Page_ChatModuleDescription_8": "Líně nabité konverzace.",
    "Landing_Page_DocsModuleDescription_1": "Tento modul se používá k vytváření webových stránek technické dokumentace;",
    "Landing_Page_DocsModuleDescription_2": "Vestavěná <strong>integrace GitHubu</strong> : Přímé psaní a správa dokumentů na GitHubu.",
    "Landing_Page_DocsModuleDescription_3": "Podpora <strong>verzování</strong> přímo integrovaná do vydání GitHubu.",
    "Landing_Page_DocsModuleDescription_4": "Podporuje <strong>více jazyků</strong> (s nouzovou podporou výchozího jazyka).",
    "Landing_Page_DocsModuleDescription_5": "Podporuje formáty <strong>Markdown</strong> a HTML.",
    "Landing_Page_DocsModuleDescription_6": "Poskytuje <strong>navigaci</strong> a část <strong>osnovy</strong> .",
    "Landing_Page_DocsModuleDescription_7": "Umožňuje hostovat <strong>více projektové</strong> dokumentace v jedné aplikaci.",
    "Landing_Page_DocsModuleDescription_8": "Odkazy na soubor na GitHubu, takže kdokoli může snadno přispět kliknutím na <strong>odkaz Upravit</strong> .",
    "Landing_Page_DocsModuleDescription_9": "Kromě zdroje GitHub umožňuje jednoduše použít složku jako zdroj dokumentace.",
    "Landing_Page_FileManagementModuleDescription_1": "Nahrávejte, stahujte a organizujte soubory v hierarchické struktuře složek.",
    "Landing_Page_FileManagementModuleDescription_2": "Tento modul se používá k nahrávání, stahování a organizování souborů v hierarchické struktuře složek. Je také kompatibilní s multipronájmem a můžete určit celkový limit velikosti pro své nájemníky.",
    "Landing_Page_FileManagementModuleDescription_3": "Tento modul je založen na systému <a href=\"https://docs.abp.io/en/abp/latest/Blob-Storing\">BLOB Storing</a> , takže může používat různé poskytovatele úložiště pro ukládání obsahu souborů.",
    "Landing_Page_IdentityModuleDescription_1": "Tento modul implementuje systém uživatele a role aplikace;",
    "Landing_Page_IdentityModuleDescription_2": "Postaveno na knihovně <a href=\"https://docs.microsoft.com/en-us/aspnet/core/security/authentication/identity\">Microsoft ASP.NET Core Identity</a> .",
    "Landing_Page_IdentityModuleDescription_3": "Správa <strong>rolí</strong> a <strong>uživatelů</strong> v systému. Uživatel může mít <strong>více rolí</strong> .",
    "Landing_Page_IdentityModuleDescription_4": "Nastavte <strong>oprávnění</strong> na úrovni role a uživatele.",
    "Landing_Page_IdentityModuleDescription_5": "Povolit/zakázat <strong>dvoufaktorové ověřování</strong> a <strong>uzamčení</strong> uživatele na uživatele.",
    "Landing_Page_IdentityModuleDescription_6": "Správa základního <strong>uživatelského profilu</strong> a <strong>hesla</strong> .",
    "Landing_Page_IdentityModuleDescription_7": "Spravujte <strong>typy nároků</strong> v systému, nastavujte nároky na role a uživatele.",
    "Landing_Page_IdentityModuleDescription_8": "Stránka nastavení pro správu <strong>složitosti hesel</strong> , přihlášení uživatele, účtu a uzamčení.",
    "Landing_Page_IdentityModuleDescription_9": "Podporuje ověřování <strong>LDAP</strong> .",
    "Landing_Page_IdentityModuleDescription_10": "Poskytuje ověření <strong>e-mailu a telefonního čísla</strong> .",
    "Landing_Page_IdentityModuleDescription_11": "Podporuje integraci sociálního přihlášení (Twitter, Facebook, GitHub atd...).",
    "Landing_Page_IdentityModuleDescription_12": "Spravujte <strong>organizační jednotky</strong> v systému.",
    "Landing_Page_PaymentModuleDescription_1": "Poskytuje integraci pro různé platební brány.",
    "Landing_Page_PaymentModuleDescription_2": "Tento modul poskytuje integraci pro platební brány, takže můžete snadno získat platbu od svých zákazníků.",
    "Landing_Page_PaymentModuleDescription_3": "Tento modul podporuje následující platební brány",
    "Welcome_Page_UseSameCredentialForCommercialWebsites": "Použijte stejné přihlašovací údaje pro <a href=\"https://commercial.abp.io\" class=\"text-primary\">commercial.abp.io</a> i <a href=\"https://support.abp.io\" class=\"text-primary\">support.abp.io</a> .",
    "WatchCrudPagesVideo": "Podívejte se na video „Vytváření stránek CRUD pomocí ABP Suite“!",
    "WatchGeneratingFromDatabaseVideo": "Podívejte se na video „ABP Suite: Generování stránek CRUD ze stávajících databázových tabulek“!",
    "WatchTakeCloserLookVideo": "Podívejte se na video „Podívejte se blíže na generování kódu: ABP Suite“!",
    "ConfirmedEmailAddressRequiredToStartTrial": "Abyste mohli spustit zkušební licenci, měli byste mít potvrzenou e-mailovou adresu.",
    "EmailVerificationMailNotSent": "Ověřovací e-mail se nepodařilo odeslat.",
    "GetConfirmationEmail": "<a href=\"javascript:void(0);\" id=\"{0}\" class=\"text-decoration-underline\">Kliknutím sem dostanete ověřovací e-mail,</a> pokud jste jej ještě nedostali.",
    "WhichLicenseTypeYouAreInterestedIn": "O jaký typ licence máte zájem?",
    "DontTakeOurWordForIt": "Neberte nás za slovo...",
    "ReadAbpCommercialUsersWantYouToKnow": "Přečtěte si, co chtějí uživatelé ABP Commercial vědět",
    "Testimonial_ShortDescription_1": "Modularita ABP umožnila týmu dodat včas.",
    "Testimonial_ShortDescription_2": "Vytvářejte nové funkce rychleji než dříve.",
    "Testimonial_ShortDescription_3": "Vycházíme z předem připravených funkcí a soustředíme se jen na to, co skutečně potřebujeme napsat.",
    "Testimonial_ShortDescription_4": "ABP Commercial nejlépe vyhovovala našim potřebám.",
    "OnlineReviewersOnAbpCommercial": "Online recenze na ABP Commercial",
    "SeeWhatToldAboutAbpCommercial": "Podívejte se, co bylo řečeno o ABP Commercial, a pokud chcete, napište své myšlenky.",
    "BlazoriseLicense": "Musíme si koupit licenci Blazorise?",
    "BlazoriseLicenseExplanation": "Máme dohodu mezi společnostmi Volosoft a Megabit, na základě této dohody je licence Blazorise přibalena k produktům ABP Commercial, proto si naši zákazníci nemusí kupovat další licenci Blazorise.",
    "ExtendPaymentInfoSection_DeveloperPrice": "{0}x další vývojáři",
    "ExtendPaymentInfoSection_DiscountRate": "Sleva {0} %",
    "TotalNetPrice": "Celková čistá cena",
    "EFCore": "Jádro Entity Framework",
    "All": "Všechno",
    "Mvc": "MVC",
    "DataBaseProvider": "Poskytovatel dat",
    "UIFramework": "UI Framework",
    "LeptonXThemeForDashboard": "Téma LeptonX pro váš Admin Dashboard od",
    "AbpPlatform": "Platforma ABP",
    "YouDeserveGoodUXUI": "Zasloužíte si dobré uživatelské rozhraní a lepší uživatelské rozhraní. LeptonX Theme od ABP je tady, aby to posloužilo.",
    "ViewLiveDemo": "Zobrazit živé demo tématu",
    "GetLeptonX": "Získejte LeptonX nyní",
    "SeeLeptonXDocumentation": "Viz dokumentace LeptonX",
    "SeeLeptonDocumentation": "Viz dokumentace Lepton",
    "SimplifiedMenu": "Zjednodušené menu",
    "SimplifiedMenuDescription": "Hledanou stránku snadno najdete filtrováním nabídky",
    "YourFavoritePages": "Vaše oblíbené stránky na dosah",
    "YourFavoritePagesDescription": "Stránku můžete snadno přidat nebo odebrat z oblíbených kliknutím na ikonu hvězdičky v pravém horním rohu stránky.",
    "BreadCrumbs": "Strouhanka pro bezproblémové přepínání",
    "BreadCrumbsDescription": "Pomocí Breadcrumb se můžete jedním kliknutím přepnout na stránky na stejné úrovni, i když je levé menu zavřené, a funguje to na tabletu a mobilu!",
    "YourMenu": "Vaše menu, jak si přejete",
    "YourMenuDescription": "Přizpůsobte si přímo klikatelné ikony a rozevírací pole v uživatelské nabídce, jak si přejete. Uživatelské menu je zcela přizpůsobitelné vašim potřebám",
    "RtlSupport": "Podpora RTL pro váš jazyk",
    "RtlSupportDescription": "Téma LeptonX podporuje RTL pro váš jazyk. Jazykové možnosti jsou v nabídce nastavení, kde můžete jazyk změnit.",
    "YourColors": "Vaše barvy v uživatelském rozhraní administrátorského panelu",
    "YourColorsDescription": "Téma LeptonX funguje podle vašich systémových preferencí a má možnosti světlého motivu ovládacího panelu, tmavého motivu ovládacího panelu a polotmavého motivu ovládacího panelu.",
    "ArrangeContentWidth": "Snadno uspořádejte šířku obsahu",
    "ArrangeContentWidthDescription": "Snadno změňte šířku oblasti obsahu.",
    "LeptonXCompatibleWith": "LeptonX Theme je kompatibilní s",
    "MobileResponsiveTemplate": "Mobilní responzivní šablona",
    "MobileResponsiveTemplateDescription1": "Získejte přístup ke svému administračnímu panelu LeptonX z jakéhokoli zařízení, které se vám líbí.",
    "MobileResponsiveTemplateDescription2": "Je navržen tak, abyste jej mohli snadno používat v každém vašem zařízení. Je responzivní na mobilních zařízeních a velikostech tabletů.",
    "TopMenuLayoutOption": "Možnost rozvržení horní nabídky",
    "TopMenuLayoutOptionDescription1": "Pokud byste chtěli nastavit svůj web se stejným administračním panelem, je možné to udělat pomocí LeptonX Theme!",
    "TopMenuLayoutOptionDescription2": "Vyzkoušejte rozložení horní nabídky LeptonX, aby se to stalo!",
    "EasilyCustomizable": "Snadno přizpůsobitelné pro barvy vaší značky",
    "EasilyCustomizableDescription1": "Motiv LeptonX si můžete přizpůsobit pomocí několika proměnných SCSS. Žádné přepisování, žádné další zatížení CSS!",
    "EasilyCustomizableDescription2": "S LeptonX si můžete uspořádat svůj administrační panel, jak chcete.",
    "IndependentLayout": "Nezávislá oblast rozvržení a obsahu",
    "IndependentLayoutDescription1": "Infrastruktura uspořádání LeptonX byla navržena zcela odděleně od obsahu.",
    "IndependentLayoutDescription2": "To znamená, že pokud chcete, můžete svůj projekt volně navrhnout s jinou strukturou obsahu než Bootstrap.",
    "MostUsedLibraries": "Nejpoužívanější knihovny integrované s LeptonX",
    "MostUsedLibrariesDescription1": "LeptonX obsahuje vaše nejpoužívanější knihovny. Umožňuje vám bez námahy používat knihovny, jako jsou ApexCharts, DataTables, DropZone, FullCalender, JSTree, Select2 a Toastr.",
    "MostUsedLibrariesDescription2": "LeptonX také podporuje specifické knihovny MVC Angular a Blazor.",
    "CreateAndCustomize": "Vytvořte a přizpůsobte stránky, které potřebujete, během několika sekund pomocí vlastních stránek LeptonX",
    "CreateAndCustomizeDescription": "Pomocí tématu LeptonX máte také přístup k mnoha předpřipraveným HTML stránkám. Patří mezi ně mnoho stránek, jako je přihlašovací stránka, blog, FAQ, seznam předplatných, faktura, ceny a správa souborů.",
    "LeptonThemeForAdmin": "Téma Lepton pro váš administrační panel od",
    "LeptonThemeForAdminDescription": "Téma Lepton je stále dostupné a bude udržováno. Pokud chcete přejít na téma LeptonX jako uživatel tématu Lepton, můžete se podívat na dokumentaci, kde se dozvíte, jak na to.",
    "LeptonCompatibleWith": "Lepton Theme je kompatibilní s",
    "BlackFridayDiscount": "Black Friday sleva",
    "UpgradePaymentInfoSection_DeveloperPrice": "{0} pro další vývojáře (počet: {1})",
    "Upgrade": "Vylepšit",
    "Renewal": "Obnova",
    "UpgradePaymentInfoSection_LicensePrice": "licence {0}",
    "UpgradePaymentInfoSection_LicenseRenewalPrice": "Obnovení licence",
    "Total": "Celkový",
    "SupportPolicyFaqTitle": "Jaká je vaše politika podpory?",
    "SupportPolicyFaqExplanation": "Podporujeme pouze aktivní a předchozí hlavní verzi. Nezaručujeme vydání opravy pro třetí a starší hlavní verzi. Například pokud je aktivní verze 7.0.0, vydáme opravné verze pro verzi 6.x.x i 7.x.x. Kromě toho poskytujeme podporu pouze pro problémy související s ABP Framework a ABP Commercial. To znamená, že neposkytujeme žádnou podporu aplikacím třetích stran, cloudovým službám a dalším periferním knihovnám používaným produkty ABP. Vynaložíme komerčně přiměřené úsilí, abychom našim zákazníkům poskytli technickou podporu během oficiální pracovní doby společnosti \"Volosoft Bilisim A.S\". Na druhou stranu se nezavazujeme k době odezvy podle dohody o úrovni služeb (SLA), ale budeme se snažit reagovat na technické problémy co nejrychleji v rámci naší oficiální pracovní doby. Pokud není se zákazníkem uzavřena zvláštní dohoda, poskytujeme podporu pouze na adrese https://support.abp.io. Máme také soukromou e-mailovou podporu, která je k dispozici pouze držitelům licence Enterprise.",
    "TotalDevelopers": "Celkový počet vývojářů: {0}",
    "CustomPurchaseExplanation": "Na míru vašim konkrétním potřebám",
    "WhereDidYouHearAboutUs": "Kde jste se o nás dozvěděli?",
    "Twitter": "Cvrlikání",
    "Facebook": "Facebook",
    "Youtube": "Youtube",
    "Google": "Google",
    "Github": "GitHub",
    "Friend": "Od přítele",
    "Other": "jiný",
    "WhereDidYouHearAboutUs_explain": "Upřesněte...",
    "DeletingMemberWarningMessage": "„{0}“ bude odstraněn ze seznamu vývojářů. Pokud chcete, můžete toto prázdné místo později přiřadit jinému vývojáři.",
    "AdditionalInfo": "Pokud jsou křesla vývojářů nad vašimi požadavky, můžete je snížit. Můžete poslat e-mail na <a href=\"mailto:info@abp.io\">adresu info@abp.io</a> a odebrat některá svá vývojářská místa. Vymazáním nevyužitých míst pro vývojáře snížíte náklady na obnovení licence. Pokud chcete, můžete si během aktivního licenčního období znovu zakoupit další křesla pro vývojáře. Vzhledem k tomu, že tento licenční balíček obsahuje {0} vývojářů, nemůžete tento počet snížit.",
    "LinkExpiredErrorMessage": "Platnost odkazu, ke kterému se pokoušíte získat přístup, vypršela.",
    "ExpirationDate": "Datum spotřeby",
    "SpringCampaignDiscount": "Jarní kampaňová sleva",
    "WhyUseAbpIoPlatform": "Proč bych měl používat platformu ABP.IO místo vytváření nového řešení od začátku?",
    "WhyUseAbpIoPlatformFaqExplanation": "Na <a href=\"/why-abp-io \">této stránce</a> najdete podrobné vysvětlení, proč má používání platformy ABP.IO značnou výhodu oproti tomu, abyste si vše dělali sami.",
    "EulaPageTitle": "Licenční smlouva s koncovým uživatelem (EULA)",
    "PrivacyPolicyPageTitle": "Zásady ochrany osobních údajů – Zásady používání souborů cookie",
    "TermsConditionsPageTitle": "Pravidla a podmínky",
    "TrainingsPageTitle": "Školicí balíčky ABP",
    "ModulesPageTitle": "ABP Pre-Built Application Modules",
    "Volo.AbpIo.Commercial:040001": "Přístupový klíč API je nesprávný.",
    "GetLepton": "Získejte Lepton hned teď",
    "MyOrganizations_Detail_LicenseStartDate": "Datum zahájení licence",
    "MyOrganizations_Detail_LicenseExpiryDate": "Datum vypršení platnosti",
    "BlazoriseSupport": "Jak získám licenční klíč Blazorise a podporu od týmu Blazorise?",
    "BlazoriseSupportExplanation": "Chcete-li získat podporu od týmu Blazorise a získat svůj licenční klíč Blazorise, postupujte podle následujících kroků:",
    "BlazoriseSupportExplanation1": "Zaregistrujte si nový účet na <a href=\"https://blazorise.com/support/register\">blazorise.com/support/register</a> se stejnou e-mailovou adresou jako váš účet abp.io. Položku „Licenční klíč“ ponechte prázdnou. <strong>Musí to být stejná e-mailová adresa jako váš e-mailový účet na abp.io.</strong>",
    "BlazoriseSupportExplanation2": "Ověřte svou e-mailovou adresu kontrolou e-mailové schránky. Pokud v doručené poště nevidíte žádný e-mail, zkontrolujte schránku spamu!",
    "BlazoriseSupportExplanation3": "Přihlaste se na web podpory Blazorise na <a href=\"https://blazorise.com/support/login\">adrese blazorise.com/support/login</a> .",
    "BlazoriseSupportExplanation4": "Pokud máte aktivní licenci ABP Commercial, budete mít také licenci Blazorise PRO. Licenční klíč Blazorise můžete získat na <a href=\"https://blazorise.com/support/user/manage/license\">adrese blazorise.com/support/user/manage/license</a> .",
    "BlazoriseSupportExplanation5": "Své dotazy můžete zveřejnit na webu podpory a vygenerovat produktový token pro vaši aplikaci.",
    "AbpLiveTrainingPackages": "ABP živé tréninkové balíčky",
    "Releases": "Vydání",
    "ReleasesDescription": "Uvolněte protokoly ABP Commercial.",
    "ReleaseDate": "Datum vydání",
    "Labels": "Štítky",
    "PreRelease": "Předběžné vydání",
    "AllTypes": "Všechny typy",
    "Enhancement": "Zvýšení",
    "Bug": "Chyba",
    "Feature": "Vlastnosti",
    "AllUIs": "Všechna uživatelská rozhraní",
    "MVC": "MVC",
    "BlazorServer": "Server Blazor",
    "MAUI": "MAUI",
    "HowItWorks_Page_Title": "Jak to funguje?",
    "HowItWorks_Page_Description": "ABP Framework rozšiřuje platformu .NET. Takže vše, co můžete dělat s jednoduchým řešením .NET, je již možné s ABP Framework. Díky tomu je snadné začít s nízkou křivkou učení.",
    "HowItWorks_Description1": "ABP Framework rozšiřuje platformu .NET. Takže vše, co můžete dělat s jednoduchým řešením .NET, je již možné s ABP Framework. Díky tomu je snadné začít s nízkou křivkou učení.",
    "HowItWorks_Description2": "Jakmile se začnete učit a používat funkce ABP Framework, vývoj vašeho softwaru bude mnohem zábavnější než kdy předtím.",
    "HowItWorks_Description3": "Tato stránka v podstatě vysvětluje, jak používáte platformu ABP.IO jako vývojář .NET.",
    "CreateANewSolution": "Vytvořte nové řešení .NET",
    "CreateANewSolution_Description1": "Vše začíná vytvořením nového integrovaného řešení .NET ABP.",
    "StartWithStartupTemplates": "Spusťte jednu z předem vytvořených <a href=\"/startup-templates\">šablon řešení pro spuštění</a>",
    "SimpleMonolithApplicationTemplate": "Jednoduchá šablona aplikace monolitu",
    "LayeredApplicationTemplate": "Šablona aplikace s vrstvami",
    "MicroserviceSolutionTemplate": "Šablona řešení mikroservisu",
    "CreateEmptySolutionAndUseAbp": "Nebo vytvořte nové prázdné řešení .NET a nainstalujte <a href=\"https://abp.io/packages\" target=\"_blank\">balíčky</a> ABP NuGet &amp; NPM sami.",
    "CreatingSolutionWithMultipleOptions": "Při vytváření nového řešení existuje několik možností uživatelského rozhraní a databáze.",
    "UIFrameworkOptions": "Možnosti rozhraní uživatelského rozhraní",
    "DotnetSolutionWithoutDependency": "Nyní máte ve svém místním počítači běžné řešení .NET, které není závislé na cloudové platformě nebo externí službě.",
    "CheckTheDocumentForDetails": "Podrobnosti naleznete v dokumentu <a href=\"{0}\" target=\"_blank\">{1}</a> .",
    "UIAndDatabaseIndependent": "ABP může pracovat s jakýmkoli uživatelským rozhraním a jakýmkoli poskytovatelem databáze podporovaným .NET. \n Tito poskytovatelé uživatelského rozhraní a databází jsou však předem integrováni a dobře zdokumentováni.",
    "InstallAbpModules": "Nainstalujte moduly ABP",
    "DevelopYourSolution": "Rozvíjejte své řešení",
    "DeployAnywhere": "Nasadit kdekoli",
    "InstallAbpModule_Description1": "ABP je modulární rámec pro vývoj aplikací. Šablony spouštěcích řešení jsou již dodávány s nainstalovanými základními moduly. \n Existuje však více aplikačních modulů, které můžete chtít ve svém řešení použít.",
    "InstallAbpModule_Description2": "Každý modul se skládá z několika balíčků NuGet a NPM a má instalační dokument. <a href=\"/tools/suite\">ABP Suite</a> provádí většinu práce automaticky, poté modul ručně konfigurujete nebo dolaďujete na základě jeho dokumentace.",
    "DevelopYourSolution_Description1": "Infrastruktura ABP vás nutí <b class=\"text-white\">soustředit se na váš vlastní obchodní kód</b> automatizací opakující se práce a poskytováním předem vytvořené infrastruktury a <a href=\"https://abp.io/features\" target=\"_blank\">funkcí</a> aplikací.",
    "DevelopYourSolution_Description2": "V následujícím bloku kódu můžete vidět, jak se ABP Framework hladce integruje do vašeho kódu a automatizuje za vás opakující se úkoly.",
    "DevelopYourSolution_Description3": "I v tomto bloku krátkého kódu za vás ABP udělá spoustu věcí.",
    "DevelopYourSolution_Description4": "Poskytuje základní třídy pro použití konvencí, jako je <a href=\"https://docs.abp.io/en/abp/latest/Dependency-Injection\" target=\"_blank\">vkládání závislostí</a> \n . Obecné služby <a href=\"https://docs.abp.io/en/abp/latest/Repositories\" target=\"_blank\">úložiště</a> \n poskytují pohodlný způsob interakce s databází \n . Deklarativní <a href=\"https://docs.abp.io/en/abp/latest/Authorization\" target=\"_blank\">autorizace</a> \n funguje s vyladěným systémem oprávnění.",
    "DevelopYourSolution_Description5": "ABP zcela automatizuje <a href=\"https://docs.abp.io/en/abp/latest/Unit-Of-Work\" target=\"_blank\">jednotku práce</a> \n (pro připojení k databázi a správu transakcí), <a href=\"https://docs.abp.io/en/abp/latest/Exception-Handling\" target=\"_blank\">zpracování výjimek</a> \n , <a href=\"https://docs.abp.io/en/abp/latest/Validation\" target=\"_blank\">ověřování</a> \n \n a <a href=\"https://docs.abp.io/en/abp/latest/Audit-Logging\" target=\"_blank\">protokolování auditu</a> . Poskytuje mnohem více stavebních bloků pro zjednodušení vašich každodenních vývojových úkolů a zaměření se na váš vlastní kód při vytváření aplikací \n připravených pro produkci.",
    "DevelopYourSolution_Description6": "Dokážete si představit, jak moc může být tento blok kódu dlouhý a komplikovaný, kdybyste to všechno dělali ručně.",
    "SuiteCrudGenerationInFewSeconds": "Kromě ručního kódování vašeho řešení můžete vytvořit plně funkční pokročilé stránky CRUD během několika minut pomocí nástrojů ABP Suite. Vygeneruje kód do vašeho řešení, takže jej můžete doladit na základě vašich vlastních požadavků.",
    "DeployAnywhere_Description1": "Na konci dne máte čisté řešení .NET. Své řešení můžete nasadit na svůj vlastní server, na cloudovou platformu, na Kubernetes nebo kdekoli chcete. Můžete nasadit na tolik serverů, kolik chcete. ABP je agnostický nástroj prostředí nasazení.",
    "ExpertiseAbpFramework": "Zkušenosti s rámcem ABP",
    "ExpertiseAbpFramework_Description1": "Chcete jít nad rámec základů a získat odborné znalosti s platformou ABP.IO?",
    "FreeDownload": "Stažení zdarma",
    "Read": "Číst",
    "HavingTrouble": "Mít potíže?",
    "HavingTrouble_Description1": "Máte problémy s vývojem svého řešení? Jsme zde! Použijte platformu podpory ABP \n nebo pošlete e-mail a získejte pomoc přímo od členů týmu Core ABP Framework.",
    "WeAreHereToHelp_Description1": "Můžete procházet naše témata nápovědy nebo hledat v často kladených otázkách, \n nebo nám můžete položit otázku pomocí kontaktního formuláře.",
    "OtherModules": "Další moduly",
    "OtherModules_Description1": "Účet, protokolování auditu, chat, sada CMS, správa souborů, formuláře, GDPR, identita, správa jazyků, platby, Saas a další...",
    "HowItWorks_DatabaseProviderOptions": "Možnosti poskytovatele databáze",
    "SeeFAQ": "Viz FAQ",
    "ReleaseLogs": "Protokoly vydání",
    "ReleaseLogs_Tag": "{0} Protokoly vydání",
    "ReleaseLogs_Pr": "Vytáhnout požadavek č. {0} – {1}",
    "NoLabels": "Žádné štítky",
    "DoesTheSubscriptionRenewAutomatically": "Obnovuje se předplatné automaticky?",
    "DoesTheSubscriptionRenewAutomaticallyExplanation": "ABP Commercial nemá model účtování s automatickým obnovením. <strong>Vaše předplatné proto nebude na konci licenčního období automaticky obnoveno</strong> . Pokud chcete i nadále využívat výhody ABP Commercial, musíte si jej ručně obnovit na <a href=\"/my-organizations\">stránce správy organizace</a> . Pokud máte více organizací, klikněte na tlačítko „Spravovat“ u vaší organizace, jejíž platnost vypršela, a poté kliknutím na tlačítko „Prodloužit nyní“ obnovte svou licenci. Můžete se také podívat na <a href=\"/faq#what-happens-when-license-ends\">Co se stane, když moje licence skončí?</a> sekce.",
    "ExtraQuestionCreditsFaqTitle": "Mohu si zakoupit další kredity na otázky podpory?",
    "ExtraQuestionCreditsFaqExplanation": "Ano můžeš. Chcete-li zakoupit další kredity na otázky, pošlete e-mail na adresu <a href=\"mailto:info@abp.io\">info@abp.io</a> s názvem vaší organizace. Zde je ceník kreditů za další otázky:<ul><li> Balíček 50 otázek za 999 $</li><li> Balíček 25 otázek za 625 $</li><li> Balíček 15 otázek 450 $</li></ul>",
    "AlreadyBetaTester": "Již jste se zapojili do programu beta testerů.",
    "AbpStudio": "Studio ABP",
    "AbpStudio_Description": "ABP Studio je stále ve vývoji. Chcete-li být jedním z prvních uživatelů, můžete vyplnit formulář níže.",
    "AbpStudio_Description1": "ABP Studio je <span class=\"text-highlight-white\">multiplatformní desktopová aplikace</span> pro vývojáře ABP.",
    "AbpStudio_Description2": "Je <span class=\"text-highlight-white\">dobře integrován</span> do ABP Framework a jeho cílem je poskytnout vám pohodlné vývojové prostředí tím, že <span class=\"text-highlight-white\">automatizuje věci, poskytuje přehled</span> o vašem řešení, usnadňuje <span class=\"text-highlight-white\">vývoj, provoz</span> a <span class=\"text-highlight-white\">nasazení</span> vašich řešení.",
    "AbpStudio_ComingSoon": "Již brzy <span class=\"opacity-50 ms-0 ms-md-3 d-block d-md-inline-block \">Plánované datum vydání beta: 4. čtvrtletí roku 2023.</span>",
    "AbpStudio_PlannedPreviewDate": "Plánované datum vydání náhledu: 4. čtvrtletí roku 2023.",
    "BetaRequest": "Žádost o beta verzi",
    "CreateNewSolutions": "Vytvářejte nová řešení",
    "CreateNewSolutions_Description1": "Můžete snadno vytvářet od jednoduchých aplikací až po modulární monolitní nebo mikroservisní řešení se spoustou možností. Získáte kompletní základní softwarové řešení připravené pro výrobu pro vaši firmu.",
    "ArchitectYourSolutions": "Navrhněte svá řešení",
    "ArchitectYourSolutions_Description1": "Vytvářejte monolitní modulární a mikroservisní struktury řešení snadněji vytvořením modulů nebo služeb a navázáním vztahů mezi nimi. Můžete také nainstalovat nebo odinstalovat moduly předem sestavené aplikace.",
    "ExploreYourSolution": "Prozkoumejte své řešení",
    "ExploreYourSolution_Description1": "ABP Studio zobrazuje na vysoké úrovni pohled na komponenty vašeho řešení a moduly, na kterých vaše řešení závisí. Můžete prozkoumat entity, služby, HTTP API a mnoho dalšího, aniž byste museli otevírat svou kódovou základnu.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze": "Spusťte řešení pro více aplikací nebo mikroslužeb v brzké době",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description1": "Spusťte jednu, <span class=\"text-highlight-white\">více</span> nebo <span class=\"text-highlight-white\">všechny služby</span> jediným kliknutím. Tímto způsobem je velmi snadné zastavit službu, spustit ji ve Visual Studiu pro <span class=\"text-highlight-white\">testování</span> nebo <span class=\"text-highlight-white\">ladění</span> .",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description2": "Prohlédněte si seznam služeb, prohlédněte si <span class=\"text-highlight-white\">požadavek HTTP v reálném čase</span> a <span class=\"text-highlight-white\">počty výjimek</span> pro každou službu.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description3": "Podívejte se na všechny podrobnosti všech <span class=\"text-highlight-white\">požadavků HTTP</span> přicházejících do jakékoli služby.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description4": "Prozkoumejte <span class=\"text-highlight-white\">podrobnosti o výjimkách</span> v reálném čase v jakékoli službě, snadno filtrujte a vyhledávejte.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description5": "Zobrazit <span class=\"text-highlight-white\">protokoly aplikace</span> , filtrovat podle úrovně protokolu nebo hledat podle textu.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description6": "<span class=\"text-highlight-white\">Procházejte</span> uživatelské rozhraní vaší aplikace, aniž byste opustili běh řešení.",
    "IntegrateToYourKubernetesCluster": "Integrujte se do svého Kubernetes Clusteru",
    "IntegrateToYourKubernetesCluster_Description1": "<span class=\"text-highlight-white\">Připojte své místní vývojové prostředí k místnímu nebo vzdálenému clusteru Kubernetes</span> , kde tento cluster již provozuje vaše řešení mikroslužeb.",
    "IntegrateToYourKubernetesCluster_Description2": "Získejte přístup k jakékoli službě v Kubernetes s názvem služby jako DNS, stejně jako běží ve vašem místním počítači.",
    "IntegrateToYourKubernetesCluster_Description3": "<span class=\"text-highlight-white\">Zachyťte jakoukoli službu</span> v tomto clusteru, takže veškerý <span class=\"text-highlight-white\">provoz na zachycenou službu bude automaticky přesměrován na vaši službu</span> , která běží na vašem místním počítači. Když vaše služba potřebuje používat jakoukoli službu v Kubernetes, provoz je přesměrován zpět do clusteru, stejně jako vaše místní služba běží uvnitř Kubernetes.",
    "GetInformed": "Informujte se",
    "Studio_GetInformed_Description1": "Nechte své kontaktní údaje, abyste <span class=\"text-highlight-white\">byli informováni</span> , a <span class=\"text-highlight-white\">vyzkoušejte to jako první</span> , až bude ABP Studio spuštěno.",
    "Studio_GetInformed_Description2": "Plánované datum vydání ukázky: 3. čtvrtletí roku 2023.",
    "ThankYou!": "Děkuji!",
    "SendBetaRequest": "Odeslat žádost o beta verzi",
    "YouJoinedTheBetaTesterProgram": "Zapojili jste se do programu beta testerů ABP Studio.",
    "PricingExplanation2": "30denní záruka vrácení peněz — <a href=\"/faq#refund-policy\">Zjistěte více</a>",
    "MoneyBackGuaranteeText": "* 30denní záruka vrácení peněz na všechny licence! 100% refundace za Team, 60% refundace za Business a Enterprise licence do 30 dnů.",
    "MobileApplicationStartupTemplates": "Šablony spouštění mobilních aplikací",
    "MobileApplicationStartupTemplates_Description1": "Integrované šablony spouštění mobilních aplikací pro vaše komerční řešení ABP.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates": "Vytvářejte výkonné podnikové aplikace pomocí šablon ABP Mobile Startup Templates",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description1": "ABP Commercial poskytuje dvě šablony spouštění mobilních aplikací implementované pomocí <span class=\"text-highlight\">React Native</span> a <span class=\"text-highlight\">.NET MAUI.</span> Když vytvoříte své nové řešení založené na ABP, budete mít také základní spouštěcí aplikace připojené k vašim backendovým API.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description2": "Aplikace má předem vytvořený cyklus autentizačních tokenů, <span class=\"text-highlight\">podporu více jazyků, podporu více nájmů, přihlašovací jméno, zapomenuté heslo, správu profilů a stránku správy uživatelů</span> . Můžete přidat vlastní obchodní logiku a přizpůsobit ji na základě vašich požadavků.",
    "TwoFrameworkOptions": "Dvě možnosti rámce",
    "TwoFrameworkOptions_Description": "ABP poskytuje mobilní spouštěcí šablony <span class=\"text-highlight\">React Native</span> i <span class=\"text-highlight\">.NET MAUI</span> . Tímto způsobem si můžete vybrat ten, který nejlépe vyhovuje vašim potřebám. Obě aplikace znovu používají kód nejvyšší rychlostí mezi platformami iOS a Android.",
    "PreIntegratedToYourBackend": "Předintegrováno do vašeho backendu",
    "PreIntegratedToYourBackend_Description": "Aplikace ABP Mobile jsou předem integrovány do vašich backendových API. Získá platný ověřovací token ze serveru a provede ověřené požadavky.",
    "MultiLanguage": "Vícejazyčný",
    "MultiLanguage_Description": "Již po vybalení podporuje více než 10 jazyků. Můžete také přidat další jazyky.",
    "Arabic": "arabština",
    "Czech": "čeština",
    "English": "Angličtina",
    "Hungarian": "maďarský",
    "Finnish": "finština",
    "French": "francouzština",
    "Hindi": "hindština",
    "Portuguese": "portugalština",
    "Italian": "italština",
    "Russian": "ruština",
    "Slovak": "Slovák",
    "Turkish": "turečtina",
    "EngageAndRetainYourCustomersWithABPMobileApps": "Zaujměte a udržte si své zákazníky pomocí mobilních aplikací ABP",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description1": "Vaši zákazníci chtějí spravovat své produkty a předplatná odkudkoli a kdykoli. To vyžaduje, aby organizace vytvářely mobilní aplikace, které zákazníkům umožní rychle a hladce plnit jejich požadavky.",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description2": "S aplikacemi ABP Mobile můžete vytvářet vysoce kvalitní nativní mobilní aplikace pro Android a iOS... Pomocí jediné kódové základny a bez kompromisů v oblasti zabezpečení, kvality nebo škálovatelnosti.",
    "OneCodeBaseMultipleDevices": "Jedno kódová základna více zařízení",
    "OneCodeBaseMultipleDevices_Description": "Mobilní aplikace ABP jsou multiplatformní. Jsou připraveny k instalaci a spuštění na zařízeních iOS a Android a přizpůsobují se různým tvarovým faktorům pomocí jediné kódové základny. Vývojáři potřebují vytvořit uživatelské rozhraní a front-end kód pouze jednou, není třeba upravovat kód pro každé zařízení, které chcete podporovat.",
    "ComesWithTheSourceCode": "Dodává se se zdrojovým kódem",
    "ComesWithTheSourceCode_Description": "Mobilní aplikace jsou dodávány se zdrojovým kódem. Snadno přizpůsobte uživatelské rozhraní/uživatelské rozhraní svých aplikací tak, aby splňovaly pokyny pro branding.",
    "Purchase_OneYearPrice": "Cena za 1 rok",
    "Purchase_DeveloperSeatCount": "Počet křesel vývojáře",
    "Purchase_DevelopersAlreadyIncluded": "Již je zahrnuto {0} vývojářů",
    "1Year": "1 rok",
    "{0}Years": "{0} let",
    "1YearLicense": "Licence na 1 rok",
    "{0}YearsLicense": "Licence na {0} let",
    "1AdditionalDeveloper": "1 Další vývojář",
    "{0}AdditionalDevelopers": "{0} Další vývojáři",
    "Discount": "Sleva ({0} %)",
    "Summary": "souhrn",
    "TrainingPack": "Tréninkový balíček",
    "TrainingPackDiscount": "Sleva na tréninkový balíček",
    "Purchase_OnboardingTraining_Description": "Tento živý tréninkový balíček platí pro třídu 8 studentů a tato sleva je platná pouze při zakoupení s novou licencí. <a href=\"{0}\" class=\"text-white\">Zjistěte více<i class=\"fa fa-external-link ms-1\"></i></a>",
    "Purchase_Save": "<span class=\"save ms-1\">Úspora {0}% {1} {2}</span>",
    "RemoveBasket": "Vyjměte z košíku",
    "WhyABPIOPlatform?": "Proč <span class=\"gradient-commercial\">platforma ABP.IO</span> ?",
    "DocumentAim": "Tento dokument si klade za cíl odpovědět na velkou otázku:",
    "DocumentAim_Description": "&quot;Proč byste měli používat platformu ABP.IO místo vytváření nového řešení od začátku?&quot;",
    "DocumentAim_Description2": "Dokument představuje výzvy při budování moderního softwarového řešení a vysvětluje, jak ABP tyto výzvy řeší.",
    "CreatingANewSolution": "Vytvoření nového řešení",
    "CreatingANewSolution_Description": "Když potřebujete začít s novým řešením, musíte si položit spoustu otázek a měli byste strávit spoustu času, než začnete psát svůj úplně první obchodní kód.",
    "CreatingAnEmptySolution": "Vytvoření prázdného řešení",
    "THEPROBLEM": "PROBLÉM",
    "CreatingAnEmptySolution_THEPROBLEM_Description": "I vytvoření téměř prázdného řešení je náročné;",
    "CreatingAnEmptySolution_THEPROBLEM_Description2": "Jak organizujete svou kódovou základnu napříč projekty?",
    "CreatingAnEmptySolution_THEPROBLEM_Description3": "Co jsou to vrstvy a jak se ovlivňují?",
    "CreatingAnEmptySolution_THEPROBLEM_Description4": "Jak se integrujete do knihoven a systémů třetích stran?",
    "CreatingAnEmptySolution_THEPROBLEM_Description5": "Jak nastavit automatické testy?",
    "ABPSOLUTION": "ŘEŠENÍ ABP",
    "CreatingAnEmptySolution_ABPSOLUTION_Description": "ABP poskytuje dobře navržené, vrstvené a produkčně připravené <a href=\"https://docs.abp.io/en/abp/latest/Startup-Templates/Application\" target=\"_blank\">spouštěcí řešení</a> založené na principech <a href=\"https://docs.abp.io/en/abp/latest/Domain-Driven-Design\" target=\"_blank\">Domain Driven Design</a> . Součástí řešení je také předem nakonfigurovaná jednotka a integrační <a href=\"https://docs.abp.io/en/abp/latest/Testing\" target=\"_blank\">testovací</a> projekty pro každou vrstvu.",
    "CommonLibraries": "Společné knihovny",
    "CommonLibraries_THEPROBLEM_Description": "Které knihovny byste měli použít k implementaci společných požadavků? Ekosystém vývoje softwaru je vysoce dynamický, takže je náročné držet krok s nejnovějšími nástroji, knihovnami, trendy a přístupy.",
    "CommonLibraries_ABPSOLUTION_Description": "ABP do řešení předem integruje oblíbené, vyspělé a aktuální knihovny. Nemusíte trávit čas jejich integrací nebo jejich vzájemnou komunikací. Po vybalení fungují správně.",
    "UITheme&Layout": "Téma a rozvržení uživatelského rozhraní",
    "UITheme&Layout_THEPROBLEM_Description": "Při řešení problémů uživatelského rozhraní se objevuje řada problémů. Patří mezi ně vytvoření základu pro citlivou, moderní a přizpůsobivou sadu uživatelského rozhraní s konzistentním vzhledem a řadou funkcí, jako jsou navigační nabídky, záhlaví, panely nástrojů, zápatí, widgety a další.",
    "UITheme&Layout_THEPROBLEM_Description2": "I když se rozhodnete pro předem navržený motiv, jeho bezproblémová integrace do vašeho projektu může vyžadovat dny vývoje. Další překážka spočívá v upgradování takových témat. Struktura HTML/CSS motivu se často prolíná s vaším kódem uživatelského rozhraní a vykresluje budoucí změny motivu nebo upgrady složité úkoly. Toto prolínání kódu a designu komplikuje flexibilitu provádění úprav.",
    "UITheme&Layout_ABPSOLUTION_Description": "ABP Framework nabízí výrazný systém motivů, který osvobozuje váš kód uživatelského rozhraní od omezení motivu. Motivy existují izolovaně, zabalené jako balíčky NuGet nebo NPM, takže instalace nebo upgrady motivu jsou otázkou minut. I když si ponecháte možnost vyvinout vlastní téma nebo integrovat stávající, ABP Commercial představuje kolekci vybroušených a současných témat.",
    "UITheme&Layout_ABPSOLUTION_Description2": "Kromě toho existují poskytovatelé komponent uživatelského rozhraní, jako jsou Telerik a DevExpress. Tito poskytovatelé však primárně dodávají jednotlivé komponenty, přičemž je na vás, abyste vytvořili svůj systém uspořádání. Při práci v projektech založených na ABP můžete tyto knihovny hladce začlenit, podobně jako v jakémkoli jiném projektu.",
    "TestInfrastructure": "Testovací infrastruktura",
    "TestInfrastructure_THEPROBLEM_Description": "Vytvoření robustního testovacího prostředí je časově náročné úsilí. Zahrnuje nastavení vyhrazených testovacích projektů v rámci vašeho řešení, pečlivý výběr potřebných nástrojů, vytváření simulací služeb a databází, vytváření základních základních tříd a pomocných služeb pro minimalizaci nadbytečného kódu napříč testy a řešení různých souvisejících úkolů.",
    "TestInfrastructure_ABPSOLUTION_Description": "ABP Startup Templates jsou dodávány předem vybavené nakonfigurovanými testovacími projekty, které vám celý proces zjednodušují. To znamená, že od prvního dne můžete snadno a bez prodlení začít psát kód počáteční jednotky nebo integračního testu.",
    "CodingStandards&Training": "Standardy kódování a školení",
    "CodingStandards&Training_THEPROBLEM_Description": "Poté, co nastavíte řešení pro vývoj, obvykle musíte vývojáře naučit, jak systém funguje a jak jej postavit pomocí stejných dohodnutých metod. I když jim poskytnete školení, udržování dokumentace v aktuálním stavu může být obtížné. Jak čas plyne, každý vývojář může psát kód svým vlastním způsobem, což způsobí, že se pravidla pro psaní kódu budou navzájem lišit.",
    "CodingStandards&Training_ABPSOLUTION_Description": "Řešení ABP je již úhledně uspořádáno a má jasné vysvětlení. Výukové programy a průvodce krok za krokem vám přesně ukáží, jak pracovat na projektu ABP.",
    "KeepingYourSolutionUpToDate": "Udržujte své řešení aktuální",
    "KeepingYourSolutionUpToDate_THEPROBLEM_Description": "Po zahájení vývoje musíte sledovat nové verze knihoven, které používáte pro upgrady a opravy.",
    "KeepingYourSolutionUpToDate_ABPSOLUTION_Description": "Všechny balíčky pravidelně aktualizujeme na nejnovější verze a testujeme je před stabilním vydáním. Když aktualizujete ABP Framework, všechny jeho závislosti se upgradují na špičkovou technologii.",
    "DRY": "Neopakujte se!",
    "DRY_Description": "Vytvoření základního řešení zabere značný čas a vyžaduje dobré architektonické zkušenosti. Toto je však jen začátek! Když začnete vyvíjet, budete pravděpodobně muset napsat spoustu opakujícího se kódu; to by bylo skvělé, kdyby to všechno šlo zvládnout automaticky.",
    "DRY_Description2": "ABP co nejvíce automatizuje a zjednodušuje opakování kódu tím, že se řídí konvencí nad konfigurací. Neomezuje vás však, když potřebujete přepnout na manuální převodovku. Ovládání je vždy ve vašich rukou.",
    "Authentication": "Autentizace",
    "Authentication_THEPROBLEM_Description": "Single Sign On, integrace Active Directory / LDAP, integrace OpenIddict, sociální přihlášení, dvoufaktorová autentizace, zapomenuté/resetované heslo, aktivace e-mailu, registrace nového uživatele, kontrola složitosti hesla, zamykání účtu při neúspěšných pokusech, zobrazování neúspěšných pokusů o přihlášení... atd. Víme, že všechny tyto obecné požadavky znáte. Nejsi sám!",
    "Authentication_ABPSOLUTION_Description": "ABP Framework a komerční verze poskytují všechny tyto standardní věci předem implementované jako znovu použitelný modul účtu. Stačí povolit a nakonfigurovat, co potřebujete.",
    "CrossCuttingConcerns": "Průřezové obavy",
    "CrossCuttingConcerns_THEPROBLEM_Description": "Průřezové obavy jsou základní opakující se logikou, která by měla být implementována pro každý případ použití. Nějaké příklady;",
    "CrossCuttingConcerns_THEPROBLEM_Description2": "Zahájení transakcí, potvrzení úspěchu a vrácení při chybách.",
    "CrossCuttingConcerns_THEPROBLEM_Description3": "Zpracování a hlášení výjimek, vracení řádné chybové odpovědi klientům a řešení chybových případů na straně klienta.",
    "CrossCuttingConcerns_THEPROBLEM_Description4": "Implementace autorizace a ověřování, vracení správných odpovědí a jejich zpracování na straně klienta.",
    "CrossCuttingConcerns_ABPSOLUTION_Description": "ABP Framework automatizuje nebo zjednodušuje všechny běžné průřezové problémy. Napíšete pouze kód, který je důležitý pro vaši firmu, a ABP se postará o zbytek podle konvencí.",
    "ArchitecturalInfrastructure": "Architektonická infrastruktura",
    "ArchitecturalInfrastructure_THEPROBLEM_Description": "Pro správnou implementaci architektury obvykle potřebujete vybudovat infrastrukturu. Například obecně implementujete vzor úložiště. Definujete některé základní třídy pro zjednodušení a standardizaci pro vytváření entit, služeb, kontrolérů a dalších objektů.",
    "ArchitecturalInfrastructure_ABPSOLUTION_Description": "ABP Framework poskytuje všechny tyto a další hned po vybalení. Je vyzrálá a dobře zdokumentovaná.",
    "EnterpriseApplicationRequirements": "Požadavky na podnikové aplikace",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description": "Existuje mnoho požadavků, které opakovaně implementujete v každé podnikové aplikaci;",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description2": "Podrobný systém oprávnění a správa oprávnění v uživatelském rozhraní na základě rolí a uživatelů.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description3": "Psaní protokolů auditu a historie entit ke sledování, kdy uživatel upraví záznam databáze.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description4": "Proveďte měkké odstranění entit, aby byly označeny jako odstraněné místo fyzického odstranění z databáze a automatického filtrování odstraněných entit ve vašich dotazech.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description5": "Vytváření abstrakcí a obalů pro využití vašich backendových API z frontendového kódu.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description6": "Zařazování a provádění úloh na pozadí.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description7": "Zpracování více časových pásem v globálním systému.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description8": "Sdílení validace, lokalizace, autorizační logika mezi serverem a klientem.",
    "EnterpriseApplicationRequirements_ABPSOLUTION_Description": "ABP poskytuje infrastrukturu pro snadnou implementaci těchto požadavků. Opět nemusíte trávit svůj drahocenný čas tím, abyste toto vše znovu a znovu zavedli.",
    "GeneratingInitialCode&Tooling": "Generování počátečního kódu a nástroje",
    "GeneratingInitialCode&Tooling_THEPROBLEM_Description": "V typické webové aplikaci vytvoříte mnoho podobných stránek. Většina z nich bude provádět podobné operace CRUD. Opakované vytváření takových stránek je velmi zdlouhavé a také náchylné k chybám.",
    "GeneratingInitialCode&Tooling_ABPSOLUTION_Description": "<a href=\"/tools/suite\">ABP Suite</a> dokáže pro vaše entity vygenerovat kompletní stránku CRUD během několika sekund. Vygenerovaný kód je vrstvený a čistý. Jsou implementovány všechny standardní požadavky na validaci a autorizaci. Navíc jsou generovány třídy unit testů. Jakmile získáte plně spuštěnou stránku, můžete ji upravit podle vašich obchodních požadavků.",
    "IntegratingTo3rdPartyLibrariesAndSystems": "Integrace do knihoven a systémů třetích stran",
    "IntegratingTo3rdPartyLibrariesAndSystems_THEPROBLEM_Description": "Většina knihoven je navržena jako nízkoúrovňová a obvykle uděláte nějakou práci, abyste je správně integrovali, aniž byste všude ve svém řešení opakovali stejný integrační a konfigurační kód. Předpokládejme například, že musíte použít RabbitMQ k implementaci distribuované sběrnice událostí. Vše, co chcete udělat, je; odeslat zprávu do fronty a zpracovat příchozí zprávy. Musíte však rozumět vzorcům zpráv, frontám a podrobnostem o výměně. Chcete-li napsat efektivní kód, musíte vytvořit fond pro správu připojení, klientů a kanálů. Musíte také řešit výjimky, zprávy ACK, opětovné připojení k RabbitMQ při selhání a další.",
    "IntegratingTo3rdPartyLibrariesAndSystems_ABPSOLUTION_Description": "Například integrace RabbitMQ Distributed Event Bus od ABP abstrahuje všechny tyto detaily. Můžete odesílat a přijímat zprávy bez shonu. Potřebujete napsat nízkoúrovňový kód? Žádný problém, to můžete udělat vždy. ABP vás neomezuje, když potřebujete používat nízkoúrovňové funkce knihovny, kterou používáte.",
    "WhyNotBuildYourOwnFramework?": "Proč si nepostavit svůj vlastní rámec?",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description": "Veškerá infrastruktura, a to i tím nejjednodušším způsobem, zabere spoustu času na vybudování, údržbu a dokumentaci. Postupem času se zvětšuje a je těžké ho ve vašem řešení udržet. Jejich rozdělení do znovu použitelného projektu je výchozím bodem pro vytvoření vlastního interního rámce.",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description2": "Budování, dokumentace, školení a udržování interního rámce je opravdu těžké. Pokud nemáte zkušený, specializovaný framework tým, váš interní framework se rychle stane nezdokumentovaným starším kódem, kterému už nikdo nemůže rozumět a udržovat jej. Na druhou stranu, tyto rámce jsou obecně vyvíjeny jedním nebo dvěma vývojáři v týmu. A tito borci se stávají silem vědomostí. Je to dobré pro ně, ale špatné pro společnost, protože jsou jediným bodem selhání projektu <a href=\"https://en.wikipedia.org/wiki/Single_point_of_failure\">-SPOF-</a> . Jakmile opustí společnost, projekt dramaticky upadne.",
    "WhyNotBuildYourOwnFramework_ABPSOLUTION_Description": "ABP Framework je komunitou řízený, dobře zdokumentovaný, vyspělý a generický aplikační rámec. Tým velmi zkušených vývojářů tvrdě pracuje na tom, aby byl aktuální, snadno srozumitelný a pohodlný na používání. Použití takového stabilního rámce vás přiměje zaměřit se na svůj vlastní obchodní kód a získat pomoc s rámcem od odborníků, kdykoli ji budete potřebovat.",
    "ArchitecturalInfrastructure_Description": "SaaS aplikace, modulární nebo mikroservisní systémy jsou nejpoužívanějšími modely podnikového softwaru. Budování takových systémů vyžaduje nejen dobré porozumění a zkušenosti, ale také silnou softwarovou infrastrukturu. Jinak zjistíte, že vynakládáte velké úsilí na podporu těchto architektonických detailů ve vaší kódové základně.",
    "Modularity": "Modularita",
    "Modularity_THEPROBLEM_Description": "Sestavit skutečně modulární systém není snadné! Všechny aspekty systému (databáze, entity, API, stránky/komponenty uživatelského rozhraní) lze rozdělit do modulů a každý modul lze znovu použít bez dalších. Prostý ASP.NET Core takovou modulární architekturu neposkytuje. Pokud to potřebujete, měli byste o tom přemýšlet od začátku.",
    "Modularity_ABPSOLUTION_Description": "ABP Framework se zrodil jako modulární struktura vývoje aplikací. Každá funkce v rámci je vyvinuta tak, aby byla kompatibilní s modularitou. Dokumentace a návody vysvětlují, jak standardním způsobem vyvíjet opakovaně použitelné moduly.",
    "SaaSMultiTenancy": "SaaS / Multi-Tenancy",
    "SaaSMultiTenancy_THEPROBLEM_Description": "<a href=\"https://docs.abp.io/en/abp/latest/Multi-Tenancy\">Multi-Tenancy</a> je běžný způsob implementace systémů SaaS. Implementace konzistentní infrastruktury pro více nájemců se však může zkomplikovat.",
    "SaaSMultiTenancy_ABPSOLUTION_Description": "ABP Framework poskytuje kompletní infrastrukturu pro více nájemců a abstraktní složitost z vašeho obchodního kódu. Kód vaší aplikace bude většinou využívat více nájemců, zatímco ABP Framework od sebe automaticky izoluje databázi, mezipaměť a další podrobnosti o tenantech. Podporuje jednu databázi, databázi podle nájemce a hybridní přístupy. Správně nakonfiguruje knihovny jako Microsoft Identity a OpenIddict, které běžně nejsou kompatibilní s více nájemci.",
    "Microservices": "Mikroslužby",
    "Microservices_THEPROBLEM_Description": "Vybudování systému mikroslužeb vyžaduje mnoho podrobností o infrastruktuře: Autentizace a autorizace aplikací a mikroslužeb a implementace asynchronního zasílání zpráv a synchronních (Zbytek/GRPC) komunikačních vzorů mezi mikroslužbami jsou nejzákladnějšími problémy.",
    "Microservices_ABPSOLUTION_Description": "ABP Framework poskytuje služby, <a href=\"https://docs.abp.io/en/abp/latest/Microservice-Architecture\" target=\"_blank\">průvodce</a> a ukázky, které vám pomohou implementovat vaše řešení mikroslužeb pomocí standardních průmyslových nástrojů.",
    "Microservices_ABPSOLUTION_Description2": "ABP Commercial jde dokonce ještě o krok dále a poskytuje kompletní <a href=\"https://docs.abp.io/en/commercial/latest/startup-templates/microservice/index\" target=\"_blank\">spouštěcí šablonu</a> pro nastartování vašeho mikroservisního řešení.",
    "PreBuiltModules": "Předem postavené moduly",
    "PreBuiltModules_THEPROBLEM_Description": "Všichni máme podobné, ale trochu jiné obchodní požadavky. Všichni bychom však měli znovu vynalézt kolo, protože žádný kód nemůže přímo fungovat v našem řešení. Všechny jsou vestavěnými částmi většího řešení.",
    "PreBuiltModules_ABPSOLUTION_Description": "Komerční <a href=\"/modules\">moduly</a> ABP poskytují mnoho opakovaně použitelných aplikačních modulů, jako je platba, chat, správa souborů, hlášení protokolu auditu... atd. Všechny tyto moduly se snadno instalují do vašeho řešení a přímo fungují. Neustále doplňujeme další moduly.",
    "PreBuiltModules_ABPSOLUTION_Description2": "Všechny moduly jsou navrženy jako přizpůsobitelné pro vaše obchodní požadavky. Pokud potřebujete úplnou kontrolu, můžete si stáhnout úplný zdrojový kód libovolného modulu a zcela jej přizpůsobit na základě vašich specifických obchodních požadavků.",
    "ABPCommunity": "Společenství ABP",
    "ABPCommunity_Description": "A konečně, být ve velké komunitě, kde každý dodržuje podobné styly a principy kódování a sdílí společnou infrastrukturu, přináší sílu, když máte potíže nebo potřebujete pomoc s rozhodnutími ohledně návrhu. Vzhledem k tomu, že kód píšeme podobně, můžeme si mnohem lépe pomáhat. ABP je komunitou podporovaný projekt s více než 10 000 hvězdičkami na GitHubu.",
    "ABPCommunity_Description2": "Je snadné sdílet kód nebo dokonce znovu použitelné knihovny mezi vývojáři ABP. Fragment kódu, který funguje pro vás, bude fungovat i pro ostatní. Existuje mnoho ukázek a tutoriálů, které můžete přímo implementovat pro vaši aplikaci.",
    "ABPCommunity_Description3": "Když si najmete vývojáře, který dříve pracoval s architekturou ABP, okamžitě pochopí vaše řešení a zahájí vývoj ve velmi krátké době.",
    "WhyAbpIo_Page_Title": "Proč platforma ABP.IO?",
    "AbpStudio_Page_Title": "Studio ABP",
    "CampaignInfo": "Kupte si novou licenci nebo obnovte svou stávající licenci a <span class=\"text-white\">získejte další 2 měsíce</span> bez dalších nákladů! Tato nabídka platí pro všechny licenční plány. Ujistěte se, že využijete této časově omezené akce k rozšíření svého přístupu k prémiovým funkcím a upgradům.",
    "HurryUpLastDay": "Pospěš si! Poslední den: {0}",
    "CreatingCRUDPagesWithABPSuite": "Vytváření CRUD stránek pomocí ABP Suite",
    "Testimonials": "Posudky",
    "MultipleYearDiscount": "Víceletá sleva",
    "CampaignDiscountText": "Černý pátek sleva",
    "CampaignDiscountName": "Černý pátek",
    "CampaignName:BlackFriday": "Černý pátek"
  }
}