{
  "culture": "cs",
  "texts": {
    "OrganizationManagement": "Řízení organizace",
    "OrganizationList": "Seznam organizací",
    "Volo.AbpIo.Commercial:010003": "Nejste vlastníkem této organizace!",
    "OrganizationNotFoundMessage": "Nebyla nalezena žádná organizace!",
    "DeveloperCount": "Alokovaní / celkový počet vývojářů",
    "QuestionCount": "Zbývající / celkový počet otázek",
    "Unlimited": "Neomezený",
    "Owners": "Vlastníci",
    "AddMember": "Přidat člena",
    "AddOwner": "Přidat vlastníka",
    "AddDeveloper": "Přidat vývojáře",
    "UserName": "uživatelské jméno",
    "Name": "název",
    "EmailAddress": "Emailová adresa",
    "Developers": "Vývojáři",
    "LicenseType": "Typ licence",
    "Manage": "Spravovat",
    "StartDate": "Datum začátku",
    "EndDate": "Datum ukončení",
    "Modules": "Moduly",
    "LicenseExtendMessage": "Datum ukončení vaší licence je prodlouženo na {0}",
    "LicenseUpgradeMessage": "Vaše licence je upgradována na {0}",
    "LicenseExtendAdnUpgradeMessage": "Vaše licence byla prodloužena do {0} a váš licenční plán je upgradován na {1}.",
    "LicenseAddDeveloperMessage": "Do vaší licence bylo přidáno {0} vývojářů",
    "Volo.AbpIo.Commercial:010004": "Nelze najít zadaného uživatele! Uživatel musí být již zaregistrován.",
    "MyOrganizations": "Moje organizace",
    "ApiKey": "API klíč",
    "UserNameNotFound": "Neexistuje žádný uživatel s uživatelským jménem {0}",
    "SuccessfullyAddedToNewsletter": "Děkujeme, že jste se přihlásili k odběru našeho newsletteru!",
    "MyProfile": "Můj profil",
    "EmailNotValid": "Prosím zadejte platnou emailovou adresu.",
    "JoinOurMarketingNewsletter": "Připojte se k našemu marketingovému zpravodaji",
    "WouldLikeToReceiveMarketingMaterials": "Chci dostávat marketingové materiály, jako jsou nabídky produktů a speciální nabídky.",
    "StartUsingYourLicenseNow": "Začněte používat svou licenci nyní!",
    "WelcomePage": "Uvítací stránka",
    "UnsubscriptionExpireEmail": "Odhlásit odběr e-mailů s připomenutím data vypršení platnosti licence",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Toto e-mailové předplatné obsahuje pouze připomenutí data vypršení platnosti vaší licence.",
    "UnsubscribeFromLicenseExpireEmails": "Pokud si nepřejete dostávat e-maily o datu vypršení platnosti vaší licence, můžete se kdykoli odhlásit.",
    "Unsubscribe": "Odhlásit odběr",
    "NotOrganizationMember": "Nejste členem žádné organizace.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Úspěšně odhlášeno",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Již nebudete dostávat e-maily s upozorněním na datum vypršení platnosti licence.",
    "IndexPageHeroSection": "<span class=\"first-line\">Kompletní</span><span class=\"second-line\"> platforma pro vývoj webu</span><span class=\"third-line\">vestavěná na <img src= \"{0}\" width=\"110\" class=\"ml-1\" /> framework</span>",
    "AbpCommercialShortDescription": "ABP Commercial poskytuje předpřipravené aplikační moduly, nástroje pro rychlý vývoj aplikací, profesionální témata uživatelského rozhraní, prémiovou podporu a další.",
    "LiveDemo": "Živá ukázka",
    "GetLicence": "Získejte licenci",
    "Application": "aplikace",
    "StartupTemplates": "Spouštěcí šablony",
    "Startup": "Spuštění",
    "Templates": "Šablony",
    "Developer": "Vývojář",
    "Tools": "Nástroje",
    "Premium": "Pojistné",
    "PremiumSupport": "Prémiová podpora",
    "PremiumForumSupport": "Prémiová podpora fóra",
    "UI": "UI",
    "Themes": "Témata",
    "JoinOurNewsletter": "Připojte se k našemu zpravodaji",
    "Send": "Poslat",
    "Learn": "Učit se",
    "AdditionalServices": "Doplňkové služby",
    "WhatIsABPFramework": "CO JE RÁMEC ABP?",
    "OpenSourceBaseFramework": "Open Source Base Framework",
    "ABPFrameworkExplanation": "<p class=\"lead\">ABP Commercial je založeno na ABP Framework, open source a komunitou řízeném webovém aplikačním frameworku pro ASP.NET Core.</p><p>ABP Framework poskytuje vynikající infrastrukturu pro psaní udržitelných a rozšiřitelných a testovatelný kód s osvědčenými postupy.</p><p>Postaveno a integrováno do oblíbených nástrojů, které již znáte. Nízká křivka učení, snadná adaptace, pohodlný vývoj.</p>",
    "Modular": "Modulární",
    "MicroserviceCompatible": "Kompatibilní s mikroservisy",
    "DomainDrivenDesignInfrastructure": "Domain Driven Design Infrastructure",
    "MultiTenancy": "Vícenásobný nájem",
    "DistributedMessaging": "Distribuované zasílání zpráv",
    "DynamicProxying": "Dynamické proxy",
    "BackgroundJobs": "Práce na pozadí",
    "AuditLogging": "Protokolování auditu",
    "BLOBStoring": "Ukládání BLOB",
    "BundlingMinification": "Sdružování a minifikace",
    "AdvancedLocalization": "Pokročilá lokalizace",
    "ManyMore": "Mnoho dalších",
    "ExploreTheABPFramework": "Prozkoumejte rámec ABP",
    "WhyUseTheABPCommercial": "Proč používat ABP Commercial?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt- 5\">Vytváření webových aplikací na podnikové úrovni může být složité a časově náročné.</p><p>ABP Commercial nabízí perfektní základní infrastrukturu nezbytnou pro všechna moderní ASP.NET Core podnikové třídy založená řešení. Od návrhu až po nasazení je celý vývojový cyklus podpořen vestavěnými funkcemi a moduly ABP.</p>",
    "StartupTemplatesShortDescription": "Spouštěcí šablony vám umožní spustit projekt během několika sekund.",
    "UIFrameworksOptions": "možnosti rámců uživatelského rozhraní;",
    "DatabaseProviderOptions": "Možnosti poskytovatele databáze;",
    "PreBuiltApplicationModules": "Předem postavené aplikační moduly",
    "PreBuiltApplicationModulesShortDescription": "Většina běžných požadavků na aplikace je pro vás již vyvinuta jako opakovaně použitelné moduly.",
    "Account": "Účet",
    "Blogging": "Blogování",
    "Identity": "Identita",
    "IdentityServer": "Server identity",
    "Saas": "Saas",
    "LanguageManagement": "Správa jazyků",
    "TextTemplateManagement": "Správa šablony textu",
    "See All Modules": "SeeAllModules",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "ABP Suite je doplňkovým nástrojem k ABP Commercial.",
    "AbpSuiteExplanation": "Umožňuje vám vytvořit webové stránky během několika minut. Je to globální nástroj .NET Core, který lze nainstalovat z příkazového řádku. Dokáže vytvořit nové řešení ABP, generovat stránky CRUD z databáze do front-endu.",
    "Details": "Podrobnosti",
    "LeptonTheme": "Téma Lepton",
    "ProfessionalModernUIThemes": "Profesionální, moderní témata uživatelského rozhraní",
    "LeptonThemeExplanation": "Lepton poskytuje řadu témat pro správu Bootstrap, která slouží jako pevný základ pro jakýkoli projekt vyžadující řídicí panel správce.",
    "DefaultTheme": "Výchozí téma",
    "MaterialTheme": "Materiálové téma",
    "Default2Theme": "Výchozí 2 motiv",
    "DarkTheme": "Tmavé téma",
    "DarkBlueTheme": "Tmavě modré téma",
    "LightTheme": "Světlé téma",
    "ProudToWorkWith": "S hrdostí pracovat",
    "OurConsumers": "Na ABP Commercial spoléhají tisíce podniků a vývojářů ve více než 70 zemích světa.",
    "JoinOurConsumers": "Připojte se k nim a rychle vytvářejte úžasné produkty.",
    "AdditionalServicesExplanation": "Potřebujete doplňkové nebo zakázkové služby? <strong>My a naši partneři můžeme poskytnout;</strong>",
    "CustomProjectDevelopment": "Vývoj projektů na zakázku",
    "CustomProjectDevelopmentExplanation": "Specializovaní vývojáři pro vaše zakázkové projekty.",
    "PortingExistingProjects": "Portování stávajících projektů",
    "PortingExistingProjectsExplanation": "Migrace vašich starších projektů na platformu ABP.",
    "LiveSupport": "Živá podpora",
    "LiveSupportExplanation": "Možnost živé vzdálené podpory, když ji potřebujete.",
    "Training": "Výcvik",
    "TrainingExplanation": "Specializované školení pro vaše vývojáře.",
    "OnBoarding": "Přihlášení",
    "OnBoardingExplanation": "Pomozte nastavit vývojové prostředí, prostředí CI a CD.",
    "PrioritizedTechnicalSupport": "Prioritní technická podpora",
    "PremiumSupportExplanation": "Kromě skvělé komunitní podpory rámce ABP odpovídá náš tým podpory s vysokou prioritou na technické otázky a problémy komerčních uživatelů.",
    "SeeTheSupportOptions": "Viz Možnosti podpory",
    "Contact": "Kontakt",
    "TellUsWhatYouNeed": "Řekněte nám, co potřebujete.",
    "YourMessage": "Vaše zpráva",
    "YourFullName": "Vaše celé jméno",
    "EmailField": "Emailová adresa",
    "YourEmailAddress": "Vaše emailová adresa",
    "HowMayWeHelpYou": "Jak vám můžeme pomoci?",
    "SendMessage": "Poslat zprávu",
    "Success": "Úspěch",
    "WeWillReplyYou": "Obdrželi jsme vaši zprávu a brzy se vám ozveme.",
    "GoHome": "Jdi domů",
    "CreateLiveDemo": "Vytvořit živé demo",
    "RegisterToTheNewsletter": "Zaregistrujte se k odběru newsletteru a získejte informace o ABP.IO, včetně nových verzí atd.",
    "EnterYourEmailOrLogin": "Chcete-li vytvořit ukázku, zadejte svou e-mailovou adresu nebo se <a href=\"{0}\">přihlaste</a> pomocí svého stávajícího účtu.",
    "ApplicationTemplate": "Šablona aplikace",
    "ApplicationTemplateExplanation": "Šablona spuštění aplikace se používá k vytvoření nové webové aplikace.",
    "EfCoreProvider": "Entity Framework (podporuje SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\">a další</a>)",
    "AlreadyIncludedInTemplateModules": "V této šabloně jsou již zahrnuty a nakonfigurovány následující moduly:",
    "ApplicationTemplateArchitecture": "Tato šablona aplikace také podporuje vrstvenou architekturu, kde jsou vrstva uživatelského rozhraní, vrstva API a ověřovací služba fyzicky odděleny.",
    "SeeTheGuideOrGoToTheLiveDemo": "Technické informace o této šabloně najdete v příručce pro vývojáře nebo přejděte na živou ukázku.",
    "DeveloperGuide": "Příručka pro vývojáře",
    "ModuleTemplate": "Šablona modulu",
    "ModuleTemplateExplanation1": "Chcete vytvořit modul a znovu jej použít v různých aplikacích? Tato spouštěcí šablona připraví vše pro spuštění vytvoření opakovaně použitelného <strong>aplikačního modulu</strong> nebo <strong>mikroslužby</strong>.",
    "ModuleTemplateExplanation2": "<p>Můžete podporovat jeden nebo více rámců uživatelského rozhraní, jednoho nebo více poskytovatelů databází pro jeden modul. Spouštěcí šablona je nakonfigurována tak, aby kromě infrastruktury pro testování jednotek a integrace spouštěla a <strong>testovala váš modul</strong> v minimální aplikaci. </p> <p>Technické informace o této šabloně naleznete v příručce pro vývojáře.</p>",
    "WithAllStyleOptions": "se všemi stylovými možnostmi",
    "Demo": "Demo",
    "SeeAllModules": "Viz Všechny moduly",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) je nástroj příkazového řádku pro provádění některých běžných operací pro řešení založená na ABP.",
    "ABPSuiteEasilyCURD": "ABP Suite je nástroj, který vám umožní snadno vytvářet stránky CRUD",
    "WeAreHereToHelp": "Jsme tu, abychom vám <span class=\"zero-text\">Pomohli</span>",
    "BrowseOrAskQuestion": "Můžete procházet naše témata nápovědy nebo vyhledávat v často kladených dotazech, případně nám můžete položit otázku pomocí <a href=\"{0}\" class=\"text-success\">kontaktního formuláře</a>.",
    "SearchQuestionPlaceholder": "Hledejte v často kladených otázkách",
    "WhatIsTheABPCommercial": "Co je ABP Commercial?",
    "WhatAreDifferencesThanAbpFramework": "Jaké jsou rozdíly mezi open source ABP Framework a ABP Commercial?",
    "ABPCommercialExplanation": "ABP Commercial je sada prémiových modulů, nástrojů, témat a služeb postavených na open source <a target=\"_blank\" href=\"{0}\">rámci ABP</a>. ABP Commercial je vyvíjen a podporován stejným týmem za rámcem ABP.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\">rámec ABP</a> je modulární, tematicky kompatibilní rámec pro vývoj aplikací kompatibilní s mikroslužbami pro ASP.NET Core. Poskytuje kompletní architekturu a silnou infrastrukturu, abyste se mohli soustředit na svůj vlastní obchodní kód, než abyste se opakovali u každého nového projektu. Je založen na osvědčených postupech vývoje softwaru a oblíbených nástrojích, které již znáte. </p> <p> ABP framework je zcela zdarma, open source a řízený komunitou. Poskytuje také bezplatné téma a některé předpřipravené moduly (např. správa identit a správa tenantů).</p>",
    "VisitTheFrameworkVSCommercialDocument": "Další informace <a href=\"{0}\" target=\"_blank\"> {1} </a> naleznete na následujícím odkazu",
    "ABPCommercialFollowingBenefits": "ABP Commercial přidává k rámci ABP následující výhody;",
    "Professional": "Profesionální",
    "UIThemes": "Témata uživatelského rozhraní",
    "EnterpriseModules": "Předem připravené <a href=\"{0}\">aplikační moduly</a> připravené pro podniky, bohaté na funkce (např. správa Identity Server, správa SaaS, správa jazyků)",
    "ToolingToSupport": "Nástroje pro podporu vaší produktivity vývoje (např. <a href=\"{0}\">ABP Suite</a>)",
    "PremiumSupportLink": "Prémiová <a href=\"{0}\" target=\"_blank\">podpora</a>",
    "WhatDoIDownloadABPCommercial": "Co si stáhnu, když zakoupím ABP Commercial?",
    "CreateUnlimitedSolutions": "Jakmile si zakoupíte licenci ABP Commercial, budete moci vytvářet neomezená řešení, jak je popsáno v dokumentu <a href=\"{0}\">Začínáme</a>.",
    "ABPCommercialSolutionExplanation": "Když vytvoříte novou aplikaci, získáte řešení Visual Studio (spouštěcí šablonu) na základě vašich preferencí. Stažené řešení má již nainstalované a nakonfigurované komerční moduly a motivy. Pokud chcete, můžete odebrat předinstalovaný modul nebo přidat další modul. Všechny moduly a motivy se ve výchozím nastavení používají jako balíčky NuGet/NPM.",
    "StartDevelopWithTutorials": "Stažené řešení je dobře navrženo a zdokumentováno. Podle <a href=\"{0}\">výukových programů</a> můžete začít vyvíjet svůj vlastní obchodní kód na jeho základě",
    "TryTheCommercialDemo": "Můžete vyzkoušet <a href=\"{0}\">ukázku</a> a prohlédnout si ukázkovou aplikaci vytvořenou pomocí startovací šablony ABP Commercial.",
    "HowManyProducts": "Kolik různých produktů/řešení mohu vytvořit pomocí ABP Commercial?",
    "HowManyProductsExplanation": "Neexistuje žádný limit pro vytvoření projektu ABP. Můžete vytvořit tolik projektů, kolik chcete, vyvinout je a nahrát je na různé servery.",
    "HowManyDevelopers": "Kolik vývojářů může pracovat na ABP Commercial?",
    "HowManyDevelopersExplanation": "Licence ABP Commercial jsou na vývojáře. Různé typy licencí mají různé limity pro vývojáře. K jakémukoli typu licence však můžete kdykoli přidat další vývojáře. Na stránce <a href=\"{0}\">ceny</a> najdete typy licencí, limity pro vývojáře a další náklady na vývojáře.",
    "ChangingLicenseType": "Mohu upgradovat svůj typ licence později?",
    "ChangingLicenseTypeExplanation": "Můžete upgradovat na vyšší licenci zaplacením rozdílu během období aktivní licence. Když upgradujete na vyšší licenční plán, získáte výhody nového plánu, ale upgrade licence nezmění datum vypršení licence. Kromě toho můžete ke své stávající licenci přidat také nová vývojářská místa, viz \"Kolik vývojářů může pracovat na ABP Commercial?\"",
    "LicenseExtendUpgradeDiff": "Jaký je rozdíl mezi rozšířením licence a upgradem?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Prodloužení:</strong> Prodloužením/obnovením licence budete i nadále získávat prémiovou podporu a důležité aktualizace pro moduly a motivy. Kromě toho budete moci pokračovat ve vytváření nových projektů. A stále budete moci používat ABP Suite, který urychlí váš vývoj.<hr/><strong>Upgrade:</strong> Upgradováním licence povýšíte na vyšší licenční plán, který vám umožní získat další výhody . Rozdíly mezi licenčními plány naleznete v <a href=\"/pricing\">tabulce porovnání licencí</a>.<strong>Na druhou stranu, když upgradujete, datum vypršení platnosti vaší licence se nezmění!</strong> >Chcete-li prodloužit datum ukončení licence, musíte prodloužit licenci.",
    "LicenseRenewalCost": "Kolik stojí obnovení licence po 1 roce?",
    "LicenseRenewalCostExplanation": "Míra obnovení (prodloužení) všech trvalých licencí ABP Commercial je {0} z ceníkové ceny licencí. Cena obnovení standardní týmové licence je ${1}, standardní obchodní licence je ${2} a standardní podnikové licence je ${3}. Pokud již jste zákazníkem, <a href='{4}' target='_blank'>přihlaste se ke svému účtu</a> a zkontrolujte dostupné ceny za obnovení.",
    "HowDoIRenewMyLicense": "Jak obnovím licenci?",
    "HowDoIRenewMyLicenseExplanation": "Licenci můžete obnovit tak, že přejdete na <a href='{0}' target='_blank'>stránku správy organizace</a>. Abyste mohli využít našich zvýhodněných sazeb za předčasné obnovení, ujistěte se, že jste licenci obnovili před vypršením platnosti. Nebojte se však, že byste nevěděli, kdy vaše příležitost k předčasnému obnovení skončí. Před vypršením předplatného obdržíte 3 e-maily s upomínkou. Odešleme je 30 dní, 7 dní a 1 den před vypršením platnosti.",
    "IsSourceCodeIncluded": "Obsahuje moje licence zdrojový kód komerčních modulů a témat?",
    "IsSourceCodeIncludedExplanation1": "Závisí na typu zakoupené licence:",
    "IsSourceCodeIncludedExplanation2": "<strong>Tým</strong>: Vaše řešení používá moduly a témata jako balíčky NuGet a NPM. Nezahrnuje jejich zdrojový kód. Tímto způsobem můžete snadno upgradovat tyto moduly a motivy, kdykoli je k dispozici nová verze. Nemůžete však získat zdrojový kód modulů a témat.",
    "IsSourceCodeIncludedExplanation3": "<strong>Business/Enterprise</strong>: Kromě týmové licence si můžete stáhnout zdrojový kód libovolného modulu nebo motivu, který potřebujete. Můžete dokonce odstranit odkazy na balíček NuGet/NPM pro konkrétní modul a přidat jeho zdrojový kód přímo do vašeho řešení, abyste jej plně změnili.",
    "IsSourceCodeIncludedExplanation4": "<p>Zahrnutí zdrojového kódu modulu do vašeho řešení vám dává maximální svobodu přizpůsobit daný modul. Poté však nebude možné modul automaticky upgradovat při vydání nové verze.</p><p>Žádná z licencí neobsahuje zdrojový kód ABP Suite, což je externí nástroj, který za vás generuje kód a pomáhá k vašemu vývoji.</p><p>Další rozdíly mezi typy licencí naleznete na stránce <a href=\"{0}\">ceny</a>.</p>",
    "ChangingDevelopers": "Mohu v budoucnu změnit registrované vývojáře své organizace?",
    "ChangingDevelopersExplanation": "Kromě přidání nových vývojářů do vaší licence můžete také změnit stávající vývojáře (můžete odebrat vývojáře a přidat nového na stejné místo) bez jakýchkoli dalších nákladů.",
    "WhatHappensWhenLicenseEnds": "Co se stane, když moje licenční období skončí?",
    "WhatHappensWhenLicenseEndsExplanation1": "Typ komerční licence ABP je <a href=\"{0}\" target=\"_blank\">trvalá licence</a>. Po vypršení platnosti licence můžete pokračovat ve vývoji projektu. A nejste povinni prodlužovat licenci. Vaše licence je dodávána s ročním plánem aktualizací a podpory ihned po vybalení. Chcete-li i nadále dostávat nové funkce, vylepšení výkonu, opravy chyb, podporu a nadále používat ABP Suite, obnovte svůj plán každý rok. Po vypršení platnosti vaší licence nebudete moci získat další z následujících výhod;",
    "WhatHappensWhenLicenseEndsExplanation2": "Pomocí ABP Commercial nemůžete vytvářet nová řešení, ale můžete pokračovat ve vývoji svých stávajících aplikací navždy.",
    "WhatHappensWhenLicenseEndsExplanation3": "Budete moci získat aktualizace pro moduly a témata ve vaší HLAVNÍ verzi. Například; pokud používáte v3.2.0 modulu, stále můžete získat aktualizace pro v3.x.x (v3.3.0, v3.5.2... atd.) tohoto modulu. Nemůžete však získat aktualizace pro další hlavní verzi (jako v4.x, v5.x)",
    "WhatHappensWhenLicenseEndsExplanation4": "Po skončení licence nemůžete instalovat nové moduly a motivy přidané do platformy ABP Commercial.",
    "WhatHappensWhenLicenseEndsExplanation5": "Nemůžete používat ABP Suite.",
    "WhatHappensWhenLicenseEndsExplanation6": "Již nemůžete získat <a href=\"{0}\">prémiovou podporu</a>.",
    "WhatHappensWhenLicenseEndsExplanation7": "Pokud chcete i nadále využívat tyto výhody, můžete si předplatné obnovit. Pokud předplatné obnovíte do 1 měsíce po vypršení platnosti licence, uplatní se sleva 20 %.",
    "WhenShouldIRenewMyLicense": "Kdy bych měl obnovit licenci?",
    "WhenShouldIRenewMyLicenseExplanation1": "Pokud svou licenci obnovíte do <strong>1 měsíce</strong> po vypršení platnosti licence, uplatní se sleva 20 %.",
    "WhenShouldIRenewMyLicenseExplanation2": "Pokud obnovíte licenci po 1 měsíci od data vypršení platnosti licence, cena za obnovení bude stejná jako cena za zakoupení licence a za obnovení nebude poskytnuta žádná sleva.",
    "TrialPlan": "Máte zkušební plán?",
    "TrialPlanExplanation": "ABP Commercial zatím nemá zkušební plán. Pro týmové licence poskytujeme 30denní záruku vrácení peněz. Během prvních 30 dnů můžete pouze požádat o vrácení peněz. U licencí Business a Enterprise poskytujeme vrácení 60 % do 30 dnů. Je to proto, že licence Business a Enterprise obsahují úplný zdrojový kód všech modulů a témat.",
    "DoYouAcceptBankWireTransfer": "Přijímáte bankovní převod?",
    "DoYouAcceptBankWireTransferExplanation": "Ano, přijímáme bankovní převod.<br />Po zaslání licenčního poplatku bankovním převodem nám zašlete e-mail na adresu info@abp.io potvrzení a požadovaný typ licence. Informace o našem mezinárodním bankovním účtu:",
    "HowToUpgrade": "Jak upgradovat stávající aplikace, když je k dispozici nová verze?",
    "HowToUpgradeExplanation1": "Když vytvoříte novou aplikaci pomocí ABP Commercial, všechny moduly a téma se použijí jako balíčky NuGet a NPM. Takže můžete snadno upgradovat balíčky, když je k dispozici nová verze.",
    "HowToUpgradeExplanation2": "Kromě standardních upgradů NuGet/NPM poskytuje <a href=\"{0}\">ABP CLI</a> aktualizační příkaz, který automaticky vyhledá a upgraduje všechny balíčky související s ABP ve vašem řešení.",
    "DatabaseSupport": "Které databázové systémy jsou podporovány?",
    "DatabaseSupportExplanation": "Samotný ABP Framework je databázový agnostik a může ze své podstaty spolupracovat s jakýmkoliv poskytovatelem databáze. Seznam aktuálně implementovaných poskytovatelů naleznete v <a href=\"{0}\" target=\"_blank\">dokumentu o přístupu k datům</a>.",
    "UISupport": "Které rámce uživatelského rozhraní jsou podporovány?",
    "Supported": "Podporováno",
    "UISupportExplanation": "Samotný ABP Framework je agnostik UI frameworku a může pracovat s jakýmkoli UI frameworkem. Spouštěcí šablony, uživatelská rozhraní modulů a motivy však nebyly implementovány pro všechny rámce uživatelského rozhraní. Aktuální seznam možností uživatelského rozhraní naleznete v <a href=\"{0}\">dokumentu Začínáme</a>.",
    "MicroserviceSupport": "Podporuje architekturu mikroslužeb?",
    "MicroserviceSupportExplanation1": "Jedním z hlavních cílů rámce ABP je poskytnout pohodlnou infrastrukturu pro vytváření řešení mikroslužeb. Podívejte se na dokument <a href=\"{0}\">architektura mikroslužeb</a>, abyste pochopili, jak pomáhá vytvářet systémy mikroslužeb.",
    "MicroserviceSupportExplanation2": "Všechny komerční moduly ABP jsou navrženy tak, aby podporovaly scénáře nasazení mikroslužeb (s vlastním rozhraním API a databází) podle dokumentu <a href=\"{0}\">doporučené postupy pro vývoj modulů</a>.",
    "MicroserviceSupportExplanation3": "Poskytujeme ukázkové <a href=\"{0}\">demonstrační řešení mikroslužeb</a>, které demonstruje implementaci architektury mikroslužeb, které vám pomůže vytvořit si vlastní řešení.",
    "MicroserviceSupportExplanation4": "Krátká odpověď je tedy „<strong>ano, podporuje architekturu mikroslužeb</strong>“.",
    "MicroserviceSupportExplanation5": "Systém mikroslužeb je však řešením a každé řešení bude mít jiné požadavky, topologii sítě, komunikační scénáře, možnosti autentizace, rozhodnutí o oddělení/sdílení databáze, konfiguraci běhu, integraci systémů třetích stran a mnoho dalších.",
    "MicroserviceSupportExplanation6": "ABP Framework a ABP Commercial poskytují infrastrukturu pro scénáře mikroslužeb, moduly kompatibilní s mikroslužbami, vzorky a dokumentaci, které vám pomohou vytvořit si vlastní řešení. Neočekávejte však, že si přímo stáhnete své vysněné řešení předem vytvořené pro vás. Budete tomu muset porozumět a některé části spojit dohromady na základě vašich požadavků.",
    "WhereCanIDownloadSourceCode": "Kde si mohu stáhnout zdrojový kód?",
    "WhereCanIDownloadSourceCodeExplanation": "Zdrojový kód všech modulů ABP, balíčků Angular a témat si můžete stáhnout prostřednictvím ABP Suite nebo ABP CLI. Viz <a href=\"{0}\">Jak stáhnout zdrojový kód?</a>",
    "ComputerLimitation": "Kolik počítačů se může vývojář přihlásit při vývoji ABP?",
    "ComputerLimitationExplanation": "Výslovně povolujeme <strong>{0} počítače</strong> na jednotlivého / licencovaného vývojáře. Kdykoli je potřeba, aby vývojář vyvíjel produkty ABP Commercial na třetím počítači, měl by být zaslán e-mail na adresu license@abp.io s vysvětlením situace a my poté v našem systému provedeme příslušnou alokaci.",
    "RefundPolicy": "Máte zásady pro vrácení peněz?",
    "RefundPolicyExplanation": "O vrácení peněz můžete požádat do <strong>30 dnů</strong> od zakoupení licence. Typy licencí Business a Enterprise mají možnost stažení zdrojového kódu, proto nejsou refundace dostupné pro Business a Enterprise (a žádné licence, které zahrnují právo na získání zdrojového kódu). Kromě toho se za obnovení a nákupy druhé licence nevrací žádné peníze.",
    "HowCanIRefundVat": "Jak mohu vrátit DPH?",
    "HowCanIRefundVatExplanation1": "Pokud jste platbu provedli pomocí 2Checkout, můžete vrátit DPH prostřednictvím svého účtu 2Checkout:",
    "HowCanIRefundVatExplanation2": "Přihlaste se ke svému účtu <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\">2Checkout</a>",
    "HowCanIRefundVatExplanation3": "Najděte příslušnou objednávku a stiskněte „Vrácení opožděné DPH“ (zadejte své DIČ)",
    "HowCanIGetMyInvoice": "Jak mohu získat fakturu?",
    "HowCanIGetMyInvoiceExplanation": "Pro zakoupení licence existují 2 platební brány: Iyzico a 2Checkout. Pokud si zakoupíte licenci prostřednictvím brány 2Checkout, odešle se faktura ve formátu PDF na vaši e-mailovou adresu, viz <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How- do-invoices-work\">2Fakturace Checkout.</a> Pokud nakupujete prostřednictvím brány Iyzico, s vlastním nákupním odkazem nebo bankovním převodem, připravíme a zašleme vaši fakturu. Fakturu si můžete vyžádat nebo stáhnout na <a href=\"{0}\">stránce správy organizace</a>. Než nás budete kontaktovat ohledně faktury, zkontrolujte stránku správy vaší organizace!",
    "Forum": "Fórum",
    "SupportExplanation": "Licence ABP Commercial poskytuje prémiovou podporu fóra týmem složeným z odborníků na ABP Framework.",
    "PrivateTicket": "Soukromá vstupenka",
    "PrivateTicketExplanation": "Enterprise License také zahrnuje soukromou podporu s e-mailovým a lístkovým systémem.",
    "AbpSuiteExplanation1": "ABP Suite vám umožňuje vytvářet webové stránky během několika minut. Je to globální nástroj .NET Core, který lze nainstalovat z příkazového řádku.",
    "AbpSuiteExplanation2": "Dokáže vytvořit nové řešení ABP, generovat stránky CRUD z databáze do front-endu. Technický přehled naleznete v <a href=\"{0}\">dokumentu</a>",
    "FastEasy": "Rychlé a snadné",
    "AbpSuiteExplanation3": "ABP Suite vám umožňuje snadno vytvářet stránky CRUD. Stačí definovat vaši entitu a její vlastnosti, zbytek nechte na ABP Suite za vás! ABP Suite vygeneruje veškerý potřebný kód pro vaši stránku CRUD během několika sekund. Podporuje uživatelská rozhraní Angular, MVC a Blazor.",
    "RichOptions": "Bohaté možnosti",
    "AbpSuiteExplanation4": "ABP Suite podporuje více možností uživatelského rozhraní, jako jsou <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\">Razor Pages</a> a <a href=\"https:/ /angular.io\">Angular</a>. Podporuje také více databází jako <a href=\"https://www.mongodb.com\">MongoDB</a> a všechny databáze podporované <strong>EntityFramework Core< /strong> (MS SQL Server, Oracle, MySql, PostgreSQL a <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\">další </a>).",
    "AbpSuiteExplanation5": "Dobrá věc je, že se o tyto možnosti nemusíte starat. ABP Suite rozumí typu vašeho projektu a vygeneruje kód pro váš projekt a umístí vygenerovaný kód na správné místo ve vašem projektu.",
    "SourceCode": "Zdrojový kód",
    "AbpSuiteExplanation6": "ABP Suite vygeneruje zdrojový kód za vás! Negeneruje magické soubory pro generování webové stránky. ABP Suite generuje zdrojový kód pro <strong>Entity, Repository, Application Service, Code First Migration, JavaScript/TypeScript a CSHTML/HTML</strong> a také nezbytná rozhraní. ABP Suite také generuje kód podle <strong>Best Practices</strong> vývoje softwaru, takže se nemusíte starat o kvalitu generovaného kódu.",
    "AbpSuiteExplanation7": "Protože máte zdrojový kód stavebních bloků vygenerované stránky CRUD ve správných aplikačních vrstvách, můžete snadno upravit zdrojový kód a vložit do vygenerovaného kódu svou vlastní/obchodní logiku.",
    "CrossPlatform": "Křížová platforma",
    "AbpSuiteExplanation8": "ABP Suite je vytvořen s .NET Core a je multiplatformní. Funguje jako webová aplikace na vašem místním počítači. Můžete jej spustit na <strong>Windows</strong>, <strong>Mac</strong> a <strong>Linuxu</strong>",
    "OtherFeatures": "Další funkce",
    "OtherFeatures1": "Snadno aktualizujte balíčky <strong>NuGet</strong> a <strong>NPM</strong> ve vašem řešení.",
    "OtherFeatures2": "Regeneruje již vygenerované stránky od začátku.",
    "OtherFeatures3": "Vytváří nová řešení",
    "ThanksForCreatingProject": "Děkujeme za vytvoření vašeho projektu!",
    "HotToRunSolution": "Jak spustit vaše řešení?",
    "HotToRunSolutionExplanation": "V dokumentu Začínáme se dozvíte, jak nakonfigurovat a spustit řešení.",
    "GettingStarted": "Začínáme",
    "WebAppDevTutorial": "Výukový program pro vývojáře webových aplikací",
    "WebAppDevTutorialExplanation": "Ukázku vývoje krok za krokem najdete v dokumentu výukového programu pro vývoj webových aplikací.",
    "Document": "Dokument",
    "UsingABPSuiteToCURD": "Použití ABP Suite pro generování stránek CRUD a nástroje",
    "SeeABPSuiteDocument": "Informace o použití ABP Suite naleznete v dokumentu ABP Suite.",
    "AskQuestionsOnSupport": "Otázky můžete klást na komerční podpoře ABP.",
    "Documentation": "Dokumentace",
    "SeeModulesDocument": "Seznam všech komerčních (pro) modulů a jejich dokumentů najdete v dokumentu modulů.",
    "Pricing": "Ceny",
    "PricingExplanation": "Vyberte si vlastnosti a funkce, které vaše firma dnes potřebuje. Snadno upgradujte, jak vaše firma roste.",
    "Team": "tým",
    "Business": "podnikání",
    "Enterprise": "Podnik",
    "Custom": "Zvyk",
    "IncludedDeveloperLicenses": "Zahrnuté vývojářské licence",
    "CustomLicenceOrAdditionalServices": "Potřebujete vlastní licenci nebo doplňkové služby?",
    "CustomOrVolumeLicense": "Vlastní nebo objemová licence",
    "LiveTrainingSupport": "Živé školení a podpora",
    "AndMore": "a více",
    "AdditionalDeveloperLicense": "Dodatečná licence pro vývojáře",
    "ProjectCount": "Počet projektů",
    "AllProModules": "Všechny profi moduly",
    "AllProThemes": "Všechna profesionální témata",
    "AllProStartupTemplates": "Všechny pro startovací šablony",
    "SourceCodeOfAllModules": "Zdrojový kód všech modulů",
    "SourceCodeOfAllThemes": "Zdrojový kód všech témat",
    "PerpetualLicense": "Trvalé povolení",
    "UnlimitedServerDeployment": "Neomezené nasazení serveru",
    "YearUpgrade": "1 rok upgrade",
    "YearPremiumForumSupport": "1 rok prémiové podpory fóra",
    "ForumSupportIncidentCountYear": "Počet incidentů podpory fóra/rok",
    "PrivateTicketEmailSupport": "Soukromá vstupenka a e-mailová podpora",
    "BuyNow": "Kup nyní",
    "PayViaAmexCard": "Jak mohu platit kartou AMEX?",
    "PayViaAmexCardDescription": "Výchozí platební brána „Iyzico“ může z důvodu bezpečnostních opatření odmítnout některé kreditní karty AMEX. V tomto případě můžete platit prostřednictvím alternativní platební brány '2Checkout'.",
    "ThankYou": "Děkuji",
    "InvalidReCaptchaErrorMessage": "Při ověřování reCAPTCHA došlo k chybě. Prosím zkuste to znovu.",
    "CompanyName": "Jméno společnosti",
    "YourCompanyName": "Název vaší společnosti",
    "FirstName": "Jméno",
    "LastName": "Příjmení",
    "Optional": "Volitelný",
    "YourFirstName": "Vaše jméno",
    "YourLastName": "Tvoje příjmení",
    "SpecialOffer": "Speciální nabídka",
    "SpecialOfferMessage": "Pospěš si! Ceny jsou platné po omezenou dobu.",
    "DiscountRequest": "Žádost o slevu",
    "DiscountRequestDescribeCustomerQuestion": "Která z následujících možností vás vystihuje?",
    "DiscountRequestStudentEmailMessage": "E-mailová adresa musí obsahovat 'edu'.",
    "DiscountRequestDeveloperCount": "Kolik je vás vývojářů?",
    "DiscountRequestDeveloperCountExceedMessage": "Neposkytujeme zlevněné licence pro společnosti, které mají více než {0} vývojářů.",
    "DiscountRequestOrganizationName": "Název společnosti/organizace/školy",
    "Website": "webová stránka",
    "GithubUsername": "Uživatelské jméno GitHub",
    "PhoneNumber": "Telefonní číslo",
    "Country": "Země",
    "DescribeABPCommercialUsage": "Popište projekt, který plánujete vyvinout na základě APB Commercial",
    "DiscountRequestCertifyInformationMessage": "Potvrzuji, že všechny údaje jsou pravdivé a správné.",
    "DiscountRequestReceived": "Obdrželi jsme vaši žádost o slevu.",
    "DiscountRequestStatusMessage": "Po kontrole informací, které jste nám poskytli, vám odpovíme.",
    "MVCOrRazorPages": "MVC (Razor Pages)",
    "Angular": "Hranatý",
    "Blazor": "Blazor",
    "New": "Nový",
    "MongoDB": "MongoDB",
    "EBookDDD": "Design řízený doménou elektronické knihy",
    "PracticalGuideForImplementingDDD": "Tato kniha je praktickým průvodcem pro implementaci Domain Driven Design s ABP Framework.",
    "IntroducingDDD": "Představujeme Domain Driven Design",
    "DDDLayersAndCleanArchitecture": "DDD vrstvy a čistá architektura",
    "LayeringOfADotnetSolution": "Vrstvení řešení .NET",
    "ImplementingDDDBuildingBlocks": "Implementace stavebních bloků DDD",
    "DomainVsApplicationLogic": "Doménová logika versus aplikační logika",
    "SamplesAndDiscussions": "Ukázky a diskuze",
    "Free": "Volný, uvolnit",
    "Download": "Stažení",
    "DDDEBook": "E-kniha DDD",
    "ImplementingDDD": "Implementace návrhu řízeného doménou",
    "DDDBookExplanation": "Praktická příručka pro implementaci Domain Driven Design s ABP Framework.",
    "Overview": "Přehled",
    "DDDBookPracticalGuide": "Toto je praktický průvodce pro implementaci Domain Driven Design (DDD). Zatímco detaily implementace spoléhají na infrastrukturu ABP Framework, základní koncepty, principy a vzory jsou použitelné v jakémkoli druhu řešení, i když se nejedná o řešení .NET.",
    "TableOfContents": "Obsah",
    "IntroductionToImplementingDDD": "Úvod do implementace doménově řízeného designu",
    "WhatIsDDD": "Co je to doménou řízený design?",
    "Implementation": "Implementace",
    "TheBigPicture": "Velký obraz",
    "TheBuildingBlock": "Stavební blok",
    "ExampleUseCase": "Příklad případu použití",
    "DomainAndApplicationLogic": "Doménová logika a aplikační logika",
    "Author": "Autor",
    "PublishedOn": "Zveřejněno dne",
    "Page": "Strana",
    "FreeEBook": "E-kniha zdarma",
    "EBookSignInForDownload": "Chcete-li stáhnout e-knihu, přihlaste se",
    "SignIn": "Přihlásit se",
    "Or": "Nebo",
    "TellUsAboutYourself": "Řekni nám něco o sobě",
    "Surname": "Příjmení",
    "DoYouAgreePrivacyPolicy": "Souhlasím se <a href=\"/TermsConditions\">Smluvními podmínkami<a/> a <a href=\"/Privacy\">Zásadami ochrany osobních údajů</a>.",
    "VolosoftMarketingInformationMessage": "Chci informace, tipy a nabídky o řešeních pro podniky a organizace a dalších produktech a službách Volosoft.",
    "VolosoftSharingInformationMessage": "Chtěl bych, aby Volosoft sdílel mé informace s vybranými partnery, abych mohl dostávat relevantní informace o jejich produktech a službách.",
    "WeWillSendYouADownloadLink": "Odkaz ke stažení e-knihy byl odeslán na adresu {0}.<br/> Zkontrolujte svou doručenou poštu / nevyžádané / spamové schránky!",
    "InvalidFormInputs": "Zadejte prosím platné informace uvedené ve formuláři.",
    "DDDBookEmailBody": "Děkuji. <br /> Chcete-li si knihu stáhnout, <a href=\"{0}\">klikněte sem</a>.",
    "FreeDDDEBook": "E-kniha DDD zdarma",
    "StartFree": "Začněte zdarma",
    "FreeTrial": "Zkušební verze zdarma",
    "AcceptsMarketingCommunications": " Ano, chci dostávat komerční marketingová sdělení ABP.",
    "PurposeOfUsage": "Účel použití",
    "Industry": "Průmysl",
    "Choose": "- Vybrat -",
    "CompanyOrganizationName": "Název společnosti / organizace",
    "CompanySize": "Velikost společnosti",
    "Next": "další",
    "StartTrial": "Spusťte bezplatnou zkušební verzi",
    "ContactUsIssues": "Pokud máte nějaké problémy, kontaktujte nás",
    "TrialActivatedWarning": "Vážený uživateli {0}, uživatel má nárok pouze na 1 bezplatné zkušební období. Zkušební období jste již využili.",
    "ActivationRequirement": "Jste jeden krok od zahájení bezplatné zkušební verze.<br>Poslali jsme e-mail na adresu <b>{0}</b>, abychom aktivovali váš účet. Zkontrolujte svou doručenou poštu / nevyžádané / spamové schránky!",
    "SaveAndDownload": "Uložit a stáhnout",
    "CompanyNameValidationMessage": "Název společnosti je příliš dlouhý!",
    "AddressValidationMessage": "Adresa je příliš dlouhá!",
    "TaxNoValidationMessage": "Číslo daně/DPH je příliš dlouhé!",
    "NotesValidationMessage": "Pole poznámek je příliš dlouhé!",
    "CheckYourBillingInfo": "Fakturu můžete vytvořit pouze jednou! Před vytvořením faktury zkontrolujte své fakturační údaje.",
    "Volo.AbpIo.Commercial:030000": "Zkušební období jste již využili.",
    "Volo.AbpIo.Commercial:030001": "Tento název organizace již existuje.",
    "StartYourFreeTrial": "Začít bezplatnou zkušební verzi",
    "TrialLicenseModelInvalidErrorMessage": "Jedno z následujících polí je neplatné: Název země, Velikost společnosti, Odvětví nebo Účel použití.",
    "Trial": "zkušební",
    "Purchased": "Zakoupeno",
    "PurchaseLicense": "Koupit licenci",
    "PurchaseTrialLicenseMessage": "Datum vypršení platnosti vaší licence je {0}. <br> Chcete-li nadále používat projekty, které jste vytvořili během bezplatného zkušebního období, musíte změnit licenční klíče ve svých souborech <code>appsettings.secrets.json</code>. Zde je váš licenční klíč:",
    "TrialLicenseExpireMessage": "Používáte zkušební licenci a platnost vaší zkušební licence vyprší dne {0}.",
    "TryForFree": "Zkus zadarmo",
    "TrialLicenseExpiredInfo": "Vaše zkušební licenční období vypršelo!",
    "CommercialNewsletterConfirmationMessage": "I agree to the <a href=\"https://commercial.abp.io/TermsConditions\">Terms & Conditions</a> and <a href=\"https://commercial.abp.io/Privacy\">Privacy Policy</a>."
  }
}