{
  "culture": "de-DE",
  "texts": {
    "OrganizationManagement": "Organisationsverwaltung",
    "OrganizationList": "Organisationsauflistung",
    "Volo.AbpIo.Commercial:010003": "Sie sind der Besitzer dieser Organisation!",
    "OrganizationNotFoundMessage": "Keine Organisation gefunden!",
    "DeveloperCount": "Zugeordnete/Gesamte Entwickler",
    "QuestionCount": "Verbleibende/Gesamte Fragen",
    "Unlimited": "Unbegrenzt",
    "Owners": "Besitzer",
    "AddMember": "Mitglied hinzufügen",
    "AddOwner": "Besizer hinzufügen",
    "AddDeveloper": "Entwickler hinzufügen",
    "UserName": "Benutzername",
    "Name": "Name",
    "EmailAddress": "E-Mail-Adress",
    "Developers": "Entwickler",
    "LicenseType": "Lizenztyp",
    "Manage": "Verwalten",
    "StartDate": "Startdatum",
    "EndDate": "Enddatum",
    "Modules": "Module",
    "LicenseExtendMessage": "Ihr Lizenzenddatum wird auf {0} verlängert",
    "LicenseUpgradeMessage": "Ihre Lizenz wird auf {0} aktualisiert",
    "LicenseExtendAdnUpgradeMessage": "Ihre Lizenz wurde bis {0} verlängert und Ihr Lizenzplan wird auf {1} aktualisiert.",
    "LicenseAddDeveloperMessage": "{0} Entwickler zu Ihrer Lizenz hinzugefügt",
    "Volo.AbpIo.Commercial:010004": "Kann den angegebenen Benutzer nicht finden! Der Benutzer muss sich bereits registriert haben.",
    "MyOrganizations": "Meine Organisationen",
    "ApiKey": "API-Schlüssel",
    "UserNameNotFound": "Es gibt keinen Benutzer mit dem Benutzernamen {0}",
    "SuccessfullyAddedToNewsletter": "Vielen Dank, dass Sie unseren Newsletter abonniert haben!",
    "MyProfile": "Mein Profil",
    "EmailNotValid": "Bitte geben Sie eine gültige E-Mail-Adresse ein.",
    "JoinOurMarketingNewsletter": "Abonnieren Sie unseren Marketing-Newsletter",
    "WouldLikeToReceiveMarketingMaterials": "Ich möchte Marketingmaterialien wie Produktangebote und Sonderangebote erhalten.",
    "StartUsingYourLicenseNow": "Beginnen Sie jetzt mit der Nutzung Ihrer Lizenz!",
    "WelcomePage": "Startseite",
    "UnsubscriptionExpireEmail": "Abmelden von Erinnerungs-E-Mails zum Ablaufdatum der Lizenz",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Dieses E-Mail-Abonnement enthält nur die Erinnerung an das Ablaufdatum Ihrer Lizenz.",
    "UnsubscribeFromLicenseExpireEmails": "Wenn Sie keine E-Mails zum Ablaufdatum Ihrer Lizenz erhalten möchten, können Sie sich jederzeit abmelden.",
    "Unsubscribe": "Abbestellen",
    "NotOrganizationMember": "Sie sind in keiner Organisation Mitglied.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Erfolgreich abgemeldet",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Sie erhalten keine Erinnerungs-E-Mails mehr für das Ablaufdatum der Lizenz.",
    "IndexPageHeroSection": "<span class=\"first-line\">Eine komplette</span><span class=\"second-line\"> Webentwicklungsplattform</span><span class=\"third-line\">aufgebaute <img src= \"{0}\" width=\"110\" class=\"ml-1\" /> Framework</span>",
    "AbpCommercialShortDescription": "ABP Commercial bietet vorgefertigte Anwendungsmodule, schnelle Anwendungsentwicklungstools, professionelle UI-Themen, Premium-Support und mehr.",
    "LiveDemo": "Live-Demo",
    "GetLicence": "Holen Sie sich eine Lizenz",
    "Application": "Anwendung",
    "StartupTemplates": "Startup-Vorlagen",
    "Startup": "Anlaufen",
    "Templates": "Vorlagen",
    "Developer": "Entwickler",
    "Tools": "Werkzeuge",
    "Premium": "Prämie",
    "PremiumSupport": "Premium-Support",
    "PremiumForumSupport": "Premium-Forum-Support",
    "UI": "Benutzeroberfläche",
    "Themes": "Themen",
    "JoinOurNewsletter": "Abonnieren Sie unseren Newsletter",
    "Send": "Senden",
    "Learn": "Lernen",
    "AdditionalServices": "Zusatzleitungen",
    "WhatIsABPFramework": "WAS IST DER ABP-RAHMEN?",
    "OpenSourceBaseFramework": "Open-Source-Basis-Framework",
    "ABPFrameworkExplanation": "<p class=\"lead\">ABP Commercial basiert auf dem ABP Framework, einem Open-Source- und Community-gesteuerten Webanwendungs-Framework für ASP.NET Core.</p><p>ABP Framework bietet eine hervorragende Infrastruktur zum Schreiben von wartbaren, erweiterbaren und testbarer Code mit Best Practices.</p><p>Aufgebaut und integriert in beliebte Tools, die Sie bereits kennen. Niedrige Lernkurve, einfache Anpassung, komfortable Entwicklung.</p>",
    "Modular": "Modular",
    "MicroserviceCompatible": "Microservice-kompatibel",
    "DomainDrivenDesignInfrastructure": "Domain Driven Design Infrastruktur",
    "MultiTenancy": "Mandantenfähigkeit",
    "DistributedMessaging": "Verteilte Nachrichten",
    "DynamicProxying": "Dynamisches Proxying",
    "BackgroundJobs": "Hintergrundjobs",
    "AuditLogging": "Audit-Logging",
    "BLOBStoring": "BLOB-Speicherung",
    "BundlingMinification": "Bündelung & Minimierung",
    "AdvancedLocalization": "Erweiterte Lokalisierung",
    "ManyMore": "Viel mehr",
    "ExploreTheABPFramework": "Entdecken Sie das ABP-Framework",
    "WhyUseTheABPCommercial": "Warum den ABP-Werbespot verwenden?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\">Das Erstellen von Webanwendungen der Enterprise-Klasse kann komplex und zeitaufwändig sein.</p><p>ABP Commercial bietet die perfekte Basisinfrastruktur, die für alle modernen ASP.NET Core-Anwendungen der Enterprise-Klasse erforderlich ist basierten Lösungen. Vom Design bis zur Bereitstellung wird der gesamte Entwicklungszyklus durch die integrierten Funktionen und Module von ABP unterstützt.</p>",
    "StartupTemplatesShortDescription": "Mit Startup-Vorlagen können Sie in wenigen Sekunden mit Ihrem Projekt beginnen.",
    "UIFrameworksOptions": "Optionen für UI-Frameworks;",
    "DatabaseProviderOptions": "Optionen des Datenbankanbieters;",
    "PreBuiltApplicationModules": "Vorgefertigte Anwendungsmodule",
    "PreBuiltApplicationModulesShortDescription": "Die gängigsten Anwendungsanforderungen sind bereits als wiederverwendbare Module für Sie entwickelt.",
    "Account": "Konto",
    "Blogging": "Bloggen",
    "Identity": "Identität",
    "IdentityServer": "Identitätsserver",
    "Saas": "Saas",
    "LanguageManagement": "Sprachmanagement",
    "TextTemplateManagement": "Verwaltung von Textvorlagen",
    "See All Modules": "SieheAlleModule",
    "ABPSuite": "ABP-Suite",
    "AbpSuiteShortDescription": "ABP Suite ist ein ergänzendes Tool zum ABP Commercial.",
    "AbpSuiteExplanation": "Es ermöglicht Ihnen, Webseiten in wenigen Minuten zu erstellen. Es ist ein globales .NET Core-Tool, das über die Befehlszeile installiert werden kann. Es kann eine neue ABP-Lösung erstellen, CRUD-Seiten aus der Datenbank zum Front-End generieren.",
    "Details": "Einzelheiten",
    "LeptonTheme": "Lepton-Thema",
    "ProfessionalModernUIThemes": "Professionelle, moderne UI-Themen",
    "LeptonThemeExplanation": "Lepton bietet eine Vielzahl von Bootstrap-Admin-Themen, die als solide Grundlage für jedes Projekt dienen, das ein Admin-Dashboard erfordert.",
    "DefaultTheme": "Standardthema",
    "MaterialTheme": "Materielles Thema",
    "Default2Theme": "Standard 2 Thema",
    "DarkTheme": "Dunkles Thema",
    "DarkBlueTheme": "Dunkelblaues Thema",
    "LightTheme": "Lichtthema",
    "ProudToWorkWith": "Stolz, mit zu arbeiten",
    "OurConsumers": "Tausende von Unternehmen und Entwicklern in über 70 Ländern weltweit vertrauen auf ABP Commercial.",
    "JoinOurConsumers": "Schließen Sie sich ihnen an und bauen Sie schnell erstaunliche Produkte.",
    "AdditionalServicesExplanation": "Benötigen Sie zusätzliche oder kundenspezifische Dienstleistungen? <strong>Wir und unsere Partner können Folgendes bieten:</strong>",
    "CustomProjectDevelopment": "Kundenspezifische Projektentwicklung",
    "CustomProjectDevelopmentExplanation": "Engagierte Entwickler für Ihre benutzerdefinierten Projekte.",
    "PortingExistingProjects": "Vorhandene Projekte portieren",
    "PortingExistingProjectsExplanation": "Migration Ihrer Legacy-Projekte auf die ABP-Plattform.",
    "LiveSupport": "Live Support",
    "LiveSupportExplanation": "Live-Remote-Support-Option, wenn Sie sie brauchen.",
    "Training": "Ausbildung",
    "TrainingExplanation": "Dedizierte Schulung für Ihre Entwickler.",
    "OnBoarding": "Onboarding",
    "OnBoardingExplanation": "Helfen Sie beim Einrichten Ihrer Entwicklungs-, CI- und CD-Umgebungen.",
    "PrioritizedTechnicalSupport": "Priorisierter technischer Support",
    "PremiumSupportExplanation": "Neben dem großartigen Community-Support des ABP-Frameworks beantwortet unser Support-Team technische Fragen und Probleme der kommerziellen Nutzer mit hoher Priorität.",
    "SeeTheSupportOptions": "Siehe die Support-Optionen",
    "Contact": "Kontakt",
    "TellUsWhatYouNeed": "Sagen Sie uns, was Sie brauchen.",
    "YourMessage": "Ihre Nachricht",
    "YourFullName": "Ihren vollständigen Namen",
    "EmailField": "E-Mail-Addresse",
    "YourEmailAddress": "Ihre E-Mail-Adresse",
    "HowMayWeHelpYou": "Wie können wir Ihnen helfen?",
    "SendMessage": "Nachricht senden",
    "Success": "Erfolg",
    "WeWillReplyYou": "Wir haben Ihre Nachricht erhalten und werden uns in Kürze bei Ihnen melden.",
    "GoHome": "Nach Hause gehen",
    "CreateLiveDemo": "Live-Demo erstellen",
    "RegisterToTheNewsletter": "Melden Sie sich für den Newsletter an, um Informationen zu ABP.IO, einschließlich Neuerscheinungen etc. zu erhalten.",
    "EnterYourEmailOrLogin": "Geben Sie Ihre E-Mail-Adresse ein, um Ihre Demo zu erstellen, oder <a href=\"{0}\">Login</a> mit Ihrem bestehenden Konto.",
    "ApplicationTemplate": "Bewerbungsvorlage",
    "ApplicationTemplateExplanation": "Die Anwendungsstartvorlage wird verwendet, um eine neue Webanwendung zu erstellen.",
    "EfCoreProvider": "Entity Framework (unterstützt SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\">und andere</a>)",
    "AlreadyIncludedInTemplateModules": "Folgende Module sind bereits in dieser Vorlage enthalten und konfiguriert:",
    "ApplicationTemplateArchitecture": "Diese Anwendungsvorlage unterstützt auch eine mehrstufige Architektur, bei der UI-Schicht, API-Schicht und der Authentifizierungsdienst physisch getrennt sind.",
    "SeeTheGuideOrGoToTheLiveDemo": "Technische Informationen zu dieser Vorlage finden Sie im Entwicklerhandbuch oder in der Live-Demo.",
    "DeveloperGuide": "Entwicklerhandbuch",
    "ModuleTemplate": "Modulvorlage",
    "ModuleTemplateExplanation1": "Sie möchten ein Modul erstellen und anwendungsübergreifend wiederverwenden? Diese Startvorlage bereitet alles vor, um ein wiederverwendbares <strong>Anwendungsmodul</strong> oder einen <strong>Microservice</strong> zu erstellen.",
    "ModuleTemplateExplanation2": "<p>Sie können einzelne oder mehrere UI-Frameworks, einzelne oder mehrere Datenbankanbieter für ein einzelnes Modul unterstützen. Die Startvorlage ist so konfiguriert, dass sie zusätzlich zur Komponenten- und Integrationstestinfrastruktur in einer minimalen Anwendung ausgeführt und <strong>Ihr Modul testet</strong>. </p> <p>Technische Informationen zu dieser Vorlage finden Sie im Entwicklerhandbuch.</p>",
    "WithAllStyleOptions": "mit allen Stiloptionen",
    "Demo": "Demo",
    "SeeAllModules": "Alle Module anzeigen",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) ist ein Befehlszeilentool zum Ausführen einiger allgemeiner Operationen für ABP-basierte Lösungen.",
    "ABPSuiteEasilyCURD": "ABP Suite ist ein Tool, mit dem Sie einfach CRUD-Seiten erstellen können",
    "WeAreHereToHelp": "Wir sind hier, um <span class=\"zero-text\">Hilfe</span>",
    "BrowseOrAskQuestion": "Sie können unsere Hilfethemen durchsuchen oder in häufig gestellten Fragen suchen oder uns über das <a href=\"{0}\" class=\"text-success\">Kontaktformular</a> eine Frage stellen.",
    "SearchQuestionPlaceholder": "Suche in häufig gestellten Fragen",
    "WhatIsTheABPCommercial": "Was ist der ABP-Werbespot?",
    "WhatAreDifferencesThanAbpFramework": "Was sind die Unterschiede zwischen dem Open Source ABP Framework und dem ABP Commercial?",
    "ABPCommercialExplanation": "ABP Commercial ist eine Reihe von Premium-Modulen, Tools, Themen und Diensten, die auf dem Open-Source-<a target=\"_blank\" href=\"{0}\">ABP-Framework</a> aufbauen. ABP Commercial wird von demselben Team entwickelt und unterstützt, das hinter dem ABP-Framework steht.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\">ABP-Framework</a> ist ein modulares, thematisches, Microservice-kompatibles Anwendungsentwicklungsframework für ASP.NET Core. Es bietet eine vollständige Architektur und eine starke Infrastruktur, damit Sie sich auf Ihren eigenen Geschäftscode konzentrieren können, anstatt sich für jedes neue Projekt zu wiederholen. Es basiert auf Best Practices für die Softwareentwicklung und beliebten Tools, die Sie bereits kennen. </p> <p> Das ABP-Framework ist völlig kostenlos, Open Source und wird von der Community betrieben. Es bietet auch ein kostenloses Thema und einige vorgefertigte Module (z. B. Identitätsmanagement und Mieterverwaltung).</p>",
    "VisitTheFrameworkVSCommercialDocument": "Besuchen Sie den folgenden Link für weitere Informationen <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial fügt dem ABP-Framework die folgenden Vorteile hinzu;",
    "Professional": "Fachmann",
    "UIThemes": "UI-Themen",
    "EnterpriseModules": "Unternehmenstaugliche, funktionsreiche, vorgefertigte <a href=\"{0}\">Anwendungsmodule</a> (z. B. Identity Server-Verwaltung, SaaS-Verwaltung, Sprachverwaltung)",
    "ToolingToSupport": "Tools zur Unterstützung Ihrer Entwicklungsproduktivität (z. B. <a href=\"{0}\">ABP Suite</a>)",
    "PremiumSupportLink": "Premium <a href=\"{0}\" target=\"_blank\">Unterstützung</a>",
    "WhatDoIDownloadABPCommercial": "Was lade ich herunter, wenn ich den ABP-Werbespot kaufe?",
    "CreateUnlimitedSolutions": "Sobald Sie eine kommerzielle ABP-Lizenz erworben haben, können Sie unbegrenzte Lösungen erstellen, wie im Dokument <a href=\"{0}\">Erste Schritte</a> beschrieben.",
    "ABPCommercialSolutionExplanation": "Wenn Sie eine neue Anwendung erstellen, erhalten Sie eine Visual Studio-Lösung (eine Startvorlage) basierend auf Ihren Einstellungen. In der heruntergeladenen Lösung sind kommerzielle Module und Themen bereits installiert und für Sie konfiguriert. Sie können ein vorinstalliertes Modul entfernen oder ein weiteres Modul hinzufügen, wenn Sie möchten. Alle Module und Designs werden standardmäßig in NuGet/NPM-Paketen verwendet.",
    "StartDevelopWithTutorials": "Die heruntergeladene Lösung ist gut strukturiert und dokumentiert. Sie können damit beginnen, Ihren eigenen Geschäftscode basierend darauf zu entwickeln, indem Sie <a href=\"{0}\">den Tutorials</a> folgen",
    "TryTheCommercialDemo": "Sie können <a href=\"{0}\">die Demo</a> ausprobieren, um eine Beispielanwendung anzuzeigen, die mit der ABP Commercial-Startvorlage erstellt wurde.",
    "HowManyProducts": "Wie viele verschiedene Produkte/Lösungen kann ich mit ABP Commercial erstellen?",
    "HowManyProductsExplanation": "Es gibt keine Begrenzung, ein ABP-Projekt zu erstellen. Sie können beliebig viele Projekte erstellen, entwickeln und auf verschiedene Server hochladen.",
    "HowManyDevelopers": "Wie viele Entwickler können am ABP Commercial arbeiten?",
    "HowManyDevelopersExplanation": "ABP Commercial-Lizenzen gelten pro Entwickler. Unterschiedliche Lizenztypen haben unterschiedliche Entwicklerlimits. Sie können jedoch bei Bedarf jederzeit weitere Entwickler zu jedem Lizenztyp hinzufügen. Auf der <a href=\"{0}\">Preisseite</a> finden Sie Lizenztypen, Entwicklerlimits und zusätzliche Entwicklerkosten.",
    "ChangingLicenseType": "Kann ich meinen Lizenztyp später upgraden?",
    "ChangingLicenseTypeExplanation": "Sie können auf eine höhere Lizenz upgraden, indem Sie die Differenz innerhalb Ihres aktiven Lizenzzeitraums bezahlen. Wenn Sie auf einen höheren Lizenzplan aktualisieren, profitieren Sie von den Vorteilen des neuen Plans, aber das Lizenz-Upgrade ändert das Ablaufdatum der Lizenz nicht. Außerdem können Sie Ihrer bestehenden Lizenz auch neue Entwicklerplätze hinzufügen, siehe \"Wie viele Entwickler können an der ABP Commercial arbeiten?\"",
    "LicenseExtendUpgradeDiff": "Was ist der Unterschied zwischen Lizenzverlängerung und Upgrade?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Verlängern:</strong> Durch die Verlängerung/Erneuerung Ihrer Lizenz erhalten Sie weiterhin Premium-Support und wichtige Updates für die Module und Themen. Außerdem können Sie weiterhin neue Projekte erstellen. Und Sie können weiterhin die ABP Suite verwenden, was Ihre Entwicklung beschleunigt.<hr/><strong>Upgrade:</strong> Durch das Upgrade Ihrer Lizenz steigen Sie zu einem höheren Lizenzplan auf, mit dem Sie zusätzliche Vorteile erhalten . Sehen Sie sich die <a href=\"/pricing\">Lizenzvergleichstabelle</a> an, um die Unterschiede zwischen den Lizenzplänen zu überprüfen.<strong>Andererseits ändert sich das Ablaufdatum Ihrer Lizenz bei einem Upgrade nicht!</strong >Um das Enddatum Ihrer Lizenz zu verlängern, müssen Sie Ihre Lizenz verlängern.",
    "LicenseRenewalCost": "Wie hoch sind die Kosten für die Lizenzverlängerung nach 1 Jahr?",
    "LicenseRenewalCostExplanation": "Der Verlängerungspreis (Erweiterung) der Standard-Teamlizenz beträgt {0}$, die Standard-Business-Lizenz beträgt ${1} und die Standard-Enterprise-Lizenz beträgt ${2}. Wenn Sie bereits Kunde sind, <a href='{3}' target='_blank'>melden Sie sich in Ihrem Konto an</a>, um die verfügbaren Verlängerungspreise zu überprüfen.",
    "HowDoIRenewMyLicense": "Wie erneuere ich meine Lizenz?",
    "HowDoIRenewMyLicenseExplanation": "Sie können Ihre Lizenz erneuern, indem Sie zur <a href='{0}' target='_blank'>Organisationsverwaltungsseite</a> navigieren. Um von unseren ermäßigten Tarifen für die vorzeitige Verlängerung zu profitieren, vergewissern Sie sich, dass Sie vor Ablauf Ihrer Lizenz verlängern. Machen Sie sich jedoch keine Sorgen, dass Sie nicht wissen, wann Ihre Gelegenheit zur vorzeitigen Verlängerung endet. Sie erhalten 3 Erinnerungs-E-Mails, bevor Ihr Abonnement abläuft. Wir versenden sie 30 Tage, 7 Tage und 1 Tag vor Ablauf.",
    "IsSourceCodeIncluded": "Enthält meine Lizenz den Quellcode der kommerziellen Module und Themes?",
    "IsSourceCodeIncludedExplanation1": "Abhängig vom erworbenen Lizenztyp:",
    "IsSourceCodeIncludedExplanation2": "<strong>Team</strong>: Ihre Lösung verwendet die Module und Themes als NuGet- und NPM-Pakete. Es enthält nicht ihren Quellcode. Auf diese Weise können Sie diese Module und Themes einfach aktualisieren, wenn eine neue Version verfügbar ist. Sie können jedoch nicht den Quellcode der Module und der Themes abrufen.",
    "IsSourceCodeIncludedExplanation3": "<strong>Business/Enterprise</strong>: Zusätzlich zur Team-Lizenz können Sie den Quellcode jedes Moduls oder Themes herunterladen, das Sie benötigen. Sie können sogar die NuGet/NPM-Paketverweise für ein bestimmtes Modul entfernen und seinen Quellcode direkt zu Ihrer Lösung hinzufügen, um sie vollständig zu ändern.",
    "IsSourceCodeIncludedExplanation4": "<p>Das Einbinden des Quellcodes eines Moduls in Ihre Lösung gibt Ihnen die maximale Freiheit, dieses Modul anzupassen. Dann ist es jedoch nicht möglich, das Modul automatisch zu aktualisieren, wenn eine neue Version veröffentlicht wird.</p><p>Keine der Lizenzen enthält den Quellcode der ABP Suite, bei dem es sich um ein externes Tool handelt, das Code für Sie generiert und unterstützt zu Ihrer Entwicklung.</p><p>Weitere Unterschiede zwischen den Lizenztypen finden Sie auf der <a href=\"{0}\">Preisseite</a>.</p>",
    "ChangingDevelopers": "Kann ich die registrierten Entwickler meiner Organisation in Zukunft ändern?",
    "ChangingDevelopersExplanation": "Sie können nicht nur neue Entwickler zu Ihrer Lizenz hinzufügen, sondern auch die vorhandenen Entwickler ändern (Sie können einen Entwickler entfernen und einen neuen zum selben Arbeitsplatz hinzufügen) ohne zusätzliche Kosten.",
    "WhatHappensWhenLicenseEnds": "Was passiert, wenn mein Lizenzzeitraum endet?",
    "WhatHappensWhenLicenseEndsExplanation1": "Der kommerzielle ABP-Lizenztyp ist <a href=\"{0}\" target=\"_blank\">unbefristete Lizenz</a>. Nach Ablauf Ihrer Lizenz können Sie Ihr Projekt weiter entwickeln. Und Sie sind nicht verpflichtet, Ihre Lizenz zu erneuern. Ihre Lizenz wird standardmäßig mit einem einjährigen Update- und Supportplan geliefert. Um weiterhin neue Funktionen, Leistungsverbesserungen, Fehlerkorrekturen und Support zu erhalten und die ABP Suite weiterhin nutzen zu können, müssen Sie Ihre Lizenz erneuern. Wenn Ihre Lizenz abläuft, erhalten Sie die folgenden Vorteile nicht;",
    "WhatHappensWhenLicenseEndsExplanation2": "Sie können mit dem ABP Commercial keine neuen Lösungen erstellen, aber Sie können Ihre bestehenden Anwendungen für immer weiterentwickeln.",
    "WhatHappensWhenLicenseEndsExplanation3": "Sie können Updates für die Module und Themen Ihrer MAJOR-Version (außer RC- oder Preview-Versionen) erhalten. Beispielsweise; Wenn Sie v3.2.0 eines Moduls verwenden, können Sie immer noch Updates für v3.x.x (v3.3.0, v3.5.2... etc.) dieses Moduls erhalten. Sie können jedoch keine Updates für die nächste Hauptversion (wie v4.x, v5.x) erhalten. Wenn beispielsweise Ihre Lizenz abgelaufen ist, die neueste Version v4.4.3 und die neueste Vorschauversion v5.0.0-rc.2 war, können Sie auf v4.X.X zugreifen, aber nicht auf v5.X.X.",
    "WhatHappensWhenLicenseEndsExplanation4": "Sie können nach Ablauf Ihrer Lizenz keine neuen Module und Themen installieren, die der ABP Commercial-Plattform hinzugefügt wurden.",
    "WhatHappensWhenLicenseEndsExplanation5": "Sie können die ABP-Suite nicht verwenden.",
    "WhatHappensWhenLicenseEndsExplanation6": "Sie können den <a href=\"{0}\">Premium-Support</a> nicht mehr erhalten.",
    "WhatHappensWhenLicenseEndsExplanation7": "Sie können Ihre Lizenz verlängern (erneuern), wenn Sie diese Vorteile weiterhin nutzen möchten. Wenn Sie Ihre Lizenz innerhalb von <strong>1 Monat</strong> nach Ablauf Ihrer Lizenz verlängern, werden die folgenden Rabatte gewährt: Team-Lizenz {0}% Rabatt, Business-Lizenz {1}% Rabatt, Enterprise-Lizenz {2}% Rabatt .",
    "WhenShouldIRenewMyLicense": "Wann sollte ich meine Lizenz erneuern?",
    "WhenShouldIRenewMyLicenseExplanation": "Wenn Sie Ihre Lizenz innerhalb von <strong>1 Monat</strong> nach Ablauf Ihrer Lizenz erneuern, werden die folgenden Rabatte gewährt: Team-Lizenz {0}% Rabatt, Business-Lizenz {1}% Rabatt, Enterprise-Lizenz {2}% Rabatt . Wenn Sie Ihre Lizenz <strong>1 Monat</strong> nach dem Ablaufdatum Ihrer Lizenz verlängern, entspricht der Verlängerungspreis dem Lizenzkaufpreis und es wird kein Rabatt auf Ihre Verlängerung gewährt.",
    "TrialPlan": "Hast du einen Probeplan?",
    "TrialPlanExplanation": "Derzeit hat ABP Commercial keinen Testplan. Für die Team-Lizenzen bieten wir eine 30-tägige Geld-zurück-Garantie. Sie können nur innerhalb der ersten 30 Tage eine Rückerstattung beantragen. Für die Business- und Enterprise-Lizenzen gewähren wir innerhalb von 30 Tagen eine Rückerstattung von 60 %. Dies liegt daran, dass Business- und Enterprise-Lizenzen den vollständigen Quellcode aller Module und Themes enthalten.",
    "DoYouAcceptBankWireTransfer": "Akzeptieren Sie Banküberweisungen?",
    "DoYouAcceptBankWireTransferExplanation": "Ja, wir akzeptieren Banküberweisungen.<br />Nachdem Sie die Lizenzgebühr per Banküberweisung gesendet haben, senden Sie uns Ihre Quittung und den gewünschten Lizenztyp per E-Mail an accounting@abp.io. Unsere internationale Bankverbindung:",
    "HowToUpgrade": "Wie aktualisiere ich bestehende Anwendungen, wenn eine neue Version verfügbar ist?",
    "HowToUpgradeExplanation1": "Wenn Sie mit ABP Commercial eine neue Anwendung erstellen, werden alle Module und das Design als NuGet- und NPM-Pakete verwendet. So können Sie die Pakete problemlos aktualisieren, wenn eine neue Version verfügbar ist.",
    "HowToUpgradeExplanation2": "Zusätzlich zu den standardmäßigen NuGet/NPM-Upgrades bietet die <a href=\"{0}\">ABP CLI</a> einen Update-Befehl, der automatisch alle ABP-bezogenen Pakete in Ihrer Lösung findet und aktualisiert.",
    "DatabaseSupport": "Welche Datenbanksysteme werden unterstützt?",
    "DatabaseSupportExplanation": "ABP Framework selbst ist datenbankunabhängig und kann von Natur aus mit jedem Datenbankanbieter zusammenarbeiten. Eine Liste der derzeit implementierten Anbieter finden Sie im <a href=\"{0}\" target=\"_blank\">Datenzugriffsdokument</a>.",
    "UISupport": "Welche UI-Frameworks werden unterstützt?",
    "Supported": "Unterstützt",
    "UISupportExplanation": "ABP Framework selbst ist UI-Framework-agnostisch und kann mit jedem UI-Framework arbeiten. Allerdings wurden Startvorlagen, Modul-UIs und Themes nicht für alle UI-Frameworks implementiert. Eine aktuelle Liste der UI-Optionen finden Sie im <a href=\"{0}\">Dokument zu den ersten Schritten</a>.",
    "MicroserviceSupport": "Unterstützt es die Micro-Service-Architektur?",
    "MicroserviceSupportExplanation1": "Eines der Hauptziele des ABP-Frameworks besteht darin, eine komfortable Infrastruktur bereitzustellen, um Microservice-Lösungen zu erstellen. Lesen Sie das Dokument <a href=\"{0}\">Microservice-Architektur</a>, um zu erfahren, wie es hilft, Microservice-Systeme zu erstellen.",
    "MicroserviceSupportExplanation2": "Alle kommerziellen ABP-Module wurden entwickelt, um Bereitstellungsszenarien für Mikrodienste (mit eigener API und Datenbank) zu unterstützen, indem die <a href=\"{0}\">Best Practices für die Modulentwicklung</a> befolgt werden.",
    "MicroserviceSupportExplanation3": "Wir stellen eine <a href=\"{0}\">Demolösung für Mikrodienste</a> bereit, die eine Mikrodienstarchitekturimplementierung demonstriert, um Sie bei der Erstellung Ihrer eigenen Lösung zu unterstützen.",
    "MicroserviceSupportExplanation4": "Die kurze Antwort lautet also: \"<strong>Ja, es unterstützt die Micro-Service-Architektur</strong>\".",
    "MicroserviceSupportExplanation5": "Ein Micro-Service-System ist jedoch eine Lösung und jede Lösung hat unterschiedliche Anforderungen, Netzwerktopologie, Kommunikationsszenarien, Authentifizierungsmöglichkeiten, Entscheidungen zur Trennung/Freigabe von Datenbanken, Laufzeitkonfigurationen, Systemintegrationen von Drittanbietern und vieles mehr.",
    "MicroserviceSupportExplanation6": "Das ABP Framework und das ABP Commercial bieten eine Infrastruktur für Micro-Service-Szenarien, Micro-Service-kompatible Module, Beispiele und Dokumentation, um Sie beim Aufbau Ihrer eigenen Lösung zu unterstützen. Erwarten Sie jedoch nicht, dass Sie Ihre für Sie vorgefertigte Traumlösung direkt herunterladen. Sie müssen es verstehen und einige Teile basierend auf Ihren Anforderungen zusammenbringen.",
    "WhereCanIDownloadSourceCode": "Wo kann ich Quellcode herunterladen?",
    "WhereCanIDownloadSourceCodeExplanation": "Sie können den Quellcode aller ABP-Module, Angular-Pakete und Themes über die ABP-Suite oder die ABP-CLI herunterladen. Siehe <a href=\"{0}\">Wie lade ich den Quellcode herunter?</a>",
    "ComputerLimitation": "Wie viele Computer kann sich ein Entwickler bei der Entwicklung von ABP anmelden?",
    "ComputerLimitationExplanation": "Wir erlauben ausdrücklich <strong>{0} Computer</strong> pro Person/lizenziertem Entwickler. Wenn ein Entwickler ABP Commercial-Produkte auf einem dritten Rechner entwickeln muss, sollte eine E-Mail an license@abp.io gesendet werden, in der die Situation erläutert wird, und wir werden dann die entsprechende Zuordnung in unserem System vornehmen.",
    "RefundPolicy": "Haben Sie eine Rückerstattungsrichtlinie?",
    "RefundPolicyExplanation": "Sie können innerhalb von <strong>30 Tagen</strong> nach dem Lizenzkauf eine Rückerstattung beantragen. Die Lizenztypen Business und Enterprise verfügen über die Option zum Herunterladen des Quellcodes, daher sind Rückerstattungen für Business und Enterprise (und alle Lizenzen, die ein Recht zum Erhalt von Quellcode enthalten) nicht verfügbar. Darüber hinaus erfolgt keine Rückerstattung für Verlängerungen und Zweitlizenzkäufe.",
    "HowCanIRefundVat": "Wie kann ich die Mehrwertsteuer zurückerstatten?",
    "HowCanIRefundVatExplanation1": "Wenn Sie die Zahlung über 2Checkout getätigt haben, können Sie die Mehrwertsteuer über Ihr 2Checkout-Konto erstatten:",
    "HowCanIRefundVatExplanation2": "Melden Sie sich bei Ihrem <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\">2Checkout</a>-Konto an",
    "HowCanIRefundVatExplanation3": "Suchen Sie die entsprechende Bestellung und klicken Sie auf \"Rückerstattung der verspäteten Mehrwertsteuer\" (geben Sie Ihre Umsatzsteuer-Identifikationsnummer ein)",
    "HowCanIGetMyInvoice": "Wie erhalte ich meine Rechnung?",
    "HowCanIGetMyInvoiceExplanation": "Es gibt 2 Zahlungsgateways für den Kauf einer Lizenz: Iyzico und 2Checkout. Wenn Sie Ihre Lizenz über das 2Checkout-Gateway kaufen, wird die PDF-Rechnung an Ihre E-Mail-Adresse gesendet, siehe <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How- do-invoices-work\">2Checkout-Rechnung.</a> Wenn Sie über das Iyzico-Gateway, mit einem benutzerdefinierten Kauflink oder per Banküberweisung einkaufen, erstellen und senden wir Ihre Rechnung. Sie können Ihre Rechnung auf der <a href=\"{0}\">Seite zur Organisationsverwaltung</a> anfordern oder herunterladen. Bevor Sie uns wegen der Rechnung kontaktieren, überprüfen Sie Ihre Organisationsverwaltungsseite!",
    "Forum": "Forum",
    "SupportExplanation": "ABP Commercial Licenses bieten einen Premium-Forum-Support durch ein Team, das aus den ABP Framework-Experten besteht.",
    "PrivateTicket": "Privatticket",
    "PrivateTicketExplanation": "Die Enterprise-Lizenz beinhaltet auch einen privaten Support mit E-Mail- und Ticketsystem.",
    "AbpSuiteExplanation1": "Mit der ABP Suite können Sie Webseiten in wenigen Minuten erstellen. Es handelt sich um ein globales .NET Core-Tool, das über die Befehlszeile installiert werden kann.",
    "AbpSuiteExplanation2": "Es kann eine neue ABP-Lösung erstellen, CRUD-Seiten aus der Datenbank zum Front-End generieren. Eine technische Übersicht finden Sie im <a href=\"{0}\">Dokument</a>",
    "FastEasy": "Schnell leicht",
    "AbpSuiteExplanation3": "Mit der ABP Suite können Sie einfach CRUD-Seiten erstellen. Sie müssen nur Ihre Entität und ihre Eigenschaften definieren, den Rest überlassen Sie ABP Suite! ABP Suite generiert in wenigen Sekunden den gesamten erforderlichen Code für Ihre CRUD-Seite. Es unterstützt Angular-, MVC- und Blazor-Benutzeroberflächen.",
    "RichOptions": "Reichhaltige Optionen",
    "AbpSuiteExplanation4": "ABP Suite supports multiple UI options like <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\">Razor Pages</a> and <a href=\"https://angular.io\">Angular</a>.It also supports multiple databases like <a href=\"https://www.mongodb.com\">MongoDB</a> and all databases supported by <strong>EntityFramework Core</strong> (MS SQL Server, Oracle, MySql, PostgreSQL and <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\">more</a>).",
    "AbpSuiteExplanation5": "Das Gute ist, dass Sie sich um diese Optionen keine Sorgen machen müssen. ABP Suite versteht Ihren Projekttyp und generiert den Code für Ihr Projekt und platziert den generierten Code an der richtigen Stelle in Ihrem Projekt.",
    "SourceCode": "Quellcode",
    "AbpSuiteExplanation6": "ABP Suite generiert den Quellcode für Sie! Es werden keine magischen Dateien generiert, um die Webseite zu generieren. Die ABP Suite generiert den Quellcode für <strong>Entity, Repository, Application Service, Code First Migration, JavaScript/TypeScript und CSHTML/HTML</strong> und notwendige Schnittstellen. Die ABP Suite generiert den Code auch gemäß <strong>Best Practices</strong> der Softwareentwicklung, sodass Sie sich keine Sorgen um die Qualität des generierten Codes machen müssen.",
    "AbpSuiteExplanation7": "Da Sie den Quellcode der Bausteine der generierten CRUD-Seite in den richtigen Anwendungsschichten haben, können Sie den Quellcode leicht ändern und Ihre benutzerdefinierte/Geschäftslogik in den generierten Code einfügen.",
    "CrossPlatform": "Plattformübergreifend",
    "AbpSuiteExplanation8": "Die ABP Suite wurde mit .NET Core erstellt und ist plattformübergreifend. Es läuft als Webanwendung auf Ihrem lokalen Computer. Sie können es auf <strong>Windows</strong>, <strong>Mac</strong> und <strong>Linux</strong> ausführen",
    "OtherFeatures": "Andere Eigenschaften",
    "OtherFeatures1": "Aktualisiert problemlos <strong>NuGet</strong>- und <strong>NPM</strong>-Pakete für Ihre Lösung.",
    "OtherFeatures2": "Regeneriert bereits generierte Seiten von Grund auf neu.",
    "OtherFeatures3": "Schafft neue Lösungen",
    "ThanksForCreatingProject": "Vielen Dank, dass Sie Ihr Projekt erstellt haben!",
    "HotToRunSolution": "Wie führen Sie Ihre Lösung aus?",
    "HotToRunSolutionExplanation": "Im Dokument \"Erste Schritte\" erfahren Sie, wie Sie Ihre Lösung konfigurieren und ausführen.",
    "GettingStarted": "Einstieg",
    "WebAppDevTutorial": "Web-App-Entwickler-Tutorial",
    "WebAppDevTutorialExplanation": "Im Tutorialdokument zur Entwicklung von Webanwendungen finden Sie ein schrittweises Entwicklungsbeispiel.",
    "Document": "Dokumentieren",
    "UsingABPSuiteToCURD": "Verwenden der ABP Suite für CRUD-Seitengenerierung und -tooling",
    "SeeABPSuiteDocument": "Siehe das Dokument ABP Suite, um mehr über die Verwendung der ABP Suite zu erfahren.",
    "AskQuestionsOnSupport": "Sie können Fragen zum kommerziellen ABP-Support stellen.",
    "Documentation": "Dokumentation",
    "SeeModulesDocument": "Eine Liste aller kommerziellen (Pro-)Module und deren Dokumente finden Sie im Moduldokument.",
    "Pricing": "Preisgestaltung",
    "PricingExplanation": "Wählen Sie die Funktionen und Funktionen, die Ihr Unternehmen heute benötigt. Einfaches Upgraden, wenn Ihr Unternehmen wächst.",
    "Team": "Mannschaft",
    "Business": "Unternehmen",
    "Enterprise": "Unternehmen",
    "Custom": "Benutzerdefiniert",
    "IncludedDeveloperLicenses": "Enthaltene Entwicklerlizenzen",
    "CustomLicenceOrAdditionalServices": "Benötigen Sie eine benutzerdefinierte Lizenz oder zusätzliche Dienste?",
    "CustomOrVolumeLicense": "Benutzerdefinierte oder Volumenlizenz",
    "LiveTrainingSupport": "Live-Training & Support",
    "AndMore": "und mehr",
    "AdditionalDeveloperLicense": "Zusätzliche Entwicklerlizenz",
    "ProjectCount": "Projektanzahl",
    "AllProModules": "Alle Pro-Module",
    "AllProThemes": "Alle Pro-Themen",
    "AllProStartupTemplates": "Alle Pro-Startup-Vorlagen",
    "SourceCodeOfAllModules": "Quellcode aller Module",
    "SourceCodeOfAllThemes": "Quellcode aller Themes",
    "PerpetualLicense": "Unbefristete Lizenz",
    "UnlimitedServerDeployment": "Unbegrenzte Serverbereitstellung",
    "YearUpgrade": "1 Jahr Upgrade",
    "YearPremiumForumSupport": "1 Jahr Premium-Forum-Support",
    "ForumSupportIncidentCountYear": "Anzahl der Vorfälle im Forumssupport/Jahr",
    "PrivateTicketEmailSupport": "Privates Ticket & E-Mail-Support",
    "BuyNow": "Kaufe jetzt",
    "PayViaAmexCard": "Wie kann ich mit meiner AMEX-Karte bezahlen?",
    "PayViaAmexCardDescription": "Das Standard-Zahlungsgateway 'Iyzico' kann aufgrund der Sicherheitsmaßnahmen einige AMEX-Kreditkarten ablehnen. In diesem Fall können Sie über das alternative Zahlungsgateway '2Checkout' bezahlen.",
    "ThankYou": "Dankeschön",
    "InvalidReCaptchaErrorMessage": "Beim Verifizieren von reCAPTCHA ist ein Fehler aufgetreten. Bitte versuche es erneut.",
    "CompanyName": "Name der Firma",
    "YourCompanyName": "Ihr Firmenname",
    "FirstName": "Vorname",
    "LastName": "Nachname",
    "Optional": "Optional",
    "YourFirstName": "Ihr Vorname",
    "YourLastName": "Ihr Nachname",
    "SpecialOffer": "Sonderangebot",
    "SpecialOfferMessage": "Beeil dich! Die Preise sind zeitlich begrenzt gültig.",
    "DiscountRequest": "Rabattanfrage",
    "DiscountRequestDescribeCustomerQuestion": "Welche der folgenden Aussagen beschreibt Sie?",
    "DiscountRequestStudentEmailMessage": "Die E-Mail-Adresse muss \"edu\" enthalten.",
    "DiscountRequestDeveloperCount": "Wie viele Entwickler sind Sie?",
    "DiscountRequestDeveloperCountExceedMessage": "Wir bieten keine ermäßigten Lizenzen für Unternehmen mit mehr als {0} Entwicklern an.",
    "DiscountRequestOrganizationName": "Name des Unternehmens/der Organisation/der Schule",
    "Website": "Webseite",
    "GithubUsername": "GitHub-Benutzername",
    "PhoneNumber": "Telefonnummer",
    "Country": "Land",
    "DescribeABPCommercialUsage": "Beschreiben Sie das Projekt, das Sie basierend auf APB Commercial entwickeln möchten",
    "DiscountRequestCertifyInformationMessage": "Ich bestätige, dass alle Angaben wahr und richtig sind.",
    "DiscountRequestReceived": "Wir haben Ihre Rabattanfrage erhalten.",
    "DiscountRequestStatusMessage": "Wir werden Ihnen nach Prüfung der von Ihnen gemachten Angaben antworten.",
    "MVCOrRazorPages": "MVC (Razor-Seiten)",
    "Angular": "Eckig",
    "Blazor": "Blazor",
    "New": "Neu",
    "MongoDB": "MongoDB",
    "EBookDDD": "E-Book-Domain-gesteuertes Design",
    "PracticalGuideForImplementingDDD": "Dieses Buch ist ein praktischer Leitfaden für die Implementierung des Domain Driven Designs mit dem ABP Framework.",
    "IntroducingDDD": "Einführung von Domain Driven Design",
    "DDDLayersAndCleanArchitecture": "DDD-Schichten und saubere Architektur",
    "LayeringOfADotnetSolution": "Layering einer .NET-Lösung",
    "ImplementingDDDBuildingBlocks": "Implementieren von DDD-Bausteinen",
    "DomainVsApplicationLogic": "Domänenlogik vs. Anwendungslogik",
    "SamplesAndDiscussions": "Beispiele & Diskussionen",
    "Free": "Kostenlos",
    "Download": "Herunterladen",
    "DDDEBook": "DDD-E-Book",
    "ImplementingDDD": "Implementieren von Domain Driven Design",
    "DDDBookExplanation": "Ein praktischer Leitfaden für die Implementierung des Domain Driven Designs mit dem ABP Framework.",
    "Overview": "Überblick",
    "DDDBookPracticalGuide": "Dies ist ein praktischer Leitfaden für die Implementierung des Domain Driven Designs (DDD). Während die Implementierungsdetails auf der ABP Framework-Infrastruktur basieren, sind Kernkonzepte, Prinzipien und Muster auf jede Art von Lösung anwendbar, auch wenn es sich nicht um eine .NET-Lösung handelt.",
    "TableOfContents": "Inhaltsverzeichnis",
    "IntroductionToImplementingDDD": "Einführung in die Implementierung von Domain Driven Design",
    "WhatIsDDD": "Was ist Domain Driven Design?",
    "Implementation": "Implementierung",
    "TheBigPicture": "Das große Bild",
    "TheBuildingBlock": "Der Baustein",
    "ExampleUseCase": "Beispielanwendungsfall",
    "DomainAndApplicationLogic": "Domänenlogik und Anwendungslogik",
    "Author": "Autor",
    "PublishedOn": "Veröffentlicht auf",
    "Page": "Buchseite",
    "FreeEBook": "Kostenloses E-Book",
    "EBookSignInForDownload": "Um das E-Book herunterzuladen, melden Sie sich an",
    "SignIn": "Einloggen",
    "Or": "Oder",
    "TellUsAboutYourself": "Erzähl uns ein bisschen über dich",
    "Surname": "Nachname",
    "DoYouAgreePrivacyPolicy": "Ich stimme den <a href=\"/TermsConditions\">Nutzungsbedingungen<a/> und der <a href=\"/Privacy\">Datenschutzerklärung</a> zu.",
    "VolosoftMarketingInformationMessage": "Ich möchte Informationen, Tipps und Angebote zu Lösungen für Unternehmen und Organisationen und anderen Produkten und Dienstleistungen von Volosoft.",
    "VolosoftSharingInformationMessage": "Ich möchte, dass Volosoft meine Informationen mit ausgewählten Partnern teilt, damit ich relevante Informationen über deren Produkte und Dienstleistungen erhalten kann.",
    "WeWillSendYouADownloadLink": "Ein Link zum Herunterladen des E-Books wurde an {0} gesendet.<br/> Überprüfen Sie Ihren Posteingang/Junk-/Spam-Ordner!",
    "InvalidFormInputs": "Bitte geben Sie die im Formular angegebenen gültigen Informationen ein.",
    "DDDBookEmailBody": "Dankeschön. <br /> Um Ihr Buch herunterzuladen, <a href=\"{0}\">klicken Sie hier</a>.",
    "FreeDDDEBook": "Kostenloses DDD-E-Book",
    "StartFree": "Kostenlos starten",
    "FreeTrial": "Kostenlose Testphase",
    "AcceptsMarketingCommunications": " Ja, ich möchte kommerzielle Marketingmitteilungen von ABP erhalten.",
    "PurposeOfUsage": "Verwendungszweck",
    "Industry": "Industrie",
    "Choose": "- Wählen -",
    "CompanyOrganizationName": "Name der Firma/Organisation",
    "CompanySize": "Firmengröße",
    "Next": "Nächste",
    "StartTrial": "Starten Sie meine kostenlose Testversion",
    "ContactUsIssues": "Kontaktieren Sie uns, wenn Sie irgendwelche Probleme haben",
    "TrialActivatedWarning": "Sehr geehrte(r) {0}, ein Nutzer hat nur 1 kostenlosen Testzeitraum. Sie haben Ihren Testzeitraum bereits genutzt.",
    "ActivationRequirement": "Sie sind nur noch einen Schritt davon entfernt, Ihre kostenlose Testversion zu starten.<br>Wir haben eine E-Mail an <b>{0}</b> gesendet, um Ihr Konto zu aktivieren. Überprüfen Sie Ihren Posteingang/Junk/Spam-Ordner!",
    "SaveAndDownload": "Speichern und herunterladen",
    "CompanyNameValidationMessage": "Firmenname ist zu lang!",
    "AddressValidationMessage": "Adresse ist zu lang!",
    "TaxNoValidationMessage": "STEUER-/MwSt.-Nr. ist zu lang!",
    "NotesValidationMessage": "Anmerkungsfeld ist zu lang!",
    "CheckYourBillingInfo": "Sie können Ihre Rechnung nur einmal erstellen! Überprüfen Sie Ihre Rechnungsinformationen, bevor Sie Ihre Rechnung erstellen.",
    "Volo.AbpIo.Commercial:030000": "Sie haben Ihren Testzeitraum bereits genutzt.",
    "Volo.AbpIo.Commercial:030001": "Dieser Organisationsname existiert bereits.",
    "StartYourFreeTrial": "Starten Sie Ihre kostenlose Testversion",
    "TrialLicenseModelInvalidErrorMessage": "Eines der folgenden Felder ist ungültig: Ländername, Unternehmensgröße, Branche oder Verwendungszweck.",
    "Trial": "Versuch",
    "Purchased": "Gekauft",
    "PurchaseLicense": "Lizenz kaufen",
    "PurchaseTrialLicenseMessage": "Das Ablaufdatum Ihrer Lizenz ist {0}. <br> Wenn Sie die Projekte, die Sie während Ihres kostenlosen Testzeitraums erstellt haben, weiterhin verwenden möchten, müssen Sie die Lizenzschlüssel in Ihren <code>appsettings.secrets.json</code>-Dateien ändern. Hier ist Ihr Lizenzschlüssel:",
    "TrialLicenseExpireMessage": "Sie verwenden die Testlizenz und Ihre Testlizenz läuft am {0} ab.",
    "TryForFree": "Kostenlos testen",
    "TrialLicenseExpiredInfo": "Ihr Testlizenzzeitraum ist abgelaufen!",
    "CommercialNewsletterConfirmationMessage": "Ich stimme den <a href=\"https://commercial.abp.io/TermsConditions\">Allgemeinen Geschäftsbedingungen</a> und der <a href=\"https://commercial.abp.io/Privacy\">Datenschutzerklärung . zu </a>.",
    "ContinueWithNewOrganization": "Weiter mit einer neuen Organisation",
    "RenewLicenseEarly": "Erhalte ich das ganze Jahr, wenn ich meine Lizenz vorzeitig erneuere?",
    "RenewLicenseEarylExplanation": "Wenn Sie Ihre Lizenz vor dem Ablaufdatum Ihrer Lizenz erneuern, wird Ihr Lizenzablaufdatum um 1 Jahr verlängert. Wenn Ihre Lizenz beispielsweise am {0}-06-06 abläuft und Sie sie am {0}-01-01 erneuern, ist das neue Ablaufdatum der Lizenz der {1}-06-06."
  }
}