{
  "culture": "de",
  "texts": {
    "OrganizationManagement": "Organisationsverwaltung",
    "OrganizationList": "Organisationsauflistung",
    "Volo.AbpIo.Commercial:010003": "Sie sind der Besitzer dieser Organisation!",
    "OrganizationNotFoundMessage": "Keine Organisation gefunden!",
    "DeveloperCount": "Zugeordnete/Gesamte Entwickler",
    "QuestionCount": "Verbleibende/Gesamte Fragen",
    "Unlimited": "Unbegrenzt",
    "Owners": "Besitzer",
    "Owner": "Eigentümer",
    "AddMember": "Mitglied hinzufügen",
    "AddNewOwner": "Neuen Besitzer hinzufügen",
    "AddNewDeveloper": "Neuen Entwickler hinzufügen",
    "UserName": "Benutzername",
    "Name": "Name",
    "EmailAddress": "E-Mail Adresse",
    "Developers": "Entwickler",
    "LicenseType": "Lizenztyp",
    "Manage": "Verwalten",
    "SetDefault": "Als Standard einstellen",
    "DefaultOrganization": "Standard",
    "StartDate": "Startdatum",
    "EndDate": "Enddatum",
    "Modules": "Module",
    "LicenseExtendMessage": "Ihr Lizenzenddatum wird auf {0} verlängert",
    "LicenseUpgradeMessage": "Ihre Lizenz wird auf {0} aktualisiert",
    "LicenseExtendAdnUpgradeMessage": "Ihre Lizenz wurde bis {0} verlängert und Ihr Lizenzplan wird auf {1} aktualisiert.",
    "LicenseAddDeveloperMessage": "{0} Entwickler zu Ihrer Lizenz hinzugefügt",
    "Volo.AbpIo.Commercial:010004": "Kann den angegebenen Benutzer nicht finden! Der Benutzer muss sich bereits registriert haben.",
    "MyOrganizations": "Meine Organisationen",
    "ApiKey": "API-Schlüssel",
    "UserNameNotFound": "Es gibt keinen Benutzer mit dem Benutzernamen {0}",
    "SuccessfullyAddedToNewsletter": "Vielen Dank, dass Sie unseren Newsletter abonniert haben!",
    "MyProfile": "Mein Profil",
    "EmailNotValid": "Bitte geben Sie eine gültige E-Mail-Adresse ein.",
    "JoinOurMarketingNewsletter": "Abonnieren Sie unseren Marketing-Newsletter",
    "WouldLikeToReceiveMarketingMaterials": "Ich möchte Marketingmaterialien wie Produktangebote und Sonderangebote erhalten.",
    "StartUsingYourLicenseNow": "Beginnen Sie jetzt mit der Nutzung Ihrer Lizenz!",
    "WelcomePage": "Startseite",
    "UnsubscriptionExpireEmail": "Abmelden von Erinnerungs-E-Mails zum Ablaufdatum der Lizenz",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Dieses E-Mail-Abonnement enthält nur die Erinnerung an das Ablaufdatum Ihrer Lizenz.",
    "UnsubscribeFromLicenseExpireEmails": "Wenn Sie keine E-Mails zum Ablaufdatum Ihrer Lizenz erhalten möchten, können Sie sich jederzeit abmelden.",
    "Unsubscribe": "Abbestellen",
    "NotOrganizationMember": "Sie sind in keiner Organisation Mitglied.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Erfolgreich abgemeldet",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Sie erhalten keine Erinnerungs-E-Mails mehr für das Ablaufdatum der Lizenz.",
    "IndexPageHeroSection": "<span class=\"first-line\">Eine komplette</span><span class=\"second-line\"> Webentwicklungsplattform</span><span class=\"third-line\">aufgebaute <img src= \"{0}\" width=\"110\" class=\"ml-1\" /> Framework</span>",
    "AbpCommercialShortDescription": "ABP Commercial bietet vorgefertigte Anwendungsmodule, schnelle Anwendungsentwicklungstools, professionelle UI-Themen, Premium-Support und mehr.",
    "LiveDemo": "Live-Demo",
    "LiveDemoLead": "<a href=\"{0}\">{1}</a> mit Ihrem ABP-Konto, <a href=\"{2}\">{3}</a> zu abp.io.<br/>Oder füllen Sie das Formular unten aus, um jetzt eine Live-Demo zu erstellen",
    "ThereIsAlreadyAnAccountWithTheGivenEmailAddress": "Es gibt bereits ein Konto mit der angegebenen E-Mail-Adresse: <b>{0}</b><br/> Sie können sich mit Ihrem Konto anmelden, um fortzufahren.",
    "GetLicence": "Holen Sie sich eine Lizenz",
    "Application": "Anwendung",
    "StartupTemplates": "Startup-Vorlagen",
    "Startup": "Anlaufen",
    "Templates": "Vorlagen",
    "Developer": "Entwickler",
    "Tools": "Werkzeuge",
    "Premium": "Prämie",
    "PremiumSupport": "Premium-Support",
    "PremiumForumSupport": "Premium-Forum-Support",
    "UI": "Benutzeroberfläche",
    "Themes": "Themen",
    "JoinOurNewsletter": "Abonnieren Sie unseren Newsletter",
    "Send": "Senden",
    "WhatIsABPFramework": "WAS IST DER ABP-RAHMEN?",
    "OpenSourceBaseFramework": "Open-Source-Basis-Framework",
    "ABPFrameworkExplanation": "<p class=\"lead\">ABP Commercial basiert auf dem ABP Framework, einem Open-Source- und Community-gesteuerten Webanwendungs-Framework für ASP.NET Core.</p><p>ABP Framework bietet eine hervorragende Infrastruktur zum Schreiben von wartbaren, erweiterbaren und testbarer Code mit Best Practices.</p><p>Aufgebaut und integriert in beliebte Tools, die Sie bereits kennen. Niedrige Lernkurve, einfache Anpassung, komfortable Entwicklung.</p>",
    "Modular": "Modular",
    "MicroserviceCompatible": "Microservice-kompatibel",
    "DomainDrivenDesignInfrastructure": "Domain Driven Design Infrastruktur",
    "MultiTenancy": "Mandantenfähigkeit",
    "DistributedMessaging": "Verteilte Nachrichten",
    "DynamicProxying": "Dynamisches Proxying",
    "BackgroundJobs": "Hintergrundjobs",
    "AuditLogging": "Audit-Logging",
    "BLOBStoring": "BLOB-Speicherung",
    "BundlingMinification": "Bündelung & Minimierung",
    "AdvancedLocalization": "Erweiterte Lokalisierung",
    "ManyMore": "Viel mehr",
    "ExploreTheABPFramework": "Entdecken Sie das ABP-Framework",
    "WhyUseTheABPCommercial": "Warum den ABP-Werbespot verwenden?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\">Das Erstellen von Webanwendungen der Enterprise-Klasse kann komplex und zeitaufwändig sein.</p><p>ABP Commercial bietet die perfekte Basisinfrastruktur, die für alle modernen ASP.NET Core-Anwendungen der Enterprise-Klasse erforderlich ist basierten Lösungen. Vom Design bis zur Bereitstellung wird der gesamte Entwicklungszyklus durch die integrierten Funktionen und Module von ABP unterstützt.</p>",
    "StartupTemplatesShortDescription": "Mit Startup-Vorlagen können Sie in wenigen Sekunden mit Ihrem Projekt beginnen.",
    "UIFrameworksOptions": "Optionen für UI-Frameworks;",
    "DatabaseProviderOptions": "Optionen des Datenbankanbieters;",
    "PreBuiltApplicationModules": "Vorgefertigte Anwendungsmodule",
    "PreBuiltApplicationModulesShortDescription": "Die gängigsten Anwendungsanforderungen sind bereits als wiederverwendbare Module für Sie entwickelt.",
    "Account": "Konto",
    "Blogging": "Bloggen",
    "Identity": "Identität",
    "IdentityServer": "Identitätsserver",
    "Saas": "Saas",
    "LanguageManagement": "Sprachmanagement",
    "TextTemplateManagement": "Verwaltung von Textvorlagen",
    "See All Modules": "SieheAlleModule",
    "ABPSuite": "ABP-Suite",
    "AbpSuiteShortDescription": "ABP Suite ist ein ergänzendes Tool zum ABP Commercial.",
    "AbpSuiteExplanation": "Es ermöglicht Ihnen, Webseiten in wenigen Minuten zu erstellen. Es ist ein globales .NET Core-Tool, das über die Befehlszeile installiert werden kann. Es kann eine neue ABP-Lösung erstellen, CRUD-Seiten aus der Datenbank zum Front-End generieren.",
    "Details": "Einzelheiten",
    "LeptonTheme": "Lepton-Thema",
    "ProfessionalModernUIThemes": "Professionelle, moderne UI-Themen",
    "LeptonThemeExplanation": "Lepton bietet eine Vielzahl von Bootstrap-Admin-Themen, die als solide Grundlage für jedes Projekt dienen, das ein Admin-Dashboard erfordert.",
    "DefaultTheme": "Standardthema",
    "MaterialTheme": "Materielles Thema",
    "Default2Theme": "Standard 2 Thema",
    "DarkTheme": "Dunkles Thema",
    "DarkBlueTheme": "Dunkelblaues Thema",
    "LightTheme": "Lichtthema",
    "ProudToWorkWith": "Stolz, mit zu arbeiten",
    "OurConsumers": "Tausende von Unternehmen und Entwicklern in über 70 Ländern weltweit vertrauen auf ABP Commercial.",
    "JoinOurConsumers": "Schließen Sie sich ihnen an und bauen Sie schnell erstaunliche Produkte.",
    "AdditionalServicesExplanation": "Benötigen Sie zusätzliche oder kundenspezifische Dienstleistungen? <strong>Wir und unsere Partner können Folgendes bieten:</strong>",
    "CustomProjectDevelopment": "Kundenspezifische Projektentwicklung",
    "CustomProjectDevelopmentExplanation": "Engagierte Entwickler für Ihre benutzerdefinierten Projekte.",
    "PortingExistingProjects": "Vorhandene Projekte portieren",
    "PortingExistingProjectsExplanation": "Migration Ihrer Legacy-Projekte auf die ABP-Plattform.",
    "LiveSupport": "Live Support",
    "LiveSupportExplanation": "Live-Remote-Support-Option, wenn Sie sie brauchen.",
    "Training": "Ausbildung",
    "TrainingExplanation": "Dedizierte Schulung für Ihre Entwickler.",
    "OnBoarding": "Onboarding",
    "OnBoardingExplanation": "Helfen Sie beim Einrichten Ihrer Entwicklungs-, CI- und CD-Umgebungen.",
    "PrioritizedTechnicalSupport": "Priorisierter technischer Support",
    "PremiumSupportExplanation": "Neben dem großartigen Community-Support des ABP-Frameworks beantwortet unser Support-Team technische Fragen und Probleme der kommerziellen Nutzer mit hoher Priorität.",
    "SeeTheSupportOptions": "Siehe die Support-Optionen",
    "Contact": "Kontakt",
    "TellUsWhatYouNeed": "Sagen Sie uns, was Sie brauchen.",
    "YourMessage": "Ihre Nachricht",
    "YourFullName": "Ihren vollständigen Namen",
    "FirstNameField": "Vorname",
    "LastNameField": "Familienname, Nachname",
    "EmailField": "E-Mail-Addresse",
    "YourEmailAddress": "Ihre E-Mail-Adresse",
    "ValidEmailAddressIsRequired": "Eine gültige E-Mail-Adresse ist erforderlich.",
    "HowMayWeHelpYou": "Wie können wir Ihnen helfen?",
    "SendMessage": "Nachricht senden",
    "Success": "Erfolg",
    "WeWillReplyYou": "Wir haben Ihre Nachricht erhalten und werden uns in Kürze bei Ihnen melden.",
    "GoHome": "Nach Hause gehen",
    "CreateLiveDemo": "Live-Demo erstellen",
    "CreateLiveDemoDescription": "Sobald Sie dieses Formular absenden, erhalten Sie eine E-Mail mit Ihrem Demo-Link.",
    "RegisterToTheNewsletter": "Melden Sie sich für den Newsletter an, um Informationen zu ABP.IO, einschließlich Neuerscheinungen etc. zu erhalten.",
    "EnterYourEmailOrLogin": "Geben Sie Ihre E-Mail-Adresse ein, um Ihre Demo zu erstellen, oder <a href=\"{0}\">Login</a> mit Ihrem bestehenden Konto.",
    "ApplicationTemplate": "Bewerbungsvorlage",
    "ApplicationTemplateExplanation": "Die Anwendungsstartvorlage wird verwendet, um eine neue Webanwendung zu erstellen.",
    "EfCoreProvider": "Entity Framework (unterstützt SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\">und andere</a>)",
    "AlreadyIncludedInTemplateModules": "Folgende Module sind bereits in dieser Vorlage enthalten und konfiguriert:",
    "ApplicationTemplateArchitecture": "Diese Anwendungsvorlage unterstützt auch eine mehrstufige Architektur, bei der UI-Schicht, API-Schicht und der Authentifizierungsdienst physisch getrennt sind.",
    "SeeTheGuideOrGoToTheLiveDemo": "Technische Informationen zu dieser Vorlage finden Sie im Entwicklerhandbuch oder in der Live-Demo.",
    "DeveloperGuide": "Entwicklerhandbuch",
    "ModuleTemplate": "Modulvorlage",
    "ModuleTemplateExplanation1": "Sie möchten ein Modul erstellen und anwendungsübergreifend wiederverwenden? Diese Startvorlage bereitet alles vor, um ein wiederverwendbares <strong>Anwendungsmodul</strong> oder einen <strong>Microservice</strong> zu erstellen.",
    "ModuleTemplateExplanation2": "<p>Sie können einzelne oder mehrere UI-Frameworks, einzelne oder mehrere Datenbankanbieter für ein einzelnes Modul unterstützen. Die Startvorlage ist so konfiguriert, dass sie zusätzlich zur Komponenten- und Integrationstestinfrastruktur in einer minimalen Anwendung ausgeführt und <strong>Ihr Modul testet</strong>. </p> <p>Technische Informationen zu dieser Vorlage finden Sie im Entwicklerhandbuch.</p>",
    "WithAllStyleOptions": "mit allen Stiloptionen",
    "Demo": "Demo",
    "SeeAllModules": "Alle Module anzeigen",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) ist ein Befehlszeilentool zum Ausführen einiger allgemeiner Operationen für ABP-basierte Lösungen.",
    "ABPSuiteEasilyCURD": "ABP Suite ist ein Tool, mit dem Sie einfach CRUD-Seiten erstellen können",
    "WeAreHereToHelp": "Wir sind hier, um <span class=\"zero-text\">Hilfe</span>",
    "BrowseOrAskQuestion": "Sie können unsere Hilfethemen durchsuchen oder in häufig gestellten Fragen suchen oder uns über das <a href=\"{0}\" class=\"text-success\">Kontaktformular</a> eine Frage stellen.",
    "SearchQuestionPlaceholder": "Suche in häufig gestellten Fragen",
    "WhatIsTheABPCommercial": "Was ist der ABP-Werbespot?",
    "WhatAreDifferencesThanAbpFramework": "Was sind die Unterschiede zwischen dem Open Source ABP Framework und dem ABP Commercial?",
    "AbpCommercialMetaTitle": "{0} | ABP-Werbung",
    "AbpCommercialMetaDescription": "Eine umfassende Webentwicklungsplattform auf dem ABP Framework mit vorgefertigten Modulen, Startvorlagen, schnellen Entwicklungstools, professionellen UI-Themen und Premium-Support.",
    "ABPCommercialExplanation": "ABP Commercial ist eine Reihe von Premium-Modulen, Tools, Themen und Diensten, die auf dem Open-Source-<a target=\"_blank\" href=\"{0}\">ABP-Framework</a> aufbauen. ABP Commercial wird von demselben Team entwickelt und unterstützt, das hinter dem ABP-Framework steht.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\">ABP-Framework</a> ist ein modulares, thematisches, Microservice-kompatibles Anwendungsentwicklungsframework für ASP.NET Core. Es bietet eine vollständige Architektur und eine starke Infrastruktur, damit Sie sich auf Ihren eigenen Geschäftscode konzentrieren können, anstatt sich für jedes neue Projekt zu wiederholen. Es basiert auf Best Practices für die Softwareentwicklung und beliebten Tools, die Sie bereits kennen. </p> <p> Das ABP-Framework ist völlig kostenlos, Open Source und wird von der Community betrieben. Es bietet auch ein kostenloses Thema und einige vorgefertigte Module (z. B. Identitätsmanagement und Mieterverwaltung).</p>",
    "VisitTheFrameworkVSCommercialDocument": "Besuchen Sie den folgenden Link für weitere Informationen <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial fügt dem ABP-Framework die folgenden Vorteile hinzu;",
    "Professional": "Fachmann",
    "UIThemes": "UI-Themen",
    "EnterpriseModules": "Unternehmenstaugliche, funktionsreiche, vorgefertigte <a href=\"{0}\">Anwendungsmodule</a> (z. B. Identity Server-Verwaltung, SaaS-Verwaltung, Sprachverwaltung)",
    "ToolingToSupport": "Tools zur Unterstützung Ihrer Entwicklungsproduktivität (z. B. <a href=\"{0}\">ABP Suite</a>)",
    "PremiumSupportLink": "Premium <a href=\"{0}\" target=\"_blank\">Unterstützung</a>",
    "WhatDoIDownloadABPCommercial": "Was lade ich herunter, wenn ich den ABP-Werbespot kaufe?",
    "CreateUnlimitedSolutions": "Sobald Sie eine kommerzielle ABP-Lizenz erworben haben, können Sie unbegrenzte Lösungen erstellen, wie im Dokument <a href=\"{0}\">Erste Schritte</a> beschrieben.",
    "ABPCommercialSolutionExplanation": "Wenn Sie eine neue Anwendung erstellen, erhalten Sie eine Visual Studio-Lösung (eine Startvorlage) basierend auf Ihren Einstellungen. In der heruntergeladenen Lösung sind kommerzielle Module und Themen bereits installiert und für Sie konfiguriert. Sie können ein vorinstalliertes Modul entfernen oder ein weiteres Modul hinzufügen, wenn Sie möchten. Alle Module und Designs werden standardmäßig in NuGet/NPM-Paketen verwendet.",
    "StartDevelopWithTutorials": "Die heruntergeladene Lösung ist gut strukturiert und dokumentiert. Sie können damit beginnen, Ihren eigenen Geschäftscode basierend darauf zu entwickeln, indem Sie <a href=\"{0}\">den Tutorials</a> folgen",
    "TryTheCommercialDemo": "Sie können <a href=\"{0}\">die Demo</a> ausprobieren, um eine Beispielanwendung anzuzeigen, die mit der ABP Commercial-Startvorlage erstellt wurde.",
    "HowManyProducts": "Wie viele verschiedene Produkte/Lösungen kann ich mit ABP Commercial erstellen?",
    "HowManyProductsExplanation": "Es gibt keine Begrenzung, ein ABP-Projekt zu erstellen. Sie können beliebig viele Projekte erstellen, entwickeln und auf verschiedene Server hochladen.",
    "HowManyDevelopers": "Wie viele Entwickler können am ABP Commercial arbeiten?",
    "HowManyDevelopersExplanation": "ABP Commercial-Lizenzen gelten pro Entwickler. Unterschiedliche Lizenztypen haben unterschiedliche Entwicklerlimits. Sie können jedoch bei Bedarf jederzeit weitere Entwickler zu jedem Lizenztyp hinzufügen. Auf der <a href=\"{0}\">Preisseite</a> finden Sie Lizenztypen, Entwicklerlimits und zusätzliche Entwicklerkosten.",
    "ChangingLicenseType": "Kann ich meinen Lizenztyp später upgraden?",
    "ChangingLicenseTypeExplanation": "Sie können auf eine höhere Lizenz upgraden, indem Sie die Differenz innerhalb Ihres aktiven Lizenzzeitraums bezahlen. Wenn Sie auf einen höheren Lizenzplan aktualisieren, profitieren Sie von den Vorteilen des neuen Plans, aber das Lizenz-Upgrade ändert das Ablaufdatum der Lizenz nicht. Außerdem können Sie Ihrer bestehenden Lizenz auch neue Entwicklerplätze hinzufügen, siehe \"Wie viele Entwickler können an der ABP Commercial arbeiten?\"",
    "LicenseExtendUpgradeDiff": "Was ist der Unterschied zwischen Lizenzverlängerung und Upgrade?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Verlängern:</strong> Durch die Verlängerung/Erneuerung Ihrer Lizenz erhalten Sie weiterhin Premium-Support und größere oder kleinere Updates für die Module und Themes. Außerdem können Sie weiterhin neue Projekte erstellen. Und Sie können weiterhin die ABP Suite verwenden, was Ihre Entwicklung beschleunigt. Wenn Sie Ihre Lizenz verlängern, wird das Ablaufdatum Ihrer Lizenz um ein Jahr verlängert.<hr/> <strong>Upgrade:</strong> Durch das Upgrade Ihrer Lizenz werden Sie zu einem höheren Lizenzplan befördert, der Ihnen zusätzliche Vorteile ermöglicht. Schauen Sie sich die <a href=\"/pricing\">Lizenzvergleichstabelle</a> an, um die Unterschiede zwischen den Lizenzplänen zu sehen. <strong>Andererseits ändert sich bei einem Upgrade das Ablaufdatum Ihrer Lizenz nicht!</strong> Um das Enddatum Ihrer Lizenz zu verlängern, müssen Sie Ihre Lizenz verlängern.",
    "LicenseRenewalCost": "Wie hoch sind die Kosten für die Lizenzverlängerung nach 1 Jahr?",
    "LicenseRenewalCostExplanation": "Der Verlängerungspreis (Erweiterung) der Standard-Teamlizenz beträgt {0}$, die Standard-Business-Lizenz beträgt ${1} und die Standard-Enterprise-Lizenz beträgt ${2}. Wenn Sie bereits Kunde sind, <a href='{3}' target='_blank'>melden Sie sich in Ihrem Konto an</a>, um die verfügbaren Verlängerungspreise zu überprüfen.",
    "HowDoIRenewMyLicense": "Wie erneuere ich meine Lizenz?",
    "HowDoIRenewMyLicenseExplanation": "Sie können Ihre Lizenz erneuern, indem Sie zur <a href='{0}' target='_blank'>Organisationsverwaltungsseite</a> navigieren. Um von unseren ermäßigten Tarifen für die vorzeitige Verlängerung zu profitieren, vergewissern Sie sich, dass Sie vor Ablauf Ihrer Lizenz verlängern. Machen Sie sich jedoch keine Sorgen, dass Sie nicht wissen, wann Ihre Gelegenheit zur vorzeitigen Verlängerung endet. Sie erhalten 3 Erinnerungs-E-Mails, bevor Ihr Abonnement abläuft. Wir versenden sie 30 Tage, 7 Tage und 1 Tag vor Ablauf.",
    "IsSourceCodeIncluded": "Enthält meine Lizenz den Quellcode der kommerziellen Module und Themes?",
    "IsSourceCodeIncludedExplanation1": "Abhängig vom erworbenen Lizenztyp:",
    "IsSourceCodeIncludedExplanation2": "<strong>Team</strong>: Ihre Lösung verwendet die Module und Themes als NuGet- und NPM-Pakete. Es enthält nicht ihren Quellcode. Auf diese Weise können Sie diese Module und Themes einfach aktualisieren, wenn eine neue Version verfügbar ist. Sie können jedoch nicht den Quellcode der Module und der Themes abrufen.",
    "IsSourceCodeIncludedExplanation3": "<strong>Business/Enterprise</strong>: Zusätzlich zur Team-Lizenz können Sie den Quellcode jedes Moduls oder Themes herunterladen, das Sie benötigen. Sie können sogar die NuGet/NPM-Paketverweise für ein bestimmtes Modul entfernen und seinen Quellcode direkt zu Ihrer Lösung hinzufügen, um sie vollständig zu ändern.",
    "IsSourceCodeIncludedExplanation4": "<p>Das Einbinden des Quellcodes eines Moduls in Ihre Lösung gibt Ihnen die maximale Freiheit, dieses Modul anzupassen. Dann ist es jedoch nicht möglich, das Modul automatisch zu aktualisieren, wenn eine neue Version veröffentlicht wird.</p><p>Keine der Lizenzen enthält den Quellcode der ABP Suite, bei dem es sich um ein externes Tool handelt, das Code für Sie generiert und unterstützt zu Ihrer Entwicklung.</p><p>Weitere Unterschiede zwischen den Lizenztypen finden Sie auf der <a href=\"{0}\">Preisseite</a>.</p>",
    "ChangingDevelopers": "Kann ich die registrierten Entwickler meiner Organisation in Zukunft ändern?",
    "ChangingDevelopersExplanation": "Sie können nicht nur neue Entwickler zu Ihrer Lizenz hinzufügen, sondern auch die vorhandenen Entwickler ändern (Sie können einen Entwickler entfernen und einen neuen zum selben Arbeitsplatz hinzufügen) ohne zusätzliche Kosten.",
    "WhatHappensWhenLicenseEnds": "Was passiert, wenn meine Lizenzlaufzeit endet?",
    "WhatHappensWhenLicenseEndsExplanation1": "Die kommerzielle ABP-Lizenz ist eine <a href=\"{0}\" target=\"_blank\">unbefristete Lizenz</a> . Nach Ablauf Ihrer Lizenz können Sie Ihr Projekt weiter entwickeln. Und Sie sind nicht verpflichtet, Ihre Lizenz zu erneuern. Im Lieferumfang Ihrer Lizenz ist ein einjähriger Update- und Supportplan enthalten. Um weiterhin neue Funktionen, Leistungsverbesserungen, Fehlerbehebungen und Support zu erhalten und die ABP Suite weiterhin nutzen zu können, müssen Sie Ihre Lizenz erneuern. Wenn Ihre Lizenz abläuft;",
    "WhatHappensWhenLicenseEndsExplanation2": "Sie können mit ABP Commercial keine neuen Lösungen erstellen, aber Sie können Ihre bestehenden Anwendungen dauerhaft weiterentwickeln.",
    "WhatHappensWhenLicenseEndsExplanation3": "Sie können Updates für die Module und Themen in Ihrer MINOR-Version erhalten (außer RC- oder Preview-Versionen). Wenn Sie beispielsweise Version 3.2.0 eines Moduls verwenden, können Sie weiterhin Updates für Version 3.2.x (Version 3.2.1, Version 3.2.5 usw.) dieses Moduls erhalten. Sie können jedoch keine Updates für die nächste Haupt- oder Nebenversion (wie v3.3.0, v3.3.3, 4.xx usw.) erhalten. Wenn Ihre Lizenz beispielsweise abgelaufen ist, die neueste Version Version 4.4.3 war und später sowohl Version 4.4.4 als auch Version 4.5.0 veröffentlicht wurden, könnten Sie auf Version 4.4.X zugreifen, dies wäre jedoch nicht der Fall Greifen Sie auf v4.5.X zu.",
    "WhatHappensWhenLicenseEndsExplanation4": "Sie können nach Ablauf Ihrer Lizenz keine neuen Module und Themes mehr installieren, die der ABP Commercial-Plattform hinzugefügt wurden.",
    "WhatHappensWhenLicenseEndsExplanation5": "Sie können die ABP Suite nicht verwenden.",
    "WhatHappensWhenLicenseEndsExplanation6": "Sie können den <a href=\"{0}\">Premium-Support</a> nicht mehr erhalten.",
    "WhatHappensWhenLicenseEndsExplanation7": "Sie können Ihre Lizenz verlängern (erneuern), wenn Sie diese Vorteile weiterhin nutzen möchten. Wenn Sie Ihre Lizenz innerhalb von <strong>{3} Tagen</strong> nach Ablauf Ihrer Lizenz verlängern, werden die folgenden Rabatte angewendet: Teamlizenz {0}; Geschäftslizenz {1}; Unternehmenslizenz {2}.",
    "discountForYears": "{0} % Rabatt für {1} Jahr(e)",
    "WhatHappensWhenLicenseEndsExplanation8": "Die von Ihnen generierten ABP-Projekte werden nicht auf unseren Servern gespeichert. Daher liegt es in Ihrer Verantwortung, den heruntergeladenen Quellcode aufzubewahren. Wenn Ihre Lizenz abläuft, gibt es keine Möglichkeit, den generierten ABP-Projektquellcode abzurufen.",
    "WhenShouldIRenewMyLicense": "Wann sollte ich meine Lizenz erneuern?",
    "WhenShouldIRenewMyLicenseExplanation": "Wenn Sie Ihre Lizenz innerhalb von <strong>{3} Tage</strong> nach Ablauf Ihrer Lizenz erneuern, werden die folgenden Rabatte gewährt: Team-Lizenz {0}% Rabatt, Business-Lizenz {1}% Rabatt, Enterprise-Lizenz {2}% Rabatt . Wenn Sie Ihre Lizenz <strong>{3} Tage</strong> nach dem Ablaufdatum Ihrer Lizenz verlängern, entspricht der Verlängerungspreis dem Lizenzkaufpreis und es wird kein Rabatt auf Ihre Verlängerung gewährt.",
    "TrialPlan": "Hast du einen Probeplan?",
    "TrialPlanExplanation": "Ja, um Ihre kostenlose Testversion zu starten, wenden Sie sich an <a href=\"mailto:marketing@volosoft.com?subject=ABP Commercial — Trial License Request\">marketing@volosoft.com</a> . Wir bieten außerdem eine 30-tägige Geld-zurück-Garantie für die Team-Lizenz, ohne dass Fragen gestellt werden! Sie können innerhalb der ersten 30 Tage nach dem Lizenzkauf eine vollständige Rückerstattung beantragen. Für Business- und Enterprise-Lizenzen gewähren wir innerhalb von 30 Tagen eine Rückerstattung von 60 %. Dies liegt daran, dass die Business- und Enterprise-Lizenzen den vollständigen Quellcode aller Module und Themes enthalten.",
    "DoYouAcceptBankWireTransfer": "Akzeptieren Sie Banküberweisungen?",
    "DoYouAcceptBankWireTransferExplanation": "Ja, wir akzeptieren Banküberweisungen.<br />Nachdem Sie die Lizenzgebühr per Banküberweisung gesendet haben, senden Sie uns Ihre Quittung und den gewünschten Lizenztyp per E-Mail an accounting@abp.io. Unsere internationale Bankverbindung:",
    "HowToUpgrade": "Wie aktualisiere ich bestehende Anwendungen, wenn eine neue Version verfügbar ist?",
    "HowToUpgradeExplanation1": "Wenn Sie mit ABP Commercial eine neue Anwendung erstellen, werden alle Module und das Design als NuGet- und NPM-Pakete verwendet. So können Sie die Pakete problemlos aktualisieren, wenn eine neue Version verfügbar ist.",
    "HowToUpgradeExplanation2": "Zusätzlich zu den standardmäßigen NuGet/NPM-Upgrades bietet die <a href=\"{0}\">ABP CLI</a> einen Update-Befehl, der automatisch alle ABP-bezogenen Pakete in Ihrer Lösung findet und aktualisiert.",
    "DatabaseSupport": "Welche Datenbanksysteme werden unterstützt?",
    "DatabaseSupportExplanation": "ABP Framework selbst ist datenbankunabhängig und kann von Natur aus mit jedem Datenbankanbieter zusammenarbeiten. Eine Liste der derzeit implementierten Anbieter finden Sie im <a href=\"{0}\" target=\"_blank\">Datenzugriffsdokument</a>.",
    "UISupport": "Welche UI-Frameworks werden unterstützt?",
    "Supported": "Unterstützt",
    "UISupportExplanation": "ABP Framework selbst ist UI-Framework-agnostisch und kann mit jedem UI-Framework arbeiten. Allerdings wurden Startvorlagen, Modul-UIs und Themes nicht für alle UI-Frameworks implementiert. Eine aktuelle Liste der UI-Optionen finden Sie im <a href=\"{0}\">Dokument zu den ersten Schritten</a>.",
    "MicroserviceSupport": "Unterstützt es die Micro-Service-Architektur?",
    "MicroserviceSupportExplanation1": "Eines der Hauptziele des ABP-Frameworks besteht darin, eine komfortable Infrastruktur bereitzustellen, um Microservice-Lösungen zu erstellen. Lesen Sie das Dokument <a href=\"{0}\">Microservice-Architektur</a>, um zu erfahren, wie es hilft, Microservice-Systeme zu erstellen.",
    "MicroserviceSupportExplanation2": "Alle kommerziellen ABP-Module wurden entwickelt, um Bereitstellungsszenarien für Mikrodienste (mit eigener API und Datenbank) zu unterstützen, indem die <a href=\"{0}\">Best Practices für die Modulentwicklung</a> befolgt werden.",
    "MicroserviceSupportExplanation3": "Wir stellen eine <a href=\"{0}\">Demolösung für Mikrodienste</a> bereit, die eine Mikrodienstarchitekturimplementierung demonstriert, um Sie bei der Erstellung Ihrer eigenen Lösung zu unterstützen.",
    "MicroserviceSupportExplanation4": "Die kurze Antwort lautet also: \"<strong>Ja, es unterstützt die Micro-Service-Architektur</strong>\".",
    "MicroserviceSupportExplanation5": "Ein Micro-Service-System ist jedoch eine Lösung und jede Lösung hat unterschiedliche Anforderungen, Netzwerktopologie, Kommunikationsszenarien, Authentifizierungsmöglichkeiten, Entscheidungen zur Trennung/Freigabe von Datenbanken, Laufzeitkonfigurationen, Systemintegrationen von Drittanbietern und vieles mehr.",
    "MicroserviceSupportExplanation6": "Das ABP Framework und das ABP Commercial bieten eine Infrastruktur für Micro-Service-Szenarien, Micro-Service-kompatible Module, Beispiele und Dokumentation, um Sie beim Aufbau Ihrer eigenen Lösung zu unterstützen. Erwarten Sie jedoch nicht, dass Sie Ihre für Sie vorgefertigte Traumlösung direkt herunterladen. Sie müssen es verstehen und einige Teile basierend auf Ihren Anforderungen zusammenbringen.",
    "WhereCanIDownloadSourceCode": "Wo kann ich Quellcode herunterladen?",
    "WhereCanIDownloadSourceCodeExplanation": "Sie können den Quellcode aller ABP-Module, Angular-Pakete und Themes über die ABP-Suite oder die ABP-CLI herunterladen. Siehe <a href=\"{0}\">Wie lade ich den Quellcode herunter?</a>",
    "ComputerLimitation": "Wie viele Computer kann sich ein Entwickler bei der Entwicklung von ABP anmelden?",
    "ComputerLimitationExplanation": "Wir erlauben ausdrücklich <strong>{0} Computer</strong> pro Person/lizenziertem Entwickler. Wenn ein Entwickler ABP Commercial-Produkte auf einem dritten Rechner entwickeln muss, sollte eine E-Mail an license@abp.io gesendet werden, in der die Situation erläutert wird, und wir werden dann die entsprechende Zuordnung in unserem System vornehmen.",
    "RefundPolicy": "Haben Sie eine Rückerstattungsrichtlinie?",
    "RefundPolicyExplanation": "Sie können innerhalb von <strong>30 Tagen</strong> nach dem Lizenzkauf eine Rückerstattung beantragen. Die Lizenztypen Business und Enterprise verfügen über die Option zum Herunterladen des Quellcodes, daher sind Rückerstattungen für Business und Enterprise (und alle Lizenzen, die ein Recht zum Erhalt von Quellcode enthalten) nicht verfügbar. Darüber hinaus erfolgt keine Rückerstattung für Verlängerungen und Zweitlizenzkäufe.",
    "HowCanIRefundVat": "Wie kann ich die Mehrwertsteuer zurückerstatten?",
    "HowCanIRefundVatExplanation1": "Wenn Sie die Zahlung über 2Checkout getätigt haben, können Sie die Mehrwertsteuer über Ihr 2Checkout-Konto erstatten:",
    "HowCanIRefundVatExplanation2": "Melden Sie sich bei Ihrem <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\">2Checkout</a>-Konto an",
    "HowCanIRefundVatExplanation3": "Suchen Sie die entsprechende Bestellung und klicken Sie auf \"Rückerstattung der verspäteten Mehrwertsteuer\" (geben Sie Ihre Umsatzsteuer-Identifikationsnummer ein)",
    "HowCanIGetMyInvoice": "Wie erhalte ich meine Rechnung?",
    "HowCanIGetMyInvoiceExplanation": "Es gibt 2 Zahlungsgateways für den Kauf einer Lizenz: Iyzico und 2Checkout. Wenn Sie Ihre Lizenz über das 2Checkout-Gateway kaufen, wird die PDF-Rechnung an Ihre E-Mail-Adresse gesendet, siehe <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How- do-invoices-work\">2Checkout-Rechnung.</a> Wenn Sie über das Iyzico-Gateway, mit einem benutzerdefinierten Kauflink oder per Banküberweisung einkaufen, erstellen und senden wir Ihre Rechnung. Sie können Ihre Rechnung auf der <a href=\"{0}\">Seite zur Organisationsverwaltung</a> anfordern oder herunterladen. Bevor Sie uns wegen der Rechnung kontaktieren, überprüfen Sie Ihre Organisationsverwaltungsseite!",
    "Forum": "Forum",
    "SupportExplanation": "ABP Commercial Licenses bieten einen Premium-Forum-Support durch ein Team, das aus den ABP Framework-Experten besteht.",
    "PrivateTicket": "Privatticket",
    "PrivateTicketExplanation": "Die Enterprise-Lizenz beinhaltet auch einen privaten Support mit E-Mail- und Ticketsystem.",
    "AbpSuiteExplanation1": "Mit der ABP Suite können Sie Webseiten in wenigen Minuten erstellen. Es handelt sich um ein globales .NET Core-Tool, das über die Befehlszeile installiert werden kann.",
    "AbpSuiteExplanation2": "Es kann eine neue ABP-Lösung erstellen, CRUD-Seiten aus der Datenbank zum Front-End generieren. Eine technische Übersicht finden Sie im <a href=\"{0}\">Dokument</a>",
    "FastEasy": "Schnell leicht",
    "AbpSuiteExplanation3": "Mit der ABP Suite können Sie einfach CRUD-Seiten erstellen. Sie müssen nur Ihre Entität und ihre Eigenschaften definieren, den Rest überlassen Sie ABP Suite! ABP Suite generiert in wenigen Sekunden den gesamten erforderlichen Code für Ihre CRUD-Seite. Es unterstützt Angular-, MVC- und Blazor-Benutzeroberflächen.",
    "RichOptions": "Reichhaltige Optionen",
    "AbpSuiteExplanation4": "ABP Suite supports multiple UI options like <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\">Razor Pages</a> and <a href=\"https://angular.io\">Angular</a>.It also supports multiple databases like <a href=\"https://www.mongodb.com\">MongoDB</a> and all databases supported by <strong>EntityFramework Core</strong> (MS SQL Server, Oracle, MySql, PostgreSQL and <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\">more</a>).",
    "AbpSuiteExplanation5": "Das Gute ist, dass Sie sich um diese Optionen keine Sorgen machen müssen. ABP Suite versteht Ihren Projekttyp und generiert den Code für Ihr Projekt und platziert den generierten Code an der richtigen Stelle in Ihrem Projekt.",
    "SourceCode": "Quellcode",
    "AbpSuiteExplanation6": "ABP Suite generiert den Quellcode für Sie! Es werden keine magischen Dateien generiert, um die Webseite zu generieren. Die ABP Suite generiert den Quellcode für <strong>Entity, Repository, Application Service, Code First Migration, JavaScript/TypeScript und CSHTML/HTML</strong> und notwendige Schnittstellen. Die ABP Suite generiert den Code auch gemäß <strong>Best Practices</strong> der Softwareentwicklung, sodass Sie sich keine Sorgen um die Qualität des generierten Codes machen müssen.",
    "AbpSuiteExplanation7": "Da Sie den Quellcode der Bausteine der generierten CRUD-Seite in den richtigen Anwendungsschichten haben, können Sie den Quellcode leicht ändern und Ihre benutzerdefinierte/Geschäftslogik in den generierten Code einfügen.",
    "CrossPlatform": "Plattformübergreifend",
    "AbpSuiteExplanation8": "Die ABP Suite wurde mit .NET Core erstellt und ist plattformübergreifend. Es läuft als Webanwendung auf Ihrem lokalen Computer. Sie können es auf <strong>Windows</strong>, <strong>Mac</strong> und <strong>Linux</strong> ausführen",
    "OtherFeatures": "Andere Eigenschaften",
    "OtherFeatures1": "Aktualisiert problemlos <strong>NuGet</strong>- und <strong>NPM</strong>-Pakete für Ihre Lösung.",
    "OtherFeatures2": "Regeneriert bereits generierte Seiten von Grund auf neu.",
    "OtherFeatures3": "Schafft neue Lösungen",
    "ThanksForCreatingProject": "Vielen Dank, dass Sie Ihr Projekt erstellt haben!",
    "HotToRunSolution": "Wie führen Sie Ihre Lösung aus?",
    "HotToRunSolutionExplanation": "Im Dokument \"Erste Schritte\" erfahren Sie, wie Sie Ihre Lösung konfigurieren und ausführen.",
    "GettingStarted": "Einstieg",
    "WebAppDevTutorial": "Web-App-Entwickler-Tutorial",
    "WebAppDevTutorialExplanation": "Im Tutorialdokument zur Entwicklung von Webanwendungen finden Sie ein schrittweises Entwicklungsbeispiel.",
    "Document": "Dokumentieren",
    "UsingABPSuiteToCURD": "Verwenden der ABP Suite für CRUD-Seitengenerierung und -tooling",
    "SeeABPSuiteDocument": "Siehe das Dokument ABP Suite, um mehr über die Verwendung der ABP Suite zu erfahren.",
    "AskQuestionsOnSupport": "Sie können Fragen zum kommerziellen ABP-Support stellen.",
    "Documentation": "Dokumentation",
    "SeeModulesDocument": "Eine Liste aller kommerziellen (Pro-)Module und deren Dokumente finden Sie im Moduldokument.",
    "Pricing": "Preisgestaltung",
    "PricingExplanation": "Wählen Sie die Funktionen und Funktionen, die Ihr Unternehmen heute benötigt. Einfaches Upgraden, wenn Ihr Unternehmen wächst.",
    "Team": "Mannschaft",
    "Business": "Unternehmen",
    "Enterprise": "Unternehmen",
    "Custom": "Benutzerdefiniert",
    "IncludedDeveloperLicenses": "Enthaltene Entwicklerlizenzen",
    "CustomLicenceOrAdditionalServices": "Benötigen Sie eine benutzerdefinierte Lizenz oder zusätzliche Dienste?",
    "CustomOrVolumeLicense": "Benutzerdefinierte oder Volumenlizenz",
    "LiveTrainingSupport": "Live-Training & Support",
    "AndMore": "und mehr",
    "AdditionalDeveloperLicense": "Zusätzliche Entwicklerlizenz",
    "ProjectCount": "Projektanzahl",
    "AllProModules": "Alle Pro-Module",
    "AllProThemes": "Alle Pro-Themen",
    "AllProStartupTemplates": "Alle Pro-Startup-Vorlagen",
    "SourceCodeOfAllModules": "Quellcode aller Module",
    "SourceCodeOfAllThemes": "Quellcode aller Themes",
    "PerpetualLicense": "Unbefristete Lizenz",
    "UnlimitedServerDeployment": "Unbegrenzte Serverbereitstellung",
    "YearUpgrade": "1 Jahr Upgrade",
    "YearPremiumForumSupport": "1 Jahr Premium-Forum-Support",
    "ForumSupportIncidentCountYear": "Anzahl der Vorfälle im Forumssupport/Jahr",
    "PrivateTicketEmailSupport": "Privates Ticket & E-Mail-Support",
    "BuyNow": "Kaufe jetzt",
    "PayViaAmexCard": "Wie kann ich mit meiner AMEX-Karte bezahlen?",
    "PayViaAmexCardDescription": "Das Standard-Zahlungsgateway 'Iyzico' kann aufgrund der Sicherheitsmaßnahmen einige AMEX-Kreditkarten ablehnen. In diesem Fall können Sie über das alternative Zahlungsgateway '2Checkout' bezahlen.",
    "ThankYou": "Dankeschön",
    "InvalidReCaptchaErrorMessage": "Beim Verifizieren von reCAPTCHA ist ein Fehler aufgetreten. Bitte versuche es erneut.",
    "CompanyName": "Name der Firma",
    "YourCompanyName": "Ihr Firmenname",
    "FirstName": "Vorname",
    "LastName": "Nachname",
    "Optional": "Optional",
    "YourFirstName": "Ihr Vorname",
    "YourLastName": "Ihr Nachname",
    "SpecialOffer": "Sonderangebot",
    "SpecialOfferMessage": "Beeil dich! Die Preise sind zeitlich begrenzt gültig.",
    "DiscountRequest": "Rabattanfrage",
    "DiscountRequestDescribeCustomerQuestion": "Welche der folgenden Aussagen beschreibt Sie?",
    "DiscountRequestStudentEmailMessage": "Die E-Mail-Adresse muss \"edu\" enthalten.",
    "DiscountRequestDeveloperCount": "Wie viele Entwickler sind Sie?",
    "DiscountRequestDeveloperCountExceedMessage": "Wir bieten keine ermäßigten Lizenzen für Unternehmen mit mehr als {0} Entwicklern an.",
    "DiscountRequestOrganizationName": "Name des Unternehmens/der Organisation/der Schule",
    "Website": "Webseite",
    "GithubUsername": "GitHub-Benutzername",
    "PhoneNumber": "Telefonnummer",
    "Country": "Land",
    "DescribeABPCommercialUsage": "Beschreiben Sie das Projekt, das Sie basierend auf APB Commercial entwickeln möchten",
    "DiscountRequestCertifyInformationMessage": "Ich bestätige, dass alle Angaben wahr und richtig sind.",
    "DiscountRequestReceived": "Wir haben Ihre Rabattanfrage erhalten.",
    "DiscountRequestStatusMessage": "Wir werden Ihnen nach Prüfung der von Ihnen gemachten Angaben antworten.",
    "MVCOrRazorPages": "MVC (Razor-Seiten)",
    "Angular": "Eckig",
    "Blazor": "Blazor",
    "New": "Neu",
    "MongoDB": "MongoDB",
    "EBookDDD": "E-Book-Domain-gesteuertes Design",
    "PracticalGuideForImplementingDDD": "Dieses Buch ist ein praktischer Leitfaden für die Implementierung des Domain Driven Designs mit dem ABP Framework.",
    "IntroducingDDD": "Einführung von Domain Driven Design",
    "DDDLayersAndCleanArchitecture": "DDD-Schichten und saubere Architektur",
    "LayeringOfADotnetSolution": "Layering einer .NET-Lösung",
    "ImplementingDDDBuildingBlocks": "Implementieren von DDD-Bausteinen",
    "DomainVsApplicationLogic": "Domänenlogik vs. Anwendungslogik",
    "SamplesAndDiscussions": "Beispiele & Diskussionen",
    "Free": "Kostenlos",
    "Download": "Herunterladen",
    "DDDEBook": "DDD-E-Book",
    "ImplementingDDD": "Implementieren von Domain Driven Design",
    "DDDBookExplanation": "Ein praktischer Leitfaden für die Implementierung des Domain Driven Designs mit dem ABP Framework.",
    "Overview": "Überblick",
    "DDDBookPracticalGuide": "Dies ist ein praktischer Leitfaden für die Implementierung des Domain Driven Designs (DDD). Während die Implementierungsdetails auf der ABP Framework-Infrastruktur basieren, sind Kernkonzepte, Prinzipien und Muster auf jede Art von Lösung anwendbar, auch wenn es sich nicht um eine .NET-Lösung handelt.",
    "TableOfContents": "Inhaltsverzeichnis",
    "IntroductionToImplementingDDD": "Einführung in die Implementierung von Domain Driven Design",
    "WhatIsDDD": "Was ist Domain Driven Design?",
    "Implementation": "Implementierung",
    "TheBigPicture": "Das große Bild",
    "TheBuildingBlock": "Der Baustein",
    "ExampleUseCase": "Beispielanwendungsfall",
    "DomainAndApplicationLogic": "Domänenlogik und Anwendungslogik",
    "Author": "Autor",
    "PublishedOn": "Veröffentlicht auf",
    "Page": "Buchseite",
    "FreeEBook": "Kostenloses E-Book",
    "EBookSignInForDownload": "Um das E-Book herunterzuladen, melden Sie sich an",
    "SignIn": "Einloggen",
    "Or": "Oder",
    "TellUsAboutYourself": "Erzähl uns ein bisschen über dich",
    "Surname": "Nachname",
    "DoYouAgreePrivacyPolicy": "Ich stimme den <a href=\"/TermsConditions\">Nutzungsbedingungen<a/> und der <a href=\"/Privacy\">Datenschutzerklärung</a> zu.",
    "VolosoftMarketingInformationMessage": "Ich möchte Informationen, Tipps und Angebote zu Lösungen für Unternehmen und Organisationen und anderen Produkten und Dienstleistungen von Volosoft.",
    "VolosoftSharingInformationMessage": "Ich möchte, dass Volosoft meine Informationen mit ausgewählten Partnern teilt, damit ich relevante Informationen über deren Produkte und Dienstleistungen erhalten kann.",
    "WeWillSendYouADownloadLink": "Ein Link zum Herunterladen des E-Books wurde an {0} gesendet.<br/> Überprüfen Sie Ihren Posteingang/Junk-/Spam-Ordner!",
    "InvalidFormInputs": "Bitte geben Sie die im Formular angegebenen gültigen Informationen ein.",
    "DDDBookEmailBody": "Dankeschön. <br /> Um Ihr Buch herunterzuladen, <a href=\"{0}\">klicken Sie hier</a>.",
    "StartFree": "Kostenlos starten",
    "FreeTrial": "Kostenlose Testphase",
    "AcceptsMarketingCommunications": " Ja, ich möchte kommerzielle Marketingmitteilungen von ABP erhalten.",
    "PurposeOfUsage": "Verwendungszweck",
    "Choose": "- Wählen -",
    "CompanyOrganizationName": "Name der Firma/Organisation",
    "CompanySize": "Firmengröße",
    "Next": "Nächste",
    "StartTrial": "Starten Sie meine kostenlose Testversion",
    "ContactUsQuestions": "Kontaktieren Sie uns, wenn Sie Fragen haben",
    "TrialActivatedWarning": "Ein Benutzer hat nur Anspruch auf 1 kostenlose Testphase. Sie haben Ihre Testphase bereits genutzt.",
    "ActivationRequirement": "Sie sind nur noch einen Schritt vom Beginn Ihrer Testversion entfernt.<br> Nach Prüfung Ihrer Angaben aktivieren wir Ihre Lizenz. Sobald Ihre Lizenz aktiviert ist, senden wir eine E-Mail an <b>{0}</b> . Keine Sorge, dieser Vorgang wird nicht lange dauern!",
    "SaveAndDownload": "Speichern und herunterladen",
    "CompanyNameValidationMessage": "Firmenname ist zu lang!",
    "AddressValidationMessage": "Adresse ist zu lang!",
    "TaxNoValidationMessage": "STEUER-/MwSt.-Nr. ist zu lang!",
    "NotesValidationMessage": "Anmerkungsfeld ist zu lang!",
    "CheckYourBillingInfo": "Sie können Ihre Rechnung nur einmal erstellen! Überprüfen Sie Ihre Rechnungsinformationen, bevor Sie Ihre Rechnung erstellen.",
    "StartYourFreeTrial": "Starten Sie Ihre kostenlose Testversion",
    "TrialLicenseModelInvalidErrorMessage": "Eines der folgenden Felder ist ungültig: Ländername, Unternehmensgröße, Branche oder Verwendungszweck.",
    "Trial": "Versuch",
    "Purchased": "Gekauft",
    "PurchaseNow": "Jetzt kaufen",
    "PurchaseTrialLicenseMessage": "Das Ablaufdatum Ihrer Lizenz ist {0}. <br> Wenn Sie die Projekte, die Sie während Ihres kostenlosen Testzeitraums erstellt haben, weiterhin verwenden möchten, müssen Sie die Lizenzschlüssel in Ihren <code>appsettings.secrets.json</code>-Dateien ändern. Hier ist Ihr Lizenzschlüssel:",
    "TrialLicenseExpireMessage": "Sie verwenden die Testlizenz und Ihre Testlizenz läuft am {0} ab.",
    "TryForFree": "Kostenlos testen",
    "TrialLicenseExpiredInfo": "Ihr Testlizenzzeitraum ist abgelaufen!",
    "DowngradeLicensePlan": "Kann ich in Zukunft ein Downgrade auf einen niedrigeren Lizenzplan durchführen?",
    "DowngradeLicensePlanExplanation": "Sie können Ihren bestehenden Lizenzplan nicht herunterstufen. Sie können jedoch einen neuen niedrigeren Lizenzplan erwerben und Ihre Entwicklung mit der neuen Lizenz fortsetzen. Nachdem Sie eine niedrigere Lizenz erworben haben, müssen Sie sich lediglich über den ABP-CLI-Befehl „abp login“ bei Ihrem neuen Lizenzplan anmelden<username> -Ö<organization> `.",
    "LicenseTransfer": "Kann eine Lizenz von einem Entwickler auf einen anderen übertragen werden?",
    "LicenseTransferExplanation": "Ja! Wenn Sie eine Lizenz erwerben, werden Sie zum Lizenzinhaber und haben daher Zugriff auf die Organisationsverwaltungsseite. Eine Organisation hat Eigentümer- und Entwicklerrollen. Eigentümer können die Entwicklerplätze verwalten und Entwickler zuweisen. Jeder zugewiesene Entwickler meldet sich über den ABP-CLI-Befehl am System an und verfügt über Entwicklungs- und Supportberechtigungen.",
    "UserOwnerDescription": "Der „Eigentümer“ der Organisation ist der Administrator dieses Kontos. Er/sie verwaltet die Organisation, indem er Lizenzen kauft und Entwickler zuweist. Ein „Eigentümer“ kann keinen Code in den kommerziellen ABP-Projekten schreiben, die ABP-Beispielprojekte nicht herunterladen und auf der Support-Website keine Fragen stellen. Wenn Sie all dies tun möchten, müssen Sie sich auch selbst als Entwickler hinzufügen.",
    "UserDeveloperDescription": "Die „Entwickler“ können Code in den ABP Commercial-Projekten schreiben, die ABP-Beispielprojekte herunterladen und auf der Support-Website Fragen stellen. Andererseits können die „Entwickler“ diese Organisation nicht verwalten.",
    "RemoveCurrentUserFromOrganizationWarningMessage": "Sie entfernen sich aus Ihrer eigenen Organisation. Sie können diese Organisation nicht mehr verwalten. Bestätigen Sie dies?",
    "RenewExistingOrganizationOrCreateNewOneMessage": "Sie können die Lizenz Ihrer Organisation(en) erneuern, indem Sie auf die Schaltfläche(n) unten „Jetzt verlängern“ klicken und so das Ablaufdatum der Lizenz um ein Jahr verlängern. Wenn Sie mit dem Bezahlen fortfahren, erhalten Sie eine neue Organisation. Möchten Sie mit einer neuen Organisation weitermachen?",
    "PurchaseTrialOrganizationOrCreateNewOneMessage": "Sie haben eine Testlizenz. Um Ihre Testlizenz zu erwerben, klicken Sie auf die Schaltfläche „Jetzt kaufen“. Wenn Sie mit dem Bezahlen fortfahren, erhalten Sie eine neue Organisation. Möchten Sie mit einer neuen Organisation weitermachen?",
    "ExtendNow": "Jetzt verlängern",
    "CreateNewOrganization": "Erstellen Sie eine neue Organisation",
    "RenewLicenseEarly": "Erhalte ich das ganze Jahr, wenn ich meine Lizenz vorzeitig erneuere?",
    "RenewLicenseEarylExplanation": "Wenn Sie Ihre Lizenz vor dem Ablaufdatum Ihrer Lizenz erneuern, wird Ihr Lizenzablaufdatum um 1 Jahr verlängert. Wenn Ihre Lizenz beispielsweise am {0}-06-06 abläuft und Sie sie am {0}-01-01 erneuern, ist das neue Ablaufdatum der Lizenz der {1}-06-06.",
    "OpenSourceWebApplication": "Open-Source-Webanwendung",
    "CompleteWebDevelopment": "Eine komplette Webentwicklung",
    "ABPFrameworkDescription": "ABP Framework ist eine vollständige Infrastruktur zur Erstellung moderner Webanwendungen unter Befolgung der Best Practices der Softwareentwicklung und Konventionen.",
    "CommunityDescription": "Teilen Sie Ihre Erfahrungen mit dem ABP Framework!",
    "GetStarted": "Loslegen",
    "Views": "Ansichten",
    "LatestPosts": "Neueste Beiträge",
    "PreBuiltApplication": "Vorgefertigte Anwendung",
    "DatabaseProviders": "Datenbankanbieter",
    "UIFrameworks": "UI-Frameworks",
    "UsefulLinks": "Nützliche Links",
    "Platform": "Plattform",
    "CoolestCompaniesUseABPCommercial": "Die coolsten Unternehmen nutzen bereits <span class=\"fw-bold\">ABP Commercial.</span>",
    "UserInterface": "Benutzeroberfläche",
    "APIGateway": "API-Gateway",
    "Microservice": "Mikroservice",
    "Database": "Datenbank",
    "Architecture": "Die Architektur",
    "MicroserviceArchitectureExplanation": "Hierbei handelt es sich um eine vollständige Lösungsarchitektur, die aus mehreren Anwendungen, API-Gateways, Microservices und Datenbanken besteht, um eine skalierbare Microservice-Lösung mit den neuesten Technologien aufzubauen.",
    "BusinessLogic": "Geschäftslogik",
    "DataAccessLayer": "Datenzugriffsschicht",
    "Monolith": "Monolith",
    "ModularArchitectureExplanation": "Diese Startup-Vorlage bietet eine mehrschichtige, modulare und DDD-basierte Lösungsarchitektur zum Aufbau einer sauberen und wartbaren Codebasis.",
    "SeeDetails": "Siehe Einzelheiten",
    "SeeDocumentation": "Schauen Sie sich die Dokumentation an",
    "Bs5Compatible": "Bootstrap 5-kompatibles professionelles Theme, perfekt für Ihre Admin-Website.",
    "LeptonXTheme": "LeptonX-Theme",
    "LeptonXDark": "LeptonX Dark",
    "LeptonXLight": "LeptonX-Licht",
    "LeptonXSemiDark": "LeptonX Halbdunkel",
    "BuiltOnBs5Library": "Basierend auf der Bootstrap 5-Bibliothek",
    "FullyCompatibleWithBs5": "100 % kompatibel mit der HTML-Struktur und den CSS-Klassen von Bootstrap 5",
    "ResponsiveAndMobileCompatible": "Reaktionsschnelle, mobilkompatible RTL-Unterstützung",
    "ProvidesStylesForDatatables": "Stellt Stile für Datentabellen bereit",
    "MultipleLayoutOptions": "Mehrere Layoutoptionen",
    "EasilyInstallAndUpgrade": "Einfache Installation und Aktualisierung",
    "SupportForum": "Hilfeforum",
    "TrustedBy": "Vertrauenswürdig von",
    "OurPricing": "Unsere <span class=\"gradient-commercial\">Preise</span>",
    "Plans": "Pläne",
    "NameSurname": "Vorname Familienname",
    "Unspecified": "Nicht spezifiziert",
    "LicenceType": "Lizenztyp",
    "LicenseDiscountWarning": "DIESE RABATTSEITE VERWENDET DEN STANDARD-RABATTCODE UND FÜR VOLOSOFT-ENTWICKLER. DIE UNTENSTEHENDEN KAUFLINKS FUNKTIONIEREN NICHT.",
    "DiscountedLicenseExplanation": "Diese Lizenzpreise gelten für kleine Startups, einzelne Entwickler, Studenten, gemeinnützige Organisationen und Projekte!",
    "General": "Allgemein",
    "License": "Lizenz",
    "Development": "Entwicklung",
    "Payment": "Zahlung",
    "WatchExplainerVideo": "Lass uns treffen! Sehen Sie sich das Erklärvideo an",
    "LightDarkAndSemiDarkThemes": "Hell, dunkel und halbdunkel",
    "LeptonXThemeExplanation": "Lepton Theme kann Ihr Theme entsprechend Ihren Systemeinstellungen ändern.",
    "PRO": "PROFI",
    "WelcomeToABPCommercial": "Willkommen bei <span class=\"gradient-commercial\">ABP Commercial!</span>",
    "YourAccountDetails": "Deine Benutzerkontendetails",
    "OrganizationName": "Name der Organisation",
    "AddDevelopers": "Entwickler hinzufügen",
    "StartDevelopment": "Starten Sie die Entwicklung",
    "CreateAndRunApplicationUsingStartupTemplate": "Erfahren Sie, wie Sie mithilfe der ABP Commercial-Startvorlage eine neue Webanwendung erstellen und ausführen.",
    "CommunityDescription2": "<span class=\"fw-6\">community.abp.io</span> ist ein Ort, an dem Menschen ABP-bezogene Artikel teilen können. Suchen Sie nach Artikeln, Tutorials, Codebeispielen und Fallstudien und treffen Sie Leute auf der gleichen Spur wie Sie.",
    "UseABPSuiteExplanation": "Verwenden Sie ABP Suite, um den Quellcode der Module und Themes herunterzuladen.",
    "ManageModulesWithSuite": "Sie können Ihre ABP-Module auch mit Suite verwalten.",
    "LearnHowToInstallSuite": "Erfahren Sie, wie Sie die ABP Suite installieren und verwenden.",
    "SeeMore": "Mehr sehen",
    "SeeLess": "Weniger anzeigen",
    "LayeredSolutionStructure": "Mehrschichtige Lösungsstruktur",
    "LayeredSolutionStructureExplanation": "Die Lösung ist geschichtet und basiert auf Prinzipien und Mustern des Domain Driven Design, um Ihre Geschäftslogik von der Infrastruktur und den Integrationen zu isolieren und die Wartbarkeit und Wiederverwendbarkeit des Codes zu maximieren. ABP Framework bietet bereits Abstraktionen, Basisklassen und Anleitungen, um DDD wirklich für Ihre Anwendung zu implementieren.",
    "MultipleUIOptions": "Mehrere UI-Optionen",
    "MultipleUIOptionsExplanation": "Wir lieben verschiedene Möglichkeiten, die Benutzeroberfläche zu erstellen. Diese Startup-Lösung bietet drei verschiedene UI-Framework-Optionen für Ihre Geschäftsanwendung.",
    "MultipleDatabaseOptions": "Mehrere Datenbankoptionen",
    "MultipleDatabaseOptionsExplanation": "Sie haben zwei Datenbankanbieteroptionen (zusätzlich zur Verwendung beider in einer einzigen Anwendung). Verwenden Sie Entity Framework Core, um mit jeder relationalen Datenbank zu arbeiten, und verwenden Sie optional Dapper, wenn Sie Low-Level-Abfragen für eine bessere Leistung schreiben müssen. MongoDB ist eine weitere Option, wenn Sie eine dokumentenbasierte NoSQL-Datenbank verwenden müssen. Obwohl diese Anbieter gut integriert, abstrahiert und vorkonfiguriert sind, können Sie tatsächlich mit jedem Datenbanksystem interagieren, das Sie mit .NET verwenden können.",
    "ModularArchitectureExplanation2": "Modularität ist ein erstklassiger Bestandteil der ABP.IO-Plattform. Alle Anwendungsfunktionen sind in gut isolierte optionale Module aufgeteilt. In der Startup-Lösung sind die grundlegenden <a href=\"/modules\" class=\"text-primary\">ABP Commercial-Module</a> bereits vorinstalliert. Sie können auch eigene Module erstellen, um ein modulares System für Ihre eigene Anwendung aufzubauen.",
    "MultiTenancyForSaasBusiness": "Mandantenfähigkeit für Ihr SaaS-Unternehmen",
    "MultiTenancyForSaasBusinessExplanation": "ABP Commercial bietet ein vollständiges End-to-End-Multi-Tenancy-System zur Erstellung Ihrer SaaS-Systeme (Software-as-a-Service). Es ermöglicht den Mietern, ihre Datenbanken gemeinsam zu nutzen oder über ein System zur spontanen Datenbankerstellung und -migration zu verfügen.",
    "MicroserviceStartupSolution": "Microservice-Startup-Lösung",
    "MicroserviceArchitectureExplanation2": "Sie können es für Ihr nächstes Microservice-System erwerben, um von der vorgefertigten Basislösung und der destillierten Erfahrung zu profitieren.",
    "PreIntegratedTools": "In gängige Tools vorintegriert",
    "PreIntegratedToolsExplanation": "Die Lösung ist bereits in die branchenüblichen Tools und Technologien integriert, Sie können diese jedoch jederzeit ändern und in Ihre bevorzugten Tools integrieren.",
    "SingleSignOnAuthenticationServer": "Single-Sign-On-Authentifizierungsserver",
    "SingleSignOnAuthenticationServerExplanation": "Die Lösung verfügt über eine Authentifizierungsserveranwendung, die von den anderen Anwendungen als Single-Sign-On-Server mit den API-Zugriffsverwaltungsfunktionen verwendet wird. Es basiert auf dem IdentityServer.",
    "WebAppsWithGateways": "2 Web-App mit 2 API-Gateways",
    "WebAppsWithGatewaysExplanation": "Die Lösung enthält zwei Webanwendungen, jede verfügt über ein dediziertes API-Gateway (BFF – Backend For Frontend-Muster).",
    "BackOfficeApplication": "Backoffice-Anwendung",
    "BackOfficeApplicationExplanation": "Die eigentliche Webanwendung Ihres Systems mit mehreren UI-Framework-Optionen. Sie können jede Art von Geschäftsanwendung erstellen.",
    "LandingWebsite": "Landing-Website",
    "LandingWebsiteExplanation": "Eine generische Landing-/öffentliche Website, die für verschiedene Zwecke verwendet werden kann, z. B. zur Vorstellung Ihres Unternehmens, zum Verkauf Ihrer Produkte usw.",
    "ABPFrameworkEBook": "E-Book „Mastering ABP Framework“.",
    "MasteringAbpFrameworkEBookDescription": "In Ihrer kommerziellen ABP-Lizenz enthalten",
    "FullName": "Vollständiger Name",
    "LicenseTypeNotCorrect": "Der Lizenztyp ist nicht korrekt!",
    "Trainings": "Schulungen",
    "ChooseTrainingPlaceholder": "Wählen Sie die Ausbildung...",
    "DoYouNeedTrainings": "Benötigen Sie eine dieser Schulungen?",
    "DoYouNeedTraining": "Benötigen Sie {0} Schulung?",
    "GetInTouchUs": "Nehmen Sie Kontakt mit uns auf",
    "ForMoreInformationClickHere": "Für weitere Informationen klicken Sie <a href='{0}'>hier.</a>",
    "ForMoreInformationClickHereByClass": "<span class=\"{1}\">Für weitere Informationen klicken Sie</span> <a href='{0}'>hier.</a>",
    "IsGetOnboardingTraining": "Möchten Sie eine Schulung zum Onboarding und zur Entwicklung von Webanwendungen erhalten?",
    "OnboardingWebApplicationDevelopmentTrainingMessage": "Um Ihren Schulungskalender zu planen, kontaktieren Sie bitte {0}, nachdem Sie die Organisation erstellt haben",
    "CustomPurchaseMessage": "Klicken Sie im nächsten Schritt auf {0}, um Kontakt mit uns aufzunehmen.",
    "Note": "Notiz",
    "AdditionalNote": "Zusätzliche Anmerkung",
    "OnboardingTrainingFaqTitle": "Haben Sie eine ABP-Onboarding-Schulung?",
    "OnboardingTrainingFaqExplanation": "Ja, wir bieten ABP-Schulungsdienste an, die Ihnen dabei helfen, Ihr ABP-Projekt schnell zu starten. Sie erfahren von einem Mitglied des ABP-Kernteams etwas über ABP und erwerben die Fähigkeiten, mit denen Sie Ihr ABP-Projekt beginnen können. Im Onboarding-Training erklären wir Ihnen, wie Sie Ihre Entwicklungsumgebung einrichten, die erforderlichen Tools installieren und eine voll funktionsfähige CRUD-Seite erstellen. Die Schulung findet live statt und es wird die Zoom-Anwendung verwendet. Wir sind offen für die Nutzung anderer Online-Meeting-Plattformen. Die Sprache der Schulung ist Englisch. Sie können während der Sitzungen auch Ihre Fragen zu ABP stellen. Für beide Seiten wird ein passender Zeitpunkt und Termin vereinbart. Um weitere Informationen zu erhalten, kontaktieren Sie uns unter <a href=\"mailto:info@abp.io\">info@abp.io</a> .",
    "AddBasket": "Zum Warenkorb hinzufügen",
    "SendTrainingRequest": "Schulungsanfrage senden",
    "OnlyEnglishVersionOfThisDocumentIsTheRecentAndValid": "* Die englische Version dieses Dokuments ist die aktuellste und die englische Version hat bei allen Streitigkeiten Vorrang.",
    "Pricing_Page_Title": "Preise und Pläne",
    "Pricing_Page_Description": "Wählen Sie noch heute die Features und Funktionen, die Ihr Unternehmen benötigt. Kaufen Sie eine kommerzielle ABP-Lizenz und erstellen Sie unbegrenzt viele Projekte.",
    "Pricing_Page_HurryUp": "Beeil dich!",
    "Pricing_Page_BuyLicense": "Kaufen Sie bis zum 16. Januar eine Lizenz zum <strong>Preis von 2021</strong> !",
    "Pricing_Page_ValidForExistingCustomers": "Gilt auch für Bestandskunden und Lizenzverlängerungen.",
    "Pricing_Page_Hint1": "Im Lizenzpreis ist eine bestimmte Anzahl an Entwicklerplätzen enthalten. Wenn Sie mehr Entwickler haben, können Sie jederzeit zusätzliche Plätze erwerben.",
    "Pricing_Page_Hint2": "Sie können jetzt oder in Zukunft weitere Entwicklerlizenzen erwerben. Lizenzen sind platzbasiert, sodass Sie einen Platz von einem Entwickler auf einen anderen übertragen können.",
    "Pricing_Page_Hint3": "Mit Ihrer Lizenz können Sie eine unbegrenzte Anzahl verschiedener Produkte entwickeln.",
    "Pricing_Page_Hint4": "ABP Suite ist ein Tool, das Sie bei der Entwicklung unterstützt und Ihre Produktivität steigert. Es unterstützt das Generieren von CRUD-Seiten und das Erstellen neuer Projekte.",
    "Pricing_Page_Hint5": "Sie können alle vorgefertigten Module in Ihren Anwendungen verwenden.",
    "Pricing_Page_Hint6": "Sie können alle vorgefertigten Themen in Ihren Anwendungen verwenden.",
    "Pricing_Page_Hint7": "Eine Startvorlage ist eine Visual Studio-Lösung, die Ihnen den Start Ihres Projekts erleichtert. Alle grundlegenden Module werden für Sie hinzugefügt und vorkonfiguriert.",
    "Pricing_Page_Hint8": "Das E-Book „Mastering ABP Framework“ erklärt, wie man .NET-Lösungen mit Best Practices implementiert. Es wird auf Amazon.com verkauft und Sie können das Buch mit Ihrer Lizenz kostenlos herunterladen.",
    "Pricing_Page_Hint9": "Sie können den Quellcode jedes Moduls herunterladen. Möglicherweise möchten Sie den Quellcode zu Ihrer Lösung hinzufügen, um radikale Änderungen vorzunehmen, oder ihn aus Sicherheitsgründen einfach für sich behalten.",
    "Pricing_Page_Hint10": "Lizenzen gelten lebenslang. Das bedeutet, dass Sie Ihre Anwendung dauerhaft weiterentwickeln können. Der Zugriff auf die neueste Version und der Erhalt von Support werden innerhalb des Lizenzzeitraums gewährt (1 Jahr, sofern Sie ihn nicht verlängern).",
    "Pricing_Page_Hint11": "Keine Einsatzbeschränkungen! Sie können die Bereitstellung auf beliebig vielen Servern durchführen, einschließlich der Cloud-Dienste oder vor Ort.",
    "Pricing_Page_Hint12": "Sie können die Module, Themes und Tools innerhalb Ihres aktiven Lizenzzeitraums auf die neueste Version aktualisieren. Nachdem Ihre Lizenz abgelaufen ist, müssen Sie sie erneuern, um weiterhin Updates für Fehlerbehebungen, neue Funktionen und Verbesserungen zu erhalten.",
    "Pricing_Page_Hint13": "Sie können den Premium-Support für ein Jahr erhalten (Sie können Ihre Lizenz erneuern, um sie zu verlängern).",
    "Pricing_Page_Hint14": "Bei Team- und Business-Lizenzen ist die Anzahl der Vorfälle/Fragen begrenzt. Wenn Sie zusätzliche Entwicklerlizenzen kaufen, erhöht sich Ihr Vorfalllimit um {0} (für die Team-Lizenz) oder {1} (für die Business-Lizenz) pro Entwickler.",
    "Pricing_Page_Hint15": "Nur die Enterprise-Lizenz beinhaltet privaten Support. Sie können eine E-Mail direkt an das ABP-Team senden oder Fragen auf support.abp.io mit einer privaten Ticketoption stellen. Die Privattickets sind für die Öffentlichkeit nicht sichtbar.",
    "Pricing_Page_Hint16": "Sie können den Quellcode aller ABP-Themes herunterladen. Möglicherweise möchten Sie den Quellcode zu Ihrer Lösung hinzufügen, um radikale Änderungen vorzunehmen, oder ihn aus Sicherheitsgründen einfach für sich behalten.",
    "Pricing_Page_Testimonial_1": "ABP Commercial ermöglichte es SC Ventures, innerhalb von 9 Monaten eine bankfähige Multi-Tenant-Silo-Datenbank-SaaS-Plattform bereitzustellen, um die Debitoren-/Kreditoren-Lieferkettenfinanzierung von Rechnungen mit erheblichem Wert von mehreren integrierten Ankern zu unterstützen. Die Modularität von ABP ermöglichte es dem Team, in Rekordzeit zu liefern, alle VAPT zu bestehen und den containerisierten Microservices-Stack über vollständige CI/CD und Pipelines in der Produktion bereitzustellen.",
    "Pricing_Page_Testimonial_2": "Wir sehen den Wert der Nutzung von ABP Commercial, um den Overhead kundenspezifischer Entwicklungsprojekte zu reduzieren. Das Team ist in der Lage, das Codemuster in verschiedenen Projektströmen zu vereinheitlichen. Wir sehen in dem Framework mehr Potenzial, neue Funktionen schneller als bisher zu entwickeln. Wir vertrauen darauf, dass wir den Wert der Nutzung von ABP Commercial immer wieder erkennen werden.",
    "Pricing_Page_Testimonial_3": "Wir lieben ABP. Wir müssen nicht alles von Grund auf neu schreiben. Wir beginnen mit sofort einsatzbereiten Funktionen und konzentrieren uns nur auf das, was wir wirklich schreiben müssen. Außerdem ist ABP gut strukturiert und der Code ist von hoher Qualität und weist weniger Fehler auf. Wenn wir alles, was wir brauchten, selbst schreiben müssten, müssten wir vielleicht Jahre damit verbringen. Eine weitere Sache, die uns gefällt, ist, dass die neue Version, Problembehebung oder Verbesserung sehr bald alle zwei Wochen veröffentlicht wird. Wir warten nicht zu lange.",
    "Pricing_Page_Testimonial_4": "ABP Commercial ist ein fantastisches Produkt, das ich empfehlen kann. Kommerzielle Produkte zur Vermarktung für unsere Kunden auf einer einzigen konfigurierbaren Plattform. Die Starthilfe, die das Framework und die Tools jedem Team bieten, ist jeden Cent wert. ABP Commercial war für unsere Bedürfnisse am besten geeignet.",
    "Pricing_Page_Testimonial_5": "ABP Framework ist nicht nur ein Framework, sondern auch ein Leitfaden für die Projektentwicklung/-verwaltung, da es Schulungen zu DDD, GenericRepository, DI, Microservice und Modularität bietet. Auch wenn Sie das Framework selbst nicht nutzen, können Sie sich mit docs.abp.io selbst entwickeln, das gut und professionell vorbereitet ist (OpenIddict, Redis, Quartz etc.). Da viele Dinge vorgefertigt sind, verkürzt sich die Projektentwicklungszeit erheblich (z. B. Anmeldeseite, Ausnahmebehandlung, Datenfilterung, Seeding, Audit-Protokollierung, Lokalisierung, automatischer API-Controller usw.). Als Beispiel aus unserer Anwendung habe ich Local Event Bus zur Bestandskontrolle verwendet. Daher bin ich in der Lage, Auftragsbewegungen zu verwalten, indem ich „Stock Handler“ schreibe. Es ist wunderbar, keine Zeit für CreationTime und CreatorId zu verlieren. Sie werden automatisch gefüllt.",
    "Pricing_Page_Testimonial_6": "ABP Framework ist ein gutes Framework, aber es braucht Zeit, um die verschiedenen Ebenen, Klassen und Bibliotheken zu verstehen, die es verwendet (insbesondere ABP). Ich habe viel Zeit damit verbracht, die Codebasis zu lesen, aber ABP Commercial hat uns Zeit bei der Erstellung der Projektspezialitäten (AR) und des damit verknüpften Repositorys gespart. Mir gefiel auch der in ABP verwendete Ansatz, der sehr ausgereift ist. Wir wissen, dass es auf DDD und Monolith basiert.",
    "Pricing_Page_Testimonial_7": "Als Startup müssen wir schnell iterieren und möglichst wenig Zeit mit Standardfunktionen und nicht zum Kerngeschäft gehörenden Funktionen verbringen. \n Unsere Ingenieure reichen von sehr erfahrenen Ingenieuren bis hin zu jungen Ingenieuren, und wir brauchten ein gemeinsames Verständnis und eine Möglichkeit, technisches und domänenbezogenes Wissen auszutauschen. ABP ermöglichte uns dies aufgrund ihrer großartigen Leitfäden und Dokumentationen. \n Es gibt Dinge, über die wir uns keine Sorgen machen mussten, da sie mit ABP sofort funktionieren. \n ABP hat uns dabei geholfen, Rapid Prototyping und Entwicklung zu rationalisieren, und zwar in weniger als vier Wochen von der Einführung des Features bis zur Produktion. Mit all seinen Premium-Funktionen, die in der Lizenz enthalten sind, hat ABP uns ein „Startup in a Box“ auf der Software-Engineering-Seite gegeben.",
    "Pricing_Page_Testimonial_8": "Ich würde ABP Commercial allen empfehlen, die die Produktpalette für ihre Kunden erweitern möchten. Es ist fantastisch, wenn eine verteilte Unternehmensumgebung (Angular, WPF, Win&amp;Linux) verwendet werden muss. Zusätzlich zu ihren Produkten lieben wir ihren Support, der unsere Arbeit schneller und einfacher macht. Wir wissen bereits, dass wir einen großartigen Partner für die Zukunft gefunden haben, der uns beim Ausbau unseres Geschäfts unterstützen wird.",
    "Pricing_Page_Testimonial_9": "Wir sind ein Unternehmen mit 2 Mitarbeitern, das seit über 20 Jahren im Geschäft ist. \n Aufgrund unserer Erfahrung mit ABP Commercial wurden wir von einem Kunden angesprochen, der uns darum bat, eine neue Personalanwendung in einer modernen Umgebung zu entwickeln, um seine 25 Jahre alte Access-Anwendung zu ersetzen. Wir haben uns entschieden, von einer Desktop-Lösung auf eine webbasierte Lösung umzusteigen. \n \n Zu dieser Zeit hatten wir nur sehr geringe Kenntnisse über Webanwendungen und .NET, aber wir stießen auf ABP Commercial und konnten mit Hilfe des ABP Frameworks, der technischen Dokumentation und der ABP Suite nicht nur die Anwendung entwickeln Anforderungen des Kunden erfüllen, sondern auch innerhalb eines Jahres erfolgreich in einer .NET-Umgebung arbeiten.",
    "AbpBookDownloadArea_ClaimYourEBook": "Fordern Sie Ihr <span class='gradient-framework'>Mastering ABP Framework</span> E-Book an",
    "AddMemberModal_Warning_1": "Wenn der <strong>Benutzername,</strong> den Sie hinzufügen möchten, nicht im System vorhanden ist, bitten Sie Ihr Teammitglied, sich bei <a href='{0}/Account/Register'>{0}</a> zu registrieren und Ihnen den Benutzernamen seines Kontos mitzuteilen.",
    "MyOrganizations_Detail_WelcomeMessage": "Willkommen in Ihrer Organisation, {0}",
    "MyOrganizations_Detail_OrganizationManagement": "<span class=\"gradient-commercial\">Organisationsmanagement</span>",
    "OrganizationDisplayName": "Anzeigename der Organisation",
    "MyOrganizations_Detail_EditDisplayName": "Anzeigename bearbeiten",
    "MyOrganizations_Detail_UpgradeYourLicense": "Aktualisieren Sie Ihre Lizenz",
    "MyOrganizations_Detail_LicenseStartAndExpiryDate": "Startdatum der Lizenz – Ablaufdatum",
    "MyOrganizations_Detail_OwnerRightInfo": "Sie nutzen {0} Ihrer {1} Eigentümerrechte.",
    "MyOrganizations_Detail_CopyApiKey": "Kopieren Sie den Schlüssel",
    "MyOrganizations_Detail_ApiKeyDescription": "Der API-Schlüssel ist das Token der auf <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{1} gehosteten PRO-Pakete.</a>",
    "MyOrganizations_Detail_YourPrivateNugetSource": "Ihre private NuGet-Quelle ist <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{0}</a>",
    "MyOrganizations_Detail_PrivateNugetSourceWarning": "Dies wird automatisch als Feed zu Ihrer NuGet.Config in Ihrer ABP-Lösung hinzugefügt. Geben Sie Ihren privaten Schlüssel nicht an unbefugte Benutzer weiter!",
    "MyOrganizations_Detail_DeveloperSeatInfo": "Sie nutzen {0} Ihrer {1} Entwicklerplätze.",
    "NeedMoreSeatsForYourTeam": "Benötigen Sie mehr Sitzplätze für Ihr Team?",
    "MyOrganizations_Detail_PricePerYear": "{0} / pro Jahr",
    "MyOrganizations_Detail_PurchaseDeveloperSeats": "Erwerben Sie Entwicklerplätze",
    "Invoices": "Rechnungen",
    "RequestInvoice": "Rechnung anfordern",
    "OrderNumber": "Bestellnummer",
    "Date": "Datum",
    "Products": "Produkte",
    "TotalPrice": "Gesamtpreis",
    "ThereIsNoInvoice": "Es liegt keine Rechnung vor",
    "MyOrganizations_Detail_PaymentProviderInfo": "Wenn Sie Ihre Lizenz über das <i>{0}</i> -Gateway erworben haben, wird die PDF-Rechnung an Ihre E-Mail-Adresse gesendet, siehe <a href=\"{1}\" target=\"_blank\">{0}-Rechnung.</a>",
    "MyOrganizations_Detail_PayUInfo": "Wenn Sie über das <i>Iyzico-</i> Gateway gekauft haben, klicken Sie auf die Schaltfläche „Rechnung anfordern“ und geben Sie die Rechnungsinformationen ein.",
    "MyOrganizations_Detail_ConclusionInfo": "Ihre Rechnungsanfrage wird innerhalb von {0} Werktagen bearbeitet.",
    "ExtendYourLicense": "Verlängern Sie Ihre <span class=\"text-primary\">{0}</span> -Lizenz",
    "Continue": "Weitermachen",
    "PurchaseLicense": "Kaufe {0} Lizenz",
    "DownloadInvoiceModal_DownloadInvoice": "Download Rechnung",
    "DownloadInvoiceModal_SaveInformationOnlyOnce": "Sie können Ihre Zahlungsinformationen nur einmal speichern.",
    "InvoiceModal_EnterCompanyName": "Geben Sie Ihren Firmennamen ein...",
    "InvoiceModal_EnterCompanyAddress": "Geben Sie Ihre Firmenadresse ein...",
    "InvoiceModal_EnterTaxNumber": "Geben Sie Ihre Steuer-/Mehrwertsteuernummer ein, falls verfügbar...",
    "RequestInvoiceModal_EnterNotes": "Geben Sie Ihre zusätzliche Nachricht zu Ihrer Rechnung ein...",
    "PrePayment_PayWithIyzico": "Sie bezahlen mit Iyzico",
    "ContinueToCheckout": "Weiter zur Kasse",
    "PrePayment_IyzicoRedirectionInfo": "Sie werden zum Iyzico Payment Gateway weitergeleitet, um Ihren Kauf sicher abzuschließen.",
    "PrePayment_IyzicoAcceptVisaAndMasterCard": "Iyzico akzeptiert Visa und MasterCard.",
    "Purchase": "Kaufen",
    "AcceptTermsAndConditions": "Ich habe die <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">Datenschutzrichtlinie</a> , <a href=\"{1}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">die Allgemeinen Geschäftsbedingungen</a> und <a href=\"{2}\" target=\"_blank\" class=\"text-primary\">die EULA gelesen, verstanden und akzeptiere sie.</a>",
    "AcceptTermsAndConditionsWarningMessage": "Bitte akzeptieren Sie die Datenschutzbestimmungen und Allgemeinen Geschäftsbedingungen",
    "SelectGatewayToContinue": "Bitte wählen Sie ein Gateway aus, um fortzufahren!",
    "GatewaySelection_SelectGateway": "Wählen Sie ein Zahlungsgateway aus",
    "GatewaySelection_RedirectionMessage": "Als nächstes werden Sie für die Transaktion auf die Website des ausgewählten Zahlungsgateways weitergeleitet.",
    "PaymentSucceed_PaymentSuccessMessage": "Bezahlung erfolgreich",
    "PaymentSucceed_ThanksForPurchase": "Danke für Ihren Einkauf!",
    "PaymentSucceed_CreateYourOrganization": "Erstellen Sie Ihre Organisation",
    "PaymentSucceed_AddMeAsDeveloper": "Ich bin auch Entwickler. Fügen Sie mich als Entwickler zu meiner Organisation hinzu.",
    "PaymentSucceed_CreateOrganization": "Organisation erstellen",
    "PaymentSucceed_OrganizationDescription": "Eine Organisation besteht aus Entwicklern und Eigentümern. Die Entwickler sind Benutzer, die Code für das ABP-Projekt schreiben und von der <a href=\"{0}\" target=\"_blank\">{1}</a> -Website profitieren. Die Eigentümer sind Benutzer, die Entwicklerplätze zuweisen und die Lizenzierung verwalten.",
    "PaymentSucceed_ViewOrganization": "Klicken Sie hier, um die Organisation anzuzeigen",
    "Purchase_TotalAnnualPrice": "GESAMT <small class=\"opacity-50\">(Jahresgebühr)</small>",
    "Purchase_TrainingPrice": "Schulungspreis",
    "Purchase_OnboardingTraining": "Live-Training für Onboarding und Webanwendungsentwicklung",
    "TotalDeveloperPrice": "Gesamtentwicklerpreis",
    "Purchase_PricePerDeveloper": "<span>{0} {1}</span> pro Entwickler",
    "Purchase_IncludedDeveloperInfo": "{0} {1} enthalten.",
    "Purchase_LicenseExtraDeveloperPurchaseMessage": "Die <span class=\"fw-bold\">{0}-Lizenz</span> umfasst {1} Entwickler. Sie können weitere Entwickler hinzufügen.",
    "StartupTemplates_Page_Title": "ABP-Startvorlagen",
    "StartupTemplates_Page_Description": "Mit ABP Commercial können Sie Lösungen beliebiger Komplexität erstellen. Es bietet zwei vorgefertigte Startup-Hauptlösungen. Sie können diejenige auswählen, die Ihren Anforderungen am nächsten kommt, und darauf aufbauend Ihre eigene individuelle Lösung erstellen.",
    "MicroserviceStartupSolutionForDotnet": "Microservice-Startup-Lösung für .NET",
    "MonolithSolutionForDotnet": "Monolithische (modulare) Lösung für .NET",
    "TrainingDetailsHeaderInfo_TrainingHour": "{0} Stunde(n)",
    "Trainings_Content": "Inhalte der Ausbildung",
    "Trial_Page_StartYourFreeTrial": "Starten Sie Ihre <span class=\"gradient-commercial\">kostenlose Testversion</span>",
    "TrialLicenseFeatures": "Sie können von allen kommerziellen ABP-Funktionen profitieren",
    "TrialPeriodDays": "Sie erhalten eine Teamlizenz für {0} Tage",
    "TrialForumSupportIncident": "Sie haben {0} Forum-Supportvorfälle",
    "Contact_Page_Title": "Kontakt mit dem ABP-Entwicklungsteam",
    "Contact_Page_Description": "Kontaktieren Sie das ABP-Entwicklungsteam, wenn Sie Hilfe benötigen oder Ihre Gedanken und Meinungen mitteilen möchten! Das ABP-Supportteam steht Ihnen gerne zur Verfügung.",
    "Demo_Page_Title": "Erstellen Sie eine Demo",
    "Demo_Page_Description": "Erstellen Sie eine kostenlose Demo, um eine Beispielanwendung zu sehen, die mit der ABP Commercial-Startup-Vorlage erstellt wurde. Wiederholen Sie sich nicht bei allgemeinen Bewerbungsanforderungen.",
    "Discounted_Page_Title": "Ermäßigte Preise",
    "Discounted_Page_Description": "Wählen Sie noch heute die Features und Funktionen, die Ihr Unternehmen benötigt. Kaufen Sie eine kommerzielle ABP-Lizenz und erstellen Sie unbegrenzt viele Projekte",
    "Faq_Page_Title": "Häufig gestellte Fragen (FAQ)",
    "Faq_Page_Description": "Haben Sie irgendwelche Fragen? Suchen Sie nach häufig gestellten Fragen oder stellen Sie uns über das Kontaktformular eine Frage.",
    "Faq_Page_SwiftCode": "SWIFT-Code",
    "Faq_Page_BankName": "Bank Name",
    "Faq_Page_AccountName": "Kontoname",
    "Faq_Page_AccountNumber": "Accountnummer",
    "Faq_Page_Currency": "Währung",
    "Faq_Page_VatNumber": "Umsatzsteuer-Identifikationsnummer",
    "Faq_Page_OtherCurrenciesInfo": "Für andere Währungen siehe <a href='{0}'>alle Konten</a>",
    "ProjectCreatedSuccess_Page_Title": "Ihr Projekt wurde erstellt",
    "ProjectCreatedSuccess_Page_Description": "Ihr ABP-Projekt wurde erfolgreich erstellt!",
    "Suite_Page_Title": "ABP-Suite",
    "Suite_Page_Description": "ABP Commercial bietet schnelle Anwendungsentwicklungstools zur Steigerung der Entwicklerproduktivität. Mit der ABP Suite können Sie ganz einfach CRUD-Seiten erstellen.",
    "Themes_Page_Title": "ABP-Themen",
    "Themes_Page_Description": "ABP Commercial bietet mehrere professionelle, moderne UI-Themen. Erstellen Sie eine kostenlose Demo, um einen schnellen Überblick über die Benutzeroberfläche zu erhalten.",
    "Tools_Page_Title": "Tools für die schnelle Anwendungsentwicklung",
    "Tools_Page_Description": "ABP Commercial bietet schnelle Anwendungsentwicklungstools zur Steigerung der Entwicklerproduktivität. Mit der ABP Suite können Sie ganz einfach CRUD-Seiten erstellen.",
    "DeveloperPrice": "Entwicklerpreis",
    "AdditionalDeveloperPaymentInfoSection_AdditionalDevelopers": "{0} <small>Entwickler</small>",
    "LicenseRemainingDays": "für <span>{0}</span> Tage",
    "ExtendPaymentInfoSection_Description": "Durch die Verlängerung/Erneuerung Ihrer Lizenz erhalten Sie weiterhin <a href=\"{0}\" target=\"_blank\">Premium-Support</a> . Sie können außerdem größere oder kleinere Updates für Module und Themen erhalten. Sie können weiterhin neue Projekte erstellen. Und Sie können weiterhin <a href=\"{1}\" target=\"_blank\">die ABP Suite</a> verwenden, was Ihre Entwicklung beschleunigt.",
    "LicenseRenewalPrice": "Preis für Lizenzverlängerung",
    "LicensePrice": "Lizenzpreis",
    "TrialLicensePaymentInfoSection_Description": "<strong>Lizenz kaufen:</strong> Durch den Kauf einer Lizenz erhalten Sie weiterhin <a href=\"{0}\" target=\"_blank\" rel=\"noopener\">Premium-Support</a> . Sie können außerdem größere oder kleinere Updates für Module und Themen erhalten. Sie können weiterhin neue Projekte erstellen. Und Sie können weiterhin <a href=\"{1}\" target=\"_blank\" rel=\"noopener\">die ABP Suite</a> verwenden, was Ihre Entwicklung beschleunigt.<br> Sehen Sie sich die <a href=\"{2}\" target=\"_blank\" rel=\"noopener\">Lizenzvergleichstabelle</a> an, um die Unterschiede zwischen den Lizenztypen zu überprüfen.",
    "SelectTargetLicense": "Wählen Sie Ziellizenz aus",
    "UpgradePaymentInfoSection_ExtendMyLicenseForOneYear": "Ja, ich verlängere das Ablaufdatum meiner Lizenz um ein Jahr.",
    "UpgradePaymentInfoSection_WantToExtendLicense": "Möchten Sie Ihre Lizenz um ein weiteres Jahr verlängern?",
    "UpgradePaymentInfoSection_UpgradingWillNotExtendLicense": "Durch ein Upgrade wird das Ablaufdatum Ihrer Lizenz nicht verlängert!",
    "UpgradePaymentInfoSection_LicenseUpgradeDescription": "Durch die Aktualisierung Ihrer Lizenz werden Sie zu einem höheren Lizenztyp befördert, wodurch Sie zusätzliche Vorteile erhalten. Sehen Sie sich die <a href=\"/Pricing\" target=\"_blank\">Lizenzvergleichstabelle</a> an, um die Unterschiede zwischen den Lizenztypen zu überprüfen.",
    "Landing_Page_CustomerStories": "Kundengeschichten",
    "Landing_Page_OurGreatCustomers": "Unsere großartigen Kunden",
    "Landing_Page_WebApplicationFramework": "Webanwendungs-Framework",
    "Landing_Page_WebDevelopmentPlatform": "Webentwicklungsplattform",
    "Landing_Page_CompleteWebDevelopmentPlatform": "Komplette Webentwicklungsplattform",
    "Landing_Page_TryFreeDemo": "Probieren Sie die kostenlose Demo aus",
    "Landing_Page_StartingPointForWebApplications": "Der Ausgangspunkt für ASP.NET Core-basierte Webanwendungen! Es basiert auf dem ABP Framework für beste Webentwicklung.",
    "Landing_Page_AbpProvidesSoftwareInfrastructure": "ABP Framework bietet eine Software-Infrastruktur zur Entwicklung hervorragender Webanwendungen mit Best Practices.",
    "Landing_Page_MicroserviceCompatibleArchitecture": "Microservice-kompatible Architektur",
    "Landing_Page_PreBuiltApplicationModulesAndThemes": "Vorgefertigte Anwendungsmodule und Themen",
    "Landing_Page_MultiTenantArchitecture": "Multi-Tenant-Architektur",
    "Landing_Page_MultiTenancyDescription": "SaaS-Anwendungen leicht gemacht! Integrierte Mandantenfähigkeit von der Datenbank bis zur Benutzeroberfläche.",
    "Landing_Page_DDDIntroduction": "Entworfen und entwickelt auf der Grundlage von DDD-Mustern und -Prinzipien. Stellt ein Schichtmodell für Ihre Anwendung bereit.",
    "Landing_Page_CrossCuttingConcernsInfo": "Komplette Infrastruktur für Autorisierung, Validierung, Ausnahmebehandlung, Caching, Audit-Protokollierung, Transaktionsmanagement und mehr.",
    "Landing_Page_PreBuiltApplicationModules": "Vorgefertigte Anwendungsmodule, die die gängigsten Webanwendungsanforderungen umfassen.",
    "Landing_Page_ChatModule": "Plaudern",
    "Landing_Page_DocsModule": "Dokumente",
    "Landing_Page_FileManagementModule": "Dokumentenverwaltung",
    "Landing_Page_CustomerStory_1": "ABP Commercial ermöglichte es SC Ventures, innerhalb von 9 Monaten eine bankfähige Multi-Tenant-Silo-Datenbank-SaaS-Plattform bereitzustellen, um die Debitoren-/Kreditoren-Lieferkettenfinanzierung von Rechnungen mit erheblichem Wert von mehreren integrierten Ankern zu unterstützen. Die Modularität von ABP ermöglichte es dem Team, in Rekordzeit zu liefern, alle VAPT zu bestehen und den containerisierten Microservices-Stack über vollständige CI/CD und Pipelines in der Produktion bereitzustellen.",
    "Landing_Page_CustomerStory_2": "Wir sehen den Wert der Nutzung von ABP Commercial, um den Overhead kundenspezifischer Entwicklungsprojekte zu reduzieren. Das Team kann das Codemuster in verschiedenen Projektströmen vereinheitlichen. Wir sehen in dem Framework mehr Potenzial, neue Funktionen schneller als bisher zu entwickeln. Wir vertrauen darauf, dass wir den Wert der Nutzung von ABP Commercial immer wieder erkennen werden.",
    "Landing_Page_CustomerStory_3": "Wir lieben ABP. Wir müssen nicht alles von Grund auf neu schreiben. Wir beginnen mit sofort einsatzbereiten Funktionen und konzentrieren uns nur auf das, was wir wirklich schreiben müssen. Außerdem ist ABP gut strukturiert und der Code ist von hoher Qualität und weist weniger Fehler auf. Wenn wir alles, was wir brauchten, selbst schreiben müssten, müssten wir vielleicht Jahre damit verbringen. Eine weitere Sache, die uns gefällt, ist, dass die neue Version, Problembehebung oder Verbesserung alle zwei Wochen sehr bald veröffentlicht wird. \n . Wir warten nicht zu lange.",
    "Landing_Page_CustomerStory_4": "ABP Commercial ist ein fantastisches Produkt, das ich empfehlen kann. Kommerzielle Produkte zur Vermarktung für unsere Kunden auf einer einzigen konfigurierbaren Plattform. Die Starthilfe, die das Framework und die Tools jedem Team bieten, ist jeden Cent wert. ABP Commercial war für unsere Bedürfnisse am besten geeignet.",
    "Landing_Page_AdditionalServices": "Kundenspezifische oder Volumenlizenz, Onboarding, Live-Schulung und Support, maßgeschneiderte Projektentwicklung, Portierung bestehender Projekte und mehr ...",
    "Landing_Page_IncludedDeveloperLicenses": "Enthalten sind <strong>{0}</strong> Entwicklerlizenzen",
    "Landing_Page_SeeOnDemo": "Siehe Demo",
    "Landing_Page_LeptonThemes": "Lepton-Themen",
    "Landing_Page_AccountModuleDescription_1": "Dieses Modul implementiert das Authentifizierungssystem für eine Anwendung;",
    "Landing_Page_AccountModuleDescription_2": "Stellt eine <strong>Anmeldeseite</strong> mit dem Benutzernamen und dem Passwort bereit",
    "Landing_Page_AccountModuleDescription_3": "Bietet eine <strong>Registrierungsseite</strong> zum Erstellen eines neuen Kontos.",
    "Landing_Page_AccountModuleDescription_4": "Bietet eine Seite <strong>„Passwort vergessen“</strong> , über die Sie einen Link <strong>zum Zurücksetzen des Passworts</strong> per E-Mail senden können.",
    "Landing_Page_AccountModuleDescription_5": "Bietet <strong>E-Mail-Bestätigungsfunktionen</strong> mit Benutzeroberfläche.",
    "Landing_Page_AccountModuleDescription_6": "Implementiert <strong>Zwei-Faktor-</strong> Authentifizierung (SMS und E-Mail).",
    "Landing_Page_AccountModuleDescription_7": "Implementiert <strong>die Benutzersperre</strong> (sperrt das Konto für die festgelegte Zeitspanne, wenn innerhalb eines bestimmten Zeitraums eine bestimmte Anzahl fehlgeschlagener Anmeldungen aufgrund ungültiger Anmeldeinformationen auftritt).",
    "Landing_Page_AccountModuleDescription_8": "Implementiert die Benutzeroberfläche und Funktionalität <strong>des Identity Server-</strong> Authentifizierungsservers.",
    "Landing_Page_AccountModuleDescription_9": "Ermöglicht den <strong>Wechsel zwischen Mandanten</strong> in einer Multi-Tenant-Umgebung.",
    "Landing_Page_AccountModuleDescription_10": "Ermöglicht das Ändern der <strong>UI-Sprache</strong> der Anwendung.",
    "Landing_Page_AuditLoggingModuleDescription_1": "Dieses Modul stellt die Benutzeroberfläche für die Überwachungsprotokollberichterstattung für die Überwachungsinfrastruktur bereit. Ermöglicht das Suchen, Filtern und Anzeigen von Audit-Log-Einträgen und Entitätsänderungsprotokollen.",
    "Landing_Page_AuditLoggingModuleDescription_2": "Ein Audit-Log-Eintrag besteht aus kritischen Daten zu jeder Client-Anfrage:",
    "Landing_Page_AuditLoggingModuleDescription_3": "URL, Browser, IP-Adresse, Clientname",
    "Landing_Page_AuditLoggingModuleDescription_4": "Der Benutzer",
    "Landing_Page_AuditLoggingModuleDescription_5": "HTTP-Methode, HTTP-Rückgabestatuscode",
    "Landing_Page_AuditLoggingModuleDescription_6": "Erfolg/Fehler, Ausnahmedetails, falls verfügbar",
    "Landing_Page_AuditLoggingModuleDescription_7": "Dauer der Anforderungsausführung",
    "Landing_Page_AuditLoggingModuleDescription_8": "Die Entitäten wurden in dieser Anfrage erstellt, gelöscht oder aktualisiert (mit geänderten Eigenschaften).",
    "Landing_Page_BloggingModuleDescription_1": "Dieses Modul fügt Ihrer ABP-Anwendung einen einfachen Blog hinzu;",
    "Landing_Page_BloggingModuleDescription_2": "Ermöglicht die Erstellung mehrerer Blogs in einer einzigen Anwendung.",
    "Landing_Page_BloggingModuleDescription_3": "Unterstützt das Markdown-Format.",
    "Landing_Page_BloggingModuleDescription_4": "Ermöglicht das Schreiben eines Kommentars zu einem Beitrag.",
    "Landing_Page_BloggingModuleDescription_5": "Ermöglicht das Zuweisen von Tags zu den Blogbeiträgen.",
    "Landing_Page_BloggingModuleDescription_6": "Sehen Sie sich die Website <a href=\"blog.abp.io\">blog.abp.io</a> als Live-Beispiel des Blogging-Moduls an.",
    "Landing_Page_ChatModuleDescription_1": "Dieses Modul wird für Echtzeitnachrichten zwischen Benutzern in der Anwendung verwendet.",
    "Landing_Page_ChatModuleDescription_2": "Echtzeit-Nachrichten auf der Chat-Seite.",
    "Landing_Page_ChatModuleDescription_3": "Durchsuchen Sie Benutzer in der Anwendung nach neuen Konversationen.",
    "Landing_Page_ChatModuleDescription_4": "Kontaktliste für aktuelle Gespräche.",
    "Landing_Page_ChatModuleDescription_5": "Benachrichtigungen über neue Nachrichten, wenn der Benutzer eine andere Seite ansieht.",
    "Landing_Page_ChatModuleDescription_6": "Abzeichen für die Gesamtanzahl ungelesener Nachrichten auf dem Menüsymbol.",
    "Landing_Page_ChatModuleDescription_7": "Anzahl ungelesener Nachrichten für jede Konversation.",
    "Landing_Page_ChatModuleDescription_8": "Faul geladene Gespräche.",
    "Landing_Page_DocsModuleDescription_1": "Dieses Modul wird zum Erstellen von Websites zur technischen Dokumentation verwendet;",
    "Landing_Page_DocsModuleDescription_2": "Integrierte <strong>GitHub-Integration</strong> : Schreiben und verwalten Sie Dokumente direkt auf GitHub.",
    "Landing_Page_DocsModuleDescription_3": "<strong>Versionierungsunterstützung</strong> direkt in GitHub-Releases integriert.",
    "Landing_Page_DocsModuleDescription_4": "Unterstützt <strong>mehrere Sprachen</strong> (mit Fallback-Unterstützung auf die Standardsprache).",
    "Landing_Page_DocsModuleDescription_5": "Unterstützt die Formate <strong>Markdown</strong> und HTML.",
    "Landing_Page_DocsModuleDescription_6": "Bietet eine <strong>Navigation</strong> und einen <strong>Gliederungsabschnitt</strong> .",
    "Landing_Page_DocsModuleDescription_7": "Ermöglicht das Hosten <strong>mehrerer</strong> Projektdokumentationen in einer einzigen Anwendung.",
    "Landing_Page_DocsModuleDescription_8": "Links zur Datei auf GitHub, sodass jeder problemlos einen Beitrag leisten kann, indem er auf den <strong>Link „Bearbeiten“</strong> klickt.",
    "Landing_Page_DocsModuleDescription_9": "Ermöglicht zusätzlich zur GitHub-Quelle die einfache Verwendung eines Ordners als Dokumentationsquelle.",
    "Landing_Page_FileManagementModuleDescription_1": "Laden Sie Dateien hoch, laden Sie sie herunter und organisieren Sie sie in einer hierarchischen Ordnerstruktur.",
    "Landing_Page_FileManagementModuleDescription_2": "Dieses Modul dient zum Hochladen, Herunterladen und Organisieren von Dateien in einer hierarchischen Ordnerstruktur. Es ist auch mit der Mehrmandantenfähigkeit kompatibel und Sie können die Gesamtgrößenbeschränkung für Ihre Mandanten festlegen.",
    "Landing_Page_FileManagementModuleDescription_3": "Dieses Modul basiert auf dem <a href=\"https://docs.abp.io/en/abp/latest/Blob-Storing\">BLOB-Speichersystem</a> und kann daher verschiedene Speicheranbieter zum Speichern der Dateiinhalte nutzen.",
    "Landing_Page_IdentityModuleDescription_1": "Dieses Modul implementiert das Benutzer- und Rollensystem einer Anwendung;",
    "Landing_Page_IdentityModuleDescription_2": "Basierend auf der <a href=\"https://docs.microsoft.com/en-us/aspnet/core/security/authentication/identity\">ASP.NET Core Identity-Bibliothek von Microsoft</a> .",
    "Landing_Page_IdentityModuleDescription_3": "Verwalten Sie <strong>Rollen</strong> und <strong>Benutzer</strong> im System. Ein Benutzer darf <strong>mehrere Rollen</strong> haben.",
    "Landing_Page_IdentityModuleDescription_4": "Legen Sie <strong>Berechtigungen</strong> auf Rollen- und Benutzerebene fest.",
    "Landing_Page_IdentityModuleDescription_5": "Aktivieren/deaktivieren Sie <strong>die Zwei-Faktor-Authentifizierung</strong> und <strong>die Benutzersperre</strong> pro Benutzer.",
    "Landing_Page_IdentityModuleDescription_6": "Verwalten Sie das grundlegende <strong>Benutzerprofil</strong> und <strong>das Passwort</strong> .",
    "Landing_Page_IdentityModuleDescription_7": "Verwalten Sie <strong>Anspruchstypen</strong> im System, legen Sie Ansprüche auf Rollen und Benutzer fest.",
    "Landing_Page_IdentityModuleDescription_8": "Einstellungsseite zum Verwalten <strong>der Passwortkomplexität</strong> , Benutzeranmeldung, Konto und Sperrung.",
    "Landing_Page_IdentityModuleDescription_9": "Unterstützt <strong>LDAP-</strong> Authentifizierung.",
    "Landing_Page_IdentityModuleDescription_10": "Bietet <strong>E-Mail- und Telefonnummernüberprüfung</strong> .",
    "Landing_Page_IdentityModuleDescription_11": "Unterstützt soziale Login-Integrationen (Twitter, Facebook, GitHub usw.).",
    "Landing_Page_IdentityModuleDescription_12": "<strong>Organisationseinheiten</strong> im System verwalten.",
    "Landing_Page_PaymentModuleDescription_1": "Bietet Integration für verschiedene Zahlungsgateways.",
    "Landing_Page_PaymentModuleDescription_2": "Dieses Modul bietet die Integration für Zahlungsgateways, sodass Sie problemlos Zahlungen von Ihren Kunden erhalten können.",
    "Landing_Page_PaymentModuleDescription_3": "Dieses Modul unterstützt die folgenden Zahlungsgateways",
    "Welcome_Page_UseSameCredentialForCommercialWebsites": "Verwenden Sie für <a href=\"https://commercial.abp.io\" class=\"text-primary\">Commercial.abp.io</a> und <a href=\"https://support.abp.io\" class=\"text-primary\">Support.abp.io</a> dieselben Anmeldeinformationen.",
    "WatchCrudPagesVideo": "Sehen Sie sich das Video „CRUD-Seiten mit ABP Suite erstellen“ an!",
    "WatchGeneratingFromDatabaseVideo": "Sehen Sie sich das Video „ABP Suite: Generieren von CRUD-Seiten aus vorhandenen Datenbanktabellen“ an!",
    "WatchTakeCloserLookVideo": "Sehen Sie sich das Video „Werfen Sie einen genaueren Blick auf die Codegenerierung: ABP Suite“ an!",
    "ConfirmedEmailAddressRequiredToStartTrial": "Sie sollten über eine bestätigte E-Mail-Adresse verfügen, um eine Testlizenz starten zu können.",
    "EmailVerificationMailNotSent": "E-Mail-Bestätigungsmail konnte nicht gesendet werden.",
    "GetConfirmationEmail": "<a href=\"javascript:void(0);\" id=\"{0}\" class=\"text-decoration-underline\">Klicken Sie hier, um eine Bestätigungs-E-Mail zu erhalten,</a> falls Sie diese noch nicht erhalten haben.",
    "WhichLicenseTypeYouAreInterestedIn": "Für welchen Lizenztyp interessieren Sie sich?",
    "DontTakeOurWordForIt": "Glauben Sie uns nicht beim Wort...",
    "ReadAbpCommercialUsersWantYouToKnow": "Lesen Sie, was ABP Commercial-Benutzer Sie wissen lassen möchten",
    "Testimonial_ShortDescription_1": "Die Modularität von ABP ermöglichte es dem Team, pünktlich zu liefern.",
    "Testimonial_ShortDescription_2": "Erstellen Sie neue Funktionen schneller als je zuvor.",
    "Testimonial_ShortDescription_3": "Wir beginnen mit sofort einsatzbereiten Funktionen und konzentrieren uns nur auf das, was wir wirklich schreiben müssen.",
    "Testimonial_ShortDescription_4": "ABP Commercial war für unsere Bedürfnisse am besten geeignet.",
    "OnlineReviewersOnAbpCommercial": "Online-Rezensionen zu ABP Commercial",
    "SeeWhatToldAboutAbpCommercial": "Sehen Sie, was über ABP Commercial gesagt wurde, und schreiben Sie Ihre Gedanken, wenn Sie möchten.",
    "BlazoriseLicense": "Müssen wir eine Blazorise-Lizenz kaufen?",
    "BlazoriseLicenseExplanation": "Wir haben eine Vereinbarung zwischen Volosoft und Megabit. Durch diese Vereinbarung wird die Blazorise-Lizenz mit ABP Commercial-Produkten gebündelt, sodass unsere Kunden keine zusätzliche Blazorise-Lizenz erwerben müssen.",
    "ExtendPaymentInfoSection_DeveloperPrice": "{0}x zusätzliche Entwickler",
    "ExtendPaymentInfoSection_DiscountRate": "Rabatt {0}%",
    "TotalNetPrice": "Gesamtnettopreis",
    "EFCore": "Entity Framework Core",
    "All": "Alle",
    "Mvc": "MVC",
    "DataBaseProvider": "Datenanbieter",
    "UIFramework": "UI-Framework",
    "LeptonXThemeForDashboard": "LeptonX-Theme für Ihr Admin-Dashboard von",
    "AbpPlatform": "ABP-Plattform",
    "YouDeserveGoodUXUI": "Sie verdienen eine gute Benutzeroberfläche und eine bessere UX. Das LeptonX Theme von ABP ist dafür da.",
    "ViewLiveDemo": "Live-Theme-Demo ansehen",
    "GetLeptonX": "Holen Sie sich jetzt LeptonX",
    "SeeLeptonXDocumentation": "Siehe LeptonX-Dokumentation",
    "SeeLeptonDocumentation": "Siehe Lepton-Dokumentation",
    "SimplifiedMenu": "Vereinfachtes Menü",
    "SimplifiedMenuDescription": "Sie können die gesuchte Seite ganz einfach finden, indem Sie das Menü filtern",
    "YourFavoritePages": "Ihre Lieblingsseiten in Ihrer Reichweite",
    "YourFavoritePagesDescription": "Fügen Sie die Seite ganz einfach zu den Favoriten hinzu oder entfernen Sie sie daraus, indem Sie auf das Sternsymbol in der oberen rechten Ecke der Seite klicken.",
    "BreadCrumbs": "Breadcrumb für nahtlosen Wechsel",
    "BreadCrumbsDescription": "Mit Breadcrumb können Sie mit einem Klick zu den Seiten auf derselben Ebene wechseln, auch wenn das linke Menü geschlossen ist, und es funktioniert auf Tablets und Mobilgeräten responsiv!",
    "YourMenu": "Ihr Menü ganz nach Ihren Wünschen",
    "YourMenuDescription": "Passen Sie die direkt anklickbaren Icons und Dropdown-Boxen im Benutzermenü nach Ihren Wünschen an. Das Benutzermenü ist vollständig an Ihre Bedürfnisse anpassbar",
    "RtlSupport": "RTL-Unterstützung für Ihre Sprache",
    "RtlSupportDescription": "Das LeptonX Theme unterstützt RTL für Ihre Sprache. Die Sprachoptionen befinden sich im Einstellungsmenü, sodass Sie die Sprache ändern können.",
    "YourColors": "Ihre Farben auf der Benutzeroberfläche Ihres Admin-Dashboards",
    "YourColorsDescription": "Das LeptonX-Design richtet sich nach Ihren Systemeinstellungen und verfügt über Optionen für ein helles Dashboard-Design, ein dunkles Dashboard-Design und ein halbdunkles Dashboard-Design.",
    "ArrangeContentWidth": "Ordnen Sie ganz einfach die Breite Ihres Inhalts an",
    "ArrangeContentWidthDescription": "Ändern Sie ganz einfach die Breite Ihres Inhaltsbereichs.",
    "LeptonXCompatibleWith": "LeptonX Theme ist kompatibel mit",
    "MobileResponsiveTemplate": "Mobile Responsive-Vorlage",
    "MobileResponsiveTemplateDescription1": "Greifen Sie von jedem beliebigen Gerät aus auf Ihr LeptonX-Admin-Dashboard zu.",
    "MobileResponsiveTemplateDescription2": "Es ist so konzipiert, dass Sie es problemlos in jedem Ihrer Geräte verwenden können. Es reagiert auf Mobilgeräte und Tablet-Größen.",
    "TopMenuLayoutOption": "Top-Menü-Layout-Option",
    "TopMenuLayoutOptionDescription1": "Wenn Sie Ihre Website mit demselben Admin-Dashboard einrichten möchten, ist dies mit LeptonX Theme möglich!",
    "TopMenuLayoutOptionDescription2": "Probieren Sie einfach das obere Menülayout von LeptonX aus, um es zu verwirklichen!",
    "EasilyCustomizable": "Leicht anpassbar an die Farben Ihrer Marke",
    "EasilyCustomizableDescription1": "Sie können das LeptonX-Theme mit nur wenigen SCSS-Variablen anpassen. Kein Überschreiben, keine zusätzliche CSS-Last!",
    "EasilyCustomizableDescription2": "Mit LeptonX können Sie Ihr Admin-Dashboard nach Ihren Wünschen gestalten.",
    "IndependentLayout": "Unabhängiger Layout- und Inhaltsbereich",
    "IndependentLayoutDescription1": "Die Layout-Infrastruktur von LeptonX wurde völlig unabhängig vom Inhalt entwickelt.",
    "IndependentLayoutDescription2": "Dies bedeutet, dass Sie Ihr Projekt bei Bedarf mit einer anderen Inhaltsstruktur als Bootstrap frei gestalten können.",
    "MostUsedLibraries": "Die am häufigsten verwendeten Bibliotheken sind in LeptonX integriert",
    "MostUsedLibrariesDescription1": "LeptonX enthält Ihre am häufigsten verwendeten Bibliotheken. Es ermöglicht Ihnen die mühelose Nutzung von Bibliotheken wie ApexCharts, DataTables, DropZone, FullCalender, JSTree, Select2 und Toastr.",
    "MostUsedLibrariesDescription2": "LeptonX unterstützt auch MVC Angular- und Blazor-spezifische Bibliotheken.",
    "CreateAndCustomize": "Erstellen und passen Sie die Seiten, die Sie benötigen, in Sekundenschnelle mit den benutzerdefinierten LeptonX-Seiten an",
    "CreateAndCustomizeDescription": "Durch die Verwendung des LeptonX-Themes haben Sie auch Zugriff auf viele vorgefertigte HTML-Seiten. Dazu gehören viele Seiten wie Anmeldeseite, Blog, FAQ, Abonnementliste, Rechnung, Preise und Dateiverwaltung.",
    "LeptonThemeForAdmin": "Lepton Theme für Ihr Admin-Dashboard von",
    "LeptonThemeForAdminDescription": "Das Lepton-Theme ist weiterhin verfügbar und wird beibehalten. Wenn Sie als Lepton Theme-Benutzer zum LeptonX Theme wechseln möchten, können Sie sich die Dokumentation ansehen, um zu erfahren, wie das geht.",
    "LeptonCompatibleWith": "Lepton Theme ist kompatibel mit",
    "BlackFridayDiscount": "Black Friday Rabatt",
    "UpgradePaymentInfoSection_DeveloperPrice": "{0} für {1} zusätzliche Entwickler",
    "Upgrade": "Aktualisierung",
    "Renewal": "Erneuerung",
    "UpgradePaymentInfoSection_LicensePrice": "{0}-Lizenz",
    "UpgradePaymentInfoSection_LicenseRenewalPrice": "Lizenz Erneuerung",
    "Total": "Gesamt",
    "SupportPolicyFaqTitle": "Wie lauten Ihre Supportrichtlinien?",
    "SupportPolicyFaqExplanation": "Wir unterstützen nur die aktive und die vorherige Hauptversion. Wir garantieren keine Patch-Veröffentlichung für die 3. und ältere Hauptversionen. Wenn die aktive Version beispielsweise 7.0.0 ist, veröffentlichen wir Patch-Releases sowohl für 6.xx als auch für 7.xx. Außerdem bieten wir Support nur für Probleme im Zusammenhang mit ABP Framework und ABP Commercial. Das bedeutet, dass für die von ABP-Produkten verwendeten Drittanbieteranwendungen, Cloud-Dienste und andere Peripheriebibliotheken kein Support gewährt wird. Wir werden wirtschaftlich angemessene Anstrengungen unternehmen, um unseren Kunden während der offiziellen Geschäftszeiten von „Volosoft Bilisim AS“ technischen Support zu bieten. Andererseits verpflichten wir uns nicht zu einer Service-Level-Agreement (SLA)-Reaktionszeit, sondern werden versuchen, innerhalb unserer offiziellen Arbeitszeiten so schnell wie möglich auf technische Probleme zu reagieren. Sofern keine besondere Vereinbarung mit dem Kunden getroffen wird, leisten wir Support ausschließlich unter https://support.abp.io. Wir bieten auch privaten E-Mail-Support an, der nur Inhabern einer Enterprise-Lizenz zur Verfügung steht.",
    "TotalDevelopers": "Insgesamt {0} Entwickler(n)",
    "CustomPurchaseExplanation": "Auf Ihre spezifischen Bedürfnisse zugeschnitten",
    "WhereDidYouHearAboutUs": "Wo haben Sie von uns gehört?",
    "Twitter": "Twitter",
    "Facebook": "Facebook",
    "Youtube": "Youtube",
    "Google": "Google",
    "Github": "GitHub",
    "Friend": "Von einem Freund",
    "Other": "Andere",
    "WhereDidYouHearAboutUs_explain": "Geben Sie an ...",
    "DeletingMemberWarningMessage": "„{0}“ wird aus der Entwicklerliste entfernt. Wenn Sie möchten, können Sie diesen freien Platz später einem anderen Entwickler zuweisen.",
    "AdditionalInfo": "Sollten die Entwicklerplätze über Ihrem Bedarf liegen, können Sie diese reduzieren. Sie können eine E-Mail an <a href=\"mailto:info@abp.io\">info@abp.io</a> senden, um einige Ihrer Entwicklerplätze zu entfernen. Durch die Freigabe ungenutzter Entwicklerplätze werden die Kosten für die Lizenzverlängerung gesenkt. Wenn Sie möchten, können Sie innerhalb Ihres aktiven Lizenzzeitraums zusätzliche Entwicklerplätze erneut erwerben. Beachten Sie, dass Sie diese Anzahl nicht reduzieren können, da dieses Lizenzpaket {0} Entwickler enthält.",
    "LinkExpiredErrorMessage": "Der Link, auf den Sie zugreifen möchten, ist abgelaufen.",
    "ExpirationDate": "Verfallsdatum",
    "SpringCampaignDiscount": "Rabatt auf die Frühjahrskampagne",
    "WhyUseAbpIoPlatform": "Warum sollte ich die ABP.IO-Plattform nutzen, anstatt eine neue Lösung von Grund auf zu erstellen?",
    "WhyUseAbpIoPlatformFaqExplanation": "Auf <a href=\"/why-abp-io \">dieser Seite</a> finden Sie eine ausführliche Erklärung, warum die Verwendung der ABP.IO-Plattform einen erheblichen Vorteil gegenüber der Selbsterledigung bietet.",
    "EulaPageTitle": "Endbenutzer-Lizenzvereinbarung (EULA)",
    "PrivacyPolicyPageTitle": "Datenschutzrichtlinie – Cookie-Richtlinie",
    "TermsConditionsPageTitle": "Geschäftsbedingungen",
    "TrainingsPageTitle": "ABP-Schulungspakete",
    "ModulesPageTitle": "Vorgefertigte ABP-Anwendungsmodule",
    "Volo.AbpIo.Commercial:040001": "Der API-Zugriffsschlüssel ist falsch.",
    "GetLepton": "Holen Sie sich jetzt Lepton",
    "MyOrganizations_Detail_LicenseStartDate": "Startdatum der Lizenz",
    "MyOrganizations_Detail_LicenseExpiryDate": "Verfallsdatum",
    "BlazoriseSupport": "Wie erhalte ich den Blazorise-Lizenzschlüssel und Support vom Blazorise-Team?",
    "BlazoriseSupportExplanation": "Befolgen Sie die folgenden Schritte, um Unterstützung vom Blazorise-Team zu erhalten und Ihren Blazorise-Lizenzschlüssel zu erhalten:",
    "BlazoriseSupportExplanation1": "Eröffnen Sie ein neues Konto unter <a href=\"https://blazorise.com/support/register\">blazorise.com/support/register</a> mit derselben E-Mail-Adresse wie Ihr abp.io-Konto. Lassen Sie den Eintrag „Lizenzschlüssel“ leer. <strong>Es muss dieselbe E-Mail-Adresse sein wie Ihr E-Mail-Konto auf abp.io.</strong>",
    "BlazoriseSupportExplanation2": "Überprüfen Sie Ihre E-Mail-Adresse, indem Sie Ihr E-Mail-Postfach aktivieren. Überprüfen Sie Ihr Spam-Postfach, wenn Sie keine E-Mail in Ihrem Posteingang sehen!",
    "BlazoriseSupportExplanation3": "Melden Sie sich auf der Blazorise-Support-Website unter <a href=\"https://blazorise.com/support/login\">blazorise.com/support/login</a> an.",
    "BlazoriseSupportExplanation4": "Wenn Sie über eine aktive kommerzielle ABP-Lizenz verfügen, verfügen Sie auch über eine Blazorise PRO-Lizenz. Sie können Ihren Blazorise-Lizenzschlüssel unter <a href=\"https://blazorise.com/support/user/manage/license\">blazorise.com/support/user/manage/license</a> erhalten.",
    "BlazoriseSupportExplanation5": "Sie können Ihre Fragen auf der Support-Website posten und ein Produkt-Token für Ihre Anwendung generieren.",
    "AbpLiveTrainingPackages": "ABP Live-Schulungspakete",
    "Releases": "Veröffentlichungen",
    "ReleasesDescription": "Veröffentlichungsprotokolle von ABP Commercial.",
    "ReleaseDate": "Veröffentlichungsdatum",
    "Labels": "Etiketten",
    "PreRelease": "Vorabversion",
    "AllTypes": "Alle Arten",
    "Enhancement": "Erweiterung",
    "Bug": "Insekt",
    "Feature": "Besonderheit",
    "AllUIs": "Alle Benutzeroberflächen",
    "MVC": "MVC",
    "BlazorServer": "Blazor-Server",
    "MAUI": "MAUI",
    "HowItWorks_Page_Title": "Wie es funktioniert?",
    "HowItWorks_Page_Description": "ABP Framework erweitert die .NET-Plattform. Alles, was Sie mit einer einfachen .NET-Lösung tun können, ist also bereits mit dem ABP Framework möglich. Das erleichtert den Einstieg mit einer geringen Lernkurve.",
    "HowItWorks_Description1": "ABP Framework erweitert die .NET-Plattform. Alles, was Sie mit einer einfachen .NET-Lösung tun können, ist also bereits mit dem ABP Framework möglich. Das erleichtert den Einstieg mit einer geringen Lernkurve.",
    "HowItWorks_Description2": "Sobald Sie mit dem Erlernen und Nutzen der ABP-Framework-Funktionen beginnen, wird die Entwicklung Ihrer Software viel mehr Spaß machen als je zuvor.",
    "HowItWorks_Description3": "Auf dieser Seite wird im Wesentlichen erläutert, wie Sie als .NET-Entwickler die ABP.IO-Plattform verwenden.",
    "CreateANewSolution": "Erstellen Sie eine neue .NET-Lösung",
    "CreateANewSolution_Description1": "Alles beginnt mit der Erstellung einer neuen ABP-integrierten .NET-Lösung.",
    "StartWithStartupTemplates": "Starten Sie eine der vorgefertigten <a href=\"/startup-templates\">Startup-Lösungsvorlagen</a>",
    "SimpleMonolithApplicationTemplate": "Einfache Monolith-Anwendungsvorlage",
    "LayeredApplicationTemplate": "Mehrschichtige Anwendungsvorlage",
    "MicroserviceSolutionTemplate": "Microservice-Lösungsvorlage",
    "CreateEmptySolutionAndUseAbp": "Oder erstellen Sie eine neue leere .NET-Lösung und installieren Sie ABP NuGet- und NPM <a href=\"https://abp.io/packages\" target=\"_blank\">-Pakete</a> selbst.",
    "CreatingSolutionWithMultipleOptions": "Beim Erstellen einer neuen Lösung stehen mehrere Benutzeroberflächen- und Datenbankoptionen zur Verfügung.",
    "UIFrameworkOptions": "UI-Framework-Optionen",
    "DotnetSolutionWithoutDependency": "Jetzt verfügen Sie über eine reguläre .NET-Lösung auf Ihrem lokalen Computer, die nicht von einer Cloud-Plattform oder einem externen Dienst abhängig ist.",
    "CheckTheDocumentForDetails": "Einzelheiten finden Sie im Dokument <a href=\"{0}\" target=\"_blank\">{1}</a> .",
    "UIAndDatabaseIndependent": "ABP kann mit jeder Benutzeroberfläche und jedem Datenbankanbieter arbeiten, der von .NET unterstützt wird. \n Diese UI- und Datenbankanbieter sind jedoch vorintegriert und gut dokumentiert.",
    "InstallAbpModules": "Installieren Sie ABP-Module",
    "DevelopYourSolution": "Entwickeln Sie Ihre Lösung",
    "DeployAnywhere": "Überall einsetzbar",
    "InstallAbpModule_Description1": "ABP ist ein modulares Anwendungsentwicklungs-Framework. In den Startup-Lösungsvorlagen sind die wesentlichen Module bereits installiert. \n Es gibt jedoch noch weitere Anwendungsmodule, die Sie möglicherweise in Ihrer Lösung verwenden möchten.",
    "InstallAbpModule_Description2": "Jedes Modul besteht aus einigen NuGet- und NPM-Paketen und verfügt über ein Installationsdokument. <a href=\"/tools/suite\">ABP Suite</a> erledigt den Großteil der Arbeit automatisch. Anschließend konfigurieren oder optimieren Sie das Modul manuell anhand der Dokumentation.",
    "DevelopYourSolution_Description1": "Mit der Infrastruktur von ABP können Sie <b class=\"text-white\">sich auf Ihren eigenen Geschäftscode konzentrieren</b> , indem Sie sich wiederholende Arbeiten automatisieren und vorgefertigte Infrastruktur- und <a href=\"https://abp.io/features\" target=\"_blank\">Anwendungsfunktionen</a> bereitstellen.",
    "DevelopYourSolution_Description2": "Im folgenden Codeblock können Sie sehen, wie sich das ABP Framework nahtlos in Ihren Code integriert und die sich wiederholenden Aufgaben für Sie automatisiert.",
    "DevelopYourSolution_Description3": "Selbst in diesem Shortcode-Block erledigt ABP viele Dinge für Sie.",
    "DevelopYourSolution_Description4": "Es stellt Basisklassen zum Anwenden von Konventionen wie \n <a href=\"https://docs.abp.io/en/abp/latest/Dependency-Injection\" target=\"_blank\">Dependency Injection</a> bereit. Generische \n <a href=\"https://docs.abp.io/en/abp/latest/Repositories\" target=\"_blank\">Repository-</a> Dienste bieten eine praktische \n Möglichkeit zur Interaktion mit der Datenbank. Die deklarative \n <a href=\"https://docs.abp.io/en/abp/latest/Authorization\" target=\"_blank\">Autorisierung</a> funktioniert mit einem fein abgestimmten Berechtigungssystem.",
    "DevelopYourSolution_Description5": "ABP automatisiert \n <a href=\"https://docs.abp.io/en/abp/latest/Unit-Of-Work\" target=\"_blank\">Arbeitseinheit</a> (für Datenbankverbindung und Transaktionsverwaltung), \n <a href=\"https://docs.abp.io/en/abp/latest/Exception-Handling\" target=\"_blank\">Ausnahmebehandlung</a> , \n \n <a href=\"https://docs.abp.io/en/abp/latest/Validation\" target=\"_blank\">Validierung</a> und <a href=\"https://docs.abp.io/en/abp/latest/Audit-Logging\" target=\"_blank\">die Audit-Protokollierung</a> vollständig. Es bietet viele weitere Bausteine, um Ihre täglichen Entwicklungsaufgaben zu vereinfachen und sich beim Erstellen produktionsbereiter \n Anwendungen auf Ihren eigenen Code zu konzentrieren.",
    "DevelopYourSolution_Description6": "Sie können sich vorstellen, wie lang und kompliziert dieser Codeblock sein kann, wenn Sie alles manuell erledigen würden.",
    "SuiteCrudGenerationInFewSeconds": "Zusätzlich zur manuellen Codierung Ihrer Lösung können Sie mit den ABP Suite-Tools in wenigen Minuten voll funktionsfähige, erweiterte CRUD-Seiten erstellen. Es generiert den Code in Ihrer Lösung, sodass Sie ihn entsprechend Ihren individuellen Anforderungen optimieren können.",
    "DeployAnywhere_Description1": "Am Ende des Tages haben Sie eine reine .NET-Lösung. Sie können Ihre Lösung auf Ihrem eigenen Server, auf einer Cloud-Plattform, auf Kubernetes oder an einem beliebigen Ort bereitstellen. Sie können die Bereitstellung auf so vielen Servern durchführen, wie Sie möchten. ABP ist ein von der Bereitstellungsumgebung unabhängiges Tool.",
    "ExpertiseAbpFramework": "Lernen Sie das ABP-Framework kennen",
    "ExpertiseAbpFramework_Description1": "Möchten Sie über die Grundlagen hinausgehen und sich Fachwissen über die ABP.IO-Plattform aneignen?",
    "FreeDownload": "Kostenfreier Download",
    "Read": "Lesen",
    "HavingTrouble": "Probleme haben?",
    "HavingTrouble_Description1": "Haben Sie Probleme bei der Entwicklung Ihrer Lösung? Wir sind hier! Nutzen Sie die ABP-Supportplattform \n oder senden Sie eine E-Mail, um Hilfe direkt von den Mitgliedern des Core ABP Framework-Teams zu erhalten.",
    "WeAreHereToHelp_Description1": "Sie können unsere Hilfethemen durchsuchen oder in den häufig gestellten Fragen \n suchen oder uns eine Frage stellen, indem Sie das Kontaktformular verwenden.",
    "OtherModules": "Andere Module",
    "OtherModules_Description1": "Konto, Audit-Protokollierung, Chat, CMS-Kit, Dateiverwaltung, Formulare, DSGVO, Identität, Sprachverwaltung, Zahlung, Saas und mehr ...",
    "HowItWorks_DatabaseProviderOptions": "Optionen für Datenbankanbieter",
    "SeeFAQ": "Siehe FAQ",
    "ReleaseLogs": "Release-Protokolle",
    "ReleaseLogs_Tag": "{0} Veröffentlichungsprotokolle",
    "ReleaseLogs_Pr": "Pull-Anfrage #{0} – {1}",
    "NoLabels": "Keine Etiketten",
    "DoesTheSubscriptionRenewAutomatically": "Verlängert sich das Abonnement automatisch?",
    "DoesTheSubscriptionRenewAutomaticallyExplanation": "Der ABP Commercial verfügt nicht über ein Abrechnungsmodell mit automatischer Verlängerung. Daher <strong>wird Ihr Abonnement am Ende Ihres Lizenzzeitraums nicht automatisch verlängert</strong> . Wenn Sie weiterhin die Vorteile von ABP Commercial nutzen möchten, müssen Sie es manuell auf der <a href=\"/my-organizations\">Organisationsverwaltungsseite</a> verlängern. Wenn Sie mehrere Organisationen haben, klicken Sie bei Ihrer auslaufenden Organisation auf die Schaltfläche „Verwalten“ und dann auf die Schaltfläche „Jetzt verlängern“, um Ihre Lizenz zu erneuern. Vielleicht möchten Sie auch einen Blick auf <a href=\"/faq#what-happens-when-license-ends\">„Was passiert, wenn meine Lizenz endet?“</a> werfen. Abschnitt.",
    "ExtraQuestionCreditsFaqTitle": "Kann ich zusätzliche Gutschriften für Supportfragen erwerben?",
    "ExtraQuestionCreditsFaqExplanation": "Ja, du kannst. Um zusätzliche Frageguthaben zu erwerben, senden Sie eine E-Mail mit dem Namen Ihrer Organisation an <a href=\"mailto:info@abp.io\">info@abp.io</a> . Hier ist die Preisliste für die zusätzlichen Fragen-Credits:<ul><li> 50 Fragen kosten 999 $</li><li> 25 Fragen kosten 625 $</li><li> 15 Fragen kosten 450 $</li></ul>",
    "AlreadyBetaTester": "Sie sind bereits dem Betatester-Programm beigetreten.",
    "AbpStudio": "ABP Studio",
    "AbpStudio_Description": "ABP Studio befindet sich noch in der Entwicklung. Sie können das untenstehende Formular ausfüllen, um einer der ersten Benutzer zu sein.",
    "AbpStudio_Description1": "ABP Studio ist eine <span class=\"text-highlight-white\">plattformübergreifende Desktop-Anwendung</span> für ABP-Entwickler.",
    "AbpStudio_Description2": "Es ist <span class=\"text-highlight-white\">gut in das ABP-Framework integriert</span> und zielt darauf ab, Ihnen eine komfortable Entwicklungsumgebung zu bieten, indem <span class=\"text-highlight-white\">es Dinge automatisiert, Erkenntnisse über Ihre Lösung liefert</span> und <span class=\"text-highlight-white\">die Entwicklung, Ausführung</span> und <span class=\"text-highlight-white\">Bereitstellung</span> Ihrer Lösungen erheblich vereinfacht.",
    "AbpStudio_ComingSoon": "Demnächst verfügbar. <span class=\"opacity-50 ms-0 ms-md-3 d-block d-md-inline-block \">Geplantes Beta-Veröffentlichungsdatum: 4. Quartal 2023.</span>",
    "AbpStudio_PlannedPreviewDate": "Geplantes Vorschau-Veröffentlichungsdatum: 4. Quartal 2023.",
    "BetaRequest": "Beta-Anfrage",
    "CreateNewSolutions": "Schaffen Sie neue Lösungen",
    "CreateNewSolutions_Description1": "Mit vielen Optionen können Sie ganz einfach einfache Anwendungen bis hin zu modularen Monolith- oder Microservice-Lösungen erstellen. Sie erhalten eine vollständig produktionsreife Basissoftwarelösung für Ihr Unternehmen.",
    "ArchitectYourSolutions": "Gestalten Sie Ihre Lösungen",
    "ArchitectYourSolutions_Description1": "Bauen Sie monolithisch-modulare und Microservice-Lösungsstrukturen einfacher auf, indem Sie Module oder Dienste erstellen und Beziehungen zwischen ihnen herstellen. Sie können auch vorgefertigte Anwendungsmodule installieren oder deinstallieren.",
    "ExploreYourSolution": "Entdecken Sie Ihre Lösung",
    "ExploreYourSolution_Description1": "ABP Studio zeigt eine allgemeine Ansicht der Komponenten Ihrer Lösung und der Module, von denen Ihre Lösung abhängt. Sie können Entitäten, Dienste, HTTP-APIs und vieles mehr erkunden, ohne Ihre Codebasis öffnen zu müssen.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze": "Führen Sie Multianwendungs- oder Microservice-Lösungen im Handumdrehen aus",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description1": "Führen Sie einen, <span class=\"text-highlight-white\">mehrere</span> oder <span class=\"text-highlight-white\">alle Dienste</span> mit einem einzigen Klick aus. Auf diese Weise ist es sehr einfach, einen Dienst zu stoppen und ihn zum <span class=\"text-highlight-white\">Testen</span> oder <span class=\"text-highlight-white\">Debuggen</span> in Visual Studio auszuführen.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description2": "Sehen Sie sich eine Liste der Dienste an, sehen Sie sich <span class=\"text-highlight-white\">Echtzeit-HTTP-Anfragen</span> und <span class=\"text-highlight-white\">Ausnahmezahlen</span> für jeden Dienst an.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description3": "Sehen Sie sich alle Details aller <span class=\"text-highlight-white\">HTTP-Anfragen</span> an, die an einen beliebigen Dienst eingehen.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description4": "Erkunden Sie <span class=\"text-highlight-white\">Ausnahmedetails</span> in Echtzeit in jedem Dienst, filtern und suchen Sie einfach.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description5": "Zeigen Sie die <span class=\"text-highlight-white\">Anwendungsprotokolle</span> an, filtern Sie nach Protokollebene oder suchen Sie nach Text.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description6": "<span class=\"text-highlight-white\">Durchsuchen Sie</span> die Benutzeroberfläche Ihrer Anwendung, ohne den Solution Runner zu verlassen.",
    "IntegrateToYourKubernetesCluster": "Integrieren Sie es in Ihren Kubernetes-Cluster",
    "IntegrateToYourKubernetesCluster_Description1": "<span class=\"text-highlight-white\">Verbinden Sie Ihre lokale Entwicklungsumgebung mit einem lokalen oder Remote-Kubernetes-Cluster</span> , wobei dieser Cluster bereits Ihre Microservice-Lösung ausführt.",
    "IntegrateToYourKubernetesCluster_Description2": "Greifen Sie auf jeden Dienst in Kubernetes mit seinem Dienstnamen als DNS zu, so wie er auf Ihrem lokalen Computer ausgeführt wird.",
    "IntegrateToYourKubernetesCluster_Description3": "<span class=\"text-highlight-white\">Fangen Sie jeden Dienst in diesem Cluster ab</span> , sodass der gesamte <span class=\"text-highlight-white\">Datenverkehr zum abgefangenen Dienst automatisch an Ihren Dienst umgeleitet wird,</span> der auf Ihrem lokalen Computer ausgeführt wird. Wenn Ihr Dienst einen Dienst in Kubernetes nutzen muss, wird der Datenverkehr zurück zum Cluster umgeleitet, genau wie Ihr lokaler Dienst innerhalb von Kubernetes ausgeführt wird.",
    "GetInformed": "Sich informieren",
    "Studio_GetInformed_Description1": "Hinterlassen Sie Ihre Kontaktinformationen, um <span class=\"text-highlight-white\">informiert zu werden</span> und <span class=\"text-highlight-white\">probieren Sie es zuerst aus,</span> wenn ABP Studio gestartet ist.",
    "Studio_GetInformed_Description2": "Geplantes Vorschau-Veröffentlichungsdatum: 3. Quartal 2023.",
    "ThankYou!": "Danke schön!",
    "SendBetaRequest": "Beta-Anfrage senden",
    "YouJoinedTheBetaTesterProgram": "Sie sind dem Betatesterprogramm von ABP Studio beigetreten.",
    "PricingExplanation2": "30 Tage Geld-zurück-Garantie – <a href=\"/faq#refund-policy\">Erfahren Sie mehr</a>",
    "MoneyBackGuaranteeText": "* 30-tägige Geld-zurück-Garantie auf alle Lizenzen! 100 % Rückerstattung für Team-Lizenzen, 60 % Rückerstattung für Business- und Enterprise-Lizenzen innerhalb von 30 Tagen.",
    "MobileApplicationStartupTemplates": "Startvorlagen für mobile Anwendungen",
    "MobileApplicationStartupTemplates_Description1": "Integrierte Startvorlagen für mobile Anwendungen für Ihre ABP Commercial-Lösungen.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates": "Erstellen Sie leistungsstarke Branchenanwendungen mit ABP Mobile Startup-Vorlagen",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description1": "ABP Commercial bietet zwei Startvorlagen für mobile Anwendungen, die mit <span class=\"text-highlight\">React Native</span> und <span class=\"text-highlight\">.NET MAUI implementiert sind.</span> Wenn Sie Ihre neue ABP-basierte Lösung erstellen, verfügen Sie auch über grundlegende Startanwendungen, die mit Ihren Backend-APIs verbunden sind.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description2": "Die Anwendung verfügt über einen vorgefertigten Authentifizierungs-Token-Zyklus, <span class=\"text-highlight\">Mehrsprachenunterstützung, Mandantenfähigkeitsunterstützung, Anmeldung, Passwort vergessen, Profilverwaltung und eine Benutzerverwaltungsseite</span> . Sie können Ihre eigene Geschäftslogik hinzufügen und diese entsprechend Ihren Anforderungen anpassen.",
    "TwoFrameworkOptions": "Zwei Framework-Optionen",
    "TwoFrameworkOptions_Description": "ABP bietet sowohl <span class=\"text-highlight\">React Native-</span> als auch <span class=\"text-highlight\">.NET MAUI</span> Mobile-Startvorlagen. Auf diese Weise können Sie diejenige auswählen, die Ihren Anforderungen am besten entspricht. Beide Apps verwenden Code mit der höchsten Rate zwischen iOS- und Android-Plattformen wieder.",
    "PreIntegratedToYourBackend": "Vorintegriert in Ihr Backend",
    "PreIntegratedToYourBackend_Description": "ABP Mobile-Anwendungen sind vorab in Ihre Backend-APIs integriert. Es erhält ein gültiges Authentifizierungstoken vom Server und stellt authentifizierte Anfragen.",
    "MultiLanguage": "Mehrsprachig",
    "MultiLanguage_Description": "Es unterstützt bereits mehr als 10 Sprachen im Auslieferungszustand. Sie können auch weitere Sprachen hinzufügen.",
    "Arabic": "Arabisch",
    "Czech": "Tschechisch",
    "English": "Englisch",
    "Hungarian": "ungarisch",
    "Finnish": "finnisch",
    "French": "Französisch",
    "Hindi": "Hindi",
    "Portuguese": "Portugiesisch",
    "Italian": "Italienisch",
    "Russian": "Russisch",
    "Slovak": "slowakisch",
    "Turkish": "Türkisch",
    "EngageAndRetainYourCustomersWithABPMobileApps": "Binden Sie Ihre Kunden mit ABP Mobile Apps ein und binden Sie sie",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description1": "Ihre Kunden möchten ihre Produkte und Abonnements jederzeit und überall verwalten. Dafür müssen Unternehmen mobile Apps erstellen, die es den Kunden ermöglichen, ihre Anfragen schnell und nahtlos zu erfüllen.",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description2": "Mit ABP Mobile Apps können Sie hochwertige native mobile Apps für Android und iOS erstellen … mit einer einzigen Codebasis und ohne Kompromisse bei Sicherheit, Qualität oder Skalierbarkeit.",
    "OneCodeBaseMultipleDevices": "Eine Codebasis für mehrere Geräte",
    "OneCodeBaseMultipleDevices_Description": "ABP Mobile-Anwendungen sind plattformübergreifend. Sie können auf iOS- und Android-Geräten installiert und ausgeführt werden und passen sich mithilfe einer einzigen Codebasis an verschiedene Formfaktoren an. Entwickler müssen die Benutzeroberfläche und den Front-End-Code nur einmal erstellen. Sie müssen den Code nicht für jedes Gerät anpassen, das Sie unterstützen möchten.",
    "ComesWithTheSourceCode": "Kommt mit dem Quellcode",
    "ComesWithTheSourceCode_Description": "Die mobilen Apps werden mit dem Quellcode bereitgestellt. Passen Sie die UX/UI Ihrer Apps ganz einfach an, um den Branding-Richtlinien zu entsprechen.",
    "Purchase_OneYearPrice": "1-Jahres-Preis",
    "Purchase_DeveloperSeatCount": "Anzahl der Entwicklersitze",
    "Purchase_DevelopersAlreadyIncluded": "{0} Entwickler bereits enthalten",
    "1Year": "1 Jahr",
    "{0}Years": "{0} Jahre",
    "1YearLicense": "1-Jahres-Lizenz",
    "{0}YearsLicense": "{0} Jahre Lizenz",
    "1AdditionalDeveloper": "1 zusätzlicher Entwickler",
    "{0}AdditionalDevelopers": "{0} Zusätzliche Entwickler",
    "Discount": "Rabatt ({0}%)",
    "Summary": "Zusammenfassung",
    "TrainingPack": "Trainingspaket",
    "TrainingPackDiscount": "Rabatt auf Trainingspakete",
    "Purchase_OnboardingTraining_Description": "Dieses Live-Schulungspaket gilt für eine Klasse mit 8 Schülern und dieser Rabatt gilt nur beim Kauf mit der neuen Lizenz. <a href=\"{0}\" class=\"text-white\">Erfahren Sie mehr<i class=\"fa fa-external-link ms-1\"></i></a>",
    "Purchase_Save": "{0}% <span class=\"save ms-1\">sparen {1} {2}</span>",
    "RemoveBasket": "Aus dem Korb nehmen",
    "WhyABPIOPlatform?": "Warum <span class=\"gradient-commercial\">ABP.IO-Plattform</span> ?",
    "DocumentAim": "Dieses Dokument soll die große Frage beantworten:",
    "DocumentAim_Description": "„Warum sollten Sie die ABP.IO-Plattform nutzen, anstatt eine neue Lösung von Grund auf zu erstellen?“",
    "DocumentAim_Description2": "Das Dokument stellt die Herausforderungen beim Aufbau einer modernen Softwarelösung vor und erklärt, wie ABP diese Herausforderungen bewältigt.",
    "CreatingANewSolution": "Erstellen einer neuen Lösung",
    "CreatingANewSolution_Description": "Wenn Sie mit einer neuen Lösung beginnen müssen, müssen Sie sich viele Fragen stellen und Sie sollten sich viel Zeit nehmen, bevor Sie mit dem Schreiben Ihres allerersten Geschäftscodes beginnen.",
    "CreatingAnEmptySolution": "Erstellen einer leeren Lösung",
    "THEPROBLEM": "DAS PROBLEM",
    "CreatingAnEmptySolution_THEPROBLEM_Description": "Selbst die Erstellung einer fast leeren Lösung ist eine Herausforderung.",
    "CreatingAnEmptySolution_THEPROBLEM_Description2": "Wie organisieren Sie Ihre Codebasis projektübergreifend?",
    "CreatingAnEmptySolution_THEPROBLEM_Description3": "Was sind die Schichten und wie interagieren sie?",
    "CreatingAnEmptySolution_THEPROBLEM_Description4": "Wie erfolgt die Integration in Bibliotheken und Systeme von Drittanbietern?",
    "CreatingAnEmptySolution_THEPROBLEM_Description5": "Wie richte ich die automatisierten Tests ein?",
    "ABPSOLUTION": "ABP-LÖSUNG",
    "CreatingAnEmptySolution_ABPSOLUTION_Description": "ABP bietet eine gut strukturierte, mehrschichtige und produktionsbereite <a href=\"https://docs.abp.io/en/abp/latest/Startup-Templates/Application\" target=\"_blank\">Startup-Lösung</a> basierend auf den <a href=\"https://docs.abp.io/en/abp/latest/Domain-Driven-Design\" target=\"_blank\">Domain Driven Design-</a> Prinzipien. Die Lösung umfasst außerdem eine vorkonfigurierte Einheit und <a href=\"https://docs.abp.io/en/abp/latest/Testing\" target=\"_blank\">Integrationstestprojekte</a> für jede Schicht.",
    "CommonLibraries": "Gemeinsame Bibliotheken",
    "CommonLibraries_THEPROBLEM_Description": "Welche Bibliotheken sollten Sie zur Umsetzung allgemeiner Anforderungen nutzen? Das Ökosystem der Softwareentwicklung ist äußerst dynamisch, was es schwierig macht, mit den neuesten Tools, Bibliotheken, Trends und Ansätzen Schritt zu halten.",
    "CommonLibraries_ABPSOLUTION_Description": "ABP integriert beliebte, ausgereifte und aktuelle Bibliotheken vorab in die Lösung. Sie müssen keine Zeit damit verbringen, sie zu integrieren oder sie miteinander kommunizieren zu lassen. Sie funktionieren sofort nach dem Auspacken einwandfrei.",
    "UITheme&Layout": "UI-Theme und -Layout",
    "UITheme&Layout_THEPROBLEM_Description": "Bei der Lösung von UI-Problemen tauchen eine Reihe von Herausforderungen auf. Dazu gehört die Schaffung der Grundlagen für ein reaktionsfähiges, modernes und anpassungsfähiges UI-Kit mit einem einheitlichen Erscheinungsbild und einer Vielzahl von Funktionen wie Navigationsmenüs, Kopfzeilen, Symbolleisten, Fußzeilen, Widgets und mehr.",
    "UITheme&Layout_THEPROBLEM_Description2": "Selbst wenn Sie sich für ein vorgefertigtes Thema entscheiden, kann die nahtlose Integration in Ihr Projekt tagelange Entwicklungszeit erfordern. Eine zusätzliche Hürde liegt in der Aufwertung solcher Themes. Häufig ist die HTML-/CSS-Struktur des Themes mit Ihrem UI-Code verflochten, was zukünftige Theme-Änderungen oder -Upgrades zu komplizierten Aufgaben macht. Diese Verflechtung von Code und Design erschwert die Flexibilität, spätere Anpassungen vorzunehmen.",
    "UITheme&Layout_ABPSOLUTION_Description": "ABP Framework bietet ein einzigartiges Designsystem, das Ihren UI-Code von Designbeschränkungen befreit. Themes liegen isoliert vor und sind als NuGet- oder NPM-Pakete verpackt, sodass die Theme-Installation oder -Upgrades eine Sache von Minuten sind. Während Sie weiterhin die Möglichkeit haben, Ihr individuelles Theme zu entwickeln oder ein bestehendes zu integrieren, präsentiert ABP Commercial eine Sammlung ausgefeilter und zeitgemäßer Themes.",
    "UITheme&Layout_ABPSOLUTION_Description2": "Darüber hinaus gibt es Anbieter von UI-Komponenten wie Telerik und DevExpress. Allerdings liefern diese Anbieter in erster Linie einzelne Komponenten und überlassen Ihnen die Verantwortung für die Erstellung Ihres Layoutsystems. Wenn Sie in ABP-basierten Projekten arbeiten, können Sie diese Bibliotheken nahtlos integrieren, ähnlich wie Sie es in jedem anderen Projekt tun würden.",
    "TestInfrastructure": "Testinfrastruktur",
    "TestInfrastructure_THEPROBLEM_Description": "Der Aufbau einer robusten Testumgebung ist ein zeitaufwändiges Unterfangen. Dazu gehört die Einrichtung dedizierter Testprojekte innerhalb Ihrer Lösung, die sorgfältige Auswahl der erforderlichen Tools, die Erstellung von Dienst- und Datenbankmodellen, die Erstellung wesentlicher Basisklassen und Hilfsdienste zur Minimierung redundanten Codes in den Tests sowie die Bewältigung verschiedener damit zusammenhängender Aufgaben.",
    "TestInfrastructure_ABPSOLUTION_Description": "ABP-Startup-Vorlagen sind bereits mit konfigurierten Testprojekten ausgestattet, was den Prozess für Sie optimiert. Das bedeutet, dass Sie vom ersten Tag an ohne Verzögerung mit dem Schreiben Ihres ersten Unit- oder Integrationstestcodes beginnen können.",
    "CodingStandards&Training": "Codierungsstandards und Schulung",
    "CodingStandards&Training_THEPROBLEM_Description": "Nachdem Sie die Lösung für die Entwicklung eingerichtet haben, müssen Sie den Entwicklern normalerweise beibringen, wie das System funktioniert und wie sie es mit denselben vereinbarten Methoden erstellen. Selbst wenn Sie sie schulen, kann es schwierig sein, die Dokumentation auf dem neuesten Stand zu halten. Mit der Zeit kann es sein, dass jeder Entwickler seinen Code auf seine eigene Weise schreibt, was dazu führt, dass sich die Regeln für das Schreiben von Code voneinander unterscheiden.",
    "CodingStandards&Training_ABPSOLUTION_Description": "Die ABP-Lösung ist bereits übersichtlich organisiert und enthält klare Erklärungen. Schritt-für-Schritt-Anleitungen und Anleitungen zeigen Ihnen genau, wie Sie an einem ABP-Projekt arbeiten.",
    "KeepingYourSolutionUpToDate": "Halten Sie Ihre Lösung auf dem neuesten Stand",
    "KeepingYourSolutionUpToDate_THEPROBLEM_Description": "Nachdem Sie mit der Entwicklung begonnen haben, müssen Sie den Überblick über die neuen Versionen der Bibliotheken behalten, die Sie für Upgrades und Patches verwenden.",
    "KeepingYourSolutionUpToDate_ABPSOLUTION_Description": "Wir aktualisieren regelmäßig alle Pakete auf die neuesten Versionen und testen sie vor der stabilen Veröffentlichung. Wenn Sie das ABP Framework aktualisieren, werden alle seine Abhängigkeiten auf die Edge-Technologie aktualisiert.",
    "DRY": "Wiederholen Sie sich nicht!",
    "DRY_Description": "Die Erstellung einer Basislösung nimmt viel Zeit in Anspruch und erfordert gute Architekturerfahrung. Dies ist jedoch erst der Anfang! Wenn Sie mit der Entwicklung beginnen, müssen Sie wahrscheinlich viel sich wiederholenden Code schreiben; Es wäre toll, wenn das alles automatisch erledigt werden könnte.",
    "DRY_Description2": "ABP automatisiert und vereinfacht die Wiederholung von Code so weit wie möglich, indem es dem Prinzip „Konvention vor Konfiguration“ folgt. Es schränkt Sie jedoch nicht ein, wenn Sie in den manuellen Gang schalten müssen. Die Kontrolle liegt immer in Ihren Händen.",
    "Authentication": "Authentifizierung",
    "Authentication_THEPROBLEM_Description": "Single Sign-On, Active Directory/LDAP-Integration, OpenIddict-Integration, soziale Anmeldungen, Zwei-Faktor-Authentifizierung, Passwort vergessen/zurücksetzen, E-Mail-Aktivierung, Registrierung neuer Benutzer, Kontrolle der Passwortkomplexität, Sperren des Kontos bei fehlgeschlagenen Versuchen, Anzeigen fehlgeschlagener Anmeldeversuche ... usw. Wir wissen, dass Ihnen alle diese allgemeinen Anforderungen bekannt sind. Sie sind nicht allein!",
    "Authentication_ABPSOLUTION_Description": "ABP Framework und die kommerzielle Version stellen alle diese Standardfunktionen vorimplementiert als wiederverwendbares Kontomodul für Sie bereit. Sie aktivieren und konfigurieren einfach, was Sie benötigen.",
    "CrossCuttingConcerns": "Querschnittsthemen",
    "CrossCuttingConcerns_THEPROBLEM_Description": "Querschnittsbelange sind die grundlegende, sich wiederholende Logik, die für jeden Anwendungsfall implementiert werden sollte. Einige Beispiele;",
    "CrossCuttingConcerns_THEPROBLEM_Description2": "Starten von Transaktionen, Zusagen bei Erfolg und Rollback bei Fehlern.",
    "CrossCuttingConcerns_THEPROBLEM_Description3": "Behandlung und Meldung von Ausnahmen, Rückgabe einer ordnungsgemäßen Fehlerantwort an die Clients und Bearbeitung von Fehlerfällen auf Clientseite.",
    "CrossCuttingConcerns_THEPROBLEM_Description4": "Implementierung der Autorisierung und Validierung, Rückgabe der richtigen Antworten und Bearbeitung dieser auf der Clientseite.",
    "CrossCuttingConcerns_ABPSOLUTION_Description": "Das ABP Framework automatisiert oder vereinfacht alle gängigen Querschnittsthemen. Sie schreiben nur Code, der für Ihr Unternehmen wichtig ist, und ABP erledigt den Rest gemäß den Konventionen.",
    "ArchitecturalInfrastructure": "Architektonische Infrastruktur",
    "ArchitecturalInfrastructure_THEPROBLEM_Description": "Normalerweise müssen Sie eine Infrastruktur aufbauen, um Ihre Architektur ordnungsgemäß zu implementieren. Beispielsweise implementieren Sie im Allgemeinen das Repository-Muster. Sie definieren einige Basisklassen, um die Erstellung von Entitäten, Diensten, Controllern und anderen Objekten zu vereinfachen und zu standardisieren.",
    "ArchitecturalInfrastructure_ABPSOLUTION_Description": "ABP Framework bietet all dies und noch mehr sofort einsatzbereit. Es ist ausgereift und gut dokumentiert.",
    "EnterpriseApplicationRequirements": "Anforderungen an Unternehmensanwendungen",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description": "Es gibt viele Anforderungen, die Sie in jeder Geschäftsanwendung immer wieder umsetzen;",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description2": "Detailliertes Berechtigungssystem und Verwaltung von Berechtigungen auf der Benutzeroberfläche basierend auf Rollen und Benutzern.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description3": "Schreiben von Prüfprotokollen und Entitätsverläufen, um zu verfolgen, wann ein Benutzer einen Datenbankeintrag ändert.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description4": "Lassen Sie Ihre Entitäten vorläufig löschen, damit sie als gelöscht markiert werden, anstatt sie physisch aus der Datenbank zu löschen und gelöschte Entitäten automatisch in Ihren Abfragen zu filtern.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description5": "Erstellen Sie Abstraktionen und Wrapper, um Ihre Backend-APIs aus dem Frontend-Code zu nutzen.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description6": "Hintergrundjobs in die Warteschlange stellen und ausführen.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description7": "Umgang mit mehreren Zeitzonen in einem globalen System.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description8": "Gemeinsame Validierung, Lokalisierung und Autorisierungslogik zwischen Server und Client.",
    "EnterpriseApplicationRequirements_ABPSOLUTION_Description": "ABP stellt eine Infrastruktur zur einfachen Umsetzung solcher Anforderungen bereit. Auch hier gilt: Sie verschwenden Ihre wertvolle Zeit nicht damit, all dies immer wieder neu umzusetzen.",
    "GeneratingInitialCode&Tooling": "Generieren des anfänglichen Codes und der Tools",
    "GeneratingInitialCode&Tooling_THEPROBLEM_Description": "In einer typischen Webanwendung erstellen Sie viele ähnliche Seiten. Die meisten von ihnen führen ähnliche CRUD-Operationen durch. Es ist sehr mühsam und auch fehleranfällig, solche Seiten immer wieder zu erstellen.",
    "GeneratingInitialCode&Tooling_ABPSOLUTION_Description": "<a href=\"/tools/suite\">ABP Suite</a> kann in Sekundenschnelle eine Full-Stack-CRUD-Seite für Ihre Entitäten generieren. Der generierte Code ist vielschichtig und sauber. Alle standardmäßigen Validierungs- und Autorisierungsanforderungen sind implementiert. Außerdem werden Unit-Test-Klassen generiert. Sobald Sie eine vollständig lauffähige Seite erhalten, können Sie diese entsprechend Ihren Geschäftsanforderungen ändern.",
    "IntegratingTo3rdPartyLibrariesAndSystems": "Integration in Bibliotheken und Systeme von Drittanbietern",
    "IntegratingTo3rdPartyLibrariesAndSystems_THEPROBLEM_Description": "Die meisten Bibliotheken sind als Low-Level-Bibliotheken konzipiert und Sie müssen in der Regel einiges daran tun, sie richtig zu integrieren, ohne den gleichen Integrations- und Konfigurationscode überall in Ihrer Lösung zu wiederholen. Angenommen, Sie müssen RabbitMQ verwenden, um Ihren verteilten Ereignisbus zu implementieren. Alles, was Sie tun möchten, ist; Senden Sie eine Nachricht an eine Warteschlange und bearbeiten Sie die eingehenden Nachrichten. Sie müssen jedoch die Nachrichtenmuster, Warteschlangen und Austauschdetails verstehen. Um effizienten Code zu schreiben, müssen Sie einen Pool zur Verwaltung von Verbindungen, Clients und Kanälen erstellen. Sie müssen sich auch mit Ausnahmen, ACK-Nachrichten, der erneuten Verbindung zu RabbitMQ bei Fehlern und vielem mehr befassen.",
    "IntegratingTo3rdPartyLibrariesAndSystems_ABPSOLUTION_Description": "Beispielsweise abstrahiert die RabbitMQ Distributed Event Bus-Integration von ABP alle diese Details. Sie senden und empfangen Nachrichten ohne Hektik. Müssen Sie Low-Level-Code schreiben? Kein Problem, das können Sie jederzeit tun. ABP schränkt Sie nicht ein, wenn Sie Low-Level-Funktionen der von Ihnen verwendeten Bibliothek nutzen müssen.",
    "WhyNotBuildYourOwnFramework?": "Warum nicht Ihr eigenes Framework erstellen?",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description": "Der Aufbau, die Wartung und die Dokumentation der gesamten Infrastruktur, selbst in der einfachsten Form, erfordern viel Zeit. Mit der Zeit wird es größer und es wird schwieriger, es in Ihrer Lösung beizubehalten. Die Aufteilung dieser in ein wiederverwendbares Projekt ist der Ausgangspunkt für den Aufbau Ihres eigenen internen Frameworks.",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description2": "Der Aufbau, die Dokumentation, die Schulung und die Pflege eines internen Rahmenwerks ist wirklich schwierig. Wenn Sie kein erfahrenes, engagiertes Framework-Team haben, wird Ihr internes Framework schnell zu einem undokumentierten Legacy-Code, den niemand mehr verstehen und warten kann. Andererseits werden diese Frameworks in der Regel von einem oder zwei Entwicklern im Team entwickelt. Und diese Leute werden zu einem Wissenssilo. Das ist gut für sie, aber schlecht für das Unternehmen, weil sie die einzige Fehlerquelle des Projekts sind <a href=\"https://en.wikipedia.org/wiki/Single_point_of_failure\">(SPOF)</a> . Sobald sie das Unternehmen verlassen, scheitert das Projekt dramatisch.",
    "WhyNotBuildYourOwnFramework_ABPSOLUTION_Description": "ABP Framework ist ein von der Community betriebenes, gut dokumentiertes, ausgereiftes und generisches Anwendungsframework. Ein Team äußerst erfahrener Entwickler arbeitet hart daran, es aktuell, leicht verständlich und benutzerfreundlich zu halten. Durch die Verwendung eines solch stabilen Frameworks können Sie sich auf Ihren eigenen Geschäftscode konzentrieren und erhalten bei Bedarf Hilfe von Experten für das Framework.",
    "ArchitecturalInfrastructure_Description": "SaaS-Anwendungen, modulare oder Microservice-Systeme sind die am häufigsten verwendeten Unternehmenssoftwaremodelle. Der Aufbau solcher Systeme erfordert nicht nur ein gutes Verständnis und Erfahrung, sondern auch eine starke Software-Infrastruktur. Andernfalls werden Sie große Anstrengungen unternehmen, um diese Architekturdetails in Ihrer Codebasis zu unterstützen.",
    "Modularity": "Modularität",
    "Modularity_THEPROBLEM_Description": "Ein wirklich modulares System aufzubauen ist nicht einfach! Alle Aspekte des Systems (Datenbank, Entitäten, APIs, UI-Seiten/-Komponenten) können in Module aufgeteilt werden, und jedes Modul kann ohne andere wiederverwendet werden. Der einfache ASP.NET Core bietet keine solche modulare Architektur. Wenn Sie es brauchen, sollten Sie von Grund auf darüber nachdenken.",
    "Modularity_ABPSOLUTION_Description": "Das ABP Framework ist als modulare Anwendungsentwicklungsstruktur konzipiert. Jede Funktion im Framework ist so entwickelt, dass sie mit der Modularität kompatibel ist. Dokumentationen und Leitfäden erläutern, wie wiederverwendbare Module auf standardisierte Weise entwickelt werden.",
    "SaaSMultiTenancy": "SaaS / Mandantenfähigkeit",
    "SaaSMultiTenancy_THEPROBLEM_Description": "<a href=\"https://docs.abp.io/en/abp/latest/Multi-Tenancy\">Multi-Tenancy</a> ist eine gängige Methode zur Implementierung von SaaS-Systemen. Die Implementierung einer konsistenten Multi-Tenant-Infrastruktur kann jedoch kompliziert werden.",
    "SaaSMultiTenancy_ABPSOLUTION_Description": "ABP Framework bietet eine vollständige mandantenfähige Infrastruktur und abstrakte Komplexität aus Ihrem Geschäftscode. Ihr Anwendungscode ist weitgehend mandantenfähig, während das ABP-Framework die Datenbank, den Cache und andere Details der Mandanten automatisch voneinander isoliert. Es unterstützt Einzeldatenbank-, Mandantendatenbank- und Hybridansätze. Es konfiguriert ordnungsgemäß die Bibliotheken wie Microsoft Identity und OpenIddict, die normalerweise nicht mandantenfähig sind.",
    "Microservices": "Mikrodienste",
    "Microservices_THEPROBLEM_Description": "Der Aufbau eines Microservice-Systems erfordert viele Infrastrukturdetails: Die Authentifizierung und Autorisierung von Anwendungen und Microservices sowie die Implementierung von asynchronem Messaging und synchronen (Rest/GRPC) Kommunikationsmustern zwischen Microservices sind die grundlegendsten Probleme.",
    "Microservices_ABPSOLUTION_Description": "Das ABP Framework bietet Dienste, <a href=\"https://docs.abp.io/en/abp/latest/Microservice-Architecture\" target=\"_blank\">Leitfäden</a> und Beispiele, die Sie bei der Implementierung Ihrer Microservice-Lösung mithilfe der branchenüblichen Tools unterstützen.",
    "Microservices_ABPSOLUTION_Description2": "ABP Commercial geht sogar noch einen Schritt weiter und bietet eine vollständige <a href=\"https://docs.abp.io/en/commercial/latest/startup-templates/microservice/index\" target=\"_blank\">Startup-Vorlage</a> für den Kickstart Ihrer Microservice-Lösung.",
    "PreBuiltModules": "Vorgefertigte Module",
    "PreBuiltModules_THEPROBLEM_Description": "Wir alle haben ähnliche, aber leicht unterschiedliche Geschäftsanforderungen. Allerdings sollten wir alle das Rad neu erfinden, da der Code von niemandem direkt in unserer Lösung funktionieren kann. Sie alle sind eingebettete Teile einer größeren Lösung.",
    "PreBuiltModules_ABPSOLUTION_Description": "ABP Commercial- <a href=\"/modules\">Module</a> bieten viele wiederverwendbare Anwendungsmodule wie Zahlung, Chat, Dateiverwaltung, Prüfprotokollberichte usw. Alle diese Module können einfach in Ihre Lösung installiert werden und funktionieren direkt. Wir fügen ständig weitere Module hinzu.",
    "PreBuiltModules_ABPSOLUTION_Description2": "Alle Module sind so konzipiert, dass sie an Ihre Geschäftsanforderungen angepasst werden können. Wenn Sie vollständige Kontrolle benötigen, können Sie den vollständigen Quellcode jedes Moduls herunterladen und es vollständig an Ihre spezifischen Geschäftsanforderungen anpassen.",
    "ABPCommunity": "ABP-Community",
    "ABPCommunity_Description": "Schließlich bringt die Zugehörigkeit zu einer großen Community, in der jeder ähnliche Codierungsstile und -prinzipien verfolgt und eine gemeinsame Infrastruktur nutzt, Macht, wenn Sie Probleme haben oder Hilfe bei Designentscheidungen benötigen. Da wir Code auf ähnliche Weise schreiben, können wir uns gegenseitig viel besser helfen. ABP ist ein von der Community unterstütztes Projekt mit mehr als 10.000 Sternen auf GitHub.",
    "ABPCommunity_Description2": "Es ist einfach, Code oder sogar wiederverwendbare Bibliotheken zwischen ABP-Entwicklern zu teilen. Ein Codeausschnitt, der für Sie funktioniert, funktioniert auch für andere. Es gibt viele Beispiele und Tutorials, die Sie direkt in Ihre Anwendung umsetzen können.",
    "ABPCommunity_Description3": "Wenn Sie einen Entwickler einstellen, der bereits mit der ABP-Architektur gearbeitet hat, wird er Ihre Lösung sofort verstehen und in kürzester Zeit mit der Entwicklung beginnen.",
    "WhyAbpIo_Page_Title": "Warum ABP.IO-Plattform?",
    "AbpStudio_Page_Title": "ABP Studio",
    "CampaignInfo": "Kaufen Sie eine neue Lizenz oder erneuern Sie Ihre bestehende Lizenz und <span class=\"text-white\">erhalten Sie weitere 2 Monate</span> ohne zusätzliche Kosten! Dieses Angebot gilt für alle Lizenzpläne. Stellen Sie sicher, dass Sie diese zeitlich begrenzte Aktion nutzen, um Ihren Zugriff auf Premium-Funktionen und Upgrades zu erweitern.",
    "HurryUpLastDay": "Beeil dich! Letzter Tag: {0}",
    "CreatingCRUDPagesWithABPSuite": "CRUD-Seiten mit ABP Suite erstellen",
    "Testimonials": "Referenzen",
    "MultipleYearDiscount": "Rabatt für mehrere Jahre",
    "CampaignDiscountText": "Black Friday-Rabatt",
    "CampaignDiscountName": "Schwarzer Freitag",
    "CampaignName:BlackFriday": "Schwarzer Freitag"
  }
}