{
  "culture": "en",
  "texts": {
    "OrganizationManagement": "Organization Management",
    "OrganizationList": "Organization list",
    "Volo.AbpIo.Commercial:010003": "You are not owner of this organization!",
    "OrganizationNotFoundMessage": "No organization found!",
    "DeveloperCount": "Allocated / total developers",
    "QuestionCount": "Remaining / total questions",
    "Unlimited": "Unlimited",
    "Owners": "Owners",
    "AddMember": "Add member",
    "AddOwner": "Add owner",
    "AddDeveloper": "Add developer",
    "UserName": "Username",
    "Name": "Name",
    "EmailAddress": "Email address",
    "Developers": "Developers",
    "LicenseType": "License type",
    "Manage": "Manage",
    "StartDate": "Start date",
    "EndDate": "End date",
    "Modules": "Modules",
    "LicenseExtendMessage": "Your license end date is extended to {0}",
    "LicenseUpgradeMessage": "Your license is upgraded to {0}",
    "LicenseAddDeveloperMessage": "{0} developers added to your license",
    "Volo.AbpIo.Commercial:010004": "Can not find the specified user! The user must have already registered.",
    "MyOrganizations": "My organizations",
    "ApiKey": "API key",
    "UserNameNotFound": "There is no user with username {0}",
    "SuccessfullyAddedToNewsletter": "Thanks you for subscribing to our newsletter!",
    "MyProfile": "My profile",
    "EmailNotValid": "Please enter a valid email address.",
    "JoinOurMarketingNewsletter": "Join our marketing newsletter",
    "WouldLikeToReceiveMarketingMaterials": "I would like to receive marketing materials like product deals & special offers.",
    "StartUsingYourLicenseNow": "Start using your license now!",
    "WelcomePage": "Welcome Page",
    "UnsubscriptionExpireEmail": "Unsubscribe from license expire date reminder emails",
    "UnsubscribeLicenseExpireEmailReminderMessage": "This email subscription only contains reminding your license expiration date.",
    "UnsubscribeFromLicenseExpireEmails": "If you don't want to receive the emails about your license expiration date, you can unsubscribe at any time you want.",
    "Unsubscribe": "Unsubscribe",
    "NotOrganizationMember": "You are not member of any organization.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Successfully unsubscribed",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "You will not receive license expiration date reminder emails anymore.",
    "IndexPageHeroSection": "<span class=\"first-line\">A complete</span><span class=\"second-line\"> web development platform</span><span class=\"third-line\">built-on <img src=\"{0}\" width=\"110\" class=\"ml-1\" /> framework</span>",
    "AbpCommercialShortDescription": "ABP Commercial provides pre-built application modules, rapid application development tooling, professional UI themes, premium support and more.",
    "LiveDemo": "Live Demo",
    "GetLicence": "Get a Licence",
    "Application": "Application",
    "StartupTemplates": "Startup Templates",
    "Startup": "Startup",
    "Templates": "Templates",
    "Developer": "Developer",
    "Tools": "Tools",
    "Premium": "Premium",
    "PremiumSupport": "Premium Support",
    "PremiumForumSupport": "Premium Forum Support",
    "UI": "UI",
    "Themes": "Themes",
    "JoinOurNewsletter": "Join Our Newsletter",
    "Send": "Send",
    "Learn": "Learn",
    "AdditionalServices": "Additional Services",
    "WhatIsABPFramework": "WHAT IS THE ABP FRAMEWORK?",
    "OpenSourceBaseFramework": "Open Source Base Framework",
    "ABPFrameworkExplanation": "<p class=\"lead\">ABP Commercial is based on the ABP Framework, an open source and community driven web application framework for ASP.NET Core.</p><p>ABP Framework provides an excellent infrastructure to write maintainable, extensible and testable code with best practices.</p><p>Built on and integrated to popular tools you already know. Low learning curve, easy adaptation, comfortable development.</p>",
    "Modular": "Modular",
    "MicroserviceCompatible": "Microservice compatible",
    "DomainDrivenDesignInfrastructure": "Domain Driven Design Infrastructure",
    "MultiTenancy": "Multi-Tenancy",
    "DistributedMessaging": "Distributed Messaging",
    "DynamicProxying": "Dynamic Proxying",
    "BackgroundJobs": "Background Jobs",
    "AuditLogging": "Audit Logging",
    "BLOBStoring": "BLOB Storing",
    "BundlingMinification": "Bundling & Minification",
    "AdvancedLocalization": "Advanced Localization",
    "ManyMore": "Many more",
    "ExploreTheABPFramework": "Explore the ABP Framework",
    "WhyUseTheABPCommercial": "Why Use The ABP Commercial?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt- 5\">Building enterprise-grade web applications can be complex and time-consuming.</p><p>ABP Commercial offers the perfect base infrastructure necessary for all modern enterprise-grade ASP.NET Core based solutions. Right from the design to deployment, the entire development cycle is empowered by ABP's built-in features & modules.</p>",
    "StartupTemplatesShortDescription": "Startup templates make you jump-start to your project in a few seconds.",
    "UIFrameworksOptions": "UI frameworks options;",
    "DatabaseProviderOptions": "Database provider options;",
    "PreBuiltApplicationModules": "Pre-Built Application Modules",
    "PreBuiltApplicationModulesShortDescription": "Most common application requirements are already developed for you as reusable modules.",
    "Account": "Account",
    "Blogging": "Blogging",
    "Identity": "Identity",
    "IdentityServer": "Identity Server",
    "Saas": "Saas",
    "LanguageManagement": "Language Management",
    "TextTemplateManagement": "Text Template Management",
    "See All Modules": "SeeAllModules",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "ABP Suite is a complementary tool to the ABP Commercial.",
    "AbpSuiteExplanation": "It allows you to build web pages in a matter of minutes. It's a .NET Core Global tool which can be installed from the command line. It can create a new ABP solution, generate CRUD pages from the database to the front-end.",
    "Details": "Details",
    "LeptonTheme": "Lepton Theme",
    "ProfessionalModernUIThemes": "Professional, modern UI themes",
    "LeptonThemeExplanation": "Lepton provides a gamut of Bootstrap admin themes that serve as a solid foundation for any project requiring admin dashboard.",
    "DefaultTheme": "Default Theme",
    "MaterialTheme": "Material Theme",
    "Default2Theme": "Default 2 Theme",
    "DarkTheme": "Dark Theme",
    "DarkBlueTheme": "Dark Blue Theme",
    "LightTheme": "Light Theme",
    "ProudToWorkWith": "Proud to Work With",
    "OurConsumers": "Thousands of enterprises and developers over 70 countries worldwide rely on ABP Commercial.",
    "JoinOurConsumers": "Join them and build amazing products fast.",
    "AdditionalServicesExplanation": "Do you need additional or custom services?  <strong>We and our partners can provide;</strong>",
    "CustomProjectDevelopment": "Custom Project Development",
    "CustomProjectDevelopmentExplanation": "Dedicated developers for your custom projects.",
    "PortingExistingProjects": "Porting Existing Projects",
    "PortingExistingProjectsExplanation": "Migrating your legacy projects to the ABP platform.",
    "LiveSupport": "Live Support",
    "LiveSupportExplanation": "Live remote support option when you need it.",
    "Training": "Training",
    "TrainingExplanation": "Dedicated training for your developers.",
    "OnBoarding": "Onboarding",
    "OnBoardingExplanation": "Help to setup your development, CI & CD environments.",
    "PrioritizedTechnicalSupport": "Prioritized Technical Support",
    "PremiumSupportExplanation": "Beside the great community support of the ABP framework, our support team answers technical questions and problems of the commercial users with high priority.",
    "SeeTheSupportOptions": "See the Support Options",
    "Contact": "Contact",
    "TellUsWhatYouNeed": "Tell us what you need.",
    "YourMessage": "Your Message",
    "YourFullName": "Your full name",
    "EmailField": "E-mail Address",
    "YourEmailAddress": "Your e-mail address",
    "HowMayWeHelpYou": "How may we help you?",
    "SendMessage": "Send Message",
    "Success": "Success",
    "WeWillReplyYou": "We received your message and will be in touch shortly.",
    "GoHome": "Go Home",
    "CreateLiveDemo": "Create Live Demo",
    "RegisterToTheNewsletter": "Register for the newsletter to receive information regarding ABP.IO, including new releases etc.",
    "EnterYourEmailOrLogin": "Enter your e-mail address to create your demo or <a href=\"{0}\">Login</a> using your existing account.",
    "ApplicationTemplate": "Application Template",
    "ApplicationTemplateExplanation": "Application startup template is used to create a new web application.",
    "EfCoreProvider": "Entity Framework (Supports SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\">and others</a>)",
    "AlreadyIncludedInTemplateModules": "Following modules are already included and configured in this template:",
    "ApplicationTemplateArchitecture": "This application template also supports tiered architecture where UI layer, API layer and the authentication service are physically separated.",
    "SeeTheGuideOrGoToTheLiveDemo": "See the developer guide for technical information about this template or go to the live demo.",
    "DeveloperGuide": "Developer Guide",
    "ModuleTemplate": "Module Template",
    "ModuleTemplateExplanation1": "You want to create a module and reuse across different applications? This startup template prepares everything to start to create a reusable <strong>application module</strong> or a <strong>microservice</strong>.",
    "ModuleTemplateExplanation2": "<p>You can support single or multiple UI frameworks, single or multiple database providers for a single module. The startup template is configured to run and <strong>test your module</strong> in a minimal application in addition to the unit and integration test infrastructure. </p> <p>See the developer guide for technical information about this template.</p>",
    "WithAllStyleOptions": "with all style options",
    "Demo": "Demo",
    "SeeAllModules": "See All Modules",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) is a command line tool to perform some common operations for ABP based solutions.",
    "ABPSuiteEasilyCURD": "ABP Suite is a tool which allows you to easily create CRUD pages",
    "WeAreHereToHelp": "We are Here to <span class=\"zero-text\">Help</span>",
    "BrowseOrAskQuestion": "You can browse our help topics or search in frequently asked questions, or you can ask us a question by using the <a href=\"{0}\" class=\"text-success\">contact form</a>.",
    "SearchQuestionPlaceholder": "Search in frequently asked questions",
    "WhatIsTheABPCommercial": "What is the ABP Commercial?",
    "WhatAreDifferencesThanAbpFramework": "What are the differences between the open source ABP Framework and the ABP Commercial?",
    "ABPCommercialExplanation": "ABP Commercial is a set of premium modules, tools, themes and services built on top of the open source <a target=\"_blank\" href=\"{0}\">ABP framework</a>. ABP Commercial is being developed and supported by the same team behind the ABP framework.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\">ABP framework</a> is a modular, themeable, micro-service compatible application development framework for ASP.NET Core. It provides a complete architecture and a strong infrastructure to make you focusing on your own business code rather than repeating yourself for every new project. It is based on software development best practices and popular tools you already know.  </p> <p> ABP framework is completely free, open source and community-driven. It also provides a free theme and some pre-built modules (e.g. identity management and tenant management).</p>",
    "VisitTheFrameworkVSCommercialDocument": "Visit the following link, for more information <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial adds the following benefits on top of the ABP framework;",
    "Professional": "Professional",
    "UIThemes": "UI themes",
    "EnterpriseModules": "Enterprise ready, feature rich, pre-built <a href=\"{0}\">application modules</a> (e.g. Identity Server management, SaaS management, language management)",
    "ToolingToSupport": "Tooling to support your development productivity (e.g. <a href=\"{0}\">ABP Suite</a>)",
    "PremiumSupportLink": "Premium <a href=\"{0}\" target=\"_blank\">support</a>",
    "WhatDoIDownloadABPCommercial": "What do I download when I purchase the ABP Commercial?",
    "CreateUnlimitedSolutions": "Once you purchase an ABP Commercial license, you will be able to create unlimited solutions like described in the <a href=\"{0}\">Getting Started</a> document.",
    "ABPCommercialSolutionExplanation": "When you create a new application, you get a Visual Studio solution (a startup template) based on your preferences. The downloaded solution has commercial modules and themes already installed and configured for you. You can remove a pre-installed module or add another module if you like. All modules and themes are used a NuGet/NPM packages by default.",
    "StartDevelopWithTutorials": "The downloaded solution is well architected and documented. You can start to develop your own business code based on it following <a href=\"{0}\">the tutorials</a>",
    "TryTheCommercialDemo": "You can try <a href=\"{0}\">the demo</a> to see a sample application created using the ABP Commercial startup template.",
    "HowManyProducts": "How many different products/solutions can I build using the ABP Commercial?",
    "HowManyProductsExplanation": "There is no limit to create an ABP project. You can create as many project as you want, develop and upload them to different servers.",
    "HowManyDevelopers": "How many developers can work on the ABP Commercial?",
    "HowManyDevelopersExplanation": "ABP Commercial licenses are per developer. Different license types have different developer limits. However, you can add more developers to any license type whenever you need. See <a href=\"{0}\">the prices</a> page for license types, developer limits and additional developer costs.",
    "ChangingLicenseType": "Can I upgrade my license type later?",
    "ChangingLicenseTypeExplanation": "You can upgrade to a higher license by paying the difference within your active license period. When you upgrade to a higher license plan, you get the benefits of the new plan, but the license upgrade does not change the license expiry date. Besides, you can also add new developer seats to your existing license, see \"How many developers can work on the ABP Commercial?\"",
    "LicenseExtendUpgradeDiff": "What is the difference between license extend and upgrade?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Extending:</strong> By extending/renewing your license, you will continue to get premium support and get major updates for the modules and themes. Besides, you will be able to continue creating new projects. And you will still be able to use ABP Suite which speeds up your development.<hr/><strong>Upgrading:</strong> By upgrading your license, you will promote to a higher license plan which will allow you to get additional benefits. See the <a href=\"/pricing\">license comparison table</a> to check the differences between the license plans.<strong>On the other hand, when you upgrade, your license expiry date will not change!</strong>To extend your license end date, you need to extend your license.",
    "LicenseRenewalCost": "What is the license renewal cost after 1 year?",
    "LicenseRenewalCostExplanation": "The renewal (extend) rate of all ABP Commercial perpetual licenses is {0} of the license list price. The renewal price of the standard Team License is ${1}, standard Business License is ${2} and standard Enterprise License is ${3}. If you are already a customer, <a href='{4}' target='_blank'>log into your account</a> to review the available renewal pricing.",
    "HowDoIRenewMyLicense": "How do I renew my license?",
    "HowDoIRenewMyLicenseExplanation": "You can renew your license by navigating to the <a href='{0}' target='_blank'>organization management page</a>. In order to take advantage of our discounted Early Renewal rates, make sure you renew before your license expires. Don't worry about not knowing when your Early Renewal opportunity closes, however. You'll receive 2 reminder e-mails before your subscription expires. We'll send them at 30 days, 7 days before expiration.",
    "IsSourceCodeIncluded": "Does my license include the source code of the commercial modules and themes?",
    "IsSourceCodeIncludedExplanation1": "Depends on the license type you've purchased:",
    "IsSourceCodeIncludedExplanation2": "<strong>Team</strong>: Your solution uses the modules and the themes as NuGet and NPM packages. It doesn't include their source code. In this way, you can easily upgrade these modules and themes whenever a new version is available. However, you can not get the source code of the modules and the themes.",
    "IsSourceCodeIncludedExplanation3": "<strong>Business/Enterprise</strong>: In addition to the Team license, you are able to download the source code of any module or theme you need. You can even remove the NuGet/NPM package references for a particular module and add its source code directly to your solution to fully change it.",
    "IsSourceCodeIncludedExplanation4": "<p>Including the source code of a module to your solution gives you the maximum freedom to customize that module. However, then it will not be possible to automatically upgrade the module when a new version is released.</p><p>None of the licenses include the ABP Suite source code, which is an external tool that generates code for you and assist to your development.</p><p>See <a href=\"{0}\">the pricing</a> page for other differences between the license types.</p>",
    "ChangingDevelopers": "Can I change the registered developers of my organization in the future?",
    "ChangingDevelopersExplanation": "In addition to add new developers to your license, you can also change the existing developers (you can remove a developer and add a new one to the same seat) without any additional cost.",
    "WhatHappensWhenLicenseEnds": "What happens when my license period ends?",
    "WhatHappensWhenLicenseEndsExplanation1": "ABP Commercial license type is <a href=\"{0}\" target=\"_blank\">perpetual license</a>. After your license expires, you can continue developing your project. And you are not obliged to renew your license. Your license comes with a one-year Updates and Support plan out of the box. To continue to receive new features, performance enhancements, bug fixes, support and continue to use ABP Suite, make sure to renew your plan each year. When your license expires, you will not be able to get more of the following benefits;",
    "WhatHappensWhenLicenseEndsExplanation2": "You can not create new solutions using the ABP Commercial, but you can continue to develop your existing applications forever.",
    "WhatHappensWhenLicenseEndsExplanation3": "You will be able to get updates for the modules and themes within your MAJOR version. For example; if you are using v3.2.0 of a module, you can still get updates for v3.x.x (v3.3.0, v3.5.2... etc.) of that module. But you cannot get updates for the next major version (like v4.x, v5.x)",
    "WhatHappensWhenLicenseEndsExplanation4": "You can not install new modules and themes added to the ABP Commercial platform after your license ends.",
    "WhatHappensWhenLicenseEndsExplanation5": "You can not use the ABP Suite.",
    "WhatHappensWhenLicenseEndsExplanation6": "You can not get the <a href=\"{0}\">premium support</a> anymore.",
    "WhatHappensWhenLicenseEndsExplanation7": "You can renew your subscription if you want to continue to get these benefits. If you renew your subscription within 1 month after your license expires, a 20% discount is applied.",
    "WhenShouldIRenewMyLicense": "When should I renew my license?",
    "WhenShouldIRenewMyLicenseExplanation1": "If you renew your license within <strong>1 month</strong> after your license expires, a %20 discount is be applied.",
    "WhenShouldIRenewMyLicenseExplanation2": "If you renew your license after 1 month from your license expire date, the renew price will be same as license purchase price and there will be no discount for your renewal.",
    "TrialPlan": "Do you have a trial plan?",
    "TrialPlanExplanation": "For now, ABP Commercial doesn't have a trial plan. For the Team licenses we provide 30 days money back guarantee. You can just request a refund in the first 30 days. For the Business and Enterprise licenses, we provide 60% refund in 30 days. This is because Business and Enterprise licenses include the full source code of all the modules and the themes.",
    "DoYouAcceptBankWireTransfer": "Do you accept bank wire transfer?",
    "DoYouAcceptBankWireTransferExplanation": "Yes, we accept bank wire transfer.<br />After sending the license fee via bank transfer, email us at info@abp.io your receipt and the type of license requested. Our international bank account information:",
    "HowToUpgrade": "How to upgrade existing applications when a new version is available?",
    "HowToUpgradeExplanation1": "When you create a new application using ABP Commercial, all the modules and the theme are used as NuGet and NPM packages. So, you can easily upgrade the packages when a new version is available.",
    "HowToUpgradeExplanation2": "In addition to the standard NuGet/NPM upgrades, <a href=\"{0}\">ABP CLI</a> provides an update command that automatically finds and upgrades all ABP related packages in your solution.",
    "DatabaseSupport": "Which database systems are supported?",
    "DatabaseSupportExplanation": "ABP Framework itself is database agnostic and can work with any database provider by its nature. See <a href=\"{0}\" target=\"_blank\">the data access document</a> for a list of currently implemented providers.",
    "UISupport": "Which UI frameworks are supported?",
    "Supported": "Supported",
    "UISupportExplanation": "ABP Framework itself is UI framework agnostic and can work with any UI framework. However, startup templates, module UIs and themes were not implemented for all UI frameworks. See <a href=\"{0}\">the getting started document</a> for the up-to-date list of UI options.",
    "MicroserviceSupport": "Does it support the micro-service architecture?",
    "MicroserviceSupportExplanation1": "One of the major goals of the ABP framework is to provide a convenient infrastructure to create micro-service solutions. See the <a href=\"{0}\">micro-service architecture</a> document to understand how it helps to create micro-service systems.",
    "MicroserviceSupportExplanation2": "All the ABP Commercial modules are designed to support micro-service deployment scenarios (with its own API and database) by following the <a href=\"{0}\">module development best practices</a> document.",
    "MicroserviceSupportExplanation3": "We provide a sample <a href=\"{0}\">micro-service demo solution</a>that demonstrates a micro-service architecture implementation to help you to create your own solution.",
    "MicroserviceSupportExplanation4": "So, the short answer is \"<strong>yes, it supports micro-service architecture</strong>\".",
    "MicroserviceSupportExplanation5": "However, a micro-service system is a solution and every solution will have different requirements, network topology, communication scenarios, authentication possibilities, database separation/sharing decisions, runtime configurations, 3rd party system integrations and many more.",
    "MicroserviceSupportExplanation6": "The ABP Framework and the ABP Commercial provides infrastructure for micro-service scenarios, micro-service compatible modules, samples and documentation to help you to build your own solution. But don't expect to directly download your dream solution pre-built for you. You will need to understand it and bring some parts together based on your requirements.",
    "WhereCanIDownloadSourceCode": "Where can I download source-code?",
    "WhereCanIDownloadSourceCodeExplanation": "You can download the source code of all ABP modules, Angular packages and themes via ABP Suite or ABP CLI. See <a href=\"{0}\">How to download source-code?</a>",
    "ComputerLimitation": "How many computers can a developer login when developing ABP?",
    "ComputerLimitationExplanation": "We specifically permit <strong>{0} computers</strong> per individual/licensed developer. Whenever there is a need for a developer to develop ABP Commercial products on a third machine, an e-mail should be sent to license@abp.io explaining the situation and we will then make the appropriate allocation in our system.",
    "RefundPolicy": "Do you have a refund policy?",
    "RefundPolicyExplanation": "You can request a refund within <strong>30 days</strong> of your license purchase. The Business and Enterprise license types have source-code download option, therefore refunds are not available for the Business and Enterprise (and any licenses that include a right to receive source-code). In addition, no refunds are made for renewals and second license purchases.",
    "HowCanIRefundVat": "How can I refund VAT?",
    "HowCanIRefundVatExplanation1": "If you made the payment using 2Checkout, you can refund VAT via your 2Checkout account:",
    "HowCanIRefundVatExplanation2": "Log in into your <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\">2Checkout</a> account",
    "HowCanIRefundVatExplanation3": "Find the appropriate order and press \"Refund Belated VAT\" (enter your VAT ID)",
    "HowCanIGetMyInvoice": "How can I get my invoice?",
    "HowCanIGetMyInvoiceExplanation": "There are 2 payment gateways for purchasing a license: PayU and 2Checkout. If you purchase your license through 2Checkout gateway, it sends the PDF invoice to your email address, see <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How-do-invoices-work\">2Checkout invoicing.</a> If you purchase through the PayU gateway or via bank wire transfer, we will prepare and send your invoice. You can request your invoice from the <a href=\"{0}\">organization management page.</a>",
    "Forum": "Forum",
    "SupportExplanation": "ABP Commercial licenses provides a premium forum support by a team consists of the ABP Framework experts.",
    "PrivateTicket": "Private Ticket",
    "PrivateTicketExplanation": "Enterprise License also includes a private support with e-mail and ticket system.",
    "AbpSuiteExplanation1": "ABP Suite allows you to build web pages in a matter of minutes. It's a .NET Core Global tool that can be installed from the command line.",
    "AbpSuiteExplanation2": "It can create a new ABP solution, generate CRUD pages from the database to the front-end. For technical overview see <a href=\"{0}\">the document</a>",
    "FastEasy": "Fast & Easy",
    "AbpSuiteExplanation3": "ABP Suite allows you to easily create CRUD pages. You just need to define your entity and its properties, let the rest to ABP Suite for you! ABP Suite generates all the necessary code for your CRUD page in a few seconds. It supports Angular, MVC and Blazor user interfaces.",
    "RichOptions": "Rich Options",
    "AbpSuiteExplanation4": "ABP Suite supports multiple UI options like <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\">Razor Pages</a> and <a href=\"https://angular.io\">Angular</a>.It also supports multiple databases like <a href=\"https://www.mongodb.com\">MongoDB</a> and all databases supported by <strong>EntityFramework Core</strong> (MS SQL Server, Oracle, MySql, PostgreSQL and <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\">more</a>).",
    "AbpSuiteExplanation5": "Good thing is that, you don't have to worry about those options. ABP Suite understands your project type and generates the code for your project and places the generated code in correct place in your project.",
    "SourceCode": "Source Code",
    "AbpSuiteExplanation6": "ABP Suite generates the source code for you! It doesn't generate magic files to generate the web page. ABP Suite generates the source code for <strong>Entity, Repository, Application Service, Code First Migration, JavaScript/TypeScript and CSHTML/HTML</strong> and necessary Interfaces as well. ABP Suite also generates the code according to <strong>Best Practices</strong> of software development, so you don't have to worry about generated code's quality.",
    "AbpSuiteExplanation7": "Since you have the source code of building blocks of the generated CRUD page in correct application layers, you can easily modify the source code and inject your custom/bussiness logic to the generated code.",
    "CrossPlatform": "Cross Platform",
    "AbpSuiteExplanation8": "ABP Suite is built with .NET Core and it is cross platform. It runs as a web application on your local computer. You can run it on <strong>Windows</strong>, <strong>Mac</strong> and <strong>Linux</strong>",
    "OtherFeatures": "Other Features",
    "OtherFeatures1": "Updates <strong>NuGet</strong> and <strong>NPM</strong> packages on your solution easily.",
    "OtherFeatures2": "Regenerates already generated pages from scratch.",
    "OtherFeatures3": "Creates new solutions",
    "ThanksForCreatingProject": "Thanks for Creating Your Project!",
    "HotToRunSolution": "How to run your solution?",
    "HotToRunSolutionExplanation": "See getting started document to learn how to configure and run your solution.",
    "GettingStarted": "Getting Started",
    "WebAppDevTutorial": "Web App Dev Tutorial",
    "WebAppDevTutorialExplanation": "See web application development tutorial document for a step by step development sample.",
    "Document": "Document",
    "UsingABPSuiteToCURD": "Using ABP Suite for CRUD Page Generation & Tooling",
    "SeeABPSuiteDocument": "See ABP Suite document to learn the usage of ABP Suite.",
    "AskQuestionsOnSupport": "You can ask questions on ABP Commercial Support.",
    "Documentation": "Documentation",
    "SeeModulesDocument": "See modules document for a list of all commercial (pro) modules and their documents.",
    "Pricing": "Pricing",
    "PricingExplanation": "Choose the features and functionality your business needs today. Easily upgrade as your business grows.",
    "Team": "Team",
    "Business": "Business",
    "Enterprise": "Enterprise",
    "Custom": "Custom",
    "IncludedDeveloperLicenses": "Included developer licenses",
    "CustomLicenceOrAdditionalServices": "Need custom licence or additional services?",
    "CustomOrVolumeLicense": "Custom or volume license",
    "LiveTrainingSupport": "Live training & support",
    "AndMore": "and more",
    "AdditionalDeveloperLicense": "Additional developer license",
    "ProjectCount": "Project count",
    "AllProModules": "All pro modules",
    "AllProThemes": "All pro themes",
    "AllProStartupTemplates": "All pro startup templates",
    "SourceCodeOfAllModules": "Source code of all modules",
    "SourceCodeOfAllThemes": "Source code of all themes",
    "PerpetualLicense": "Perpetual license",
    "UnlimitedServerDeployment": "Unlimited server deployment",
    "YearUpgrade": "1 year upgrade",
    "YearPremiumForumSupport": "1 year premium forum support",
    "ForumSupportIncidentCountYear": "Forum support incident count/year",
    "PrivateTicketEmailSupport": "Private ticket & email support",
    "BuyNow": "Buy Now",
    "PayViaAmexCard": "How can I pay via my AMEX card?",
    "PayViaAmexCardDescription": "The default payment gateway 'Iyzico' may decline some AMEX credit cards due to the security measures. In this case, you can pay through the alternative payment gateway '2Checkout'.",
    "ThankYou": "Thank you",
    "InvalidReCaptchaErrorMessage": "There was an error verifying reCAPTCHA. Please try again.",
    "CompanyName": "Company name",
    "YourCompanyName": "Your company name",
    "FirstName": "First name",
    "LastName": "Last name",
    "Optional": "Optional",
    "YourFirstName": "Your first name",
    "YourLastName": "Your last name",
    "SpecialOffer": "Special Offer",
    "SpecialOfferMessage": "Hurry up! Prices are valid for a limited time.",
    "DiscountRequest": "Discount Request",
    "DiscountRequestDescribeCustomerQuestion": "Which of the following describes you?",
    "DiscountRequestStudentEmailMessage": "Email Address must contain 'edu'.",
    "DiscountRequestDeveloperCount": "How many developers are you?",
    "DiscountRequestDeveloperCountExceedMessage": "We don't provide discounted license for companies that has over {0} developers.",
    "DiscountRequestOrganizationName": "Company/organization/school name",
    "Website": "Website",
    "GithubUsername": "GitHub username",
    "PhoneNumber": "Phone number",
    "Country": "Country",
    "DescribeABPCommercialUsage": "Describe the project you are planning to develop based on APB Commercial",
    "DiscountRequestCertifyInformationMessage": "I certify all information is true and correct.",
    "DiscountRequestReceived": "We have received your discount request.",
    "DiscountRequestStatusMessage": "We will respond to you after checking the information you have provided.",
    "MVCOrRazorPages": "MVC (Razor Pages)",
    "Angular": "Angular",
    "Blazor": "Blazor",
    "New": "New",
    "MongoDB": "MongoDB",
    "EBookDDD": "E-Book Domain Driven Design",
    "PracticalGuideForImplementingDDD": "This book is a practical guide for implementing the Domain Driven Design with the ABP Framework.",
    "IntroducingDDD": "Introducing Domain Driven Design",
    "DDDLayersAndCleanArchitecture": "DDD Layers & Clean Architecture",
    "LayeringOfADotnetSolution": "Layering of a .NET Solution",
    "ImplementingDDDBuildingBlocks": "Implementing DDD Building Blocks",
    "DomainVsApplicationLogic": "Domain Logic vs Application Logic",
    "SamplesAndDiscussions": "Samples & Discussions",
    "Free": "Free",
    "Download": "Download",
    "DDDEBook": "DDD E-book",
    "ImplementingDDD": "Implementing Domain Driven Design",
    "DDDBookExplanation": "A practical guide for implementing the Domain Driven Design with the ABP Framework.",
    "Overview": "Overview",
    "DDDBookPracticalGuide": "This is a practical guide for implementing the Domain Driven Design (DDD). While the implementation details rely on the ABP Framework infrastructure, core concepts, principles, and patterns are applicable in any kind of solution, even if it is not a .NET solution.",
    "TableOfContents": "Table of Contents",
    "IntroductionToImplementingDDD": "Introduction to Implementing Domain Driven Design",
    "WhatIsDDD": "What is Domain Driven Design?",
    "Implementation": "Implementation",
    "TheBigPicture": "The Big Picture",
    "TheBuildingBlock": "The Building Block",
    "ExampleUseCase": "Example Use Case",
    "DomainAndApplicationLogic": "Domain Logic & Application Logic",
    "Author": "Author",
    "PublishedOn": "Published on",
    "Page": "Page",
    "FreeEBook": "Free E-Book",
    "EBookSignInForDownload": "To download the e-book sign in",
    "SignIn": "Sign In",
    "Or": "Or",
    "TellUsAboutYourself": "Tell us little bit about yourself",
    "Surname": "Surname",
    "DoYouAgreePrivacyPolicy": "I agree to the <a href=\"/TermsConditions\">Terms & Conditions<a/> and <a href=\"/Privacy\">Privacy Policy</a>.",
    "VolosoftMarketingInformationMessage": "I would like information, tips, and offers about Solutions for Businesses and Organizations and other Volosoft products and services.",
    "VolosoftSharingInformationMessage": "I would like Volosoft to share my information with select partners so I can receive relevant information about their products and services.",
    "WeWillSendYouADownloadLink": "A link to download the e-book has been sent to {0}.<br/> Check your inbox / junk / spam boxes!",
    "InvalidFormInputs": "Please, type the valid information specified on the form.",
    "DDDBookEmailBody": "Thank you. <br /> To download your book, <a href=\"{0}\">click here</a>.",
    "FreeDDDEBook": "Free DDD E-Book",
    "StartFree": "Start free",
    "FreeTrial": "Free Trial",
    "AcceptsMarketingCommunications": " Yes, I`d like to receive ABP Commercial marketing communications.",
    "PurposeOfUsage": "Purpose of usage",
    "Industry": "Industry",
    "Choose": "- Choose -",
    "CompanyOrganizationName": "Company / Organization Name",
    "CompanySize": "Company Size",
    "Next": "Next",
    "StartTrial": "Start My Free Trial",
    "ContactUsIssues": "Contact us if you have any issues",
    "TrialActivatedWarning": "Dear {0}, a user is entitled to have only 1 free trial period. You already used your trial period.",
    "ActivationRequirement": "You are one step away from starting your free trial.<br>We have sent an email to <b>{0}</b> to activate your account. Check your inbox/junk/spam boxes!",
    "SaveAndDownload": "Save And Download",
    "CompanyNameValidationMessage": "Company name is too long!",
    "AddressValidationMessage": "Address is too long!",
    "TaxNoValidationMessage": "TAX/VAT No is too long!",
    "NotesValidationMessage": "Notes field is too long!",
    "CheckYourBillingInfo": "You can create your invoice only once! Check your billing information before creating your invoice.",
    "Volo.AbpIo.Commercial:030000": "You already used your trial period.",
    "Volo.AbpIo.Commercial:030001": "There is already an organization called \"{CompanyName}\"",
    "StartYourFreeTrial": "Start your free trial",
    "TrialLicenseModelInvalidErrorMessage": "One of the following fields are invalid: Country Name, Company Size, Industry or Purpose Of Usage.",
    "Trial": "Trial",
    "Purchased": "Purchased",
    "PurchaseLicense": "Purchase License",
    "PurchaseTrialLicenseMessage": "Your license expiration date is {0}. <br> If you want to continue using the projects you created during your free trial period, you need to change the license keys in your <code>appsettings.secrets.json</code> files. Here is your license key:",
    "TrialLicenseExpireMessage": "You are using the trial license and your trial license will expire on {0}.",
    "TryForFree": "Try For Free",
    "TrialLicenseExpiredInfo": "Your trial license period has expired!"
  }
}
