{
  "culture": "es",
  "texts": {
    "OrganizationManagement": "Gestión de la organización",
    "OrganizationList": "Lista organización",
    "Volo.AbpIo.Commercial:010003": "Tu no eres el propietario de esta organización!",
    "OrganizationNotFoundMessage": "Organización no encontrada!",
    "DeveloperCount": "Total desarrolladores asignados",
    "QuestionCount": "Total de preguntas restantes",
    "Unlimited": "Ilimitado",
    "Owners": "Propietarios",
    "Owner": "Dueño",
    "AddMember": "Añadir miembro",
    "AddNewOwner": "Agregar nuevo propietario",
    "AddNewDeveloper": "Agregar nuevo desarrollador",
    "UserName": "Nombre de usuario",
    "Name": "Nombre",
    "EmailAddress": "Dirección de Email",
    "Developers": "Desarrolladores",
    "LicenseType": "Tipo de licencia",
    "Manage": "Gestionar",
    "SetDefault": "Establecer por defecto",
    "DefaultOrganization": "Por defecto",
    "StartDate": "Fecha de inicio",
    "EndDate": "Fecha de fin",
    "Modules": "Módulos",
    "LicenseExtendMessage": "Tu fecha de finalización de tu licencia ha sido extendido a {0}",
    "LicenseUpgradeMessage": "Tu licencia esta actualizada a {0}",
    "LicenseExtendAdnUpgradeMessage": "Su licencia se extendió hasta el {0} y su plan de licencias se actualizó a {1}.",
    "LicenseAddDeveloperMessage": "{0} desarrolladores añadidos a tu licencia",
    "Volo.AbpIo.Commercial:010004": "No se pudo encontrar el usuario especificado. El usuario debe estar ya registrado.",
    "MyOrganizations": "Mis organizaciones",
    "ApiKey": "API Key",
    "UserNameNotFound": "No hay un usuario con el nombre de usuario {0}",
    "SuccessfullyAddedToNewsletter": "Gracias por suscribirte a nuestro boletín de noticias!",
    "MyProfile": "Mi perfil",
    "EmailNotValid": "Por favor, introduce una dirección de email válida.",
    "JoinOurMarketingNewsletter": "Únase a nuestro boletín de marketing",
    "WouldLikeToReceiveMarketingMaterials": "Me gustaría recibir materiales de marketing como ofertas de productos y ofertas especiales.",
    "StartUsingYourLicenseNow": "¡Empiece a usar su licencia ahora!",
    "WelcomePage": "Pagina de bienvenida",
    "UnsubscriptionExpireEmail": "Cancelar la suscripción a los correos electrónicos de recordatorio de la fecha de vencimiento de la licencia",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Esta suscripción de correo electrónico solo contiene un recordatorio de la fecha de vencimiento de su licencia.",
    "UnsubscribeFromLicenseExpireEmails": "Si no desea recibir los correos electrónicos sobre la fecha de vencimiento de su licencia, puede cancelar la suscripción en cualquier momento que desee.",
    "Unsubscribe": "Darse de baja",
    "NotOrganizationMember": "No eres miembro de ninguna organización.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Se anuló con éxito la suscripción",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Ya no recibirá correos electrónicos de recordatorio de la fecha de vencimiento de la licencia.",
    "IndexPageHeroSection": "<span class=\"first-line\"> Una </span> <span class=\"second-line\"> plataforma de desarrollo web completa </span> <span class=\"third-line\"> integrada <img src=\"{0}\" width = \"110\" class=\"ml-1\" /> marco </span>",
    "AbpCommercialShortDescription": "ABP Commercial proporciona módulos de aplicaciones prediseñados, herramientas de desarrollo rápido de aplicaciones, temas de interfaz de usuario profesionales, soporte premium y más.",
    "LiveDemo": "Demo en vivo",
    "LiveDemoLead": "<a href=\"{0}\">{1}</a> usando su cuenta ABP, <a href=\"{2}\">{3}</a> a abp.io.<br/>O complete el siguiente formulario para crear una demostración en vivo ahora",
    "ThereIsAlreadyAnAccountWithTheGivenEmailAddress": "Ya existe una cuenta con la dirección de correo electrónico especificada: <b>{0}</b><br/> Puede iniciar sesión con su cuenta para continuar.",
    "GetLicence": "Obtener una licencia",
    "Application": "Solicitud",
    "StartupTemplates": "Plantillas de inicio",
    "Startup": "Puesta en marcha",
    "Templates": "Plantillas",
    "Developer": "Desarrollador",
    "Tools": "Instrumentos",
    "Premium": "Prima",
    "PremiumSupport": "Soporte Premium",
    "PremiumForumSupport": "Soporte de foro premium",
    "UI": "Interfaz de usuario",
    "Themes": "Temas",
    "JoinOurNewsletter": "Suscríbase a nuestro boletín",
    "Send": "Enviar",
    "WhatIsABPFramework": "¿CUÁL ES EL MARCO ABP?",
    "OpenSourceBaseFramework": "Marco base de código abierto",
    "ABPFrameworkExplanation": "<p class=\"lead\"> ABP Commercial se basa en ABP Framework, un marco de aplicación web de código abierto y dirigido por la comunidad para ASP.NET Core. </p> <p> ABP Framework proporciona una excelente infraestructura para escribir, mantenible y extensible y código comprobable con las mejores prácticas. </p> <p> Desarrollado e integrado a herramientas populares que ya conoce. Curva de aprendizaje baja, fácil adaptación, cómodo desarrollo. </p>",
    "Modular": "Modular",
    "MicroserviceCompatible": "Compatible con microservicios",
    "DomainDrivenDesignInfrastructure": "Infraestructura de diseño basada en dominios",
    "MultiTenancy": "Multi Alquiler",
    "DistributedMessaging": "Mensajería distribuida",
    "DynamicProxying": "Proxying dinámico",
    "BackgroundJobs": "Trabajos en segundo plano",
    "AuditLogging": "Registro de auditoría",
    "BLOBStoring": "Almacenamiento BLOB",
    "BundlingMinification": "Agrupación y minificación",
    "AdvancedLocalization": "Localización avanzada",
    "ManyMore": "Mucho mas",
    "ExploreTheABPFramework": "Explore el marco de ABP",
    "WhyUseTheABPCommercial": "¿Por qué utilizar The ABP Commercial?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\"> La creación de aplicaciones web de nivel empresarial puede ser compleja y llevar mucho tiempo. </p> <p> ABP Commercial ofrece la infraestructura base perfecta necesaria para todos los ASP.NET Core modernos de nivel empresarial soluciones basadas. Desde el diseño hasta la implementación, todo el ciclo de desarrollo está potenciado por las funciones y módulos integrados de ABP. </p>",
    "StartupTemplatesShortDescription": "Las plantillas de inicio le permiten iniciar su proyecto en unos segundos.",
    "UIFrameworksOptions": "Opciones de marcos de interfaz de usuario;",
    "DatabaseProviderOptions": "Opciones de proveedores de bases de datos;",
    "PreBuiltApplicationModules": "Módulos de aplicación prediseñados",
    "PreBuiltApplicationModulesShortDescription": "Los requisitos de aplicación más comunes ya están desarrollados para usted como módulos reutilizables.",
    "Account": "Cuenta",
    "Blogging": "Blogging",
    "Identity": "Identidad",
    "IdentityServer": "Servidor de identidad",
    "Saas": "Saas",
    "LanguageManagement": "Manejo del idioma",
    "TextTemplateManagement": "Gestión de plantillas de texto",
    "See All Modules": "Ver todos los módulos",
    "ABPSuite": "Suite ABP",
    "AbpSuiteShortDescription": "ABP Suite es una herramienta complementaria a ABP Commercial.",
    "AbpSuiteExplanation": "Te permite crear páginas web en cuestión de minutos. Es una herramienta global de .NET Core que se puede instalar desde la línea de comandos. Puede crear una nueva solución ABP, generar páginas CRUD desde la base de datos al front-end.",
    "Details": "Detalles",
    "LeptonTheme": "Tema de Lepton",
    "ProfessionalModernUIThemes": "Temas de interfaz de usuario modernos y profesionales",
    "LeptonThemeExplanation": "Lepton proporciona una gama de temas de administración de Bootstrap que sirven como una base sólida para cualquier proyecto que requiera un panel de administración.",
    "DefaultTheme": "Tema predeterminado",
    "MaterialTheme": "Tema material",
    "Default2Theme": "Tema predeterminado 2",
    "DarkTheme": "Tema oscuro",
    "DarkBlueTheme": "Tema azul oscuro",
    "LightTheme": "Tema de luz",
    "ProudToWorkWith": "Orgulloso de trabajar con",
    "OurConsumers": "Miles de empresas y desarrolladores de más de 70 países en todo el mundo confían en ABP Commercial.",
    "JoinOurConsumers": "Únase a ellos y cree productos increíbles rápidamente.",
    "AdditionalServicesExplanation": "¿Necesitas servicios adicionales o personalizados? <strong> Nosotros y nuestros socios podemos proporcionar; </strong>",
    "CustomProjectDevelopment": "Desarrollo de proyectos personalizados",
    "CustomProjectDevelopmentExplanation": "Desarrolladores dedicados a sus proyectos personalizados.",
    "PortingExistingProjects": "Portar proyectos existentes",
    "PortingExistingProjectsExplanation": "Migrar sus proyectos heredados a la plataforma ABP.",
    "LiveSupport": "Soporte vital",
    "LiveSupportExplanation": "Opción de soporte remoto en vivo cuando lo necesite.",
    "Training": "Capacitación",
    "TrainingExplanation": "Formación dedicada a sus desarrolladores.",
    "OnBoarding": "Inducción",
    "OnBoardingExplanation": "Ayude a configurar sus entornos de desarrollo, CI y CD.",
    "PrioritizedTechnicalSupport": "Soporte técnico priorizado",
    "PremiumSupportExplanation": "Además del gran apoyo de la comunidad del marco ABP, nuestro equipo de soporte responde preguntas técnicas y problemas de los usuarios comerciales con alta prioridad.",
    "SeeTheSupportOptions": "Ver las opciones de soporte",
    "Contact": "Contacto",
    "TellUsWhatYouNeed": "Díganos lo que usted necesita.",
    "YourMessage": "Tu mensaje",
    "YourFullName": "Tu nombre completo",
    "FirstNameField": "Nombre de pila",
    "LastNameField": "Apellido",
    "EmailField": "Dirección de correo electrónico",
    "YourEmailAddress": "Tu correo electrónico",
    "ValidEmailAddressIsRequired": "Se requiere una dirección de correo electrónico válida.",
    "HowMayWeHelpYou": "¿Cómo podemos ayudarle?",
    "SendMessage": "Enviar mensaje",
    "Success": "Éxito",
    "WeWillReplyYou": "Recibimos su mensaje y nos pondremos en contacto a la brevedad.",
    "GoHome": "Vete a casa",
    "CreateLiveDemo": "Crear demostración en vivo",
    "CreateLiveDemoDescription": "Una vez que envíe este formulario, recibirá un correo electrónico con el enlace de su demostración.",
    "RegisterToTheNewsletter": "Regístrese para recibir el boletín informativo para recibir información sobre ABP.IO, incluidos nuevos lanzamientos, etc.",
    "EnterYourEmailOrLogin": "Ingrese su dirección de correo electrónico para crear su demostración o <a href=\"{0}\"> Iniciar sesión </a> con su cuenta existente.",
    "ApplicationTemplate": "Plantilla de aplicación",
    "ApplicationTemplateExplanation": "La plantilla de inicio de la aplicación se utiliza para crear una nueva aplicación web.",
    "EfCoreProvider": "Entity Framework (compatible con SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\"> y otros </a>)",
    "AlreadyIncludedInTemplateModules": "Los siguientes módulos ya están incluidos y configurados en esta plantilla:",
    "ApplicationTemplateArchitecture": "Esta plantilla de aplicación también admite una arquitectura por niveles donde la capa de interfaz de usuario, la capa de API y el servicio de autenticación están separados físicamente.",
    "SeeTheGuideOrGoToTheLiveDemo": "Consulte la guía para desarrolladores para obtener información técnica sobre esta plantilla o vaya a la demostración en vivo.",
    "DeveloperGuide": "Guía para desarrolladores",
    "ModuleTemplate": "Plantilla de módulo",
    "ModuleTemplateExplanation1": "¿Quiere crear un módulo y reutilizarlo en diferentes aplicaciones? Esta plantilla de inicio lo prepara todo para empezar a crear un <strong> módulo de aplicación </strong> reutilizable o un <strong> microservicio </strong>.",
    "ModuleTemplateExplanation2": "<p> Puede admitir marcos de interfaz de usuario únicos o múltiples, proveedores de bases de datos únicos o múltiples para un solo módulo. La plantilla de inicio está configurada para ejecutar y <strong> probar su módulo </strong> en una aplicación mínima además de la infraestructura de prueba de integración y unidad. </p> <p> Consulte la guía para desarrolladores para obtener información técnica sobre esta plantilla. </p>",
    "WithAllStyleOptions": "con todas las opciones de estilo",
    "Demo": "Manifestación",
    "SeeAllModules": "Ver todos los módulos",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) es una herramienta de línea de comandos para realizar algunas operaciones comunes para soluciones basadas en ABP.",
    "ABPSuiteEasilyCURD": "ABP Suite es una herramienta que le permite crear fácilmente páginas CRUD",
    "WeAreHereToHelp": "Estamos aquí para <span class=\"zero-text\"> Ayuda </span>",
    "BrowseOrAskQuestion": "Puede explorar nuestros temas de ayuda o buscar preguntas frecuentes, o puede hacernos una pregunta mediante el <a href=\"{0}\" class=\"text-success\"> formulario de contacto </a>.",
    "SearchQuestionPlaceholder": "Buscar en preguntas frecuentes",
    "WhatIsTheABPCommercial": "¿Qué es ABP Commercial?",
    "WhatAreDifferencesThanAbpFramework": "¿Cuáles son las diferencias entre ABP Framework de código abierto y ABP Commercial?",
    "AbpCommercialMetaTitle": "{0} | Comercial ABP",
    "AbpCommercialMetaDescription": "Una plataforma integral de desarrollo web en ABP Framework con módulos prediseñados, plantillas de inicio, herramientas de desarrollo rápido, temas de interfaz de usuario profesionales y soporte premium.",
    "ABPCommercialExplanation": "ABP Commercial es un conjunto de módulos, herramientas, temas y servicios premium creados sobre el <a target=\"_blank\" href=\"{0}\"> marco ABP </a> de código abierto. ABP Commercial está siendo desarrollado y respaldado por el mismo equipo que está detrás del marco ABP.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\"> marco ABP </a> es un marco de desarrollo de aplicaciones modular, temático y compatible con microservicios para ASP.NET Core. Proporciona una arquitectura completa y una infraestructura sólida para que pueda concentrarse en su propio código comercial en lugar de repetirse para cada nuevo proyecto. Se basa en las mejores prácticas de desarrollo de software y en herramientas populares que ya conoce. </p> <p> El marco ABP es completamente gratuito, de código abierto y dirigido por la comunidad. También proporciona un tema gratuito y algunos módulos prediseñados (por ejemplo, administración de identidad y administración de inquilinos). </p>",
    "VisitTheFrameworkVSCommercialDocument": "Visite el siguiente enlace para obtener más información <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial agrega los siguientes beneficios además del marco ABP;",
    "Professional": "Profesional",
    "UIThemes": "Temas de interfaz de usuario",
    "EnterpriseModules": "<a href=\"{0}\"> módulos de aplicación </a> predefinidos, ricos en funciones y listos para la empresa (p. Ej., Administración de Identity Server, administración de SaaS, administración de idiomas)",
    "ToolingToSupport": "Herramientas para respaldar su productividad de desarrollo (p. Ej., <a href=\"{0}\"> ABP Suite </a>)",
    "PremiumSupportLink": "<a href=\"{0}\" target=\"_blank\"> asistencia premium </a>",
    "WhatDoIDownloadABPCommercial": "¿Qué descargo cuando compro ABP Commercial?",
    "CreateUnlimitedSolutions": "Una vez que adquiera una licencia comercial de ABP, podrá crear soluciones ilimitadas como se describe en el documento <a href=\"{0}\"> Getting Started </a>.",
    "ABPCommercialSolutionExplanation": "Cuando crea una nueva aplicación, obtiene una solución de Visual Studio (una plantilla de inicio) basada en sus preferencias. La solución descargada tiene módulos comerciales y temas ya instalados y configurados para usted. Puede quitar un módulo preinstalado o agregar otro módulo si lo desea. Todos los módulos y temas se utilizan como paquetes NuGet/NPM de forma predeterminada.",
    "StartDevelopWithTutorials": "La solución descargada está bien diseñada y documentada. Puede comenzar a desarrollar su propio código comercial basado en él siguiendo <a href=\"{0}\"> los tutoriales </a>.",
    "TryTheCommercialDemo": "Puede probar <a href=\"{0}\"> la demostración </a> para ver una aplicación de muestra creada con la plantilla de inicio comercial de ABP.",
    "HowManyProducts": "¿Cuántos productos/soluciones diferentes puedo construir usando ABP Commercial?",
    "HowManyProductsExplanation": "No hay límite para crear un proyecto ABP. Puedes crear tantos proyectos como quieras, desarrollarlos y subirlos a diferentes servidores.",
    "HowManyDevelopers": "¿Cuántos desarrolladores pueden trabajar en ABP Commercial?",
    "HowManyDevelopersExplanation": "Las licencias comerciales de ABP son por desarrollador. Los diferentes tipos de licencias tienen diferentes límites de desarrollador. Sin embargo, puede agregar más desarrolladores a cualquier tipo de licencia cuando lo necesite. Consulte <a href=\"{0}\"> la página de precios </a> para conocer los tipos de licencia, los límites de desarrollador y los costos adicionales de desarrollador.",
    "ChangingLicenseType": "¿Puedo actualizar mi tipo de licencia más tarde?",
    "ChangingLicenseTypeExplanation": "Puede actualizar a una licencia superior pagando la diferencia dentro de su período de licencia activa. Cuando actualiza a un plan de licencia superior, obtiene los beneficios del nuevo plan, pero la actualización de la licencia no cambia la fecha de vencimiento de la licencia. Además, también puede agregar nuevos puestos de desarrollador a su licencia existente, consulte \"¿Cuántos desarrolladores pueden trabajar en ABP Commercial?\"",
    "LicenseExtendUpgradeDiff": "¿Cuál es la diferencia entre ampliar y actualizar la licencia?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Ampliación:</strong> Al ampliar/renovar su licencia, seguirá recibiendo soporte premium y actualizaciones mayores o menores para los módulos y temas. Además podrás seguir creando nuevos proyectos. Y aún podrá utilizar ABP Suite, que acelera su desarrollo. Cuando extiende su licencia, se agrega 1 año a la fecha de vencimiento de su licencia.<hr/> <strong>Actualización:</strong> al actualizar su licencia, se le ascenderá a un plan de licencia superior, lo que le permitirá obtener beneficios adicionales. Consulte la <a href=\"/pricing\">tabla de comparación de licencias</a> para ver las diferencias entre los planes de licencia. <strong>Por otro lado, cuando actualice, ¡la fecha de vencimiento de su licencia no cambiará!</strong> Para extender la fecha de finalización de su licencia, debe extender su licencia.",
    "LicenseRenewalCost": "¿Cuál es el costo de renovación de la licencia después de 1 año?",
    "LicenseRenewalCostExplanation": "El precio de renovación (extensión) de la Licencia de equipo estándar es de $ {0}, la Licencia comercial estándar es de $ {1} y la Licencia empresarial estándar es de $ {2}. Si ya es cliente, <a href='{3}' target='_blank'> inicie sesión en su cuenta </a> para revisar los precios de renovación disponibles.",
    "HowDoIRenewMyLicense": "¿Cómo renuevo mi licencia?",
    "HowDoIRenewMyLicenseExplanation": "Puede renovar su licencia navegando a la <a href='{0}' target='_blank'> página de administración de la organización </a>. Para aprovechar nuestras tarifas de renovación anticipada con descuento, asegúrese de renovar antes de que expire su licencia. Sin embargo, no se preocupe por no saber cuándo se cierra su oportunidad de Renovación Temprana. Recibirá 3 correos electrónicos de recordatorio antes de que expire su suscripción. Los enviaremos 30 días, 7 días y 1 día antes del vencimiento.",
    "IsSourceCodeIncluded": "¿Mi licencia incluye el código fuente de los módulos y temas comerciales?",
    "IsSourceCodeIncludedExplanation1": "Depende del tipo de licencia que haya comprado:",
    "IsSourceCodeIncludedExplanation2": "<strong> Equipo </strong>: su solución usa los módulos y los temas como paquetes NuGet y NPM. No incluye su código fuente. De esta manera, puede actualizar fácilmente estos módulos y temas siempre que haya una nueva versión disponible. Sin embargo, no puede obtener el código fuente de los módulos y los temas.",
    "IsSourceCodeIncludedExplanation3": "<strong> Business/Enterprise </strong>: además de la licencia Team, puedes descargar el código fuente de cualquier módulo o tema que necesites. Incluso puede eliminar las referencias del paquete NuGet/NPM para un módulo en particular y agregar su código fuente directamente a su solución para cambiarlo por completo.",
    "IsSourceCodeIncludedExplanation4": "<p> Incluir el código fuente de un módulo en su solución le brinda la máxima libertad para personalizar ese módulo. Sin embargo, entonces no será posible actualizar automáticamente el módulo cuando se lance una nueva versión. </p> <p> Ninguna de las licencias incluye el código fuente de ABP Suite, que es una herramienta externa que genera código para usted y ayuda para su desarrollo. </p> <p> Consulte <a href=\"{0}\"> la página de precios </a> para ver otras diferencias entre los tipos de licencia. </p>",
    "ChangingDevelopers": "¿Puedo cambiar los desarrolladores registrados de mi organización en el futuro?",
    "ChangingDevelopersExplanation": "Además de agregar nuevos desarrolladores a su licencia, también puede cambiar los desarrolladores existentes (puede eliminar un desarrollador y agregar uno nuevo al mismo puesto) sin ningún costo adicional.",
    "WhatHappensWhenLicenseEnds": "¿Qué sucede cuando finaliza el período de mi licencia?",
    "WhatHappensWhenLicenseEndsExplanation1": "La licencia Comercial ABP es una <a href=\"{0}\" target=\"_blank\">licencia perpetua</a> . Una vez que caduque su licencia, podrá continuar desarrollando su proyecto. Y no estás obligado a renovar tu licencia. Su licencia viene con un plan de soporte y actualización de un año listo para usar. Para continuar obteniendo nuevas funciones, mejoras de rendimiento, correcciones de errores, soporte y continuar usando ABP Suite, debe renovar su licencia. Cuando su licencia caduque;",
    "WhatHappensWhenLicenseEndsExplanation2": "No puede crear nuevas soluciones utilizando ABP Commercial, pero puede continuar desarrollando sus aplicaciones existentes para siempre.",
    "WhatHappensWhenLicenseEndsExplanation3": "Podrá obtener actualizaciones para los módulos y temas dentro de su versión MENOR (excepto las versiones RC o Preview). Por ejemplo, si está utilizando la versión 3.2.0 de un módulo, aún puede obtener actualizaciones para la versión 3.2.x (v3.2.1, v3.2.5... etc.) de ese módulo. Pero no puede obtener actualizaciones para la próxima versión principal o secundaria (como v3.3.0, v3.3.3, 4.xx, etc.). Por ejemplo, cuando su licencia expiró, la última versión fue la v4.4.3 y, posteriormente, publicó tanto la versión 4.4.4 como la versión 4.5.0, podrá acceder a la v4.4.X pero no podrá acceder a la v4.5.X.",
    "WhatHappensWhenLicenseEndsExplanation4": "No puede instalar nuevos módulos y temas agregados a la plataforma ABP Commercial una vez finalizada su licencia.",
    "WhatHappensWhenLicenseEndsExplanation5": "No puede utilizar la Suite ABP.",
    "WhatHappensWhenLicenseEndsExplanation6": "Ya no podrás obtener el <a href=\"{0}\">soporte premium</a> .",
    "WhatHappensWhenLicenseEndsExplanation7": "Puede extender (renovar) su licencia si desea continuar obteniendo estos beneficios. Si extiende su licencia dentro de <strong>los {3} días</strong> posteriores a su vencimiento, se aplicarán los siguientes descuentos: Licencia de equipo {0}; Licencia comercial {1}; Licencia empresarial {2}.",
    "discountForYears": "{0}% de descuento por {1} año(s)",
    "WhatHappensWhenLicenseEndsExplanation8": "Los proyectos ABP que generó no se almacenan en nuestros servidores. Por lo tanto, es su responsabilidad conservar el código fuente que descargue. Cuando su licencia caduque, no habrá forma de obtener el código fuente del proyecto ABP generado.",
    "WhenShouldIRenewMyLicense": "¿Cuándo debo renovar mi licencia?",
    "WhenShouldIRenewMyLicenseExplanation": "Si renueva su licencia dentro de <strong> {3} dias </strong> después de su vencimiento, se aplicarán los siguientes descuentos: Licencia de equipo {0}% de descuento, Licencia comercial {1}% de descuento, Licencia empresarial {2}% de descuento . Si renueva su licencia <strong> {3} dias </strong> después de la fecha de vencimiento de su licencia, el precio de renovación será el mismo que el precio de compra de la licencia y no habrá descuento en su renovación.",
    "TrialPlan": "¿Tiene un plan de prueba?",
    "TrialPlanExplanation": "Sí, para iniciar su prueba gratuita, comuníquese con <a href=\"mailto:marketing@volosoft.com?subject=ABP Commercial — Trial License Request\">marketing@volosoft.com</a> . También ofrecemos una garantía de devolución de dinero de 30 días para la licencia Team, ¡sin hacer preguntas! Puede solicitar un reembolso completo dentro de los primeros 30 días de la compra de la licencia. Ofrecemos un reembolso del 60 % en un plazo de 30 días para licencias Business y Enterprise. Esto se debe a que las licencias Business y Enterprise contienen el código fuente completo de todos los módulos y temas.",
    "DoYouAcceptBankWireTransfer": "¿Aceptan transferencia bancaria?",
    "DoYouAcceptBankWireTransferExplanation": "Sí, aceptamos transferencia bancaria. <br /> Después de enviar la tarifa de la licencia mediante transferencia bancaria, envíenos un correo electrónico a accounting@abp.io con su recibo y el tipo de licencia solicitada. Nuestra información de cuenta bancaria internacional:",
    "HowToUpgrade": "¿Cómo actualizar las aplicaciones existentes cuando hay una nueva versión disponible?",
    "HowToUpgradeExplanation1": "Cuando crea una nueva aplicación utilizando ABP Commercial, todos los módulos y el tema se utilizan como paquetes NuGet y NPM. Por lo tanto, puede actualizar fácilmente los paquetes cuando haya una nueva versión disponible.",
    "HowToUpgradeExplanation2": "Además de las actualizaciones estándar de NuGet/NPM, <a href=\"{0}\"> ABP CLI </a> proporciona un comando de actualización que busca y actualiza automáticamente todos los paquetes relacionados con ABP en su solución.",
    "DatabaseSupport": "¿Qué sistemas de bases de datos son compatibles?",
    "DatabaseSupportExplanation": "ABP Framework en sí es independiente de la base de datos y puede trabajar con cualquier proveedor de base de datos por su naturaleza. Consulte <a href=\"{0}\" target=\"_blank\"> el documento de acceso a datos </a> para obtener una lista de los proveedores implementados actualmente.",
    "UISupport": "¿Qué marcos de interfaz de usuario son compatibles?",
    "Supported": "Soportado",
    "UISupportExplanation": "ABP Framework en sí es independiente del marco de interfaz de usuario y puede funcionar con cualquier marco de interfaz de usuario. Sin embargo, las plantillas de inicio, las IU de módulo y los temas no se implementaron para todos los marcos de IU. Consulte <a href=\"{0}\"> el documento de introducción </a> para obtener la lista actualizada de opciones de IU.",
    "MicroserviceSupport": "¿Es compatible con la arquitectura de microservicio?",
    "MicroserviceSupportExplanation1": "Uno de los principales objetivos del marco ABP es proporcionar una infraestructura conveniente para crear soluciones de microservicio. Consulte el documento <a href=\"{0}\"> arquitectura de microservicio </a> para comprender cómo ayuda a crear sistemas de microservicio.",
    "MicroserviceSupportExplanation2": "Todos los módulos comerciales de ABP están diseñados para admitir escenarios de implementación de microservicios (con su propia API y base de datos) siguiendo el documento de <a href=\"{0}\"> mejores prácticas de desarrollo de módulos </a>.",
    "MicroserviceSupportExplanation3": "Proporcionamos una <a href=\"{0}\"> solución de demostración de microservicio </a> de muestra que demuestra una implementación de arquitectura de microservicio para ayudarlo a crear su propia solución.",
    "MicroserviceSupportExplanation4": "Entonces, la respuesta corta es \"<strong> sí, es compatible con la arquitectura de microservicio </strong>\".",
    "MicroserviceSupportExplanation5": "Sin embargo, un sistema de microservicio es una solución y cada solución tendrá diferentes requisitos, topología de red, escenarios de comunicación, posibilidades de autenticación, decisiones de separación/uso compartido de bases de datos, configuraciones de tiempo de ejecución, integraciones de sistemas de terceros y muchos más.",
    "MicroserviceSupportExplanation6": "ABP Framework y ABP Commercial proporcionan infraestructura para escenarios de microservicio, módulos compatibles con microservicio, muestras y documentación para ayudarlo a crear su propia solución. Pero no espere descargar directamente la solución de sus sueños preconstruida para usted. Deberá comprenderlo y unir algunas partes según sus requisitos.",
    "WhereCanIDownloadSourceCode": "¿Dónde puedo descargar el código fuente?",
    "WhereCanIDownloadSourceCodeExplanation": "Puede descargar el código fuente de todos los módulos ABP, paquetes angulares y temas a través de ABP Suite o ABP CLI. Consulte <a href=\"{0}\"> ¿Cómo descargar el código fuente? </a>",
    "ComputerLimitation": "¿Cuántas computadoras puede iniciar sesión un desarrollador al desarrollar ABP?",
    "ComputerLimitationExplanation": "Permitimos específicamente <strong> {0} computadoras </strong> por individuo/desarrollador con licencia. Siempre que sea necesario que un desarrollador desarrolle productos ABP Commercial en una tercera máquina, se debe enviar un correo electrónico a license@abp.io explicando la situación y luego haremos la asignación apropiada en nuestro sistema.",
    "RefundPolicy": "¿Tiene una política de reembolso?",
    "RefundPolicyExplanation": "Puede solicitar un reembolso dentro de los <strong> 30 días </strong> posteriores a la compra de su licencia. Los tipos de licencia Business y Enterprise tienen la opción de descargar el código fuente, por lo tanto, los reembolsos no están disponibles para Business y Enterprise (y cualquier licencia que incluya el derecho a recibir el código fuente). Además, no se realizan reembolsos por renovaciones y compras de segundas licencias.",
    "HowCanIRefundVat": "¿Cómo puedo devolver el IVA?",
    "HowCanIRefundVatExplanation1": "Si realizó el pago mediante 2Checkout, puede reembolsar el IVA a través de su cuenta 2Checkout:",
    "HowCanIRefundVatExplanation2": "Inicie sesión en su cuenta de <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\"> 2Checkout </a>",
    "HowCanIRefundVatExplanation3": "Busque el pedido correspondiente y presione \"Reembolsar IVA tardío\" (ingrese su ID de IVA)",
    "HowCanIGetMyInvoice": "¿Cómo puedo obtener mi factura?",
    "HowCanIGetMyInvoiceExplanation": "Hay 2 pasarelas de pago para comprar una licencia: Iyzico y 2Checkout. Si compra su licencia a través de la puerta de enlace 2Checkout, envía la factura en PDF a su dirección de correo electrónico, consulte <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How- do-invoices-work \"> 2Facturación de pago. </a> Si compras a través de la pasarela de Iyzico, con un enlace de compra personalizado o mediante transferencia bancaria, prepararemos y enviaremos tu factura. Puede solicitar o descargar su factura desde la <a href=\"{0}\"> página de administración de la organización </a>. ¡Antes de contactarnos para la factura, consulte la página de administración de su organización!",
    "Forum": "Foro",
    "SupportExplanation": "Las licencias comerciales de ABP proporcionan un soporte de foro premium por parte de un equipo formado por expertos en ABP Framework.",
    "PrivateTicket": "Entrada privada",
    "PrivateTicketExplanation": "Enterprise License también incluye un soporte privado con correo electrónico y sistema de tickets.",
    "AbpSuiteExplanation1": "ABP Suite le permite crear páginas web en cuestión de minutos. Es una herramienta global de .NET Core que se puede instalar desde la línea de comandos.",
    "AbpSuiteExplanation2": "Puede crear una nueva solución ABP, generar páginas CRUD desde la base de datos al front-end. Para obtener una descripción general técnica, consulte <a href=\"{0}\"> el documento </a>",
    "FastEasy": "Rápido y Fácil",
    "AbpSuiteExplanation3": "ABP Suite le permite crear fácilmente páginas CRUD. Solo necesita definir su entidad y sus propiedades, ¡deje el resto a ABP Suite por usted! ABP Suite genera todo el código necesario para su página CRUD en unos segundos. Es compatible con las interfaces de usuario Angular, MVC y Blazor.",
    "RichOptions": "Opciones ricas",
    "AbpSuiteExplanation4": "ABP Suite admite varias opciones de IU como <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\"> Razor Pages </a> y <a href=\"https://angular.io\">Angular </a>. También admite varias bases de datos como <a href=\"https://www.mongodb.com\"> MongoDB </a> y todas las bases de datos compatibles con <strong> EntityFramework Core </strong> (MS SQL Server, Oracle, MySql, PostgreSQL y <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\"> más </a>).",
    "AbpSuiteExplanation5": "Lo bueno es que no tienes que preocuparte por esas opciones. ABP Suite entiende su tipo de proyecto y genera el código para su proyecto y coloca el código generado en el lugar correcto en su proyecto.",
    "SourceCode": "Código fuente",
    "AbpSuiteExplanation6": "¡ABP Suite genera el código fuente por usted! No genera archivos mágicos para generar la página web. ABP Suite genera el código fuente para <strong> Entity, Repository, Application Service, Code First Migration, JavaScript/TypeScript y CSHTML/HTML </strong> y también las interfaces necesarias. ABP Suite también genera el código de acuerdo con las <strong> Mejores prácticas </strong> de desarrollo de software, por lo que no tiene que preocuparse por la calidad del código generado.",
    "AbpSuiteExplanation7": "Dado que tiene el código fuente de los bloques de construcción de la página CRUD generada en las capas de aplicación correctas, puede modificar fácilmente el código fuente e inyectar su lógica personalizada/empresarial al código generado.",
    "CrossPlatform": "Plataforma cruzada",
    "AbpSuiteExplanation8": "ABP Suite está construido con .NET Core y es multiplataforma. Se ejecuta como una aplicación web en su computadora local. Puede ejecutarlo en <strong> Windows </strong>, <strong> Mac </strong> y <strong> Linux </strong>",
    "OtherFeatures": "Otras características",
    "OtherFeatures1": "Actualiza fácilmente los paquetes <strong>NuGet</strong> y <strong>NPM</strong> en su solución.",
    "OtherFeatures2": "Regenera páginas ya generadas desde cero.",
    "OtherFeatures3": "Crea nuevas soluciones",
    "ThanksForCreatingProject": "¡Gracias por crear su proyecto!",
    "HotToRunSolution": "¿Cómo ejecutar su solución?",
    "HotToRunSolutionExplanation": "Consulte el documento de introducción para aprender a configurar y ejecutar su solución.",
    "GettingStarted": "Empezando",
    "WebAppDevTutorial": "Tutorial para desarrolladores de aplicaciones web",
    "WebAppDevTutorialExplanation": "Consulte el documento tutorial de desarrollo de aplicaciones web para obtener una muestra de desarrollo paso a paso.",
    "Document": "Documento",
    "UsingABPSuiteToCURD": "Uso de ABP Suite para generación de páginas y herramientas CRUD",
    "SeeABPSuiteDocument": "Consulte el documento de ABP Suite para conocer el uso de ABP Suite.",
    "AskQuestionsOnSupport": "Puede hacer preguntas sobre el soporte comercial de ABP.",
    "Documentation": "Documentación",
    "SeeModulesDocument": "Consulte el documento de módulos para obtener una lista de todos los módulos comerciales(pro) y sus documentos.",
    "Pricing": "Precios",
    "PricingExplanation": "Elija las características y la funcionalidad que su empresa necesita hoy. Actualice fácilmente a medida que crece su negocio.",
    "Team": "Equipo",
    "Business": "Negocio",
    "Enterprise": "Empresa",
    "Custom": "Personalizado",
    "IncludedDeveloperLicenses": "Licencias de desarrollador incluidas",
    "CustomLicenceOrAdditionalServices": "¿Necesita una licencia personalizada o servicios adicionales?",
    "CustomOrVolumeLicense": "Licencia personalizada o por volumen",
    "LiveTrainingSupport": "Capacitación y soporte en vivo",
    "AndMore": "y más",
    "AdditionalDeveloperLicense": "Licencia de desarrollador adicional",
    "ProjectCount": "Recuento de proyectos",
    "AllProModules": "Todos los módulos pro",
    "AllProThemes": "Todos los temas profesionales",
    "AllProStartupTemplates": "Todas las plantillas de inicio profesionales",
    "SourceCodeOfAllModules": "Código fuente de todos los módulos",
    "SourceCodeOfAllThemes": "Código fuente de todos los temas",
    "PerpetualLicense": "Licencia perpetua",
    "UnlimitedServerDeployment": "Implementación de servidor ilimitada",
    "YearUpgrade": "1 año de actualización",
    "YearPremiumForumSupport": "Soporte de foro premium de 1 año",
    "ForumSupportIncidentCountYear": "Número de incidentes de soporte del foro/año",
    "PrivateTicketEmailSupport": "Soporte privado de tickets y correo electrónico",
    "BuyNow": "Compra ahora",
    "PayViaAmexCard": "¿Cómo puedo pagar con mi tarjeta AMEX?",
    "PayViaAmexCardDescription": "La pasarela de pago predeterminada 'Iyzico' puede rechazar algunas tarjetas de crédito AMEX debido a las medidas de seguridad. En este caso, puede pagar a través de la pasarela de pago alternativa '2Checkout'.",
    "ThankYou": "Gracias",
    "InvalidReCaptchaErrorMessage": "Se produjo un error al verificar reCAPTCHA. Inténtalo de nuevo.",
    "CompanyName": "Nombre de empresa",
    "YourCompanyName": "El nombre de tu compañía",
    "FirstName": "Nombre de pila",
    "LastName": "Apellido",
    "Optional": "Opcional",
    "YourFirstName": "Su nombre",
    "YourLastName": "Tu apellido",
    "SpecialOffer": "Oferta especial",
    "SpecialOfferMessage": "¡Apresúrate! Los precios son válidos por tiempo limitado.",
    "DiscountRequest": "Solicitud de descuento",
    "DiscountRequestDescribeCustomerQuestion": "Cuál de las siguientes te describe?",
    "DiscountRequestStudentEmailMessage": "La dirección de correo electrónico debe contener 'edu'.",
    "DiscountRequestDeveloperCount": "¿Cuántos desarrolladores eres?",
    "DiscountRequestDeveloperCountExceedMessage": "No proporcionamos licencias con descuento para empresas que tienen más de {0} desarrolladores.",
    "DiscountRequestOrganizationName": "Nombre de la empresa/organización/escuela",
    "Website": "Sitio web",
    "GithubUsername": "Nombre de usuario de GitHub",
    "PhoneNumber": "Número de teléfono",
    "Country": "País",
    "DescribeABPCommercialUsage": "Describe el proyecto que planeas desarrollar en base a APB Comercial",
    "DiscountRequestCertifyInformationMessage": "Certifico que toda la información es verdadera y correcta.",
    "DiscountRequestReceived": "Hemos recibido su solicitud de descuento.",
    "DiscountRequestStatusMessage": "Le responderemos después de verificar la información que nos ha proporcionado.",
    "MVCOrRazorPages": "MVC (páginas de Razor)",
    "Angular": "Angular",
    "Blazor": "Blazor",
    "New": "Nuevo",
    "MongoDB": "MongoDB",
    "EBookDDD": "Diseño basado en dominios de libros electrónicos",
    "PracticalGuideForImplementingDDD": "Este libro es una guía práctica para implementar el diseño basado en dominios con el marco ABP.",
    "IntroducingDDD": "Presentamos el diseño basado en dominios",
    "DDDLayersAndCleanArchitecture": "Capas DDD y arquitectura limpia",
    "LayeringOfADotnetSolution": "Creación de capas de una solución .NET",
    "ImplementingDDDBuildingBlocks": "Implementación de bloques de construcción de DDD",
    "DomainVsApplicationLogic": "Lógica de dominio frente a lógica de aplicación",
    "SamplesAndDiscussions": "Muestras y discusiones",
    "Free": "Gratis",
    "Download": "Descargar",
    "DDDEBook": "Libro electrónico DDD",
    "ImplementingDDD": "Implementación de diseño basado en dominios",
    "DDDBookExplanation": "Una guía práctica para implementar el diseño dirigido por dominios con el marco ABP.",
    "Overview": "Visión general",
    "DDDBookPracticalGuide": "Esta es una guía práctica para implementar el diseño controlado por dominio (DDD). Si bien los detalles de implementación se basan en la infraestructura ABP Framework, los conceptos, principios y patrones centrales son aplicables en cualquier tipo de solución, incluso si no es una solución .NET.",
    "TableOfContents": "Tabla de contenido",
    "IntroductionToImplementingDDD": "Introducción a la implementación del diseño basado en dominios",
    "WhatIsDDD": "¿Qué es el diseño basado en dominios?",
    "Implementation": "Implementación",
    "TheBigPicture": "El panorama",
    "TheBuildingBlock": "El bloque de construcción",
    "ExampleUseCase": "Ejemplo de caso de uso",
    "DomainAndApplicationLogic": "Lógica de dominio y lógica de aplicación",
    "Author": "Autor",
    "PublishedOn": "Publicado en",
    "Page": "Página",
    "FreeEBook": "Libro electrónico gratuito",
    "EBookSignInForDownload": "Para descargar el libro electrónico, inicie sesión",
    "SignIn": "Iniciar sesión",
    "Or": "O",
    "TellUsAboutYourself": "Cuéntanos un poco sobre ti",
    "Surname": "Apellido",
    "DoYouAgreePrivacyPolicy": "Acepto los <a href=\"/TermsConditions\"> Términos y condiciones <a/> y la <a href=\"/Privacy\"> Política de privacidad </a>.",
    "VolosoftMarketingInformationMessage": "Me gustaría obtener información, consejos y ofertas sobre soluciones para empresas y organizaciones y otros productos y servicios de Volosoft.",
    "VolosoftSharingInformationMessage": "Me gustaría que Volosoft compartiera mi información con socios selectos para poder recibir información relevante sobre sus productos y servicios.",
    "WeWillSendYouADownloadLink": "Se ha enviado un enlace para descargar el libro electrónico a {0}. <br/> ¡Revise su bandeja de entrada/correo no deseado/correo no deseado!",
    "InvalidFormInputs": "Por favor, ingrese la información válida especificada en el formulario.",
    "DDDBookEmailBody": "Gracias. <br /> Para descargar su libro, <a href=\"{0}\"> haga clic aquí </a>.",
    "StartFree": "Empiece gratis",
    "FreeTrial": "Prueba gratis",
    "AcceptsMarketingCommunications": " Sí, me gustaría recibir comunicaciones de marketing comercial de ABP.",
    "PurposeOfUsage": "Propósito de uso",
    "Choose": "- Escoger -",
    "CompanyOrganizationName": "Nombre de Empresa/Organización",
    "CompanySize": "Tamaño de la empresa",
    "Next": "próximo",
    "StartTrial": "Iniciar mi prueba gratuita",
    "ContactUsQuestions": "Póngase en contacto con nosotros si tiene alguna pregunta",
    "TrialActivatedWarning": "Un usuario tiene derecho a tener solo 1 período de prueba gratuito. Ya utilizó su período de prueba.",
    "ActivationRequirement": "Estás a un paso de comenzar tu prueba.<br> Después de verificar su información, activaremos su licencia. Una vez activada su licencia, le enviaremos un correo electrónico a <b>{0}</b> . ¡No te preocupes, este proceso no llevará mucho tiempo!",
    "SaveAndDownload": "Guardar y descargar",
    "CompanyNameValidationMessage": "¡El nombre de la empresa es demasiado largo!",
    "AddressValidationMessage": "¡La dirección es demasiado larga!",
    "TaxNoValidationMessage": "IMPUESTO/IVA ¡No es demasiado largo!",
    "NotesValidationMessage": "El campo de notas es demasiado largo.",
    "CheckYourBillingInfo": "¡Puedes crear tu factura solo una vez! Verifique su información de facturación antes de crear su factura.",
    "StartYourFreeTrial": "Comienza tu prueba gratuita",
    "TrialLicenseModelInvalidErrorMessage": "Uno de los siguientes campos no es válido: nombre del país, tamaño de la empresa, sector o finalidad de uso.",
    "Trial": "Prueba",
    "Purchased": "Comprado",
    "PurchaseNow": "Comprar ahora",
    "PurchaseTrialLicenseMessage": "La fecha de vencimiento de su licencia es {0}. <br> Si desea continuar usando los proyectos que creó durante su período de prueba gratuito, debe cambiar las claves de licencia en sus archivos <code> appsettings.secrets.json </code>. Aquí está su clave de licencia:",
    "TrialLicenseExpireMessage": "Está utilizando la licencia de prueba y su licencia de prueba caducará el {0}.",
    "TryForFree": "Prueba gratis",
    "TrialLicenseExpiredInfo": "¡Su período de licencia de prueba ha expirado!",
    "DowngradeLicensePlan": "¿Puedo cambiar a un plan de licencia inferior en el futuro?",
    "DowngradeLicensePlanExplanation": "No puede degradar su plan de licencia existente. Pero puede comprar un nuevo plan de licencia inferior y continuar su desarrollo con la nueva licencia. Después de comprar una licencia inferior, solo necesita iniciar sesión en su nuevo plan de licencia mediante el comando CLI de ABP: ` abp login<username> -o<organization> `.",
    "LicenseTransfer": "¿Se puede transferir una licencia de un desarrollador a otro?",
    "LicenseTransferExplanation": "¡Sí! Cuando compra una licencia, se convierte en el titular de la licencia y, por lo tanto, tendrá acceso a la página de administración de la organización. Una organización tiene roles de propietario y desarrollador. Los propietarios pueden administrar los puestos de desarrollador y asignar desarrolladores. Cada desarrollador asignado iniciará sesión mediante el comando CLI de ABP en el sistema y tendrá permisos de desarrollo y soporte.",
    "UserOwnerDescription": "El &quot;propietario&quot; de la organización es el administrador de esta cuenta. Él/ella gestiona la organización comprando licencias y asignando desarrolladores. Un &#39;Propietario&#39; no puede escribir código en los proyectos comerciales de ABP, no puede descargar los proyectos de muestra de ABP y no puede hacer preguntas en el sitio web de soporte. Si desea hacer todo esto, también debe agregarse como desarrollador.",
    "UserDeveloperDescription": "Los &#39;Desarrolladores&#39; pueden escribir código en los proyectos comerciales de ABP, descargar los proyectos de muestra de ABP y hacer preguntas en el sitio web de soporte. Por otro lado, los &#39;Desarrolladores&#39; no pueden gestionar esta organización.",
    "RemoveCurrentUserFromOrganizationWarningMessage": "Te estás eliminando de tu propia organización. Ya no podrás gestionar esta organización, ¿lo confirmas?",
    "RenewExistingOrganizationOrCreateNewOneMessage": "Puede renovar la licencia de su(s) organización(es) haciendo clic en el(los) botón(es) &quot;Extender ahora&quot; a continuación y así podrá extender la fecha de vencimiento de la licencia por 1 año. Si continúa pagando, tendrá una nueva organización. ¿Quieres continuar con una nueva organización?",
    "PurchaseTrialOrganizationOrCreateNewOneMessage": "Tienes una licencia de prueba. Para comprar su licencia de prueba, haga clic en el botón Comprar ahora. Si continúa pagando, tendrá una nueva organización. ¿Quieres continuar con una nueva organización?",
    "ExtendNow": "Ampliar ahora",
    "CreateNewOrganization": "Crear una nueva organización",
    "RenewLicenseEarly": "Si renuevo mi licencia antes, ¿obtendré el año completo?",
    "RenewLicenseEarylExplanation": "Cuando renueve su licencia antes de la fecha de vencimiento de su licencia, se agregará 1 año a la fecha de vencimiento de su licencia. Por ejemplo, si su licencia vence el {0} -06-06 y la renueva el {0} -01-01, la fecha de vencimiento de su nueva licencia será {1} -06-06.",
    "OpenSourceWebApplication": "Aplicación web de código abierto",
    "CompleteWebDevelopment": "Un desarrollo web completo",
    "ABPFrameworkDescription": "ABP Framework es una infraestructura completa para crear aplicaciones web modernas siguiendo las mejores prácticas y convenciones de desarrollo de software.",
    "CommunityDescription": "¡Comparta sus experiencias con el Marco ABP!",
    "GetStarted": "Empezar",
    "Views": "puntos de vista",
    "LatestPosts": "últimas publicaciones",
    "PreBuiltApplication": "Aplicación prediseñada",
    "DatabaseProviders": "Proveedores de bases de datos",
    "UIFrameworks": "Marcos de interfaz de usuario",
    "UsefulLinks": "Enlaces útiles",
    "Platform": "Plataforma",
    "CoolestCompaniesUseABPCommercial": "Las empresas más cool ya utilizan <span class=\"fw-bold\">ABP Comercial.</span>",
    "UserInterface": "Interfaz de usuario",
    "APIGateway": "Puerta de enlace API",
    "Microservice": "Microservicio",
    "Database": "Base de datos",
    "Architecture": "Arquitectura",
    "MicroserviceArchitectureExplanation": "Se trata de una arquitectura de solución completa que consta de múltiples aplicaciones, puertas de enlace API, microservicios y bases de datos para crear una solución de microservicios escalable con las últimas tecnologías.",
    "BusinessLogic": "Lógica de negocios",
    "DataAccessLayer": "Capa de acceso a datos",
    "Monolith": "Monolito",
    "ModularArchitectureExplanation": "Esta plantilla de inicio proporciona una arquitectura de solución en capas, modular y basada en DDD para crear una base de código limpia y fácil de mantener.",
    "SeeDetails": "Ver detalles",
    "SeeDocumentation": "Consulte la documentación",
    "Bs5Compatible": "Tema profesional compatible con Bootstrap 5, perfecto para su sitio web de administración.",
    "LeptonXTheme": "Tema LeptonX",
    "LeptonXDark": "LeptonX oscuro",
    "LeptonXLight": "Luz LeptonX",
    "LeptonXSemiDark": "LeptonX semioscuro",
    "BuiltOnBs5Library": "Construido en la biblioteca Bootstrap 5",
    "FullyCompatibleWithBs5": "100% compatible con la estructura HTML y clases CSS de Bootstrap 5",
    "ResponsiveAndMobileCompatible": "Responsivo, compatible con dispositivos móviles, soporte RTL",
    "ProvidesStylesForDatatables": "Proporciona estilos para tablas de datos.",
    "MultipleLayoutOptions": "Múltiples opciones de diseño",
    "EasilyInstallAndUpgrade": "Instale y actualice fácilmente",
    "SupportForum": "Foro de soporte",
    "TrustedBy": "Confiado por",
    "OurPricing": "Nuestros <span class=\"gradient-commercial\">precios</span>",
    "Plans": "Planes",
    "NameSurname": "Nombre Apellido",
    "Unspecified": "No especificado",
    "LicenceType": "Tipo de licencia",
    "LicenseDiscountWarning": "ESTA PÁGINA DE DESCUENTO UTILIZA EL CÓDIGO DE DESCUENTO PREDETERMINADO Y PARA DESARROLLADORES DE VOLOSOFT. LOS ENLACES DE COMPRA A CONTINUACIÓN NO FUNCIONAN.",
    "DiscountedLicenseExplanation": "¡Estos precios de licencia son para pequeñas empresas emergentes, desarrolladores individuales, estudiantes, organizaciones y proyectos sin fines de lucro!",
    "General": "General",
    "License": "Licencia",
    "Development": "Desarrollo",
    "Payment": "Pago",
    "WatchExplainerVideo": "¡Vamos a quedar! Ver vídeo explicativo",
    "LightDarkAndSemiDarkThemes": "Claro, Oscuro y Semioscuro",
    "LeptonXThemeExplanation": "Lepton Theme puede cambiar su tema según la configuración de su sistema.",
    "PRO": "PRO",
    "WelcomeToABPCommercial": "¡Bienvenidos a <span class=\"gradient-commercial\">Comercial ABP!</span>",
    "YourAccountDetails": "Detalles de su cuenta",
    "OrganizationName": "Nombre de la Organización",
    "AddDevelopers": "Agregar desarrolladores",
    "StartDevelopment": "Iniciar desarrollo",
    "CreateAndRunApplicationUsingStartupTemplate": "Aprenda a crear y ejecutar una nueva aplicación web utilizando la plantilla de inicio de ABP Commercial.",
    "CommunityDescription2": "<span class=\"fw-6\">community.abp.io</span> es un lugar donde las personas pueden compartir artículos relacionados con ABP. Busque artículos, tutoriales, ejemplos de código, estudios de casos y conozca gente en su mismo carril.",
    "UseABPSuiteExplanation": "Utilice ABP Suite para descargar el código fuente de los módulos y temas.",
    "ManageModulesWithSuite": "También puedes gestionar tus módulos ABP con Suite.",
    "LearnHowToInstallSuite": "Aprenda a instalar y utilizar ABP Suite.",
    "SeeMore": "Ver más",
    "SeeLess": "Ver menos",
    "LayeredSolutionStructure": "Estructura de solución en capas",
    "LayeredSolutionStructureExplanation": "La solución se basa en principios y patrones de diseño basado en dominios para aislar su lógica empresarial de la infraestructura y las integraciones y maximizar la capacidad de mantenimiento y reutilización del código. ABP Framework ya proporciona abstracciones, clases base y guías para implementar realmente DDD para su aplicación.",
    "MultipleUIOptions": "Múltiples opciones de interfaz de usuario",
    "MultipleUIOptionsExplanation": "Nos encantan las diferentes formas de crear la interfaz de usuario. Esta solución de inicio proporciona tres opciones de marco de interfaz de usuario diferentes para su aplicación empresarial.",
    "MultipleDatabaseOptions": "Múltiples opciones de base de datos",
    "MultipleDatabaseOptionsExplanation": "Tiene dos opciones de proveedores de bases de datos (además de usar ambas en una sola aplicación). Utilice Entity Framework Core para trabajar con cualquier base de datos relacional y, opcionalmente, utilice Dapper cuando necesite escribir consultas de bajo nivel para un mejor rendimiento. MongoDB es otra opción si necesita utilizar una base de datos NoSQL basada en documentos. Si bien estos proveedores están bien integrados, abstractos y preconfigurados, usted puede interactuar con cualquier sistema de base de datos que pueda usar con .NET.",
    "ModularArchitectureExplanation2": "La modularidad es un ciudadano de primera clase en la plataforma ABP.IO. Todas las funcionalidades de la aplicación se dividen en módulos opcionales bien aislados. La solución de inicio ya viene con los <a href=\"/modules\" class=\"text-primary\">módulos fundamentales de ABP Commercial</a> preinstalados. También puede crear sus propios módulos para construir un sistema modular para su propia aplicación.",
    "MultiTenancyForSaasBusiness": "Multi-Tenencia para su negocio SaaS",
    "MultiTenancyForSaasBusinessExplanation": "ABP Commercial proporciona un sistema multiinquilino completo de extremo a extremo para crear sus sistemas SaaS (software como servicio). Permite a los inquilinos compartir o tener sus propias bases de datos con un sistema de migración y creación de bases de datos sobre la marcha.",
    "MicroserviceStartupSolution": "Solución de inicio de microservicios",
    "MicroserviceArchitectureExplanation2": "Puede obtenerlo para su próximo sistema de microservicio para aprovechar la solución básica prediseñada y la experiencia refinada.",
    "PreIntegratedTools": "Preintegrado a herramientas populares",
    "PreIntegratedToolsExplanation": "La solución ya está integrada en las herramientas y tecnologías estándar de la industria, aunque usted siempre puede cambiarlas e integrarlas a sus herramientas favoritas.",
    "SingleSignOnAuthenticationServer": "Servidor de autenticación de inicio de sesión único",
    "SingleSignOnAuthenticationServerExplanation": "La solución tiene una aplicación de servidor de autenticación que utilizan las otras aplicaciones como un servidor de inicio de sesión único con funciones de administración de acceso API. Está basado en IdentityServer.",
    "WebAppsWithGateways": "2 aplicaciones web con 2 puertas de enlace API",
    "WebAppsWithGatewaysExplanation": "La solución contiene dos aplicaciones web, cada una tiene una puerta de enlace API dedicada (patrón BFF - Backend For Frontend).",
    "BackOfficeApplication": "Solicitud de Oficina Virtual",
    "BackOfficeApplicationExplanation": "La aplicación web real de su sistema, con múltiples opciones de marco de interfaz de usuario. Puede crear cualquier tipo de aplicación empresarial.",
    "LandingWebsite": "Sitio web de aterrizaje",
    "LandingWebsiteExplanation": "Un sitio web público/de aterrizaje genérico que se puede utilizar para varios propósitos, como presentar su empresa, vender sus productos, etc.",
    "ABPFrameworkEBook": "Libro electrónico Dominar el marco ABP",
    "MasteringAbpFrameworkEBookDescription": "Incluido dentro de su licencia comercial ABP",
    "FullName": "Nombre completo",
    "LicenseTypeNotCorrect": "¡El tipo de licencia no es correcto!",
    "Trainings": "Entrenamientos",
    "ChooseTrainingPlaceholder": "Elige la formación...",
    "DoYouNeedTrainings": "¿Necesitas una de estas formaciones?",
    "DoYouNeedTraining": "¿Necesita {0} formación?",
    "GetInTouchUs": "Póngase en contacto con nosotros",
    "ForMoreInformationClickHere": "Para obtener más información, haga clic <a href='{0}'>aquí.</a>",
    "ForMoreInformationClickHereByClass": "<span class=\"{1}\">Para obtener más información, haga clic</span> <a href='{0}'>aquí.</a>",
    "IsGetOnboardingTraining": "¿Le gustaría recibir capacitación en incorporación y desarrollo de aplicaciones web?",
    "OnboardingWebApplicationDevelopmentTrainingMessage": "Para programar su calendario de capacitación, comuníquese con {0} después de crear la organización",
    "CustomPurchaseMessage": "Para el siguiente paso, haga clic en {0} para contactarnos.",
    "Note": "Nota",
    "AdditionalNote": "Nota adicional",
    "OnboardingTrainingFaqTitle": "¿Tiene capacitación de incorporación de ABP?",
    "OnboardingTrainingFaqExplanation": "Sí, contamos con servicios de capacitación en ABP para ayudarlo a iniciar rápidamente su proyecto de ABP. Aprenderá sobre ABP de la mano de un miembro del equipo central de ABP y obtendrá las habilidades para comenzar su proyecto de ABP. En la capacitación de incorporación, le explicaremos cómo configurar su entorno de desarrollo, instalar las herramientas necesarias y crear una página CRUD completamente funcional. La capacitación será en vivo y se utilizará la aplicación Zoom, estamos abiertos a utilizar otras plataformas de reuniones en línea. El idioma de la formación será el inglés. También podrás hacer tus preguntas sobre ABP durante las sesiones. Se planificará una fecha y hora convenientes para ambas partes. Para obtener más información, contáctenos en <a href=\"mailto:info@abp.io\">info@abp.io</a> .",
    "AddBasket": "Añadir al carrito",
    "SendTrainingRequest": "Enviar solicitud de capacitación",
    "OnlyEnglishVersionOfThisDocumentIsTheRecentAndValid": "* La versión en inglés de este documento es la más actualizada y la versión en inglés prevalecerá en cualquier disputa.",
    "Pricing_Page_Title": "Precios y planes",
    "Pricing_Page_Description": "Elija las características y funcionalidades que su empresa necesita hoy. Compre una licencia comercial de ABP y cree proyectos ilimitados.",
    "Pricing_Page_HurryUp": "¡Apresúrate!",
    "Pricing_Page_BuyLicense": "¡Compra una licencia a <strong>precios de 2021</strong> hasta el 16 de enero!",
    "Pricing_Page_ValidForExistingCustomers": "También válido para clientes existentes y renovaciones de licencia.",
    "Pricing_Page_Hint1": "El precio de la licencia incluye una determinada cantidad de puestos de desarrollador. Si tiene más desarrolladores, siempre puede comprar puestos adicionales.",
    "Pricing_Page_Hint2": "Puede adquirir más licencias de desarrollador ahora o en el futuro. Las licencias se basan en puestos, por lo que puede transferir un puesto de un desarrollador a otro.",
    "Pricing_Page_Hint3": "Puede desarrollar una cantidad ilimitada de productos diferentes con su licencia.",
    "Pricing_Page_Hint4": "ABP Suite es una herramienta que le ayudará en su desarrollo para mejorar su productividad. Admite la generación de páginas CRUD y la creación de nuevos proyectos.",
    "Pricing_Page_Hint5": "Puede utilizar todos los módulos prediseñados en sus aplicaciones.",
    "Pricing_Page_Hint6": "Puede utilizar todos los temas prediseñados en sus aplicaciones.",
    "Pricing_Page_Hint7": "Una plantilla de inicio es una solución de Visual Studio que le permite poner en marcha su proyecto. Todos los módulos fundamentales se agregan y preconfiguran para usted.",
    "Pricing_Page_Hint8": "El libro electrónico Mastering ABP Framework explica cómo implementar soluciones .NET con las mejores prácticas. Se vende en Amazon.com y puede descargar el libro gratis con su licencia.",
    "Pricing_Page_Hint9": "Puede descargar el código fuente de cualquier módulo. Es posible que desee agregar el código fuente a su solución para realizar cambios radicales o simplemente conservarlo por razones de seguridad.",
    "Pricing_Page_Hint10": "Las licencias son para toda la vida. Eso significa que puede continuar desarrollando su aplicación para siempre. El acceso a la última versión y la obtención de soporte se otorgan dentro del período de licencia (1 año a menos que la renueve).",
    "Pricing_Page_Hint11": "¡Sin restricciones de implementación! Puede implementar en tantos servidores como desee, incluidos los servicios en la nube o locales.",
    "Pricing_Page_Hint12": "Puede actualizar los módulos, temas y herramientas a la última versión dentro de su período de licencia activo. Una vez que caduque su licencia, deberá renovarla para continuar recibiendo actualizaciones para corregir errores, nuevas funciones y mejoras.",
    "Pricing_Page_Hint13": "Puede obtener soporte premium por un año (puede renovar su licencia para extenderla).",
    "Pricing_Page_Hint14": "Las licencias Team y Business tienen un límite de recuento de incidentes/preguntas. Si compra licencias de desarrollador adicionales, su límite de incidentes aumenta en {0} (para la licencia de equipo) o {1} (para la licencia comercial) por desarrollador.",
    "Pricing_Page_Hint15": "Solo la licencia Enterprise incluye soporte privado. Puede enviar un correo electrónico directamente al equipo de ABP o hacer preguntas en support.abp.io con una opción de ticket privado. Las entradas privadas no son visibles al público.",
    "Pricing_Page_Hint16": "Puede descargar el código fuente de todos los temas de ABP. Es posible que desee agregar el código fuente a su solución para realizar cambios radicales o simplemente conservarlo por razones de seguridad.",
    "Pricing_Page_Testimonial_1": "ABP Commercial permitió a SC Ventures ofrecer una plataforma SaaS de base de datos de silo multiinquilino de nivel bancario en 9 meses para respaldar la financiación de la cadena de suministro de cuentas por cobrar y cuentas por pagar de facturas de valor significativo desde múltiples anclajes integrados. La modularidad de ABP hizo posible que el equipo realizara entregas en un tiempo récord, pasara todos los VAPT e implementara la pila de microservicios en contenedores a través de CI/CD completo y canalizaciones en producción.",
    "Pricing_Page_Testimonial_2": "Vemos el valor de utilizar ABP Commercial para reducir los gastos generales de los proyectos de desarrollo personalizados. El equipo puede unificar el patrón de código en diferentes flujos de proyectos. Vemos más potencial en el marco para que podamos crear nuevas funciones más rápido que antes. Confiamos en que veremos constantemente el valor de aprovechar ABP Commercial.",
    "Pricing_Page_Testimonial_3": "Nos encanta la ABP. No tenemos que escribir todo desde cero. Partimos de funciones listas para usar y solo nos enfocamos en lo que realmente necesitamos escribir. Además, ABP está bien diseñado y el código es de alta calidad con menos errores. Si tuviéramos que escribir todo lo que necesitáramos por nuestra cuenta, tal vez tendríamos que pasar años. Una cosa más que nos gusta es que la nueva versión, la solución de problemas o la mejora sale muy pronto cada dos semanas. No esperamos demasiado.",
    "Pricing_Page_Testimonial_4": "ABP Commercial es un producto fantástico que recomendaría. Productos comerciales al mercado para nuestros clientes en una única plataforma configurable. El impulso que el marco y las herramientas proporcionan a cualquier equipo vale cada centavo. ABP Commercial fue la mejor opción para nuestras necesidades.",
    "Pricing_Page_Testimonial_5": "ABP Framework no es solo un marco, sino que también es una guía para el desarrollo/gestión de proyectos, porque proporciona capacitación en DDD, GenericRepository, DI, Microservicio y Modularidad. Incluso si no va a utilizar el marco en sí, puede desarrollarlo usted mismo con docs.abp.io, que está bien preparado y profesionalmente (OpenIddict, Redis, Quartz, etc.). Debido a que muchas cosas están prediseñadas, acorta significativamente el tiempo de desarrollo del proyecto (como la página de inicio de sesión, el manejo de excepciones, el filtrado de datos, la siembra, el registro de auditoría, la localización, el controlador API automático, etc.). Como ejemplo de nuestra aplicación, he utilizado Local Event Bus para el control de stock. Por lo tanto, puedo gestionar los movimientos de pedidos escribiendo el controlador de stock. Es maravilloso no perder el tiempo con CreationTime, CreatorId. Se están llenando automáticamente.",
    "Pricing_Page_Testimonial_6": "ABP Framework es un buen marco, pero necesita tiempo para comprender las diferentes capas, clases y bibliotecas que utiliza (especialmente ABP). Pasé mucho tiempo leyendo el código base, pero ABP Commercial nos ahorró tiempo en la creación de las entidades especializadas (AR) del proyecto y el repositorio vinculado a cada una de ellas. También me gustó el enfoque utilizado en ABP, que es muy maduro; Sabemos que está basado en DDD y monolito.",
    "Pricing_Page_Testimonial_7": "Como startup, necesitamos iterar rápidamente y dedicar un tiempo mínimo a funciones estándar y no básicas. \n Nuestros ingenieros van desde ingenieros altamente experimentados hasta ingenieros junior, y necesitábamos un entendimiento común y una forma de compartir conocimientos técnicos y de dominio, ABP nos permitió hacerlo gracias a sus excelentes guías y documentación. \n Hay cosas de las que no hemos tenido que preocuparnos desde que funcionan de inmediato con ABP. \n ABP nos ayudó a agilizar la creación y el desarrollo rápidos de prototipos, en menos de cuatro semanas desde el inicio de la función hasta la producción. Con todas sus funciones premium incluidas en la licencia, ABP nos ha brindado &quot;Startup in a Box&quot; en el lado de ingeniería de software.",
    "Pricing_Page_Testimonial_8": "Recomendaría ABP comercial a todos aquellos que quieran ampliar la gama de productos disponibles para sus clientes. Es fantástico cuando es necesario utilizar un entorno empresarial distribuido (Angular, WPF, Win&amp;Linux). Además de sus productos, nos encanta su soporte, lo que hace que nuestro trabajo sea más rápido y sencillo. Ya sabemos que hemos encontrado un gran socio para el futuro que nos apoyará en la expansión de nuestro negocio.",
    "Pricing_Page_Testimonial_9": "Somos una empresa de 2 empleados que lleva más de 20 años en el negocio. \n En términos de nuestra experiencia con ABP Commercial, un cliente se acercó a nosotros y nos solicitó que desarrollemos una nueva aplicación de recursos humanos en un entorno moderno para reemplazar su aplicación Access de 25 años. Decidimos pasar de una solución de escritorio a una basada en web. \n \n En ese momento, teníamos muy poco conocimiento de aplicaciones web y .NET, pero nos topamos con ABP Commercial y, con la ayuda de ABP Framework, la documentación técnica y ABP Suite, pudimos no solo desarrollar la aplicación para las especificaciones del cliente pero también trabajar exitosamente dentro de un entorno .NET dentro de un año.",
    "AbpBookDownloadArea_ClaimYourEBook": "Solicite su libro electrónico <span class='gradient-framework'>Mastering ABP Framework</span>",
    "AddMemberModal_Warning_1": "Si el <strong>nombre de usuario</strong> que intenta agregar no existe en el sistema, solicite al miembro de su equipo que se registre en <a href='{0}/Account/Register'>{0}</a> y comparta el nombre de usuario de su cuenta con usted.",
    "MyOrganizations_Detail_WelcomeMessage": "Bienvenido a su organización, {0}",
    "MyOrganizations_Detail_OrganizationManagement": "<span class=\"gradient-commercial\">Gestión</span> de la organización",
    "OrganizationDisplayName": "Nombre para mostrar de la organización",
    "MyOrganizations_Detail_EditDisplayName": "Editar nombre para mostrar",
    "MyOrganizations_Detail_UpgradeYourLicense": "Actualice su licencia",
    "MyOrganizations_Detail_LicenseStartAndExpiryDate": "Fecha de inicio de la licencia - Fecha de vencimiento",
    "MyOrganizations_Detail_OwnerRightInfo": "Estás utilizando {0} de tus {1} derechos de propietario.",
    "MyOrganizations_Detail_CopyApiKey": "Copia la clave",
    "MyOrganizations_Detail_ApiKeyDescription": "La clave API es el token de los paquetes PRO alojados en <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{1}.</a>",
    "MyOrganizations_Detail_YourPrivateNugetSource": "Su fuente privada de NuGet es <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{0}</a>",
    "MyOrganizations_Detail_PrivateNugetSourceWarning": "Esto se agrega automáticamente como una fuente a NuGet.Config en su solución ABP. ¡No comparta su clave privada con usuarios no autorizados!",
    "MyOrganizations_Detail_DeveloperSeatInfo": "Está utilizando {0} de sus {1} puestos de desarrollador.",
    "NeedMoreSeatsForYourTeam": "¿Necesitas más asientos para tu equipo?",
    "MyOrganizations_Detail_PricePerYear": "{0} / por año",
    "MyOrganizations_Detail_PurchaseDeveloperSeats": "Comprar puestos de desarrollador",
    "Invoices": "Facturas",
    "RequestInvoice": "Solicitud de factura",
    "OrderNumber": "Número de orden",
    "Date": "Fecha",
    "Products": "Productos",
    "TotalPrice": "Precio total",
    "ThereIsNoInvoice": "no hay factura",
    "MyOrganizations_Detail_PaymentProviderInfo": "Si compró su licencia a través de <i>{0}</i> gateway, envía la factura en PDF a su dirección de correo electrónico; consulte <a href=\"{1}\" target=\"_blank\">{0} facturación.</a>",
    "MyOrganizations_Detail_PayUInfo": "Si has comprado a través de la pasarela <i>de Iyzico</i> , haz clic en el botón &quot;Solicitar factura&quot; y rellena los datos de facturación.",
    "MyOrganizations_Detail_ConclusionInfo": "Su solicitud de factura concluirá dentro de {0} días hábiles.",
    "ExtendYourLicense": "Amplíe su licencia <span class=\"text-primary\">{0}</span>",
    "Continue": "Continuar",
    "PurchaseLicense": "Comprar {0} licencia",
    "DownloadInvoiceModal_DownloadInvoice": "Descargar factura",
    "DownloadInvoiceModal_SaveInformationOnlyOnce": "Puede guardar su información de facturación solo una vez.",
    "InvoiceModal_EnterCompanyName": "Introduzca el nombre legal de su empresa...",
    "InvoiceModal_EnterCompanyAddress": "Ingrese la dirección legal de su empresa...",
    "InvoiceModal_EnterTaxNumber": "Ingrese su número de IMPUESTO/IVA si está disponible...",
    "RequestInvoiceModal_EnterNotes": "Ingrese su mensaje adicional sobre su factura...",
    "PrePayment_PayWithIyzico": "Pagarás con Iyzico",
    "ContinueToCheckout": "Continuar a la comprobación",
    "PrePayment_IyzicoRedirectionInfo": "Serás redirigido a Pasarela de Pago Iyzico para completar tu compra de forma segura.",
    "PrePayment_IyzicoAcceptVisaAndMasterCard": "Iyzico acepta Visa y MasterCard.",
    "Purchase": "Compra",
    "AcceptTermsAndConditions": "He leído, entiendo y acepto la <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">política de privacidad</a> , <a href=\"{1}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">los términos y condiciones</a> y <a href=\"{2}\" target=\"_blank\" class=\"text-primary\">el EULA.</a>",
    "AcceptTermsAndConditionsWarningMessage": "Por favor acepte la política de privacidad y los términos y condiciones.",
    "SelectGatewayToContinue": "¡Seleccione una puerta de enlace para continuar!",
    "GatewaySelection_SelectGateway": "Seleccione una Pasarela de Pago",
    "GatewaySelection_RedirectionMessage": "A continuación, será redirigido al sitio web de la pasarela de pago seleccionada para realizar la transacción.",
    "PaymentSucceed_PaymentSuccessMessage": "Pago exitoso",
    "PaymentSucceed_ThanksForPurchase": "Gracias por su compra!",
    "PaymentSucceed_CreateYourOrganization": "Crea tu organización",
    "PaymentSucceed_AddMeAsDeveloper": "Yo también soy desarrollador, agrégame como desarrollador a mi organización.",
    "PaymentSucceed_CreateOrganization": "Crear organización",
    "PaymentSucceed_OrganizationDescription": "Una organización está formada por desarrolladores y propietarios. Los desarrolladores son usuarios que escriben código en el proyecto ABP y se beneficiarán del sitio web <a href=\"{0}\" target=\"_blank\">{1}</a> . Los propietarios son usuarios que asignan puestos de desarrollador y gestionan las licencias.",
    "PaymentSucceed_ViewOrganization": "Haga clic aquí para ver la organización",
    "Purchase_TotalAnnualPrice": "TOTAL <small class=\"opacity-50\">(cuota anual)</small>",
    "Purchase_TrainingPrice": "Precio de la formación",
    "Purchase_OnboardingTraining": "Capacitación en vivo sobre incorporación y desarrollo de aplicaciones web",
    "TotalDeveloperPrice": "Precio total del desarrollador",
    "Purchase_PricePerDeveloper": "<span>{0} {1}</span> por desarrollador",
    "Purchase_IncludedDeveloperInfo": "{0} {1} incluido.",
    "Purchase_LicenseExtraDeveloperPurchaseMessage": "La <span class=\"fw-bold\">licencia {0}</span> incluye {1} desarrolladores. Puede agregar desarrolladores adicionales.",
    "StartupTemplates_Page_Title": "Plantillas de inicio de ABP",
    "StartupTemplates_Page_Description": "ABP Commercial le permite crear soluciones con cualquier nivel de complejidad. Proporciona dos soluciones de inicio principales prediseñadas. Puede seleccionar el que se ajuste mejor a sus necesidades y crear su propia solución personalizada sobre él.",
    "MicroserviceStartupSolutionForDotnet": "Solución de inicio de microservicios para .NET",
    "MonolithSolutionForDotnet": "Solución monolítica (modular) para .NET",
    "TrainingDetailsHeaderInfo_TrainingHour": "{0} hora(s)",
    "Trainings_Content": "Contenido de la formación",
    "Trial_Page_StartYourFreeTrial": "Comienza tu <span class=\"gradient-commercial\">prueba gratuita</span>",
    "TrialLicenseFeatures": "Podrás beneficiarte de todas las funciones comerciales de ABP",
    "TrialPeriodDays": "Tendrás una licencia de equipo de {0} días",
    "TrialForumSupportIncident": "Tendrás {0} incidentes de soporte del foro",
    "Contact_Page_Title": "Contacto con el equipo de desarrollo de ABP",
    "Contact_Page_Description": "¡Póngase en contacto con el equipo de desarrollo de ABP si necesita ayuda o comparta sus pensamientos y opiniones! El equipo de soporte de ABP está listo para ayudar.",
    "Demo_Page_Title": "Crear una demostración",
    "Demo_Page_Description": "Cree una demostración gratuita para ver una aplicación de muestra creada con la plantilla de inicio comercial de ABP. No se repita sobre los requisitos de aplicación comunes.",
    "Discounted_Page_Title": "Precios con descuento",
    "Discounted_Page_Description": "Elija las características y funcionalidades que su empresa necesita hoy. Compre una licencia comercial de ABP y cree proyectos ilimitados",
    "Faq_Page_Title": "Preguntas frecuentes (FAQ)",
    "Faq_Page_Description": "¿Tiene usted alguna pregunta? Busca preguntas frecuentes o haznos una pregunta mediante el formulario de contacto.",
    "Faq_Page_SwiftCode": "Código SWIFT",
    "Faq_Page_BankName": "Nombre del banco",
    "Faq_Page_AccountName": "Nombre de la cuenta",
    "Faq_Page_AccountNumber": "Número de cuenta",
    "Faq_Page_Currency": "Divisa",
    "Faq_Page_VatNumber": "Número de valor agregado",
    "Faq_Page_OtherCurrenciesInfo": "Para otras monedas, ver <a href='{0}'>todas las cuentas</a>",
    "ProjectCreatedSuccess_Page_Title": "Tu proyecto creado",
    "ProjectCreatedSuccess_Page_Description": "¡Su proyecto ABP se creó con éxito!",
    "Suite_Page_Title": "Suite PAA",
    "Suite_Page_Description": "ABP Commercial proporciona herramientas de desarrollo rápido de aplicaciones para aumentar la productividad de los desarrolladores. ABP Suite le permite crear páginas CRUD fácilmente.",
    "Themes_Page_Title": "Temas ABP",
    "Themes_Page_Description": "ABP Commercial ofrece múltiples temas de interfaz de usuario modernos y profesionales. Cree una demostración gratuita para tener una vista rápida de cómo se ve la interfaz de usuario.",
    "Tools_Page_Title": "Herramientas de desarrollo rápido de aplicaciones",
    "Tools_Page_Description": "ABP Commercial proporciona herramientas de desarrollo rápido de aplicaciones para aumentar la productividad de los desarrolladores. ABP Suite le permite crear páginas CRUD fácilmente.",
    "DeveloperPrice": "Precio del desarrollador",
    "AdditionalDeveloperPaymentInfoSection_AdditionalDevelopers": "{0} <small>desarrolladores</small>",
    "LicenseRemainingDays": "durante <span>{0}</span> días",
    "ExtendPaymentInfoSection_Description": "Al ampliar/renovar su licencia, seguirá recibiendo <a href=\"{0}\" target=\"_blank\">soporte premium</a> . También podrá obtener actualizaciones mayores o menores para módulos y temas. Podrás seguir creando nuevos proyectos. Y aún podrá utilizar <a href=\"{1}\" target=\"_blank\">ABP Suite</a> , que acelera su desarrollo.",
    "LicenseRenewalPrice": "Precio de renovación de licencia",
    "LicensePrice": "Precio de licencia",
    "TrialLicensePaymentInfoSection_Description": "<strong>Compra de licencia:</strong> al comprar una licencia, seguirá recibiendo <a href=\"{0}\" target=\"_blank\" rel=\"noopener\">soporte premium</a> . También podrá obtener actualizaciones mayores o menores para módulos y temas. Podrás seguir creando nuevos proyectos. Y aún podrá utilizar <a href=\"{1}\" target=\"_blank\" rel=\"noopener\">ABP Suite</a> , que acelera su desarrollo.<br> Consulte la <a href=\"{2}\" target=\"_blank\" rel=\"noopener\">tabla de comparación de licencias</a> para comprobar las diferencias entre los tipos de licencia.",
    "SelectTargetLicense": "Seleccione la licencia de destino",
    "UpgradePaymentInfoSection_ExtendMyLicenseForOneYear": "Sí, extender la fecha de vencimiento de mi licencia por 1 año.",
    "UpgradePaymentInfoSection_WantToExtendLicense": "¿Quieres ampliar tu licencia por 1 año más?",
    "UpgradePaymentInfoSection_UpgradingWillNotExtendLicense": "¡La actualización no extenderá la fecha de vencimiento de su licencia!",
    "UpgradePaymentInfoSection_LicenseUpgradeDescription": "Al actualizar su licencia, se le ascenderá a un tipo de licencia superior, lo que le permitirá obtener beneficios adicionales. Consulte la <a href=\"/Pricing\" target=\"_blank\">tabla de comparación de licencias</a> para comprobar las diferencias entre los tipos de licencia.",
    "Landing_Page_CustomerStories": "Historias de clientes",
    "Landing_Page_OurGreatCustomers": "Nuestros grandes clientes",
    "Landing_Page_WebApplicationFramework": "Marco de aplicaciones web",
    "Landing_Page_WebDevelopmentPlatform": "Plataforma de desarrollo web",
    "Landing_Page_CompleteWebDevelopmentPlatform": "Plataforma completa de desarrollo web",
    "Landing_Page_TryFreeDemo": "Pruebe la demostración gratuita",
    "Landing_Page_StartingPointForWebApplications": "¡El punto de partida para aplicaciones web basadas en ASP.NET Core! Se basa en el marco ABP para el mejor desarrollo web.",
    "Landing_Page_AbpProvidesSoftwareInfrastructure": "ABP Framework proporciona una infraestructura de software para desarrollar excelentes aplicaciones web con las mejores prácticas.",
    "Landing_Page_MicroserviceCompatibleArchitecture": "Arquitectura compatible con microservicios",
    "Landing_Page_PreBuiltApplicationModulesAndThemes": "Temas y módulos de aplicaciones prediseñados",
    "Landing_Page_MultiTenantArchitecture": "Arquitectura multiinquilino",
    "Landing_Page_MultiTenancyDescription": "¡Aplicaciones SaaS simplificadas! Multiinquilino integrado desde la base de datos hasta la interfaz de usuario.",
    "Landing_Page_DDDIntroduction": "Diseñado y desarrollado en base a patrones y principios de DDD. Proporciona un modelo en capas para su aplicación.",
    "Landing_Page_CrossCuttingConcernsInfo": "Infraestructura completa para autorización, validación, manejo de excepciones, almacenamiento en caché, registro de auditoría, gestión de transacciones y más.",
    "Landing_Page_PreBuiltApplicationModules": "Módulos de aplicaciones prediseñados que incluyen los requisitos de aplicaciones web más comunes.",
    "Landing_Page_ChatModule": "Charlar",
    "Landing_Page_DocsModule": "Documentos",
    "Landing_Page_FileManagementModule": "Gestión de archivos",
    "Landing_Page_CustomerStory_1": "ABP Commercial permitió a SC Ventures ofrecer una plataforma SaaS de base de datos de silo multiinquilino de nivel bancario en 9 meses para respaldar la financiación de la cadena de suministro de cuentas por cobrar y cuentas por pagar de facturas de valor significativo desde múltiples anclajes integrados. La modularidad de ABP hizo posible que el equipo realizara entregas en un tiempo récord, pasara todos los VAPT e implementara la pila de microservicios en contenedores a través de CI/CD completo y canalizaciones en producción.",
    "Landing_Page_CustomerStory_2": "Vemos el valor de utilizar ABP Commercial para reducir los gastos generales de los proyectos de desarrollo personalizados. El equipo puede unificar el patrón de código en diferentes flujos de proyectos. Vemos más potencial en el marco para que podamos crear nuevas funciones más rápido que antes. Confiamos en que veremos constantemente el valor de aprovechar ABP Commercial.",
    "Landing_Page_CustomerStory_3": "Nos encanta la ABP. No tenemos que escribir todo desde cero. Partimos de funciones listas para usar y solo nos enfocamos en lo que realmente necesitamos escribir. Además, ABP está bien diseñado y el código es de alta calidad con menos errores. Si tuviéramos que escribir todo lo que necesitáramos por nuestra cuenta, tal vez tendríamos que pasar años. Una cosa más que nos gusta es que la nueva versión, la solución de problemas o la mejora sale muy pronto, \n , cada dos semanas. No esperamos demasiado.",
    "Landing_Page_CustomerStory_4": "ABP Commercial es un producto fantástico que recomendaría. Productos comerciales al mercado para nuestros clientes en una única plataforma configurable. El impulso que el marco y las herramientas proporcionan a cualquier equipo vale cada centavo. ABP Commercial fue la mejor opción para nuestras necesidades.",
    "Landing_Page_AdditionalServices": "Licencia personalizada o por volumen, incorporación, capacitación y soporte en vivo, desarrollo de proyectos personalizados, portabilidad de proyectos existentes y más...",
    "Landing_Page_IncludedDeveloperLicenses": "Incluye <strong>{0}</strong> licencias de desarrollador",
    "Landing_Page_SeeOnDemo": "Ver en demostración",
    "Landing_Page_LeptonThemes": "LeptonTemas",
    "Landing_Page_AccountModuleDescription_1": "Este módulo implementa el sistema de autenticación de una aplicación;",
    "Landing_Page_AccountModuleDescription_2": "Proporciona una página <strong>de inicio de sesión</strong> con el nombre de usuario y la contraseña.",
    "Landing_Page_AccountModuleDescription_3": "Proporciona una página <strong>de registro</strong> para crear una nueva cuenta.",
    "Landing_Page_AccountModuleDescription_4": "Proporciona una página <strong>de contraseña olvidada</strong> para enviar un enlace <strong>de restablecimiento de contraseña</strong> como correo electrónico.",
    "Landing_Page_AccountModuleDescription_5": "Proporciona funcionalidad <strong>de confirmación por correo electrónico</strong> con interfaz de usuario.",
    "Landing_Page_AccountModuleDescription_6": "Implementa autenticación <strong>de dos factores</strong> (SMS y correo electrónico).",
    "Landing_Page_AccountModuleDescription_7": "Implementa <strong>el bloqueo de usuarios</strong> (bloquea la cuenta durante el período de tiempo establecido cuando ocurre una cierta cantidad de inicios de sesión fallidos debido a credenciales no válidas dentro de un cierto intervalo de tiempo).",
    "Landing_Page_AccountModuleDescription_8": "Implementa la interfaz de usuario y la funcionalidad del servidor de autenticación <strong>de Identity Server</strong> .",
    "Landing_Page_AccountModuleDescription_9": "Permite <strong>cambiar entre inquilinos</strong> en un entorno multiinquilino.",
    "Landing_Page_AccountModuleDescription_10": "Permite cambiar el <strong>idioma de la interfaz de usuario</strong> de la aplicación.",
    "Landing_Page_AuditLoggingModuleDescription_1": "Este módulo proporciona la interfaz de usuario de informes de registros de auditoría para la infraestructura de auditoría. Permite buscar, filtrar y mostrar entradas de registros de auditoría y registros de cambios de entidades.",
    "Landing_Page_AuditLoggingModuleDescription_2": "Una entrada del registro de auditoría consta de datos críticos sobre cada solicitud de cliente:",
    "Landing_Page_AuditLoggingModuleDescription_3": "URL, navegador, dirección IP, nombre del cliente",
    "Landing_Page_AuditLoggingModuleDescription_4": "El usuario",
    "Landing_Page_AuditLoggingModuleDescription_5": "Método HTTP, código de estado de retorno HTTP",
    "Landing_Page_AuditLoggingModuleDescription_6": "Éxito/fracaso, detalles de la excepción si están disponibles",
    "Landing_Page_AuditLoggingModuleDescription_7": "Duración de la ejecución de la solicitud",
    "Landing_Page_AuditLoggingModuleDescription_8": "Las entidades han sido creadas, eliminadas o actualizadas en esta solicitud (con propiedades modificadas).",
    "Landing_Page_BloggingModuleDescription_1": "Este módulo agrega un blog simple a su aplicación ABP;",
    "Landing_Page_BloggingModuleDescription_2": "Permite crear múltiples blogs en una sola aplicación.",
    "Landing_Page_BloggingModuleDescription_3": "Admite el formato Markdown.",
    "Landing_Page_BloggingModuleDescription_4": "Permite escribir comentarios para una publicación.",
    "Landing_Page_BloggingModuleDescription_5": "Permite asignar etiquetas a las publicaciones del blog.",
    "Landing_Page_BloggingModuleDescription_6": "Vea el sitio web <a href=\"blog.abp.io\">blog.abp.io</a> como un ejemplo en vivo del módulo de blogs.",
    "Landing_Page_ChatModuleDescription_1": "Este módulo se utiliza para mensajería en tiempo real entre usuarios de la aplicación.",
    "Landing_Page_ChatModuleDescription_2": "Mensajería en tiempo real en la página de chat.",
    "Landing_Page_ChatModuleDescription_3": "Busque usuarios en la aplicación para nuevas conversaciones.",
    "Landing_Page_ChatModuleDescription_4": "Lista de contactos para conversaciones recientes.",
    "Landing_Page_ChatModuleDescription_5": "Notificaciones de mensajes nuevos cuando el usuario está mirando otra página.",
    "Landing_Page_ChatModuleDescription_6": "Insignia de recuento total de mensajes no leídos en el icono del menú.",
    "Landing_Page_ChatModuleDescription_7": "Recuento de mensajes no leídos para cada conversación.",
    "Landing_Page_ChatModuleDescription_8": "Conversaciones cargadas de pereza.",
    "Landing_Page_DocsModuleDescription_1": "Este módulo se utiliza para crear sitios web de documentación técnica;",
    "Landing_Page_DocsModuleDescription_2": "<strong>Integración incorporada de GitHub</strong> : escriba y administre documentos directamente en GitHub.",
    "Landing_Page_DocsModuleDescription_3": "Soporte <strong>de versiones</strong> integrado directamente a las versiones de GitHub.",
    "Landing_Page_DocsModuleDescription_4": "Admite <strong>varios idiomas</strong> (con soporte alternativo al idioma predeterminado).",
    "Landing_Page_DocsModuleDescription_5": "Admite los formatos <strong>Markdown</strong> y HTML.",
    "Landing_Page_DocsModuleDescription_6": "Proporciona una sección <strong>de navegación</strong> y de <strong>esquema</strong> .",
    "Landing_Page_DocsModuleDescription_7": "Permite alojar la documentación <strong>de múltiples proyectos</strong> en una sola aplicación.",
    "Landing_Page_DocsModuleDescription_8": "Enlaces al archivo en GitHub, para que cualquiera pueda contribuir fácilmente haciendo clic en el <strong>enlace Editar</strong> .",
    "Landing_Page_DocsModuleDescription_9": "Además de la fuente de GitHub, permite simplemente usar una carpeta como fuente de documentación.",
    "Landing_Page_FileManagementModuleDescription_1": "Cargue, descargue y organice archivos en una estructura de carpetas jerárquica.",
    "Landing_Page_FileManagementModuleDescription_2": "Este módulo se utiliza para cargar, descargar y organizar archivos en una estructura de carpetas jerárquica. También es compatible con inquilinos múltiples y puede determinar el límite de tamaño total para sus inquilinos.",
    "Landing_Page_FileManagementModuleDescription_3": "Este módulo se basa en el sistema <a href=\"https://docs.abp.io/en/abp/latest/Blob-Storing\">BLOB Storage</a> , por lo que puede utilizar diferentes proveedores de almacenamiento para almacenar el contenido del archivo.",
    "Landing_Page_IdentityModuleDescription_1": "Este módulo implementa el sistema de Usuario y Roles de una aplicación;",
    "Landing_Page_IdentityModuleDescription_2": "Construido sobre la biblioteca <a href=\"https://docs.microsoft.com/en-us/aspnet/core/security/authentication/identity\">ASP.NET Core Identity de Microsoft</a> .",
    "Landing_Page_IdentityModuleDescription_3": "Administrar <strong>roles</strong> y <strong>usuarios</strong> en el sistema. Un usuario puede tener <strong>múltiples roles</strong> .",
    "Landing_Page_IdentityModuleDescription_4": "Establezca <strong>permisos</strong> en niveles de rol y usuario.",
    "Landing_Page_IdentityModuleDescription_5": "Habilite/deshabilite <strong>la autenticación de dos factores</strong> y <strong>el bloqueo</strong> de usuario por usuario.",
    "Landing_Page_IdentityModuleDescription_6": "Administrar <strong>perfil de usuario</strong> básico y <strong>contraseña</strong> .",
    "Landing_Page_IdentityModuleDescription_7": "Administre <strong>los tipos de reclamos</strong> en el sistema, establezca reclamos para roles y usuarios.",
    "Landing_Page_IdentityModuleDescription_8": "Página de configuración para administrar <strong>la complejidad de la contraseña</strong> , el inicio de sesión de usuario, la cuenta y el bloqueo.",
    "Landing_Page_IdentityModuleDescription_9": "Admite autenticación <strong>LDAP</strong> .",
    "Landing_Page_IdentityModuleDescription_10": "Proporciona verificación <strong>de correo electrónico y número de teléfono</strong> .",
    "Landing_Page_IdentityModuleDescription_11": "Admite integraciones de inicio de sesión social (Twitter, Facebook, GitHub, etc.).",
    "Landing_Page_IdentityModuleDescription_12": "Gestionar <strong>unidades de organización</strong> en el sistema.",
    "Landing_Page_PaymentModuleDescription_1": "Proporciona integración para diferentes pasarelas de pago.",
    "Landing_Page_PaymentModuleDescription_2": "Este módulo proporciona integración para pasarelas de pago, para que pueda recibir pagos de sus clientes fácilmente.",
    "Landing_Page_PaymentModuleDescription_3": "Este módulo admite las siguientes pasarelas de pago",
    "Welcome_Page_UseSameCredentialForCommercialWebsites": "Utilice las mismas credenciales tanto para <a href=\"https://commercial.abp.io\" class=\"text-primary\">comercial.abp.io</a> como <a href=\"https://support.abp.io\" class=\"text-primary\">para support.abp.io</a> .",
    "WatchCrudPagesVideo": "¡Mire el vídeo &quot;Creación de páginas CRUD con ABP Suite&quot;!",
    "WatchGeneratingFromDatabaseVideo": "¡Mire el vídeo &quot;ABP Suite: Generación de páginas CRUD a partir de tablas de bases de datos existentes&quot;!",
    "WatchTakeCloserLookVideo": "¡Mire el vídeo &quot;Eche un vistazo más de cerca a la generación de código: ABP Suite&quot;!",
    "ConfirmedEmailAddressRequiredToStartTrial": "Debe tener una dirección de correo electrónico confirmada para poder iniciar una licencia de prueba.",
    "EmailVerificationMailNotSent": "No se pudo enviar el correo de verificación de correo electrónico.",
    "GetConfirmationEmail": "<a href=\"javascript:void(0);\" id=\"{0}\" class=\"text-decoration-underline\">Haga clic aquí para recibir un correo electrónico de verificación</a> si aún no lo ha recibido.",
    "WhichLicenseTypeYouAreInterestedIn": "¿Qué tipo de licencia le interesa?",
    "DontTakeOurWordForIt": "No confíe en nuestra palabra...",
    "ReadAbpCommercialUsersWantYouToKnow": "Lea lo que los usuarios de ABP Comercial quieren que sepa",
    "Testimonial_ShortDescription_1": "La modularidad de ABP hizo posible que el equipo entregara a tiempo.",
    "Testimonial_ShortDescription_2": "Cree nuevas funciones más rápido que antes.",
    "Testimonial_ShortDescription_3": "Partimos de funciones listas para usar y solo nos enfocamos en lo que realmente necesitamos escribir.",
    "Testimonial_ShortDescription_4": "ABP Commercial fue la mejor opción para nuestras necesidades.",
    "OnlineReviewersOnAbpCommercial": "Reseñas en línea sobre ABP Comercial",
    "SeeWhatToldAboutAbpCommercial": "Mira lo que se ha contado sobre ABP Comercial y escribe tu opinión si quieres.",
    "BlazoriseLicense": "¿Necesitamos comprar una licencia Blazorise?",
    "BlazoriseLicenseExplanation": "Tenemos un acuerdo entre Volosoft y Megabit, con este acuerdo la licencia Blazorise se incluye con los productos comerciales de ABP, por lo que nuestros clientes no necesitan comprar una licencia Blazorise adicional.",
    "ExtendPaymentInfoSection_DeveloperPrice": "{0}x desarrolladores adicionales",
    "ExtendPaymentInfoSection_DiscountRate": "Descuento {0}%",
    "TotalNetPrice": "Precio neto total",
    "EFCore": "Núcleo del marco de entidad",
    "All": "Todo",
    "Mvc": "mvc",
    "DataBaseProvider": "Proveedor de datos",
    "UIFramework": "Marco de interfaz de usuario",
    "LeptonXThemeForDashboard": "Tema LeptonX para su panel de administración por",
    "AbpPlatform": "Plataforma PAB",
    "YouDeserveGoodUXUI": "Te mereces una buena UI y una mejor UX. El tema LeptonX de ABP está aquí para servirle.",
    "ViewLiveDemo": "Ver demostración del tema en vivo",
    "GetLeptonX": "Obtenga LeptonX ahora",
    "SeeLeptonXDocumentation": "Ver la documentación de LeptonX",
    "SeeLeptonDocumentation": "Ver documentación de Lepton",
    "SimplifiedMenu": "Menú simplificado",
    "SimplifiedMenuDescription": "Podrás encontrar fácilmente la página que buscas filtrando el menú",
    "YourFavoritePages": "Tus páginas favoritas a tu alcance",
    "YourFavoritePagesDescription": "Agregue o elimine fácilmente la página de favoritos haciendo clic en el ícono de estrella en la esquina superior derecha de la página.",
    "BreadCrumbs": "Ruta de navegación para un cambio perfecto",
    "BreadCrumbsDescription": "Con Breadcrumb, puede cambiar a las páginas del mismo nivel con un solo clic, incluso cuando el menú de la izquierda está cerrado, ¡y funciona en tabletas y dispositivos móviles!",
    "YourMenu": "Tu menú como quieras",
    "YourMenuDescription": "Personalice los iconos y cuadros desplegables en los que se puede hacer clic directamente en el menú de usuario como desee. El menú de usuario es completamente personalizable para sus necesidades.",
    "RtlSupport": "Soporte RTL para tu idioma",
    "RtlSupportDescription": "El tema LeptonX admite RTL para su idioma. Las opciones de idioma están en el menú de configuración para que pueda cambiar el idioma.",
    "YourColors": "Tus colores en la interfaz de usuario del panel de administración",
    "YourColorsDescription": "El tema LeptonX funciona según las preferencias de su sistema y tiene opciones de tema claro del tablero, tema oscuro del tablero y tema semioscuro del tablero.",
    "ArrangeContentWidth": "Organice fácilmente el ancho de su contenido",
    "ArrangeContentWidthDescription": "Cambie fácilmente el ancho de su área de contenido.",
    "LeptonXCompatibleWith": "El tema LeptonX es compatible con",
    "MobileResponsiveTemplate": "Plantilla adaptable para dispositivos móviles",
    "MobileResponsiveTemplateDescription1": "Acceda a su panel de administración de LeptonX desde cualquier dispositivo que desee.",
    "MobileResponsiveTemplateDescription2": "Está diseñado para que puedas usarlo fácilmente en todos tus dispositivos. Responde en dispositivos móviles y tamaños de tabletas.",
    "TopMenuLayoutOption": "Opción de diseño del menú superior",
    "TopMenuLayoutOptionDescription1": "Si desea configurar su sitio web con el mismo panel de administración, ¡es posible hacerlo con LeptonX Theme!",
    "TopMenuLayoutOptionDescription2": "¡Simplemente prueba el diseño del menú superior de LeptonX para hacerlo realidad!",
    "EasilyCustomizable": "Fácilmente personalizable para los colores de su marca",
    "EasilyCustomizableDescription1": "Puede personalizar el tema LeptonX utilizando sólo unas pocas variables SCSS. ¡Sin anulación, sin carga CSS adicional!",
    "EasilyCustomizableDescription2": "Con LeptonX, puedes organizar tu panel de administración como quieras.",
    "IndependentLayout": "Diseño independiente y área de contenido.",
    "IndependentLayoutDescription1": "La infraestructura de diseño de LeptonX se diseñó completamente separada del contenido.",
    "IndependentLayoutDescription2": "Esto significa que puedes diseñar libremente tu proyecto con una estructura de contenido distinta a Bootstrap si lo deseas.",
    "MostUsedLibraries": "Bibliotecas más utilizadas integradas con LeptonX",
    "MostUsedLibrariesDescription1": "LeptonX contiene sus bibliotecas más utilizadas. Le permite utilizar bibliotecas como ApexCharts, DataTables, DropZone, FullCalender, JSTree, Select2 y Toastr sin esfuerzo.",
    "MostUsedLibrariesDescription2": "LeptonX también admite bibliotecas específicas de MVC Angular y Blazor.",
    "CreateAndCustomize": "Cree y personalice las páginas que necesita en segundos con las páginas personalizadas de LeptonX",
    "CreateAndCustomizeDescription": "Al utilizar el tema LeptonX, también tienes acceso a muchas páginas HTML prediseñadas. Estas incluyen muchas páginas, como página de inicio de sesión, blog, preguntas frecuentes, lista de suscripciones, facturas, precios y administración de archivos.",
    "LeptonThemeForAdmin": "Tema Lepton para su panel de administración por",
    "LeptonThemeForAdminDescription": "El tema Lepton todavía está disponible y se mantendrá. Si desea cambiar al tema LeptonX como usuario del tema Lepton, puede consultar la documentación para aprender cómo hacerlo.",
    "LeptonCompatibleWith": "El tema Lepton es compatible con",
    "BlackFridayDiscount": "Descuento de viernes negro",
    "UpgradePaymentInfoSection_DeveloperPrice": "{0} para {1} desarrolladores adicionales",
    "Upgrade": "Mejora",
    "Renewal": "Renovación",
    "UpgradePaymentInfoSection_LicensePrice": "{0} licencia",
    "UpgradePaymentInfoSection_LicenseRenewalPrice": "Renovación de licencia",
    "Total": "Total",
    "SupportPolicyFaqTitle": "¿Cuál es su política de soporte?",
    "SupportPolicyFaqExplanation": "Solo admitimos la versión activa y la versión principal anterior. No garantizamos el lanzamiento de un parche para la tercera versión principal y anteriores. Por ejemplo, si la versión activa es 7.0.0, lanzaremos parches para 6.xx y 7.xx. Además, brindamos soporte solo para problemas relacionados con ABP Framework y ABP Commercial. Eso significa que no se brinda soporte para aplicaciones de terceros, servicios en la nube y otras bibliotecas periféricas utilizadas por los productos ABP. Haremos todos los esfuerzos comercialmente razonables para proporcionar a nuestros clientes soporte técnico durante el horario comercial oficial de &quot;Volosoft Bilisim AS&quot;. Por otro lado, no nos comprometemos a un tiempo de respuesta de acuerdo de nivel de servicio (SLA), pero intentaremos responder a los problemas técnicos lo más rápido posible dentro de nuestro horario laboral oficial. A menos que se llegue a un acuerdo especial con el cliente, solo brindamos soporte en https://support.abp.io. También contamos con soporte por correo electrónico privado, que solo está disponible para titulares de licencias empresariales.",
    "TotalDevelopers": "Total de {0} desarrolladores",
    "CustomPurchaseExplanation": "Adaptado a sus necesidades específicas",
    "WhereDidYouHearAboutUs": "¿Dónde escuchaste acerca de nosotros?",
    "Twitter": "Gorjeo",
    "Facebook": "Facebook",
    "Youtube": "YouTube",
    "Google": "Google",
    "Github": "GitHub",
    "Friend": "De un amigo",
    "Other": "Otro",
    "WhereDidYouHearAboutUs_explain": "Especificar ...",
    "DeletingMemberWarningMessage": "&quot;{0}&quot; se eliminará de la lista de desarrolladores. Si lo desea, puede asignar este puesto vacío a otro desarrollador más adelante.",
    "AdditionalInfo": "Si los puestos de desarrollador superan sus requisitos, puede reducirlos. Puede enviar un correo electrónico a <a href=\"mailto:info@abp.io\">info@abp.io</a> para eliminar algunos de sus puestos de desarrollador. Limpiar los puestos de desarrollador no utilizados reducirá el costo de renovación de la licencia. Si lo desea, puede volver a comprar puestos de desarrollador adicionales dentro de su período de licencia activo. Tenga en cuenta que, dado que hay {0} desarrolladores en este paquete de licencia, no puede reducir este número.",
    "LinkExpiredErrorMessage": "El enlace al que intentas acceder está caducado.",
    "ExpirationDate": "Fecha de caducidad",
    "SpringCampaignDiscount": "Descuento de campaña de primavera",
    "WhyUseAbpIoPlatform": "¿Por qué debería utilizar la plataforma ABP.IO en lugar de crear una nueva solución desde cero?",
    "WhyUseAbpIoPlatformFaqExplanation": "Consulte <a href=\"/why-abp-io \">esa página</a> para obtener una explicación detallada de por qué usar la plataforma ABP.IO tiene una ventaja significativa sobre hacerlo todo usted mismo.",
    "EulaPageTitle": "Acuerdo de licencia de usuario final (EULA)",
    "PrivacyPolicyPageTitle": "Política de Privacidad - Política de Cookies",
    "TermsConditionsPageTitle": "Términos y condiciones",
    "TrainingsPageTitle": "Paquetes de formación ABP",
    "ModulesPageTitle": "Módulos de aplicaciones prediseñados de ABP",
    "Volo.AbpIo.Commercial:040001": "La clave de acceso API es incorrecta.",
    "GetLepton": "Consigue Lepton ahora",
    "MyOrganizations_Detail_LicenseStartDate": "Fecha de inicio de la licencia",
    "MyOrganizations_Detail_LicenseExpiryDate": "Fecha de caducidad",
    "BlazoriseSupport": "¿Cómo obtengo la clave de licencia de Blazorise y el soporte del equipo de Blazorise?",
    "BlazoriseSupportExplanation": "Siga los pasos a continuación para obtener asistencia del equipo de Blazorise y obtener su clave de licencia de Blazorise:",
    "BlazoriseSupportExplanation1": "Regístrese para obtener una nueva cuenta en <a href=\"https://blazorise.com/support/register\">blazorise.com/support/register</a> con la misma dirección de correo electrónico que su cuenta abp.io. Deje la entrada &quot;Clave de licencia&quot; en blanco. <strong>Debe ser la misma dirección de correo electrónico que su cuenta de correo electrónico en abp.io.</strong>",
    "BlazoriseSupportExplanation2": "Verifique su dirección de correo electrónico marcando su casilla de correo electrónico. ¡Revisa tu casilla de spam si no ves un correo electrónico en tu bandeja de entrada!",
    "BlazoriseSupportExplanation3": "Inicie sesión en el sitio web de soporte de Blazorise en <a href=\"https://blazorise.com/support/login\">blazorise.com/support/login</a> .",
    "BlazoriseSupportExplanation4": "Si tiene una licencia comercial ABP activa, también tendrá una licencia Blazorise PRO. Puede obtener su clave de licencia de Blazorise en <a href=\"https://blazorise.com/support/user/manage/license\">blazorise.com/support/user/manage/license</a> .",
    "BlazoriseSupportExplanation5": "Puede publicar sus preguntas en el sitio web de soporte y generar un token de producto para su aplicación.",
    "AbpLiveTrainingPackages": "Paquetes de capacitación en vivo de ABP",
    "Releases": "Lanzamientos",
    "ReleasesDescription": "Liberación de registros de ABP Comercial.",
    "ReleaseDate": "Fecha de lanzamiento",
    "Labels": "Etiquetas",
    "PreRelease": "Prelanzamiento",
    "AllTypes": "Todos los tipos",
    "Enhancement": "Mejora",
    "Bug": "Bicho",
    "Feature": "Característica",
    "AllUIs": "Todas las interfaces de usuario",
    "MVC": "mvc",
    "BlazorServer": "Servidor Blazor",
    "MAUI": "MAUI",
    "HowItWorks_Page_Title": "¿Cómo funciona?",
    "HowItWorks_Page_Description": "ABP Framework amplía la plataforma .NET. Por lo tanto, todo lo que pueda hacer con una solución .NET simple ya es posible con ABP Framework. Eso hace que sea fácil comenzar con una curva de aprendizaje baja.",
    "HowItWorks_Description1": "ABP Framework amplía la plataforma .NET. Por lo tanto, todo lo que pueda hacer con una solución .NET simple ya es posible con ABP Framework. Eso hace que sea fácil comenzar con una curva de aprendizaje baja.",
    "HowItWorks_Description2": "Una vez que comience a aprender y utilizar las funciones de ABP Framework, desarrollar su software será mucho más divertido que nunca.",
    "HowItWorks_Description3": "Esta página básicamente explica cómo utilizar la plataforma ABP.IO como desarrollador .NET.",
    "CreateANewSolution": "Cree una nueva solución .NET",
    "CreateANewSolution_Description1": "Todo comienza con la creación de una nueva solución .NET integrada de ABP.",
    "StartWithStartupTemplates": "Inicie una de las <a href=\"/startup-templates\">plantillas de soluciones de inicio</a> prediseñadas",
    "SimpleMonolithApplicationTemplate": "Plantilla de aplicación monolito simple",
    "LayeredApplicationTemplate": "Plantilla de aplicación en capas",
    "MicroserviceSolutionTemplate": "Plantilla de solución de microservicio",
    "CreateEmptySolutionAndUseAbp": "O cree una nueva solución .NET vacía e instale usted mismo <a href=\"https://abp.io/packages\" target=\"_blank\">los paquetes</a> ABP NuGet y NPM.",
    "CreatingSolutionWithMultipleOptions": "Hay múltiples opciones de interfaz de usuario y base de datos al crear una nueva solución.",
    "UIFrameworkOptions": "Opciones del marco de la interfaz de usuario",
    "DotnetSolutionWithoutDependency": "Ahora tiene una solución .NET normal en su computadora local que no depende de una plataforma en la nube o un servicio externo.",
    "CheckTheDocumentForDetails": "Puede consultar el documento <a href=\"{0}\" target=\"_blank\">{1}</a> para obtener más detalles.",
    "UIAndDatabaseIndependent": "ABP puede funcionar con cualquier interfaz de usuario y cualquier proveedor de base de datos compatible con .NET. \n Sin embargo, estos proveedores de bases de datos y UI están preintegrados y bien documentados.",
    "InstallAbpModules": "Instalar módulos ABP",
    "DevelopYourSolution": "Desarrolla tu solución",
    "DeployAnywhere": "Implementar en cualquier lugar",
    "InstallAbpModule_Description1": "ABP es un marco de desarrollo de aplicaciones modular. Las plantillas de soluciones de inicio ya vienen con los módulos esenciales instalados. \n Pero hay más módulos de aplicación que quizás desee utilizar en su solución.",
    "InstallAbpModule_Description2": "Cada módulo consta de algunos paquetes NuGet y NPM y tiene un documento de instalación. <a href=\"/tools/suite\">ABP Suite</a> hace la mayor parte del trabajo automáticamente, luego usted configura o ajusta manualmente el módulo según su documentación.",
    "DevelopYourSolution_Description1": "La infraestructura de ABP le permite <b class=\"text-white\">centrarse en su propio código empresarial</b> al automatizar el trabajo repetitivo y proporcionar infraestructura y <a href=\"https://abp.io/features\" target=\"_blank\">funciones</a> de aplicación prediseñadas.",
    "DevelopYourSolution_Description2": "En el siguiente bloque de código, puede ver cómo ABP Framework se integra perfectamente en su código y automatiza las tareas repetitivas por usted.",
    "DevelopYourSolution_Description3": "Incluso en este bloque de shortcode, ABP hace muchas cosas por usted.",
    "DevelopYourSolution_Description4": "Proporciona clases base para aplicar convenciones, como <a href=\"https://docs.abp.io/en/abp/latest/Dependency-Injection\" target=\"_blank\">la inyección de dependencia</a> \n . Los servicios <a href=\"https://docs.abp.io/en/abp/latest/Repositories\" target=\"_blank\">de repositorio</a> genéricos \n proporcionan una forma conveniente \n para interactuar con la base de datos. <a href=\"https://docs.abp.io/en/abp/latest/Authorization\" target=\"_blank\">La autorización</a> declarativa \n funciona con un sistema de permisos ajustado.",
    "DevelopYourSolution_Description5": "ABP automatiza completamente <a href=\"https://docs.abp.io/en/abp/latest/Unit-Of-Work\" target=\"_blank\">la unidad de trabajo de</a> \n (para la conexión de bases de datos y la gestión de transacciones), <a href=\"https://docs.abp.io/en/abp/latest/Exception-Handling\" target=\"_blank\">el manejo de excepciones</a> \n , <a href=\"https://docs.abp.io/en/abp/latest/Validation\" target=\"_blank\">la validación</a> \n \n <a href=\"https://docs.abp.io/en/abp/latest/Audit-Logging\" target=\"_blank\">el registro de auditoría</a> . Proporciona muchos más componentes básicos para simplificar sus tareas diarias de desarrollo y centrarse en su propio código mientras crea aplicaciones \n listas para producción.",
    "DevelopYourSolution_Description6": "Puedes imaginar lo largo y complicado que puede ser ese bloque de código si lo hicieras todo manualmente.",
    "SuiteCrudGenerationInFewSeconds": "Además de codificar manualmente su solución, puede crear páginas CRUD avanzadas completamente funcionales en unos minutos utilizando las herramientas de ABP Suite. Genera el código en su solución, para que pueda ajustarlo según sus requisitos personalizados.",
    "DeployAnywhere_Description1": "Al final del día, tiene una solución .NET pura. Puede implementar su solución en su propio servidor, en una plataforma en la nube, en Kubernetes o en cualquier lugar que desee. Puede implementar en tantos servidores como desee. ABP es una herramienta independiente del entorno de implementación.",
    "ExpertiseAbpFramework": "Experimente el marco ABP",
    "ExpertiseAbpFramework_Description1": "¿Quiere ir más allá de lo básico y adquirir experiencia con la plataforma ABP.IO?",
    "FreeDownload": "Descarga gratis",
    "Read": "Leer",
    "HavingTrouble": "¿Teniendo problemas?",
    "HavingTrouble_Description1": "¿Tiene problemas con el desarrollo de su solución? ¡Estamos aquí! Utilice la plataforma de soporte ABP \n o envíe un correo electrónico para obtener ayuda directamente de los miembros del equipo de Core ABP Framework.",
    "WeAreHereToHelp_Description1": "Puede explorar nuestros temas de ayuda o buscar en las preguntas frecuentes, \n o puede hacernos una pregunta utilizando el formulario de contacto.",
    "OtherModules": "Otros módulos",
    "OtherModules_Description1": "Cuenta, registro de auditoría, chat, kit CMS, gestión de archivos, formularios, RGPD, identidad, gestión de idiomas, pagos, Saas y más...",
    "HowItWorks_DatabaseProviderOptions": "Opciones del proveedor de bases de datos",
    "SeeFAQ": "Ver preguntas frecuentes",
    "ReleaseLogs": "Registros de lanzamiento",
    "ReleaseLogs_Tag": "{0} Registros de lanzamiento",
    "ReleaseLogs_Pr": "Solicitud de extracción n.º {0} - {1}",
    "NoLabels": "Sin etiquetas",
    "DoesTheSubscriptionRenewAutomatically": "¿La suscripción se renueva automáticamente?",
    "DoesTheSubscriptionRenewAutomaticallyExplanation": "El Comercial ABP no cuenta con un modelo de facturación de renovación automática. Por lo tanto <strong>, su suscripción no se renovará automáticamente</strong> al final del período de su licencia. Si desea seguir teniendo los beneficios de ABP Comercial, deberá renovarlo manualmente en la <a href=\"/my-organizations\">página de gestión de la organización</a> . Si tiene varias organizaciones, haga clic en el botón &quot;Administrar&quot; en su organización que está por vencer y luego haga clic en el botón &quot;Extender ahora&quot; para renovar su licencia. Es posible que también desee consultar <a href=\"/faq#what-happens-when-license-ends\">¿Qué sucede cuando finaliza mi licencia?</a> sección.",
    "ExtraQuestionCreditsFaqTitle": "¿Puedo comprar créditos adicionales para preguntas de soporte?",
    "ExtraQuestionCreditsFaqExplanation": "Sí tu puedes. Para comprar créditos de preguntas adicionales, envíe un correo electrónico a <a href=\"mailto:info@abp.io\">info@abp.io</a> con el nombre de su organización. Aquí está la lista de precios de los créditos de preguntas adicionales:<ul><li> Paquete de 50 preguntas $999</li><li> Paquete de 25 preguntas $625</li><li> Paquete de 15 preguntas $450</li></ul>",
    "AlreadyBetaTester": "Ya te has unido al programa beta tester.",
    "AbpStudio": "Estudio ABP",
    "AbpStudio_Description": "ABP Studio aún está en desarrollo. Puede completar el siguiente formulario para ser uno de los primeros usuarios.",
    "AbpStudio_Description1": "ABP Studio es una <span class=\"text-highlight-white\">aplicación de escritorio multiplataforma</span> para desarrolladores de ABP.",
    "AbpStudio_Description2": "Está <span class=\"text-highlight-white\">bien integrado</span> con ABP Framework y tiene como objetivo proporcionarle un entorno de desarrollo cómodo al <span class=\"text-highlight-white\">automatizar cosas, brindar información</span> sobre su solución y hacer que <span class=\"text-highlight-white\">desarrollar, ejecutar</span> e <span class=\"text-highlight-white\">implementar</span> sus soluciones sea mucho más fácil.",
    "AbpStudio_ComingSoon": "Próximamente <span class=\"opacity-50 ms-0 ms-md-3 d-block d-md-inline-block \">Fecha de lanzamiento beta prevista: cuarto trimestre de 2023.</span>",
    "AbpStudio_PlannedPreviewDate": "Fecha de lanzamiento prevista de la vista previa: cuarto trimestre de 2023.",
    "BetaRequest": "Solicitud Beta",
    "CreateNewSolutions": "Crear nuevas soluciones",
    "CreateNewSolutions_Description1": "Puede crear desde aplicaciones simples hasta monolitos modulares o soluciones de microservicios fácilmente con muchas opciones. Obtendrá una solución de software básica completa y lista para producción para su negocio.",
    "ArchitectYourSolutions": "Diseñe sus soluciones",
    "ArchitectYourSolutions_Description1": "Cree estructuras de soluciones monolíticas, modulares y de microservicios más fácilmente creando módulos o servicios y estableciendo relaciones entre ellos. También puede instalar o desinstalar módulos de aplicaciones prediseñados.",
    "ExploreYourSolution": "Explore su solución",
    "ExploreYourSolution_Description1": "ABP Studio muestra una vista de alto nivel de los componentes de su solución y los módulos de los que depende su solución. Puede explorar entidades, servicios, API HTTP y mucho más sin necesidad de abrir su código base.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze": "Ejecute soluciones de microservicios o aplicaciones múltiples en un abrir y cerrar de ojos",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description1": "Ejecute uno, <span class=\"text-highlight-white\">varios</span> o <span class=\"text-highlight-white\">todos los servicios</span> con un solo clic. De esta forma, es muy sencillo detener un servicio, ejecutarlo en Visual Studio para <span class=\"text-highlight-white\">probarlo</span> o <span class=\"text-highlight-white\">depurarlo</span> .",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description2": "Vea una lista de servicios, vea <span class=\"text-highlight-white\">solicitudes HTTP en tiempo real</span> y <span class=\"text-highlight-white\">recuentos de excepciones</span> para cada servicio.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description3": "Vea todos los detalles de todas <span class=\"text-highlight-white\">las solicitudes HTTP</span> que llegan a cualquier servicio.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description4": "Explore <span class=\"text-highlight-white\">los detalles de la excepción</span> en tiempo real en cualquier servicio, filtre y busque fácilmente.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description5": "Muestre los <span class=\"text-highlight-white\">registros de la aplicación</span> , filtre por nivel de registro o busque por texto.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description6": "<span class=\"text-highlight-white\">Explore</span> la interfaz de usuario de su aplicación sin salir del ejecutor de soluciones.",
    "IntegrateToYourKubernetesCluster": "Integre su clúster de Kubernetes",
    "IntegrateToYourKubernetesCluster_Description1": "<span class=\"text-highlight-white\">Conecte su entorno de desarrollo local a un clúster de Kubernetes local o remoto</span> , donde ese clúster ya ejecuta su solución de microservicio.",
    "IntegrateToYourKubernetesCluster_Description2": "Acceda a cualquier servicio en Kubernetes con su nombre de servicio como DNS, tal como se ejecutan en su computadora local.",
    "IntegrateToYourKubernetesCluster_Description3": "<span class=\"text-highlight-white\">Intercepte cualquier servicio</span> en ese clúster, de modo que todo el <span class=\"text-highlight-white\">tráfico al servicio interceptado se redirija automáticamente al servicio</span> que se ejecuta en su máquina local. Cuando su servicio necesita utilizar cualquier servicio en Kubernetes, el tráfico se redirige de regreso al clúster, tal como su servicio local se ejecuta dentro de Kubernetes.",
    "GetInformed": "Informarse",
    "Studio_GetInformed_Description1": "Deje su información de contacto para <span class=\"text-highlight-white\">informarse</span> y <span class=\"text-highlight-white\">pruébelo primero</span> cuando se lance ABP Studio.",
    "Studio_GetInformed_Description2": "Fecha de lanzamiento prevista de la vista previa: tercer trimestre de 2023.",
    "ThankYou!": "¡Gracias!",
    "SendBetaRequest": "Enviar solicitud beta",
    "YouJoinedTheBetaTesterProgram": "Te uniste al programa de prueba beta de ABP Studio.",
    "PricingExplanation2": "Garantía de devolución de dinero de 30 días — <a href=\"/faq#refund-policy\">Más información</a>",
    "MoneyBackGuaranteeText": "* ¡Garantía de devolución de dinero de 30 días en todas las licencias! Reembolso del 100 % en licencias Team, reembolso del 60 % en licencias Business y Enterprise dentro de los 30 días.",
    "MobileApplicationStartupTemplates": "Plantillas de inicio de aplicaciones móviles",
    "MobileApplicationStartupTemplates_Description1": "Plantillas de inicio de aplicaciones móviles integradas para sus soluciones comerciales de ABP.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates": "Cree potentes aplicaciones de línea de negocio utilizando las plantillas de inicio móvil de ABP",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description1": "ABP Commercial proporciona dos plantillas de inicio de aplicaciones móviles implementadas con <span class=\"text-highlight\">React Native</span> y <span class=\"text-highlight\">.NET MAUI.</span> Cuando cree su nueva solución basada en ABP, también tendrá aplicaciones de inicio básicas conectadas a sus API de backend.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description2": "La aplicación tiene un ciclo de token de autenticación prediseñado, <span class=\"text-highlight\">soporte en varios idiomas, soporte para múltiples inquilinos, inicio de sesión, contraseña olvidada, administración de perfiles y una página de administración de usuarios</span> . Puede agregar su propia lógica de negocios y personalizarla según sus requisitos.",
    "TwoFrameworkOptions": "Dos opciones de marco",
    "TwoFrameworkOptions_Description": "ABP proporciona plantillas de inicio móvil <span class=\"text-highlight\">React Native</span> y <span class=\"text-highlight\">.NET MAUI</span> . De esta manera podrás elegir el que mejor se adapte a tus necesidades. Ambas aplicaciones reutilizan código al ritmo más alto entre las plataformas iOS y Android.",
    "PreIntegratedToYourBackend": "Preintegrado a su backend",
    "PreIntegratedToYourBackend_Description": "Las aplicaciones de ABP Mobile están preintegradas en sus API de backend. Obtiene un token de autenticación válido del servidor y realiza solicitudes autenticadas.",
    "MultiLanguage": "Multi lenguaje",
    "MultiLanguage_Description": "Ya admite más de 10 idiomas desde el primer momento. También puede agregar los siguientes idiomas.",
    "Arabic": "Arábica",
    "Czech": "checo",
    "English": "Inglés",
    "Hungarian": "húngaro",
    "Finnish": "finlandés",
    "French": "Francés",
    "Hindi": "hindi",
    "Portuguese": "portugués",
    "Italian": "italiano",
    "Russian": "ruso",
    "Slovak": "eslovaco",
    "Turkish": "turco",
    "EngageAndRetainYourCustomersWithABPMobileApps": "Involucre y retenga a sus clientes con las aplicaciones móviles de ABP",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description1": "Tus clientes quieren gestionar sus productos y suscripciones desde cualquier lugar y en cualquier momento. Esto requiere que las organizaciones creen aplicaciones móviles que permitan a los clientes cumplir con sus solicitudes de manera rápida y sin problemas.",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description2": "Con las aplicaciones de ABP Mobile, puede crear aplicaciones móviles nativas de alta calidad para Android e iOS... utilizando una única base de código y sin comprometer la seguridad, la calidad o la escalabilidad.",
    "OneCodeBaseMultipleDevices": "Un código base para múltiples dispositivos",
    "OneCodeBaseMultipleDevices_Description": "Las aplicaciones de ABP Mobile son multiplataforma. Están listos para instalarse y ejecutarse en dispositivos iOS y Android, y se adaptan a diferentes factores de forma utilizando una única base de código. Los desarrolladores solo necesitan crear la interfaz de usuario y el código de interfaz una vez, no es necesario adaptar el código para cada dispositivo que desee admitir.",
    "ComesWithTheSourceCode": "Viene con el código fuente",
    "ComesWithTheSourceCode_Description": "Las aplicaciones móviles cuentan con el código fuente. Personalice fácilmente la UX/UI de sus aplicaciones para cumplir con las pautas de marca.",
    "Purchase_OneYearPrice": "Precio de 1 año",
    "Purchase_DeveloperSeatCount": "Número de puestos de desarrollador",
    "Purchase_DevelopersAlreadyIncluded": "{0} desarrolladores ya incluidos",
    "1Year": "1 año",
    "{0}Years": "{0} años",
    "1YearLicense": "Licencia de 1 año",
    "{0}YearsLicense": "Licencia de {0} años",
    "1AdditionalDeveloper": "1 desarrollador adicional",
    "{0}AdditionalDevelopers": "{0} Desarrolladores adicionales",
    "Discount": "Descuento ({0}%)",
    "Summary": "Resumen",
    "TrainingPack": "Paquete de entrenamiento",
    "TrainingPackDiscount": "Descuento en paquete de entrenamiento",
    "Purchase_OnboardingTraining_Description": "Este paquete de capacitación en vivo es válido para una clase de 8 estudiantes y este descuento solo es válido cuando se compra con la nueva licencia. <a href=\"{0}\" class=\"text-white\">Aprende más<i class=\"fa fa-external-link ms-1\"></i></a>",
    "Purchase_Save": "{0}% <span class=\"save ms-1\">Ahorro {1} {2}</span>",
    "RemoveBasket": "Retirar de la cesta",
    "WhyABPIOPlatform?": "¿Por qué <span class=\"gradient-commercial\">la plataforma ABP.IO</span> ?",
    "DocumentAim": "Este documento pretende responder a la gran pregunta:",
    "DocumentAim_Description": "&quot;¿Por qué debería utilizar la plataforma ABP.IO en lugar de crear una nueva solución desde cero?&quot;",
    "DocumentAim_Description2": "El documento presenta los desafíos de construir una solución de software moderna y explica cómo ABP aborda estos desafíos.",
    "CreatingANewSolution": "Creando una nueva solución",
    "CreatingANewSolution_Description": "Cuando necesita iniciar una nueva solución, hay muchas preguntas que debe hacerse y debe dedicar mucho tiempo antes de comenzar a escribir su primer código comercial.",
    "CreatingAnEmptySolution": "Creando una solución vacía",
    "THEPROBLEM": "EL PROBLEMA",
    "CreatingAnEmptySolution_THEPROBLEM_Description": "Incluso crear una solución casi vacía es un desafío;",
    "CreatingAnEmptySolution_THEPROBLEM_Description2": "¿Cómo organizas tu base de código entre proyectos?",
    "CreatingAnEmptySolution_THEPROBLEM_Description3": "¿Qué son las capas y cómo interactúan?",
    "CreatingAnEmptySolution_THEPROBLEM_Description4": "¿Cómo se integra con bibliotecas y sistemas de terceros?",
    "CreatingAnEmptySolution_THEPROBLEM_Description5": "¿Cómo configurar las pruebas automatizadas?",
    "ABPSOLUTION": "SOLUCIÓN PAA",
    "CreatingAnEmptySolution_ABPSOLUTION_Description": "ABP proporciona una <a href=\"https://docs.abp.io/en/abp/latest/Startup-Templates/Application\" target=\"_blank\">solución de inicio</a> bien diseñada, en capas y lista para producción basada en los principios <a href=\"https://docs.abp.io/en/abp/latest/Domain-Driven-Design\" target=\"_blank\">de Domain Driven Design</a> . La solución también incluye una unidad preconfigurada y proyectos <a href=\"https://docs.abp.io/en/abp/latest/Testing\" target=\"_blank\">de prueba</a> de integración para cada capa.",
    "CommonLibraries": "Bibliotecas comunes",
    "CommonLibraries_THEPROBLEM_Description": "¿Qué bibliotecas debería utilizar para implementar requisitos comunes? El ecosistema de desarrollo de software es muy dinámico, lo que dificulta mantenerse al día con las últimas herramientas, bibliotecas, tendencias y enfoques.",
    "CommonLibraries_ABPSOLUTION_Description": "ABP preintegra bibliotecas populares, maduras y actualizadas en la solución. No es necesario dedicar tiempo a integrarlos o hacer que se comuniquen entre sí. Funcionan correctamente desde el primer momento.",
    "UITheme&Layout": "Tema y diseño de la interfaz de usuario",
    "UITheme&Layout_THEPROBLEM_Description": "Al abordar las preocupaciones sobre la interfaz de usuario, surge una variedad de desafíos. Estos incluyen establecer las bases para un kit de interfaz de usuario responsivo, contemporáneo y adaptable con una apariencia consistente y una serie de características como menús de navegación, encabezados, barras de herramientas, pies de página, widgets y más.",
    "UITheme&Layout_THEPROBLEM_Description2": "Incluso si opta por un tema prediseñado, integrarlo perfectamente en su proyecto podría requerir días de desarrollo. Un obstáculo adicional radica en la actualización de dichos temas. Con frecuencia, la estructura HTML/CSS del tema se entrelaza con el código de la interfaz de usuario, lo que hace que futuros cambios o actualizaciones del tema sean tareas complejas. Este entrelazamiento de código y diseño complica la flexibilidad de realizar ajustes en el futuro.",
    "UITheme&Layout_ABPSOLUTION_Description": "ABP Framework ofrece un sistema de temas distintivo que libera el código de la interfaz de usuario de las restricciones del tema. Los temas existen de forma aislada, empaquetados como paquetes NuGet o NPM, lo que hace que la instalación o actualización del tema sea cuestión de minutos. Si bien conserva la opción de desarrollar su tema personalizado o integrar uno existente, ABP Commercial presenta una colección de temas pulidos y contemporáneos.",
    "UITheme&Layout_ABPSOLUTION_Description2": "Además, existen proveedores de componentes de interfaz de usuario como Telerik y DevExpress. Sin embargo, estos proveedores proporcionan principalmente componentes individuales, lo que le impone a usted la responsabilidad de establecer su sistema de diseño. Cuando trabaje en proyectos basados en ABP, puede incorporar estas bibliotecas sin problemas, de forma similar a como lo haría en cualquier otro proyecto.",
    "TestInfrastructure": "Infraestructura de prueba",
    "TestInfrastructure_THEPROBLEM_Description": "Establecer un entorno de pruebas sólido es una tarea que requiere mucho tiempo. Implica configurar proyectos de prueba dedicados dentro de su solución, seleccionar cuidadosamente las herramientas necesarias, crear simulacros de servicios y bases de datos, crear clases base esenciales y servicios de utilidad para minimizar el código redundante en las pruebas y abordar varias tareas relacionadas.",
    "TestInfrastructure_ABPSOLUTION_Description": "Las plantillas de inicio de ABP vienen preequipadas con proyectos de prueba configurados, lo que agiliza el proceso. Esto significa que desde el primer día, puede comenzar a escribir su código de prueba de integración o unidad inicial sin demora.",
    "CodingStandards&Training": "Estándares de codificación y capacitación",
    "CodingStandards&Training_THEPROBLEM_Description": "Una vez que haya configurado la solución para el desarrollo, normalmente deberá enseñar a los desarrolladores cómo funciona el sistema y cómo construirlo utilizando los mismos métodos acordados. Incluso si les brindas capacitación, mantener la documentación actualizada puede resultar complicado. A medida que pasa el tiempo, cada desarrollador puede escribir código a su manera, lo que hace que las reglas para escribir código sean diferentes entre sí.",
    "CodingStandards&Training_ABPSOLUTION_Description": "La solución ABP ya está perfectamente organizada y tiene explicaciones claras. Las guías y tutoriales paso a paso le muestran exactamente cómo trabajar en un proyecto ABP.",
    "KeepingYourSolutionUpToDate": "Mantener su solución actualizada",
    "KeepingYourSolutionUpToDate_THEPROBLEM_Description": "Después de comenzar su desarrollo, debe realizar un seguimiento de las nuevas versiones de las bibliotecas que utiliza para actualizaciones y parches.",
    "KeepingYourSolutionUpToDate_ABPSOLUTION_Description": "Actualizamos periódicamente todos los paquetes a las últimas versiones y los probamos antes de la versión estable. Cuando actualiza ABP Framework, todas sus dependencias se actualizan a tecnología de punta.",
    "DRY": "¡No te repitas!",
    "DRY_Description": "Crear una solución base lleva mucho tiempo y requiere una buena experiencia en arquitectura. Sin embargo, ¡esto es sólo el comienzo! A medida que empieces a desarrollar, probablemente tendrás que escribir mucho código repetitivo; Sería fantástico si todo esto pudiera manejarse automáticamente.",
    "DRY_Description2": "ABP automatiza y simplifica la repetición de código tanto como sea posible siguiendo el principio de convención sobre configuración. Sin embargo, no le restringe cuando necesita cambiar a marcha manual. El control siempre está en tus manos.",
    "Authentication": "Autenticación",
    "Authentication_THEPROBLEM_Description": "Inicio de sesión único, integración de Active Directory/LDAP, integración de OpenIddict, inicios de sesión sociales, autenticación de dos factores, olvidé/restablecí la contraseña, activación por correo electrónico, registro de nuevo usuario, control de complejidad de la contraseña, bloqueo de cuenta en intentos fallidos, muestra de intentos de inicio de sesión fallidos... etc. Sabemos que todos estos requisitos genéricos le resultan familiares. ¡Usted no está solo!",
    "Authentication_ABPSOLUTION_Description": "ABP Framework y la versión comercial proporcionan todas estas cosas estándar preimplementadas para usted como un módulo de cuenta reutilizable. Simplemente habilita y configura lo que necesita.",
    "CrossCuttingConcerns": "Preocupaciones transversales",
    "CrossCuttingConcerns_THEPROBLEM_Description": "Las preocupaciones transversales son la lógica repetitiva fundamental que debe implementarse para cada caso de uso. Algunos ejemplos;",
    "CrossCuttingConcerns_THEPROBLEM_Description2": "Iniciar transacciones, comprometerse con el éxito y revertir los errores.",
    "CrossCuttingConcerns_THEPROBLEM_Description3": "Manejar e informar excepciones, devolver una respuesta de error adecuada a los clientes y manejar casos de error en el lado del cliente.",
    "CrossCuttingConcerns_THEPROBLEM_Description4": "Implementar autorización y validación, devolver respuestas adecuadas y manejarlas en el lado del cliente.",
    "CrossCuttingConcerns_ABPSOLUTION_Description": "ABP Framework automatiza o simplifica todas las preocupaciones transversales comunes. Usted solo escribe código que es importante para su negocio y ABP maneja el resto mediante convenciones.",
    "ArchitecturalInfrastructure": "Infraestructura arquitectónica",
    "ArchitecturalInfrastructure_THEPROBLEM_Description": "Por lo general, necesita crear una infraestructura para implementar su arquitectura correctamente. Por ejemplo, generalmente implementas el patrón Repositorio. Defina algunas clases base para simplificar y estandarizar la creación de entidades, servicios, controladores y otros objetos.",
    "ArchitecturalInfrastructure_ABPSOLUTION_Description": "ABP Framework proporciona todo esto y más de forma inmediata. Es maduro y está bien documentado.",
    "EnterpriseApplicationRequirements": "Requisitos de la aplicación empresarial",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description": "Hay muchos requisitos que se implementan repetidamente en cada aplicación empresarial;",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description2": "Sistema de permisos detallado y gestión de permisos en la interfaz de usuario según roles y usuarios.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description3": "Escribir registros de auditoría e historiales de entidades para realizar un seguimiento cuando un usuario modifica un registro de la base de datos.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description4": "Realice una eliminación temporal de sus entidades, para que se marquen como eliminadas en lugar de eliminarlas físicamente de la base de datos y filtre automáticamente las entidades eliminadas en sus consultas.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description5": "Crear abstracciones y contenedores para consumir sus API de backend desde el código de frontend.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description6": "Poner en cola y ejecutar trabajos en segundo plano.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description7": "Manejo de múltiples zonas horarias en un sistema global.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description8": "Compartir lógica de validación, localización y autorización entre el servidor y el cliente.",
    "EnterpriseApplicationRequirements_ABPSOLUTION_Description": "ABP proporciona una infraestructura para implementar dichos requisitos fácilmente. Una vez más, no pierde su valioso tiempo reimplementando todo esto una y otra vez.",
    "GeneratingInitialCode&Tooling": "Generación de código inicial y herramientas",
    "GeneratingInitialCode&Tooling_THEPROBLEM_Description": "Creará muchas páginas similares en una aplicación web típica. La mayoría de ellos realizarán operaciones CRUD similares. Es muy tedioso y también propenso a errores crear repetidamente este tipo de páginas.",
    "GeneratingInitialCode&Tooling_ABPSOLUTION_Description": "<a href=\"/tools/suite\">ABP Suite</a> puede generar una página CRUD completa para sus entidades en segundos. El código generado tiene capas y es limpio. Se implementan todos los requisitos estándar de validación y autorización. Además, se generan clases de prueba unitaria. Una vez que obtenga una página en pleno funcionamiento, podrá modificarla según los requisitos de su negocio.",
    "IntegratingTo3rdPartyLibrariesAndSystems": "Integración a bibliotecas y sistemas de terceros",
    "IntegratingTo3rdPartyLibrariesAndSystems_THEPROBLEM_Description": "La mayoría de las bibliotecas están diseñadas como de bajo nivel y, por lo general, es necesario trabajar un poco para integrarlas correctamente sin repetir el mismo código de integración y configuración en todas partes de la solución. Por ejemplo, suponga que debe utilizar RabbitMQ para implementar su bus de eventos distribuido. Todo lo que quieres hacer es; enviar un mensaje a una cola y manejar los mensajes entrantes. Pero es necesario comprender los patrones de mensajería, las colas y los detalles de intercambio. Para escribir código eficiente, debe crear un grupo para administrar conexiones, clientes y canales. También debe lidiar con excepciones, mensajes ACK, volver a conectarse a RabbitMQ en caso de fallas y más.",
    "IntegratingTo3rdPartyLibrariesAndSystems_ABPSOLUTION_Description": "Por ejemplo, la integración del bus de eventos distribuido RabbitMQ de ABP abstrae todos estos detalles. Envías y recibes mensajes sin el ajetreo y el bullicio. ¿Necesitas escribir código de bajo nivel? No hay problema, siempre puedes hacerlo. ABP no le restringe cuando necesita utilizar funciones de bajo nivel de la biblioteca que está utilizando.",
    "WhyNotBuildYourOwnFramework?": "¿Por qué no crear su propio marco?",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description": "Toda la infraestructura, incluso la más sencilla, requiere mucho tiempo para construirla, mantenerla y documentarla. Se hace más grande con el tiempo y resulta difícil mantenerlo en su solución. Separarlos en un proyecto reutilizable es el punto de partida para construir su propio marco interno.",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description2": "Crear, documentar, capacitar y mantener un marco interno es realmente difícil. Si no tiene un equipo de marco dedicado y experimentado, su marco interno se convierte rápidamente en un código heredado indocumentado que ya nadie puede comprender ni mantener. Por otro lado, estos marcos generalmente son desarrollados por uno o dos desarrolladores del equipo. Y estos tipos se están convirtiendo en un silo de conocimientos. Es bueno para ellos pero malo para la empresa porque son el único punto de falla del proyecto <a href=\"https://en.wikipedia.org/wiki/Single_point_of_failure\">-SPOF-</a> . Una vez que abandonan la empresa, el proyecto cae drásticamente.",
    "WhyNotBuildYourOwnFramework_ABPSOLUTION_Description": "ABP Framework es un marco de aplicación genérico, maduro, bien documentado y impulsado por la comunidad. Un equipo de desarrolladores altamente experimentados está trabajando arduamente para mantenerlo actualizado, fácil de entender y cómodo de usar. El uso de un marco tan estable le permite concentrarse en su propio código comercial y obtener ayuda de expertos con el marco siempre que la necesite.",
    "ArchitecturalInfrastructure_Description": "Las aplicaciones SaaS, los sistemas modulares o de microservicios son los modelos de software empresarial más utilizados. Construir tales sistemas no sólo requiere una buena comprensión y experiencia, sino que también requiere una sólida infraestructura de software. De lo contrario, tendrá que realizar un gran esfuerzo para admitir estos detalles arquitectónicos en su código base.",
    "Modularity": "Modularidad",
    "Modularity_THEPROBLEM_Description": "¡Construir un sistema verdaderamente modular no es fácil! Todos los aspectos del sistema (base de datos, entidades, API, páginas/componentes de la interfaz de usuario) se pueden dividir en módulos, y cada módulo se puede reutilizar sin otros. El ASP.NET Core simple no proporciona una arquitectura tan modular. Si lo necesitas, deberías pensarlo desde cero.",
    "Modularity_ABPSOLUTION_Description": "El Framework ABP nace para ser una estructura modular de desarrollo de aplicaciones. Cada característica del marco está desarrollada para ser compatible con la modularidad. La documentación y las guías explican cómo desarrollar módulos reutilizables de forma estándar.",
    "SaaSMultiTenancy": "SaaS/multiinquilino",
    "SaaSMultiTenancy_THEPROBLEM_Description": "<a href=\"https://docs.abp.io/en/abp/latest/Multi-Tenancy\">Multi-Tenancy</a> es una forma común de implementar sistemas SaaS. Sin embargo, implementar una infraestructura multiinquilino consistente puede resultar complicado.",
    "SaaSMultiTenancy_ABPSOLUTION_Description": "ABP Framework proporciona una infraestructura multiinquilino completa y una complejidad abstracta de su código comercial. El código de su aplicación será en su mayoría compatible con inquilinos múltiples, mientras que ABP Framework aísla automáticamente la base de datos, el caché y otros detalles de los inquilinos entre sí. Admite bases de datos únicas, bases de datos por inquilino y enfoques híbridos. Configura correctamente bibliotecas como Microsoft Identity y OpenIddict, que normalmente no son compatibles con múltiples inquilinos.",
    "Microservices": "Microservicios",
    "Microservices_THEPROBLEM_Description": "La construcción de un sistema de microservicios requiere muchos detalles de infraestructura: autenticar y autorizar aplicaciones y microservicios e implementar mensajes asincrónicos y patrones de comunicación sincrónicos (Rest/GRPC) entre microservicios son las cuestiones más fundamentales.",
    "Microservices_ABPSOLUTION_Description": "ABP Framework proporciona servicios, <a href=\"https://docs.abp.io/en/abp/latest/Microservice-Architecture\" target=\"_blank\">guías</a> y ejemplos para ayudarlo a implementar su solución de microservicio utilizando las herramientas estándar de la industria.",
    "Microservices_ABPSOLUTION_Description2": "ABP Commercial incluso va un paso más allá y proporciona una <a href=\"https://docs.abp.io/en/commercial/latest/startup-templates/microservice/index\" target=\"_blank\">plantilla de inicio</a> completa para poner en marcha su solución de microservicio.",
    "PreBuiltModules": "Módulos prediseñados",
    "PreBuiltModules_THEPROBLEM_Description": "Todos tenemos requisitos comerciales similares pero ligeramente diferentes. Sin embargo, todos deberíamos reinventar la rueda, ya que ningún código puede funcionar directamente en nuestra solución. Todos ellos son partes integradas de una solución más amplia.",
    "PreBuiltModules_ABPSOLUTION_Description": "<a href=\"/modules\">Los módulos</a> comerciales de ABP proporcionan una gran cantidad de módulos de aplicaciones reutilizables como pagos, chat, administración de archivos, informes de registros de auditoría... etc. Todos estos módulos se instalan fácilmente en su solución y funcionan directamente. Constantemente estamos agregando más módulos.",
    "PreBuiltModules_ABPSOLUTION_Description2": "Todos los módulos están diseñados para personalizarse según los requisitos de su negocio. Si necesita un control total, puede descargar el código fuente completo de cualquier módulo y personalizarlo completamente según sus requisitos comerciales específicos.",
    "ABPCommunity": "Comunidad ABP",
    "ABPCommunity_Description": "Finalmente, estar en una gran comunidad donde todos siguen estilos y principios de codificación similares y comparten una infraestructura común brinda poder cuando tienes problemas o necesitas ayuda con las decisiones de diseño. Como escribimos código de manera similar, podemos ayudarnos mucho mejor unos a otros. ABP es un proyecto respaldado por la comunidad con más de 10.000 estrellas en GitHub.",
    "ABPCommunity_Description2": "Es fácil compartir código o incluso bibliotecas reutilizables entre desarrolladores de ABP. Un fragmento de código que funcione para usted también funcionará para otros. Hay muchos ejemplos y tutoriales que puede implementar directamente para su aplicación.",
    "ABPCommunity_Description3": "Cuando contrata a un desarrollador que trabajó antes con la arquitectura ABP, comprenderá inmediatamente su solución y comenzará el desarrollo en muy poco tiempo.",
    "WhyAbpIo_Page_Title": "¿Por qué la plataforma ABP.IO?",
    "AbpStudio_Page_Title": "Estudio ABP",
    "CampaignInfo": "¡Compre una nueva licencia o renueve su licencia existente y <span class=\"text-white\">obtenga 2 meses adicionales</span> sin costo adicional! Esta oferta es válida para todos los planes de licencia. Asegúrese de aprovechar esta promoción por tiempo limitado para ampliar su acceso a funciones premium y actualizaciones.",
    "HurryUpLastDay": "¡Apresúrate! Último día: {0}",
    "CreatingCRUDPagesWithABPSuite": "Creando páginas CRUD con ABP Suite",
    "Testimonials": "Testimonios",
    "MultipleYearDiscount": "Descuento por varios años",
    "CampaignDiscountText": "Descuento del viernes negro",
    "CampaignDiscountName": "viernes negro",
    "CampaignName:BlackFriday": "viernes negro"
  }
}