{
  "culture": "es",
  "texts": {
    "OrganizationManagement": "Gestión de la organización",
    "OrganizationList": "Lista organización",
    "Volo.AbpIo.Commercial:010003": "Tu no eres el propietario de esta organización!",
    "OrganizationNotFoundMessage": "Organización no encontrada!",
    "DeveloperCount": "Total desarrolladores asignados",
    "QuestionCount": "Total de preguntas restantes",
    "Unlimited": "Ilimitado",
    "Owners": "Propietarios",
    "AddMember": "Añadir miembro",
    "AddOwner": "Añadir propietario",
    "AddDeveloper": "Añadir desarrollador",
    "UserName": "Nombre de usuario",
    "Name": "Nombre",
    "EmailAddress": "Dirección de Email",
    "Developers": "Desarrolladores",
    "LicenseType": "Tipo de licencia",
    "Manage": "Gestionar",
    "StartDate": "Fecha de inicio",
    "EndDate": "Fecha de fin",
    "Modules": "Módulos",
    "LicenseExtendMessage": "Tu fecha de finalización de tu licencia ha sido extendido a {0}",
    "LicenseUpgradeMessage": "Tu licencia esta actualizada a {0}",
    "LicenseExtendAdnUpgradeMessage": "Su licencia se extendió hasta el {0} y su plan de licencias se actualizó a {1}.",
    "LicenseAddDeveloperMessage": "{0} desarrolladores añadidos a tu licencia",
    "Volo.AbpIo.Commercial:010004": "No se pudo encontrar el usuario especificado. El usuario debe estar ya registrado.",
    "MyOrganizations": "Mis organizaciones",
    "ApiKey": "API Key",
    "UserNameNotFound": "No hay un usuario con el nombre de usuario {0}",
    "SuccessfullyAddedToNewsletter": "Gracias por suscribirte a nuestro boletín de noticias!",
    "MyProfile": "Mi perfil",
    "EmailNotValid": "Por favor, introduce una dirección de email válida.",
    "JoinOurMarketingNewsletter": "Únase a nuestro boletín de marketing",
    "WouldLikeToReceiveMarketingMaterials": "Me gustaría recibir materiales de marketing como ofertas de productos y ofertas especiales.",
    "StartUsingYourLicenseNow": "¡Empiece a usar su licencia ahora!",
    "WelcomePage": "Pagina de bienvenida",
    "UnsubscriptionExpireEmail": "Cancelar la suscripción a los correos electrónicos de recordatorio de la fecha de vencimiento de la licencia",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Esta suscripción de correo electrónico solo contiene un recordatorio de la fecha de vencimiento de su licencia.",
    "UnsubscribeFromLicenseExpireEmails": "Si no desea recibir los correos electrónicos sobre la fecha de vencimiento de su licencia, puede cancelar la suscripción en cualquier momento que desee.",
    "Unsubscribe": "Darse de baja",
    "NotOrganizationMember": "No eres miembro de ninguna organización.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Se anuló con éxito la suscripción",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Ya no recibirá correos electrónicos de recordatorio de la fecha de vencimiento de la licencia.",
    "IndexPageHeroSection": "<span class=\"first-line\"> Una </span> <span class=\"second-line\"> plataforma de desarrollo web completa </span> <span class=\"third-line\"> integrada <img src=\"{0}\" width = \"110\" class=\"ml-1\" /> marco </span>",
    "AbpCommercialShortDescription": "ABP Commercial proporciona módulos de aplicaciones prediseñados, herramientas de desarrollo rápido de aplicaciones, temas de interfaz de usuario profesionales, soporte premium y más.",
    "LiveDemo": "Demo en vivo",
    "GetLicence": "Obtener una licencia",
    "Application": "Solicitud",
    "StartupTemplates": "Plantillas de inicio",
    "Startup": "Puesta en marcha",
    "Templates": "Plantillas",
    "Developer": "Desarrollador",
    "Tools": "Instrumentos",
    "Premium": "Prima",
    "PremiumSupport": "Soporte Premium",
    "PremiumForumSupport": "Soporte de foro premium",
    "UI": "Interfaz de usuario",
    "Themes": "Temas",
    "JoinOurNewsletter": "Suscríbase a nuestro boletín",
    "Send": "Enviar",
    "Learn": "Aprender",
    "AdditionalServices": "Servicios adicionales",
    "WhatIsABPFramework": "¿CUÁL ES EL MARCO ABP?",
    "OpenSourceBaseFramework": "Marco base de código abierto",
    "ABPFrameworkExplanation": "<p class=\"lead\"> ABP Commercial se basa en ABP Framework, un marco de aplicación web de código abierto y dirigido por la comunidad para ASP.NET Core. </p> <p> ABP Framework proporciona una excelente infraestructura para escribir, mantenible y extensible y código comprobable con las mejores prácticas. </p> <p> Desarrollado e integrado a herramientas populares que ya conoce. Curva de aprendizaje baja, fácil adaptación, cómodo desarrollo. </p>",
    "Modular": "Modular",
    "MicroserviceCompatible": "Compatible con microservicios",
    "DomainDrivenDesignInfrastructure": "Infraestructura de diseño basada en dominios",
    "MultiTenancy": "Multi Alquiler",
    "DistributedMessaging": "Mensajería distribuida",
    "DynamicProxying": "Proxying dinámico",
    "BackgroundJobs": "Trabajos en segundo plano",
    "AuditLogging": "Registro de auditoría",
    "BLOBStoring": "Almacenamiento BLOB",
    "BundlingMinification": "Agrupación y minificación",
    "AdvancedLocalization": "Localización avanzada",
    "ManyMore": "Mucho mas",
    "ExploreTheABPFramework": "Explore el marco de ABP",
    "WhyUseTheABPCommercial": "¿Por qué utilizar The ABP Commercial?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt- 5\"> La creación de aplicaciones web de nivel empresarial puede ser compleja y llevar mucho tiempo. </p> <p> ABP Commercial ofrece la infraestructura base perfecta necesaria para todos los ASP.NET Core modernos de nivel empresarial soluciones basadas. Desde el diseño hasta la implementación, todo el ciclo de desarrollo está potenciado por las funciones y módulos integrados de ABP. </p>",
    "StartupTemplatesShortDescription": "Las plantillas de inicio le permiten iniciar su proyecto en unos segundos.",
    "UIFrameworksOptions": "Opciones de marcos de interfaz de usuario;",
    "DatabaseProviderOptions": "Opciones de proveedores de bases de datos;",
    "PreBuiltApplicationModules": "Módulos de aplicación prediseñados",
    "PreBuiltApplicationModulesShortDescription": "Los requisitos de aplicación más comunes ya están desarrollados para usted como módulos reutilizables.",
    "Account": "Cuenta",
    "Blogging": "Blogging",
    "Identity": "Identidad",
    "IdentityServer": "Servidor de identidad",
    "Saas": "Saas",
    "LanguageManagement": "Manejo del idioma",
    "TextTemplateManagement": "Gestión de plantillas de texto",
    "See All Modules": "Ver todos los módulos",
    "ABPSuite": "Suite ABP",
    "AbpSuiteShortDescription": "ABP Suite es una herramienta complementaria a ABP Commercial.",
    "AbpSuiteExplanation": "Te permite crear páginas web en cuestión de minutos. Es una herramienta global de .NET Core que se puede instalar desde la línea de comandos. Puede crear una nueva solución ABP, generar páginas CRUD desde la base de datos al front-end.",
    "Details": "Detalles",
    "LeptonTheme": "Tema de Lepton",
    "ProfessionalModernUIThemes": "Temas de interfaz de usuario modernos y profesionales",
    "LeptonThemeExplanation": "Lepton proporciona una gama de temas de administración de Bootstrap que sirven como una base sólida para cualquier proyecto que requiera un panel de administración.",
    "DefaultTheme": "Tema predeterminado",
    "MaterialTheme": "Tema material",
    "Default2Theme": "Tema predeterminado 2",
    "DarkTheme": "Tema oscuro",
    "DarkBlueTheme": "Tema azul oscuro",
    "LightTheme": "Tema de luz",
    "ProudToWorkWith": "Orgulloso de trabajar con",
    "OurConsumers": "Miles de empresas y desarrolladores de más de 70 países en todo el mundo confían en ABP Commercial.",
    "JoinOurConsumers": "Únase a ellos y cree productos increíbles rápidamente.",
    "AdditionalServicesExplanation": "¿Necesitas servicios adicionales o personalizados? <strong> Nosotros y nuestros socios podemos proporcionar; </strong>",
    "CustomProjectDevelopment": "Desarrollo de proyectos personalizados",
    "CustomProjectDevelopmentExplanation": "Desarrolladores dedicados a sus proyectos personalizados.",
    "PortingExistingProjects": "Portar proyectos existentes",
    "PortingExistingProjectsExplanation": "Migrar sus proyectos heredados a la plataforma ABP.",
    "LiveSupport": "Soporte vital",
    "LiveSupportExplanation": "Opción de soporte remoto en vivo cuando lo necesite.",
    "Training": "Capacitación",
    "TrainingExplanation": "Formación dedicada a sus desarrolladores.",
    "OnBoarding": "Inducción",
    "OnBoardingExplanation": "Ayude a configurar sus entornos de desarrollo, CI y CD.",
    "PrioritizedTechnicalSupport": "Soporte técnico priorizado",
    "PremiumSupportExplanation": "Además del gran apoyo de la comunidad del marco ABP, nuestro equipo de soporte responde preguntas técnicas y problemas de los usuarios comerciales con alta prioridad.",
    "SeeTheSupportOptions": "Ver las opciones de soporte",
    "Contact": "Contacto",
    "TellUsWhatYouNeed": "Díganos lo que usted necesita.",
    "YourMessage": "Tu mensaje",
    "YourFullName": "Tu nombre completo",
    "EmailField": "Dirección de correo electrónico",
    "YourEmailAddress": "Tu correo electrónico",
    "HowMayWeHelpYou": "¿Cómo podemos ayudarle?",
    "SendMessage": "Enviar mensaje",
    "Success": "Éxito",
    "WeWillReplyYou": "Recibimos su mensaje y nos pondremos en contacto a la brevedad.",
    "GoHome": "Vete a casa",
    "CreateLiveDemo": "Crear demostración en vivo",
    "RegisterToTheNewsletter": "Regístrese para recibir el boletín informativo para recibir información sobre ABP.IO, incluidos nuevos lanzamientos, etc.",
    "EnterYourEmailOrLogin": "Ingrese su dirección de correo electrónico para crear su demostración o <a href=\"{0}\"> Iniciar sesión </a> con su cuenta existente.",
    "ApplicationTemplate": "Plantilla de aplicación",
    "ApplicationTemplateExplanation": "La plantilla de inicio de la aplicación se utiliza para crear una nueva aplicación web.",
    "EfCoreProvider": "Entity Framework (compatible con SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\"> y otros </a>)",
    "AlreadyIncludedInTemplateModules": "Los siguientes módulos ya están incluidos y configurados en esta plantilla:",
    "ApplicationTemplateArchitecture": "Esta plantilla de aplicación también admite una arquitectura por niveles donde la capa de interfaz de usuario, la capa de API y el servicio de autenticación están separados físicamente.",
    "SeeTheGuideOrGoToTheLiveDemo": "Consulte la guía para desarrolladores para obtener información técnica sobre esta plantilla o vaya a la demostración en vivo.",
    "DeveloperGuide": "Guía para desarrolladores",
    "ModuleTemplate": "Plantilla de módulo",
    "ModuleTemplateExplanation1": "¿Quiere crear un módulo y reutilizarlo en diferentes aplicaciones? Esta plantilla de inicio lo prepara todo para empezar a crear un <strong> módulo de aplicación </strong> reutilizable o un <strong> microservicio </strong>.",
    "ModuleTemplateExplanation2": "<p> Puede admitir marcos de interfaz de usuario únicos o múltiples, proveedores de bases de datos únicos o múltiples para un solo módulo. La plantilla de inicio está configurada para ejecutar y <strong> probar su módulo </strong> en una aplicación mínima además de la infraestructura de prueba de integración y unidad. </p> <p> Consulte la guía para desarrolladores para obtener información técnica sobre esta plantilla. </p>",
    "WithAllStyleOptions": "con todas las opciones de estilo",
    "Demo": "Manifestación",
    "SeeAllModules": "Ver todos los módulos",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) es una herramienta de línea de comandos para realizar algunas operaciones comunes para soluciones basadas en ABP.",
    "ABPSuiteEasilyCURD": "ABP Suite es una herramienta que le permite crear fácilmente páginas CRUD",
    "WeAreHereToHelp": "Estamos aquí para <span class=\"zero-text\"> Ayuda </span>",
    "BrowseOrAskQuestion": "Puede explorar nuestros temas de ayuda o buscar preguntas frecuentes, o puede hacernos una pregunta mediante el <a href=\"{0}\" class=\"text-success\"> formulario de contacto </a>.",
    "SearchQuestionPlaceholder": "Buscar en preguntas frecuentes",
    "WhatIsTheABPCommercial": "¿Qué es ABP Commercial?",
    "WhatAreDifferencesThanAbpFramework": "¿Cuáles son las diferencias entre ABP Framework de código abierto y ABP Commercial?",
    "ABPCommercialExplanation": "ABP Commercial es un conjunto de módulos, herramientas, temas y servicios premium creados sobre el <a target=\"_blank\" href=\"{0}\"> marco ABP </a> de código abierto. ABP Commercial está siendo desarrollado y respaldado por el mismo equipo que está detrás del marco ABP.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\"> marco ABP </a> es un marco de desarrollo de aplicaciones modular, temático y compatible con microservicios para ASP.NET Core. Proporciona una arquitectura completa y una infraestructura sólida para que pueda concentrarse en su propio código comercial en lugar de repetirse para cada nuevo proyecto. Se basa en las mejores prácticas de desarrollo de software y en herramientas populares que ya conoce. </p> <p> El marco ABP es completamente gratuito, de código abierto y dirigido por la comunidad. También proporciona un tema gratuito y algunos módulos prediseñados (por ejemplo, administración de identidad y administración de inquilinos). </p>",
    "VisitTheFrameworkVSCommercialDocument": "Visite el siguiente enlace para obtener más información <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial agrega los siguientes beneficios además del marco ABP;",
    "Professional": "Profesional",
    "UIThemes": "Temas de interfaz de usuario",
    "EnterpriseModules": "<a href=\"{0}\"> módulos de aplicación </a> predefinidos, ricos en funciones y listos para la empresa (p. Ej., Administración de Identity Server, administración de SaaS, administración de idiomas)",
    "ToolingToSupport": "Herramientas para respaldar su productividad de desarrollo (p. Ej., <a href=\"{0}\"> ABP Suite </a>)",
    "PremiumSupportLink": "<a href=\"{0}\" target=\"_blank\"> asistencia premium </a>",
    "WhatDoIDownloadABPCommercial": "¿Qué descargo cuando compro ABP Commercial?",
    "CreateUnlimitedSolutions": "Una vez que adquiera una licencia comercial de ABP, podrá crear soluciones ilimitadas como se describe en el documento <a href=\"{0}\"> Getting Started </a>.",
    "ABPCommercialSolutionExplanation": "Cuando crea una nueva aplicación, obtiene una solución de Visual Studio (una plantilla de inicio) basada en sus preferencias. La solución descargada tiene módulos comerciales y temas ya instalados y configurados para usted. Puede quitar un módulo preinstalado o agregar otro módulo si lo desea. Todos los módulos y temas se utilizan como paquetes NuGet/NPM de forma predeterminada.",
    "StartDevelopWithTutorials": "La solución descargada está bien diseñada y documentada. Puede comenzar a desarrollar su propio código comercial basado en él siguiendo <a href=\"{0}\"> los tutoriales </a>.",
    "TryTheCommercialDemo": "Puede probar <a href=\"{0}\"> la demostración </a> para ver una aplicación de muestra creada con la plantilla de inicio comercial de ABP.",
    "HowManyProducts": "¿Cuántos productos/soluciones diferentes puedo construir usando ABP Commercial?",
    "HowManyProductsExplanation": "No hay límite para crear un proyecto ABP. Puedes crear tantos proyectos como quieras, desarrollarlos y subirlos a diferentes servidores.",
    "HowManyDevelopers": "¿Cuántos desarrolladores pueden trabajar en ABP Commercial?",
    "HowManyDevelopersExplanation": "Las licencias comerciales de ABP son por desarrollador. Los diferentes tipos de licencias tienen diferentes límites de desarrollador. Sin embargo, puede agregar más desarrolladores a cualquier tipo de licencia cuando lo necesite. Consulte <a href=\"{0}\"> la página de precios </a> para conocer los tipos de licencia, los límites de desarrollador y los costos adicionales de desarrollador.",
    "ChangingLicenseType": "¿Puedo actualizar mi tipo de licencia más tarde?",
    "ChangingLicenseTypeExplanation": "Puede actualizar a una licencia superior pagando la diferencia dentro de su período de licencia activa. Cuando actualiza a un plan de licencia superior, obtiene los beneficios del nuevo plan, pero la actualización de la licencia no cambia la fecha de vencimiento de la licencia. Además, también puede agregar nuevos puestos de desarrollador a su licencia existente, consulte \"¿Cuántos desarrolladores pueden trabajar en ABP Commercial?\"",
    "LicenseExtendUpgradeDiff": "¿Cuál es la diferencia entre ampliar y actualizar la licencia?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Extending:</strong> By extending/renewing your license, you will continue to get premium support and get major updates for the modules and themes. Besides, you will be able to continue creating new projects. And you will still be able to use ABP Suite which speeds up your development.<hr/><strong>Upgrading:</strong> By upgrading your license, you will promote to a higher license plan which will allow you to get additional benefits. See the <a href=\"/pricing\">license comparison table</a> to check the differences between the license plans.<strong>On the other hand, when you upgrade, your license expiry date will not change!</strong>To extend your license end date, you need to extend your license.",
    "LicenseRenewalCost": "¿Cuál es el costo de renovación de la licencia después de 1 año?",
    "LicenseRenewalCostExplanation": "La tasa de renovación (extensión) de todas las licencias perpetuas comerciales de ABP es {0} del precio de lista de la licencia. El precio de renovación de la licencia de equipo estándar es de $ {1}, la licencia comercial estándar es de $ {2} y la licencia empresarial estándar es de $ {3}. Si ya es cliente, <a href='{4}' target='_blank'> inicie sesión en su cuenta </a> para revisar los precios de renovación disponibles.",
    "HowDoIRenewMyLicense": "¿Cómo renuevo mi licencia?",
    "HowDoIRenewMyLicenseExplanation": "Puede renovar su licencia navegando a la <a href='{0}' target='_blank'> página de administración de la organización </a>. Para aprovechar nuestras tarifas de renovación anticipada con descuento, asegúrese de renovar antes de que expire su licencia. Sin embargo, no se preocupe por no saber cuándo se cierra su oportunidad de Renovación Temprana. Recibirá 3 correos electrónicos de recordatorio antes de que expire su suscripción. Los enviaremos 30 días, 7 días y 1 día antes del vencimiento.",
    "IsSourceCodeIncluded": "¿Mi licencia incluye el código fuente de los módulos y temas comerciales?",
    "IsSourceCodeIncludedExplanation1": "Depende del tipo de licencia que haya comprado:",
    "IsSourceCodeIncludedExplanation2": "<strong> Equipo </strong>: su solución usa los módulos y los temas como paquetes NuGet y NPM. No incluye su código fuente. De esta manera, puede actualizar fácilmente estos módulos y temas siempre que haya una nueva versión disponible. Sin embargo, no puede obtener el código fuente de los módulos y los temas.",
    "IsSourceCodeIncludedExplanation3": "<strong> Business/Enterprise </strong>: además de la licencia Team, puedes descargar el código fuente de cualquier módulo o tema que necesites. Incluso puede eliminar las referencias del paquete NuGet/NPM para un módulo en particular y agregar su código fuente directamente a su solución para cambiarlo por completo.",
    "IsSourceCodeIncludedExplanation4": "<p> Incluir el código fuente de un módulo en su solución le brinda la máxima libertad para personalizar ese módulo. Sin embargo, entonces no será posible actualizar automáticamente el módulo cuando se lance una nueva versión. </p> <p> Ninguna de las licencias incluye el código fuente de ABP Suite, que es una herramienta externa que genera código para usted y ayuda para su desarrollo. </p> <p> Consulte <a href=\"{0}\"> la página de precios </a> para ver otras diferencias entre los tipos de licencia. </p>",
    "ChangingDevelopers": "¿Puedo cambiar los desarrolladores registrados de mi organización en el futuro?",
    "ChangingDevelopersExplanation": "Además de agregar nuevos desarrolladores a su licencia, también puede cambiar los desarrolladores existentes (puede eliminar un desarrollador y agregar uno nuevo al mismo puesto) sin ningún costo adicional.",
    "WhatHappensWhenLicenseEnds": "¿Qué sucede cuando finaliza mi período de licencia?",
    "WhatHappensWhenLicenseEndsExplanation1": "El tipo de licencia comercial de ABP es <a href=\"{0}\" target=\"_blank\"> licencia perpetua </a>. Una vez que expire su licencia, puede continuar desarrollando su proyecto. Y no está obligado a renovar su licencia. Su licencia viene con un plan de soporte y actualizaciones de un año listo para usar. Para continuar recibiendo nuevas funciones, mejoras de rendimiento, corrección de errores, soporte y continuar usando ABP Suite, asegúrese de renovar su plan cada año. Cuando su licencia expire, no podrá obtener más de los siguientes beneficios;",
    "WhatHappensWhenLicenseEndsExplanation2": "No puede crear nuevas soluciones utilizando ABP Commercial, pero puede continuar desarrollando sus aplicaciones existentes para siempre.",
    "WhatHappensWhenLicenseEndsExplanation3": "Podrá obtener actualizaciones para los módulos y temas dentro de su versión PRINCIPAL. Por ejemplo; si está utilizando la v3.2.0 de un módulo, aún puede obtener actualizaciones para la v3.x.x (v3.3.0, v3.5.2 ... etc.) de ese módulo. Pero no puede obtener actualizaciones para la próxima versión principal (como v4.x, v5.x)",
    "WhatHappensWhenLicenseEndsExplanation4": "No puede instalar nuevos módulos y temas agregados a la plataforma comercial de ABP después de que finalice su licencia.",
    "WhatHappensWhenLicenseEndsExplanation5": "No puede utilizar ABP Suite.",
    "WhatHappensWhenLicenseEndsExplanation6": "Ya no puede obtener la <a href=\"{0}\"> asistencia premium </a>.",
    "WhatHappensWhenLicenseEndsExplanation7": "Puede renovar su suscripción si desea continuar obteniendo estos beneficios. Si renueva su suscripción dentro de 1 mes después de que expire su licencia, se aplica un descuento del 20%.",
    "WhenShouldIRenewMyLicense": "¿Cuándo debo renovar mi licencia?",
    "WhenShouldIRenewMyLicenseExplanation1": "Si renueva su licencia dentro de <strong> 1 mes </strong> después de que caduque, se aplicará un descuento del 20%.",
    "WhenShouldIRenewMyLicenseExplanation2": "Si renueva su licencia después de 1 mes desde la fecha de vencimiento de su licencia, el precio de renovación será el mismo que el precio de compra de la licencia y no habrá descuento por su renovación.",
    "TrialPlan": "¿Tiene un plan de prueba?",
    "TrialPlanExplanation": "Por ahora, ABP Commercial no tiene un plan de prueba. Para las licencias Team ofrecemos 30 días de garantía de devolución de dinero. Solo puede solicitar un reembolso en los primeros 30 días. Para las licencias Business y Enterprise, proporcionamos un reembolso del 60% en 30 días. Esto se debe a que las licencias Business y Enterprise incluyen el código fuente completo de todos los módulos y temas.",
    "DoYouAcceptBankWireTransfer": "¿Aceptan transferencia bancaria?",
    "DoYouAcceptBankWireTransferExplanation": "Sí, aceptamos transferencia bancaria. <br /> Después de enviar la tarifa de la licencia mediante transferencia bancaria, envíenos un correo electrónico a info@abp.io con su recibo y el tipo de licencia solicitada. Nuestra información de cuenta bancaria internacional:",
    "HowToUpgrade": "¿Cómo actualizar las aplicaciones existentes cuando hay una nueva versión disponible?",
    "HowToUpgradeExplanation1": "Cuando crea una nueva aplicación utilizando ABP Commercial, todos los módulos y el tema se utilizan como paquetes NuGet y NPM. Por lo tanto, puede actualizar fácilmente los paquetes cuando haya una nueva versión disponible.",
    "HowToUpgradeExplanation2": "Además de las actualizaciones estándar de NuGet/NPM, <a href=\"{0}\"> ABP CLI </a> proporciona un comando de actualización que busca y actualiza automáticamente todos los paquetes relacionados con ABP en su solución.",
    "DatabaseSupport": "¿Qué sistemas de bases de datos son compatibles?",
    "DatabaseSupportExplanation": "ABP Framework en sí es independiente de la base de datos y puede trabajar con cualquier proveedor de base de datos por su naturaleza. Consulte <a href=\"{0}\" target=\"_blank\"> el documento de acceso a datos </a> para obtener una lista de los proveedores implementados actualmente.",
    "UISupport": "¿Qué marcos de interfaz de usuario son compatibles?",
    "Supported": "Soportado",
    "UISupportExplanation": "ABP Framework en sí es independiente del marco de interfaz de usuario y puede funcionar con cualquier marco de interfaz de usuario. Sin embargo, las plantillas de inicio, las IU de módulo y los temas no se implementaron para todos los marcos de IU. Consulte <a href=\"{0}\"> el documento de introducción </a> para obtener la lista actualizada de opciones de IU.",
    "MicroserviceSupport": "¿Es compatible con la arquitectura de microservicio?",
    "MicroserviceSupportExplanation1": "Uno de los principales objetivos del marco ABP es proporcionar una infraestructura conveniente para crear soluciones de microservicio. Consulte el documento <a href=\"{0}\"> arquitectura de microservicio </a> para comprender cómo ayuda a crear sistemas de microservicio.",
    "MicroserviceSupportExplanation2": "Todos los módulos comerciales de ABP están diseñados para admitir escenarios de implementación de microservicios (con su propia API y base de datos) siguiendo el documento de <a href=\"{0}\"> mejores prácticas de desarrollo de módulos </a>.",
    "MicroserviceSupportExplanation3": "Proporcionamos una <a href=\"{0}\"> solución de demostración de microservicio </a> de muestra que demuestra una implementación de arquitectura de microservicio para ayudarlo a crear su propia solución.",
    "MicroserviceSupportExplanation4": "Entonces, la respuesta corta es \"<strong> sí, es compatible con la arquitectura de microservicio </strong>\".",
    "MicroserviceSupportExplanation5": "Sin embargo, un sistema de microservicio es una solución y cada solución tendrá diferentes requisitos, topología de red, escenarios de comunicación, posibilidades de autenticación, decisiones de separación/uso compartido de bases de datos, configuraciones de tiempo de ejecución, integraciones de sistemas de terceros y muchos más.",
    "MicroserviceSupportExplanation6": "ABP Framework y ABP Commercial proporcionan infraestructura para escenarios de microservicio, módulos compatibles con microservicio, muestras y documentación para ayudarlo a crear su propia solución. Pero no espere descargar directamente la solución de sus sueños preconstruida para usted. Deberá comprenderlo y unir algunas partes según sus requisitos.",
    "WhereCanIDownloadSourceCode": "¿Dónde puedo descargar el código fuente?",
    "WhereCanIDownloadSourceCodeExplanation": "Puede descargar el código fuente de todos los módulos ABP, paquetes angulares y temas a través de ABP Suite o ABP CLI. Consulte <a href=\"{0}\"> ¿Cómo descargar el código fuente? </a>",
    "ComputerLimitation": "¿Cuántas computadoras puede iniciar sesión un desarrollador al desarrollar ABP?",
    "ComputerLimitationExplanation": "Permitimos específicamente <strong> {0} computadoras </strong> por individuo/desarrollador con licencia. Siempre que sea necesario que un desarrollador desarrolle productos ABP Commercial en una tercera máquina, se debe enviar un correo electrónico a license@abp.io explicando la situación y luego haremos la asignación apropiada en nuestro sistema.",
    "RefundPolicy": "¿Tiene una política de reembolso?",
    "RefundPolicyExplanation": "Puede solicitar un reembolso dentro de los <strong> 30 días </strong> posteriores a la compra de su licencia. Los tipos de licencia Business y Enterprise tienen la opción de descargar el código fuente, por lo tanto, los reembolsos no están disponibles para Business y Enterprise (y cualquier licencia que incluya el derecho a recibir el código fuente). Además, no se realizan reembolsos por renovaciones y compras de segundas licencias.",
    "HowCanIRefundVat": "¿Cómo puedo devolver el IVA?",
    "HowCanIRefundVatExplanation1": "Si realizó el pago mediante 2Checkout, puede reembolsar el IVA a través de su cuenta 2Checkout:",
    "HowCanIRefundVatExplanation2": "Inicie sesión en su cuenta de <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\"> 2Checkout </a>",
    "HowCanIRefundVatExplanation3": "Busque el pedido correspondiente y presione \"Reembolsar IVA tardío\" (ingrese su ID de IVA)",
    "HowCanIGetMyInvoice": "¿Cómo puedo obtener mi factura?",
    "HowCanIGetMyInvoiceExplanation": "Hay 2 pasarelas de pago para comprar una licencia: Iyzico y 2Checkout. Si compra su licencia a través de la puerta de enlace 2Checkout, envía la factura en PDF a su dirección de correo electrónico, consulte <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How- do-invoices-work \"> 2Facturación de pago. </a> Si compras a través de la pasarela de Iyzico, con un enlace de compra personalizado o mediante transferencia bancaria, prepararemos y enviaremos tu factura. Puede solicitar o descargar su factura desde la <a href=\"{0}\"> página de administración de la organización </a>. ¡Antes de contactarnos para la factura, consulte la página de administración de su organización!",
    "Forum": "Foro",
    "SupportExplanation": "Las licencias comerciales de ABP proporcionan un soporte de foro premium por parte de un equipo formado por expertos en ABP Framework.",
    "PrivateTicket": "Entrada privada",
    "PrivateTicketExplanation": "Enterprise License también incluye un soporte privado con correo electrónico y sistema de tickets.",
    "AbpSuiteExplanation1": "ABP Suite le permite crear páginas web en cuestión de minutos. Es una herramienta global de .NET Core que se puede instalar desde la línea de comandos.",
    "AbpSuiteExplanation2": "Puede crear una nueva solución ABP, generar páginas CRUD desde la base de datos al front-end. Para obtener una descripción general técnica, consulte <a href=\"{0}\"> el documento </a>",
    "FastEasy": "Rápido y Fácil",
    "AbpSuiteExplanation3": "ABP Suite le permite crear fácilmente páginas CRUD. Solo necesita definir su entidad y sus propiedades, ¡deje el resto a ABP Suite por usted! ABP Suite genera todo el código necesario para su página CRUD en unos segundos. Es compatible con las interfaces de usuario Angular, MVC y Blazor.",
    "RichOptions": "Opciones ricas",
    "AbpSuiteExplanation4": "ABP Suite admite varias opciones de IU como <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\"> Razor Pages </a> y <a href=\"https://angular.io\">Angular </a>. También admite varias bases de datos como <a href=\"https://www.mongodb.com\"> MongoDB </a> y todas las bases de datos compatibles con <strong> EntityFramework Core </strong> (MS SQL Server, Oracle, MySql, PostgreSQL y <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\"> más </a>).",
    "AbpSuiteExplanation5": "Lo bueno es que no tienes que preocuparte por esas opciones. ABP Suite entiende su tipo de proyecto y genera el código para su proyecto y coloca el código generado en el lugar correcto en su proyecto.",
    "SourceCode": "Código fuente",
    "AbpSuiteExplanation6": "¡ABP Suite genera el código fuente por usted! No genera archivos mágicos para generar la página web. ABP Suite genera el código fuente para <strong> Entity, Repository, Application Service, Code First Migration, JavaScript/TypeScript y CSHTML/HTML </strong> y también las interfaces necesarias. ABP Suite también genera el código de acuerdo con las <strong> Mejores prácticas </strong> de desarrollo de software, por lo que no tiene que preocuparse por la calidad del código generado.",
    "AbpSuiteExplanation7": "Dado que tiene el código fuente de los bloques de construcción de la página CRUD generada en las capas de aplicación correctas, puede modificar fácilmente el código fuente e inyectar su lógica personalizada/empresarial al código generado.",
    "CrossPlatform": "Plataforma cruzada",
    "AbpSuiteExplanation8": "ABP Suite está construido con .NET Core y es multiplataforma. Se ejecuta como una aplicación web en su computadora local. Puede ejecutarlo en <strong> Windows </strong>, <strong> Mac </strong> y <strong> Linux </strong>",
    "OtherFeatures": "Otras características",
    "OtherFeatures1": "Actualiza fácilmente los paquetes <strong> NuGet </strong> y <strong> NPM </strong> en su solución.",
    "OtherFeatures2": "Regenera páginas ya generadas desde cero.",
    "OtherFeatures3": "Crea nuevas soluciones",
    "ThanksForCreatingProject": "¡Gracias por crear su proyecto!",
    "HotToRunSolution": "¿Cómo ejecutar su solución?",
    "HotToRunSolutionExplanation": "Consulte el documento de introducción para aprender a configurar y ejecutar su solución.",
    "GettingStarted": "Empezando",
    "WebAppDevTutorial": "Tutorial para desarrolladores de aplicaciones web",
    "WebAppDevTutorialExplanation": "Consulte el documento tutorial de desarrollo de aplicaciones web para obtener una muestra de desarrollo paso a paso.",
    "Document": "Documento",
    "UsingABPSuiteToCURD": "Uso de ABP Suite para generación de páginas y herramientas CRUD",
    "SeeABPSuiteDocument": "Consulte el documento de ABP Suite para conocer el uso de ABP Suite.",
    "AskQuestionsOnSupport": "Puede hacer preguntas sobre el soporte comercial de ABP.",
    "Documentation": "Documentación",
    "SeeModulesDocument": "Consulte el documento de módulos para obtener una lista de todos los módulos comerciales (pro) y sus documentos.",
    "Pricing": "Precios",
    "PricingExplanation": "Elija las características y la funcionalidad que su empresa necesita hoy. Actualice fácilmente a medida que crece su negocio.",
    "Team": "Equipo",
    "Business": "Negocio",
    "Enterprise": "Empresa",
    "Custom": "Personalizado",
    "IncludedDeveloperLicenses": "Licencias de desarrollador incluidas",
    "CustomLicenceOrAdditionalServices": "¿Necesita una licencia personalizada o servicios adicionales?",
    "CustomOrVolumeLicense": "Licencia personalizada o por volumen",
    "LiveTrainingSupport": "Capacitación y soporte en vivo",
    "AndMore": "y más",
    "AdditionalDeveloperLicense": "Licencia de desarrollador adicional",
    "ProjectCount": "Recuento de proyectos",
    "AllProModules": "Todos los módulos pro",
    "AllProThemes": "Todos los temas profesionales",
    "AllProStartupTemplates": "Todas las plantillas de inicio profesionales",
    "SourceCodeOfAllModules": "Código fuente de todos los módulos",
    "SourceCodeOfAllThemes": "Código fuente de todos los temas",
    "PerpetualLicense": "Licencia perpetua",
    "UnlimitedServerDeployment": "Implementación de servidor ilimitada",
    "YearUpgrade": "1 año de actualización",
    "YearPremiumForumSupport": "Soporte de foro premium de 1 año",
    "ForumSupportIncidentCountYear": "Número de incidentes de soporte del foro/año",
    "PrivateTicketEmailSupport": "Soporte privado de tickets y correo electrónico",
    "BuyNow": "Compra ahora",
    "PayViaAmexCard": "¿Cómo puedo pagar con mi tarjeta AMEX?",
    "PayViaAmexCardDescription": "La pasarela de pago predeterminada 'Iyzico' puede rechazar algunas tarjetas de crédito AMEX debido a las medidas de seguridad. En este caso, puede pagar a través de la pasarela de pago alternativa '2Checkout'.",
    "ThankYou": "Gracias",
    "InvalidReCaptchaErrorMessage": "Se produjo un error al verificar reCAPTCHA. Inténtalo de nuevo.",
    "CompanyName": "Nombre de empresa",
    "YourCompanyName": "El nombre de tu compañía",
    "FirstName": "Nombre de pila",
    "LastName": "Apellido",
    "Optional": "Opcional",
    "YourFirstName": "Su nombre",
    "YourLastName": "Tu apellido",
    "SpecialOffer": "Oferta especial",
    "SpecialOfferMessage": "¡Apresúrate! Los precios son válidos por tiempo limitado.",
    "DiscountRequest": "Solicitud de descuento",
    "DiscountRequestDescribeCustomerQuestion": "Cuál de las siguientes te describe?",
    "DiscountRequestStudentEmailMessage": "La dirección de correo electrónico debe contener 'edu'.",
    "DiscountRequestDeveloperCount": "¿Cuántos desarrolladores eres?",
    "DiscountRequestDeveloperCountExceedMessage": "No proporcionamos licencias con descuento para empresas que tienen más de {0} desarrolladores.",
    "DiscountRequestOrganizationName": "Nombre de la empresa/organización/escuela",
    "Website": "Sitio web",
    "GithubUsername": "Nombre de usuario de GitHub",
    "PhoneNumber": "Número de teléfono",
    "Country": "País",
    "DescribeABPCommercialUsage": "Describe el proyecto que planeas desarrollar en base a APB Comercial",
    "DiscountRequestCertifyInformationMessage": "Certifico que toda la información es verdadera y correcta.",
    "DiscountRequestReceived": "Hemos recibido su solicitud de descuento.",
    "DiscountRequestStatusMessage": "Le responderemos después de verificar la información que nos ha proporcionado.",
    "MVCOrRazorPages": "MVC (páginas de Razor)",
    "Angular": "Angular",
    "Blazor": "Blazor",
    "New": "Nuevo",
    "MongoDB": "MongoDB",
    "EBookDDD": "Diseño basado en dominios de libros electrónicos",
    "PracticalGuideForImplementingDDD": "Este libro es una guía práctica para implementar el diseño basado en dominios con el marco ABP.",
    "IntroducingDDD": "Presentamos el diseño basado en dominios",
    "DDDLayersAndCleanArchitecture": "Capas DDD y arquitectura limpia",
    "LayeringOfADotnetSolution": "Creación de capas de una solución .NET",
    "ImplementingDDDBuildingBlocks": "Implementación de bloques de construcción de DDD",
    "DomainVsApplicationLogic": "Lógica de dominio frente a lógica de aplicación",
    "SamplesAndDiscussions": "Muestras y discusiones",
    "Free": "Gratis",
    "Download": "Descargar",
    "DDDEBook": "Libro electrónico DDD",
    "ImplementingDDD": "Implementación de diseño basado en dominios",
    "DDDBookExplanation": "Una guía práctica para implementar el diseño dirigido por dominios con el marco ABP.",
    "Overview": "Visión general",
    "DDDBookPracticalGuide": "Esta es una guía práctica para implementar el diseño controlado por dominio (DDD). Si bien los detalles de implementación se basan en la infraestructura ABP Framework, los conceptos, principios y patrones centrales son aplicables en cualquier tipo de solución, incluso si no es una solución .NET.",
    "TableOfContents": "Tabla de contenido",
    "IntroductionToImplementingDDD": "Introducción a la implementación del diseño basado en dominios",
    "WhatIsDDD": "¿Qué es el diseño basado en dominios?",
    "Implementation": "Implementación",
    "TheBigPicture": "El panorama",
    "TheBuildingBlock": "El bloque de construcción",
    "ExampleUseCase": "Ejemplo de caso de uso",
    "DomainAndApplicationLogic": "Lógica de dominio y lógica de aplicación",
    "Author": "Autor",
    "PublishedOn": "Publicado en",
    "Page": "Página",
    "FreeEBook": "Libro electrónico gratuito",
    "EBookSignInForDownload": "Para descargar el libro electrónico, inicie sesión",
    "SignIn": "Iniciar sesión",
    "Or": "O",
    "TellUsAboutYourself": "Cuéntanos un poco sobre ti",
    "Surname": "Apellido",
    "DoYouAgreePrivacyPolicy": "Acepto los <a href=\"/TermsConditions\"> Términos y condiciones <a/> y la <a href=\"/Privacy\"> Política de privacidad </a>.",
    "VolosoftMarketingInformationMessage": "Me gustaría obtener información, consejos y ofertas sobre soluciones para empresas y organizaciones y otros productos y servicios de Volosoft.",
    "VolosoftSharingInformationMessage": "Me gustaría que Volosoft compartiera mi información con socios selectos para poder recibir información relevante sobre sus productos y servicios.",
    "WeWillSendYouADownloadLink": "Se ha enviado un enlace para descargar el libro electrónico a {0}. <br/> ¡Revise su bandeja de entrada/correo no deseado/correo no deseado!",
    "InvalidFormInputs": "Por favor, ingrese la información válida especificada en el formulario.",
    "DDDBookEmailBody": "Gracias. <br /> Para descargar su libro, <a href=\"{0}\"> haga clic aquí </a>.",
    "FreeDDDEBook": "Libro electrónico DDD gratuito",
    "StartFree": "Empiece gratis",
    "FreeTrial": "Prueba gratis",
    "AcceptsMarketingCommunications": " Sí, me gustaría recibir comunicaciones de marketing comercial de ABP.",
    "PurposeOfUsage": "Propósito de uso",
    "Industry": "Industria",
    "Choose": "- Escoger -",
    "CompanyOrganizationName": "Nombre de Empresa/Organización",
    "CompanySize": "Tamaño de la empresa",
    "Next": "próximo",
    "StartTrial": "Iniciar mi prueba gratuita",
    "ContactUsIssues": "Contáctanos si tienes algún problema",
    "TrialActivatedWarning": "Estimado {0}, un usuario tiene derecho a tener solo 1 período de prueba gratuito. Ya usaste tu período de prueba.",
    "ActivationRequirement": "Está a un paso de comenzar su prueba gratuita. <br> Hemos enviado un correo electrónico a <b> {0} </b> para activar su cuenta. ¡Revise su bandeja de entrada/basura/buzones de correo no deseado!",
    "SaveAndDownload": "Guardar y descargar",
    "CompanyNameValidationMessage": "¡El nombre de la empresa es demasiado largo!",
    "AddressValidationMessage": "¡La dirección es demasiado larga!",
    "TaxNoValidationMessage": "IMPUESTO/IVA ¡No es demasiado largo!",
    "NotesValidationMessage": "El campo de notas es demasiado largo.",
    "CheckYourBillingInfo": "¡Puedes crear tu factura solo una vez! Verifique su información de facturación antes de crear su factura.",
    "Volo.AbpIo.Commercial:030000": "Ya usaste tu período de prueba.",
    "Volo.AbpIo.Commercial:030001": "Este nombre de organización ya existe.",
    "StartYourFreeTrial": "Comienza tu prueba gratuita",
    "TrialLicenseModelInvalidErrorMessage": "Uno de los siguientes campos no es válido: nombre del país, tamaño de la empresa, sector o finalidad de uso.",
    "Trial": "Prueba",
    "Purchased": "Comprado",
    "PurchaseLicense": "Licencia de compra",
    "PurchaseTrialLicenseMessage": "La fecha de vencimiento de su licencia es {0}. <br> Si desea continuar usando los proyectos que creó durante su período de prueba gratuito, debe cambiar las claves de licencia en sus archivos <code> appsettings.secrets.json </code>. Aquí está su clave de licencia:",
    "TrialLicenseExpireMessage": "Está utilizando la licencia de prueba y su licencia de prueba caducará el {0}.",
    "TryForFree": "Prueba gratis",
    "TrialLicenseExpiredInfo": "¡Su período de licencia de prueba ha expirado!",
    "CommercialNewsletterConfirmationMessage": "Acepto los <a href=\"https://commercial.abp.io/TermsConditions\"> Términos y condiciones </a> y la <a href=\"https://commercial.abp.io/Privacy\"> Política de privacidad </a>."
  }
}