{
  "culture": "fr",
  "texts": {
    "OrganizationManagement": "Gestion de l'organisation",
    "OrganizationList": "Liste des organisations",
    "Volo.AbpIo.Commercial:010003": "Vous n'êtes pas propriétaire de cette organisation!",
    "OrganizationNotFoundMessage": "Aucune organisation trouvée!",
    "DeveloperCount": "Développeurs alloués/totaux",
    "QuestionCount": "Questions restantes/totales",
    "Unlimited": "Illimité",
    "Owners": "Propriétaires",
    "AddMember": "Ajouter un membre",
    "AddOwner": "Ajouter un propriétaire",
    "AddDeveloper": "Ajouter un développeur",
    "UserName": "Nom d'utilisateur",
    "Name": "Nom",
    "EmailAddress": "Adresse e-mail",
    "Developers": "Développeurs",
    "LicenseType": "Type de licence",
    "Manage": "Gérer",
    "StartDate": "Date de début",
    "EndDate": "Date de fin",
    "Modules": "Modules",
    "LicenseExtendMessage": "La date de fin de votre licence est étendue au {0}",
    "LicenseUpgradeMessage": "Votre licence est mise à niveau vers {0}",
    "LicenseExtendAdnUpgradeMessage": "Votre licence a été prolongée jusqu'au {0} et votre plan de licence est mis à niveau vers {1}.",
    "LicenseAddDeveloperMessage": "{0} développeurs ajoutés à votre licence",
    "Volo.AbpIo.Commercial:010004": "Impossible de trouver l'utilisateur spécifié! L'utilisateur doit être déjà enregistré.",
    "MyOrganizations": "Mes organisations",
    "ApiKey": "Clé API",
    "UserNameNotFound": "Il n'y a aucun utilisateur avec le nom d'utilisateur {0}",
    "SuccessfullyAddedToNewsletter": "Merci de vous être abonné à notre newsletter!",
    "MyProfile": "Mon profil",
    "EmailNotValid": "S'il vous plaît, mettez une adresse email valide.",
    "JoinOurMarketingNewsletter": "Rejoignez notre newsletter marketing",
    "WouldLikeToReceiveMarketingMaterials": "Je souhaite recevoir des supports marketing tels que des offres de produits et des offres spéciales.",
    "StartUsingYourLicenseNow": "Commencez à utiliser votre licence maintenant!",
    "WelcomePage": "Page d'accueil",
    "UnsubscriptionExpireEmail": "Se désabonner des e-mails de rappel de la date d'expiration de la licence",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Cet abonnement par e-mail ne contient que le rappel de la date d'expiration de votre licence.",
    "UnsubscribeFromLicenseExpireEmails": "Si vous ne souhaitez pas recevoir les e-mails concernant la date d'expiration de votre licence, vous pouvez vous désinscrire à tout moment.",
    "Unsubscribe": "Se désabonner",
    "NotOrganizationMember": "Vous n'êtes membre d'aucune organisation.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Désabonnement réussi",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Vous ne recevrez plus d'e-mails de rappel de la date d'expiration de la licence.",
    "IndexPageHeroSection": "<span class=\"first-line\">Une plate-forme de développement Web</span><span class=\"second-line\"> complète </span><span class=\"third-line\"> intégrée <img src=\"{0}\" width = \"110\" class=\"ml-1\" /> cadre </span>",
    "AbpCommercialShortDescription": "ABP Commercial fournit des modules d'application prédéfinis, des outils de développement rapide d'applications, des thèmes d'interface utilisateur professionnels, un support premium et plus encore.",
    "LiveDemo": "Démo en direct",
    "GetLicence": "Obtenez une licence",
    "Application": "Application",
    "StartupTemplates": "Modèles de démarrage",
    "Startup": "Commencez",
    "Templates": "Modèles",
    "Developer": "Développeur",
    "Tools": "Outils",
    "Premium": "Premium",
    "PremiumSupport": "Assistance Premium",
    "PremiumForumSupport": "Assistance du forum Premium",
    "UI": "UI",
    "Themes": "Thèmes",
    "JoinOurNewsletter": "Rejoignez notre newsletter",
    "Send": "Envoyer",
    "Learn": "Apprendre",
    "AdditionalServices": "Des services supplémentaires",
    "WhatIsABPFramework": "QU'EST-CE QUE LE FRAMEWORK ABP?",
    "OpenSourceBaseFramework": "Framework de base Open Source",
    "ABPFrameworkExplanation": "<p class=\"lead\"> ABP Commercial est basé sur ABP Framework, un framework d'applications Web open source et communautaire pour ASP.NET Core.</p><p> ABP Framework fournit une excellente infrastructure pour écrire maintenable et extensible et du code testable avec les meilleures pratiques.</p><p> Construit et intégré à des outils populaires que vous connaissez déjà. Faible courbe d'apprentissage, adaptation facile, développement confortable.</p>",
    "Modular": "Modulaire",
    "MicroserviceCompatible": "Compatible avec les microservices",
    "DomainDrivenDesignInfrastructure": "Infrastructure de conception pilotée par domaine",
    "MultiTenancy": "Multi-souscrivant",
    "DistributedMessaging": "Messagerie distribuée",
    "DynamicProxying": "Proxying dynamique",
    "BackgroundJobs": "Tâches d'arrière-plan",
    "AuditLogging": "Journalisation d'audit",
    "BLOBStoring": "Stockage BLOB",
    "BundlingMinification": "Bundling et minification",
    "AdvancedLocalization": "Localisation avancée",
    "ManyMore": "Beaucoup plus",
    "ExploreTheABPFramework": "Explorez le Framework ABP",
    "WhyUseTheABPCommercial": "Pourquoi utiliser ABP Commercial?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\"> La création d'applications Web de niveau entreprise peut être complexe et prendre du temps.</p><p> ABP Commercial offre l'infrastructure de base parfaite nécessaire pour tous les ASP.NET Core modernes de niveau entreprise solutions basées. De la conception au déploiement, l'ensemble du cycle de développement est optimisé par les fonctionnalités et modules intégrés d'ABP.</p>",
    "StartupTemplatesShortDescription": "Les modèles de démarrage vous permettent de démarrer votre projet en quelques secondes.",
    "UIFrameworksOptions": "Options de frameworks d'interface utilisateur;",
    "DatabaseProviderOptions": "Options du fournisseur de base de données;",
    "PreBuiltApplicationModules": "Modules d'application prédéfinis",
    "PreBuiltApplicationModulesShortDescription": "Les exigences d'application les plus courantes sont déjà développées pour vous en tant que modules réutilisables.",
    "Account": "Compte",
    "Blogging": "Bloguer",
    "Identity": "Identité",
    "IdentityServer": "Serveur d'identité",
    "Saas": "Saas",
    "LanguageManagement": "Gestion de la langue",
    "TextTemplateManagement": "Gestion des modèles de texte",
    "See All Modules": "VoirTousModules",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "ABP Suite est un outil complémentaire à ABP Commercial.",
    "AbpSuiteExplanation": "Il vous permet de créer des pages Web en quelques minutes. C'est un outil global .NET Core qui peut être installé à partir de la ligne de commande. Il peut créer une nouvelle solution ABP, générer des pages CRUD de la base de données vers le front-end.",
    "Details": "Détails",
    "LeptonTheme": "Thème Lepton",
    "ProfessionalModernUIThemes": "Thèmes d'interface utilisateur professionnels et modernes",
    "LeptonThemeExplanation": "Lepton fournit une gamme de thèmes d'administration Bootstrap qui servent de base solide pour tout projet nécessitant un tableau de bord d'administration.",
    "DefaultTheme": "Thème par défaut",
    "MaterialTheme": "Thème Material",
    "Default2Theme": "Thème par défaut 2",
    "DarkTheme": "Thème sombre",
    "DarkBlueTheme": "Thème bleu foncé",
    "LightTheme": "Thème clair",
    "ProudToWorkWith": "Fier de travailler avec",
    "OurConsumers": "Des centaines d'entreprises et de développeurs dans plus de 70 pays dans le monde font confiance à ABP Commercial.",
    "JoinOurConsumers": "Rejoignez-les et créez rapidement des produits incroyables.",
    "AdditionalServicesExplanation": "Avez-vous besoin de services supplémentaires ou personnalisés? <strong> Nous et nos partenaires pouvons fournir; </strong>",
    "CustomProjectDevelopment": "Développement de projets personnalisés",
    "CustomProjectDevelopmentExplanation": "Développeurs dédiés pour vos projets personnalisés.",
    "PortingExistingProjects": "Portage de projets existants",
    "PortingExistingProjectsExplanation": "Migration de vos anciens projets vers la plateforme ABP.",
    "LiveSupport": "Support en direct",
    "LiveSupportExplanation": "Option d'assistance à distance en direct lorsque vous en avez besoin.",
    "Training": "Formation",
    "TrainingExplanation": "Une formation dédiée pour vos développeurs.",
    "OnBoarding": "Intégration",
    "OnBoardingExplanation": "Aide à la configuration de vos environnements de développement, CI et CD.",
    "PrioritizedTechnicalSupport": "Assistance technique prioritaire",
    "PremiumSupportExplanation": "Outre le grand support communautaire du framework ABP, notre équipe de support répond aux questions techniques et aux problèmes des utilisateurs commerciaux avec une priorité élevée.",
    "SeeTheSupportOptions": "Voir les options de support",
    "Contact": "Contacter",
    "TellUsWhatYouNeed": "Dites-nous ce dont vous avez besoin.",
    "YourMessage": "Votre message",
    "YourFullName": "Votre nom complet",
    "EmailField": "Adresse e-mail",
    "YourEmailAddress": "Votre adresse email",
    "HowMayWeHelpYou": "Comment pouvons nous vous aider?",
    "SendMessage": "Envoyer le message",
    "Success": "Succès",
    "WeWillReplyYou": "Nous avons reçu votre message et vous contacterons sous peu.",
    "GoHome": "Retour à l'acceuil",
    "CreateLiveDemo": "Créer une démo en direct",
    "RegisterToTheNewsletter": "Inscrivez-vous à la newsletter pour recevoir des informations concernant ABP.IO, y compris les nouvelles versions, etc.",
    "EnterYourEmailOrLogin": "Saisissez votre adresse e-mail pour créer votre démo ou <a href=\"{0}\"> Connectez-vous </a> à l'aide de votre compte existant.",
    "ApplicationTemplate": "Modèle d'application",
    "ApplicationTemplateExplanation": "Le modèle de démarrage d'application est utilisé pour créer une nouvelle application Web.",
    "EfCoreProvider": "Entity Framework (prend en charge SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\"> et autres </a>)",
    "AlreadyIncludedInTemplateModules": "Les modules suivants sont déjà inclus et configurés dans ce modèle:",
    "ApplicationTemplateArchitecture": "Ce modèle d'application prend également en charge l'architecture à plusieurs niveaux dans laquelle la couche d'interface utilisateur, la couche API et le service d'authentification sont physiquement séparés.",
    "SeeTheGuideOrGoToTheLiveDemo": "Consultez le guide du développeur pour obtenir des informations techniques sur ce modèle ou accédez à la démo en direct.",
    "DeveloperGuide": "Guide du développeur",
    "ModuleTemplate": "Modèle de module",
    "ModuleTemplateExplanation1": "Vous souhaitez créer un module et le réutiliser dans différentes applications? Ce modèle de démarrage prépare tout pour commencer à créer un <strong> module d'application </strong> réutilisable ou un <strong> microservice </strong>.",
    "ModuleTemplateExplanation2": "<p> Vous pouvez prendre en charge un ou plusieurs frameworks d'interface utilisateur, un ou plusieurs fournisseurs de bases de données pour un seul module. Le modèle de démarrage est configuré pour exécuter et <strong> tester votre module </strong> dans une application minimale en plus de l'infrastructure de test d'unité et d'intégration.</p><p> Consultez le guide du développeur pour obtenir des informations techniques sur ce modèle.</p>",
    "WithAllStyleOptions": "avec toutes les options de style",
    "Demo": "Démo",
    "SeeAllModules": "Voir tous les modules",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) est un outil de ligne de commande pour effectuer certaines opérations courantes pour les solutions basées sur ABP.",
    "ABPSuiteEasilyCURD": "ABP Suite est un outil qui vous permet de créer facilement des pages CRUD",
    "WeAreHereToHelp": "Nous sommes ici pour <span class=\"zero-text\"> Aide </span>",
    "BrowseOrAskQuestion": "Vous pouvez parcourir nos rubriques d'aide ou rechercher dans les questions fréquemment posées, ou vous pouvez nous poser une question en utilisant le <a href=\"{0}\" class=\"text-success\"> formulaire de contact </a>.",
    "SearchQuestionPlaceholder": "Rechercher dans les questions fréquemment posées",
    "WhatIsTheABPCommercial": "Qu'est-ce que la publicité ABP?",
    "WhatAreDifferencesThanAbpFramework": "Quelles sont les différences entre le Framework ABP open source et le ABP Commercial?",
    "ABPCommercialExplanation": "ABP Commercial est un ensemble de modules, d'outils, de thèmes et de services premium basés sur le <a target=\"_blank\" href=\"{0}\"> framework ABP </a> open source. ABP Commercial est développé et soutenu par la même équipe derrière le cadre ABP.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p><a target=\"_blank\" href=\"{0}\"> Framework ABP </a> est un framework de développement d'applications modulaire, thématique et compatible avec les micro-services pour ASP.NET Core. Il fournit une architecture complète et une infrastructure solide pour vous permettre de vous concentrer sur votre propre code métier plutôt que de vous répéter à chaque nouveau projet. Il est basé sur les meilleures pratiques de développement logiciel et les outils populaires que vous connaissez déjà.</p><p> Le framework ABP est entièrement gratuit, open source et géré par la communauté. Il fournit également un thème gratuit et des modules prédéfinis (par exemple, la gestion des identités et la gestion des locataires).</p>",
    "VisitTheFrameworkVSCommercialDocument": "Pour plus d'informations, consultez le lien suivant: <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial ajoute les avantages suivants en plus du cadre ABP;",
    "Professional": "Professionnel",
    "UIThemes": "Thèmes de l'interface utilisateur",
    "EnterpriseModules": "Des <a href=\"{0}\"> modules d'application </a> prédéfinis, prêts pour l'entreprise, riches en fonctionnalités (par exemple, gestion d'Identity Server, gestion SaaS, gestion des langues)",
    "ToolingToSupport": "Outils pour soutenir votre productivité de développement (par exemple, <a href=\"{0}\"> ABP Suite </a>)",
    "PremiumSupportLink": "Assistance <a href=\"{0}\" target=\"_blank\"> Premium </a>",
    "WhatDoIDownloadABPCommercial": "Que dois-je télécharger lorsque j'achète l'ABP Commercial?",
    "CreateUnlimitedSolutions": "Une fois que vous avez acheté une licence commerciale ABP, vous pourrez créer des solutions illimitées comme décrit dans le document <a href=\"{0}\"> Premiers pas </a>.",
    "ABPCommercialSolutionExplanation": "Lorsque vous créez une nouvelle application, vous obtenez une solution Visual Studio (un modèle de démarrage) en fonction de vos préférences. La solution téléchargée contient des modules et des thèmes commerciaux déjà installés et configurés pour vous. Vous pouvez supprimer un module préinstallé ou ajouter un autre module si vous le souhaitez. Tous les modules et thèmes sont utilisés par défaut dans des packages NuGet/NPM.",
    "StartDevelopWithTutorials": "La solution téléchargée est bien architecturée et documentée. Vous pouvez commencer à développer votre propre code d'entreprise basé sur celui-ci en suivant <a href=\"{0}\"> les didacticiels </a>",
    "TryTheCommercialDemo": "Vous pouvez essayer <a href=\"{0}\"> la démonstration </a> pour voir un exemple d'application créé à l'aide du modèle de démarrage ABP Commercial.",
    "HowManyProducts": "Combien de produits/solutions différents puis-je créer à l'aide d'ABP Commercial?",
    "HowManyProductsExplanation": "Il n'y a pas de limite pour créer un projet ABP. Vous pouvez créer autant de projets que vous le souhaitez, les développer et les télécharger sur différents serveurs.",
    "HowManyDevelopers": "Combien de développeurs peuvent travailler sur l'ABP Commercial?",
    "HowManyDevelopersExplanation": "Les licences commerciales ABP sont par développeur. Différents types de licence ont des limites de développeur différentes. Cependant, vous pouvez ajouter plus de développeurs à n'importe quel type de licence chaque fois que vous en avez besoin. Consultez la <a href=\"{0}\"> page des prix </a> pour connaître les types de licence, les limites pour les développeurs et les coûts supplémentaires pour les développeurs.",
    "ChangingLicenseType": "Puis-je changer mon type de licence à l'avenir?",
    "ChangingLicenseTypeExplanation": "Vous pouvez toujours ajouter de nouveaux développeurs dans votre même type de licence. Voir aussi \"Combien de développeurs peuvent travailler sur l'ABP Commercial?\". Vous pouvez également passer à une licence supérieure en payant la différence de prix calculée. Lorsque vous passez à un plan de licence supérieur, vous bénéficiez des avantages du nouveau plan, mais la mise à niveau de la licence ne modifie pas la date d'expiration de la licence.",
    "LicenseExtendUpgradeDiff": "Quelle est la différence entre l'extension de licence et la mise à niveau?",
    "LicenseExtendUpgradeDiffExplanation": "<strong> Extension: </strong> en prolongeant/renouvelant votre licence, vous continuerez à bénéficier d'une assistance premium et à des mises à jour majeures pour les modules et les thèmes. De plus, vous pourrez continuer à créer de nouveaux projets. Et vous pourrez toujours utiliser ABP Suite, ce qui accélère votre développement.<hr/><strong> Mise à niveau: </strong> En mettant à jour votre licence, vous passerez à un plan de licence supérieur qui vous permettra d’obtenir des avantages supplémentaires . Consultez le <a href=\"/pricing\"> tableau de comparaison des licences </a> pour vérifier les différences entre les plans de licence.<strong> En revanche, lors de la mise à niveau, la date d'expiration de votre licence ne changera pas! </strong> Pour prolonger la date de fin de votre licence, vous devez prolonger votre licence.",
    "LicenseRenewalCost": "Quel est le coût du renouvellement de la licence après 1 an?",
    "LicenseRenewalCostExplanation": "Le taux de renouvellement (extension) de toutes les licences perpétuelles ABP Commercial correspond à {0} du prix catalogue de la licence. Le prix de renouvellement de la licence d'équipe standard est de {1} $, la licence professionnelle standard de {2} $ et la licence d'entreprise standard de {3} $. Si vous êtes déjà client, <a href='{4}' target='_blank'> connectez-vous à votre compte </a> pour consulter les tarifs de renouvellement disponibles.",
    "HowDoIRenewMyLicense": "Comment renouveler ma licence?",
    "HowDoIRenewMyLicenseExplanation": "Vous pouvez renouveler votre licence en accédant à la <a href='{0}' target='_blank'> page de gestion de l'organisation </a>. Afin de profiter de nos tarifs réduits de renouvellement anticipé, assurez-vous de renouveler avant l'expiration de votre licence. Cependant, ne vous inquiétez pas de ne pas savoir quand votre opportunité de renouvellement anticipé se termine. Vous recevrez 2 e-mails de rappel avant l'expiration de votre abonnement. Nous les enverrons dans les 30 jours, 7 jours avant l'expiration.",
    "IsSourceCodeIncluded": "Ma licence inclut-elle le code source des modules et thèmes commerciaux?",
    "IsSourceCodeIncludedExplanation1": "Dépend du type de licence que vous avez acheté:",
    "IsSourceCodeIncludedExplanation2": "<strong> Équipe </strong>: votre solution utilise les modules et les thèmes en tant que packages NuGet et NPM. Il n'inclut pas leur code source. De cette façon, vous pouvez facilement mettre à niveau ces modules et thèmes chaque fois qu'une nouvelle version est disponible. Cependant, vous ne pouvez pas obtenir le code source des modules et des thèmes.",
    "IsSourceCodeIncludedExplanation3": "<strong> Entreprise/Entreprise </strong>: en plus de la licence Team, vous pouvez télécharger le code source de tout module ou thème dont vous avez besoin. Vous pouvez même supprimer les références de package NuGet/NPM pour un module particulier et ajouter son code source directement à votre solution pour le modifier complètement.",
    "IsSourceCodeIncludedExplanation4": "<p> L'inclusion du code source d'un module dans votre solution vous donne le maximum de liberté pour personnaliser ce module. Cependant, il ne sera pas possible de mettre à jour automatiquement le module lorsqu'une nouvelle version est publiée.</p><p> Aucune des licences n'inclut le code source d'ABP Suite, qui est un outil externe qui génère du code pour vous et vous aide à votre développement.</p><p> Consultez la <a href=\"{0}\"> page de tarification </a> pour connaître les autres différences entre les types de licence.</p>",
    "ChangingDevelopers": "Puis-je changer les développeurs enregistrés de mon organisation à l'avenir?",
    "ChangingDevelopersExplanation": "En plus d'ajouter de nouveaux développeurs à votre licence, vous pouvez également modifier les développeurs existants (vous pouvez supprimer un développeur et en ajouter un nouveau sur le même siège) sans aucun coût supplémentaire.",
    "WhatHappensWhenLicenseEnds": "Que se passe-t-il à la fin de ma période de licence?",
    "WhatHappensWhenLicenseEndsExplanation1": "Le type de licence commerciale ABP est <a href=\"{0}\" target=\"_blank\"> licence perpétuelle </a>. Une fois votre licence expirée, vous pouvez continuer à développer votre projet. Et vous n'êtes pas obligé de renouveler votre licence. Votre licence est livrée avec un plan de mise à jour et de support d'un an prêt à l'emploi. Pour continuer à recevoir de nouvelles fonctionnalités, des améliorations de performances, des corrections de bogues, une assistance et continuer à utiliser ABP Suite, assurez-vous de renouveler votre plan chaque année. Lorsque votre licence expirera, vous ne pourrez plus bénéficier des avantages suivants;",
    "WhatHappensWhenLicenseEndsExplanation2": "Vous ne pouvez pas créer de nouvelles solutions en utilisant ABP Commercial, mais vous pouvez continuer à développer vos applications existantes pour toujours.",
    "WhatHappensWhenLicenseEndsExplanation3": "Vous pourrez obtenir des mises à jour pour les modules et les thèmes de votre version MAJEURE. Par example; si vous utilisez la v3.2.0 d'un module, vous pouvez toujours obtenir des mises à jour pour la v3.x.x (v3.3.0, v3.5.2... etc.) de ce module. Mais vous ne pouvez pas obtenir de mises à jour pour la prochaine version majeure (comme v4.x, v5.x)",
    "WhatHappensWhenLicenseEndsExplanation4": "Vous ne pouvez pas installer de nouveaux modules et thèmes ajoutés à la plate-forme ABP Commercial après la fin de votre licence.",
    "WhatHappensWhenLicenseEndsExplanation5": "Vous ne pouvez pas utiliser ABP Suite.",
    "WhatHappensWhenLicenseEndsExplanation6": "Vous ne pouvez plus bénéficier de l '<a href=\"{0}\"> assistance premium </a>.",
    "WhatHappensWhenLicenseEndsExplanation7": "Vous pouvez renouveler votre abonnement si vous souhaitez continuer à bénéficier de ces avantages. Il y a une réduction de 20% lorsque vous renouvelez votre abonnement.",
    "WhenShouldIRenewMyLicense": "Quand dois-je renouveler ma licence?",
    "WhenShouldIRenewMyLicenseExplanation1": "Si vous renouvelez votre licence dans un délai de <strong> 1 mois </strong> après l'expiration de votre licence, une réduction de 20% sera appliquée au prix total de la licence.",
    "WhenShouldIRenewMyLicenseExplanation2": "Si vous renouvelez votre licence 1 mois après la date d'expiration de votre licence, le prix de renouvellement sera le même que le prix d'achat de la licence et il n'y aura pas de réduction pour votre renouvellement.",
    "TrialPlan": "Avez-vous un plan d'essai?",
    "TrialPlanExplanation": "Pour l'instant, ABP Commercial n'a pas de plan d'essai. Pour les licences Team, nous offrons une garantie de remboursement de 30 jours. Vous pouvez simplement demander un remboursement dans les 30 premiers jours. Pour les licences Business et Enterprise, nous fournissons un remboursement de 60% en 30 jours. En effet, les licences Business et Enterprise incluent le code source complet de tous les modules et thèmes.",
    "DoYouAcceptBankWireTransfer": "Acceptez-vous les virements bancaires?",
    "DoYouAcceptBankWireTransferExplanation": "Oui, nous acceptons les virements bancaires.<br/> Après avoir envoyé le montant de la licence par virement bancaire, envoyez-nous votre reçu et le type de licence demandé par e-mail.<br/> Nos coordonnées bancaires internationales:",
    "HowToUpgrade": "Comment mettre à niveau des applications existantes lorsqu'une nouvelle version est disponible?",
    "HowToUpgradeExplanation1": "Lorsque vous créez une nouvelle application à l'aide d'ABP Commercial, tous les modules et le thème sont utilisés en tant que packages NuGet et NPM. Ainsi, vous pouvez facilement mettre à jour les packages lorsqu'une nouvelle version est disponible.",
    "HowToUpgradeExplanation2": "Outre les mises à niveau standard de NuGet/NPM, <a href=\"{0}\"> ABP CLI </a> fournit une commande de mise à jour qui recherche et met automatiquement à niveau tous les packages associés à ABP dans votre solution.",
    "DatabaseSupport": "Quels systèmes de base de données sont pris en charge?",
    "DatabaseSupportExplanation": "ABP Framework lui-même est indépendant de la base de données et peut fonctionner avec n'importe quel fournisseur de base de données de par sa nature. Consultez <a href=\"{0}\" target=\"_blank\"> le document d'accès aux données </a> pour obtenir la liste des fournisseurs actuellement mis en œuvre.",
    "UISupport": "Quels frameworks d'interface utilisateur sont pris en charge?",
    "Supported": "Prise en charge",
    "UISupportExplanation": "ABP Framework lui-même est indépendant du framework d'interface utilisateur et peut fonctionner avec n'importe quel framework d'interface utilisateur. Cependant, les modèles de démarrage, les interfaces utilisateur de module et les thèmes n'étaient pas implémentés pour tous les frameworks d'interface utilisateur. Consultez <a href=\"{0}\"> le document de démarrage </a> pour la liste à jour des options d'interface utilisateur.",
    "MicroserviceSupport": "Prend-il en charge l'architecture des micro-services?",
    "MicroserviceSupportExplanation1": "L'un des principaux objectifs du cadre ABP est de fournir une infrastructure pratique pour créer des solutions de micro-services. Consultez le document <a href=\"{0}\"> architecture de micro-service </a> pour comprendre comment cela aide à créer des systèmes de micro-service.",
    "MicroserviceSupportExplanation2": "Tous les modules ABP Commercial sont conçus pour prendre en charge les scénarios de déploiement de micro-services (avec sa propre API et sa propre base de données) en suivant le document <a href=\"{0}\"> bonnes pratiques de développement de modules </a>.",
    "MicroserviceSupportExplanation3": "Nous fournissons un exemple de <a href=\"{0}\"> solution de démonstration de micro-service </a> qui présente une implémentation d'architecture de micro-service pour vous aider à créer votre propre solution.",
    "MicroserviceSupportExplanation4": "Donc, la réponse courte est \"<strong> oui, il prend en charge l'architecture de micro-services </strong>\".",
    "MicroserviceSupportExplanation5": "Cependant, un système de micro-service est une solution et chaque solution aura des exigences différentes, une topologie de réseau, des scénarios de communication, des possibilités d'authentification, des décisions de séparation/partage de base de données, des configurations d'exécution, des intégrations de systèmes tiers et bien d'autres.",
    "MicroserviceSupportExplanation6": "Le Framework ABP et l'ABP Commercial fournissent une infrastructure pour des scénarios de micro-services, des modules compatibles avec les micro-services, des exemples et de la documentation pour vous aider à créer votre propre solution. Mais ne vous attendez pas à télécharger directement la solution de vos rêves préconfigurée pour vous. Vous devrez le comprendre et rassembler certaines parties en fonction de vos besoins.",
    "WhereCanIDownloadSourceCode": "Où puis-je télécharger le code source?",
    "WhereCanIDownloadSourceCodeExplanation": "Vous pouvez télécharger le code source de tous les modules ABP, packages angulaires et thèmes via ABP Suite ou ABP CLI. Voir <a href=\"{0}\"> Comment télécharger le code source? </a>",
    "ComputerLimitation": "Combien d'ordinateurs un développeur peut-il se connecter lors du développement d'ABP?",
    "ComputerLimitationExplanation": "Nous autorisons spécifiquement les <strong> {0} ordinateurs </strong> par développeur individuel/sous licence. Chaque fois qu'un développeur a besoin de développer des produits commerciaux ABP sur une troisième machine, un e-mail doit être envoyé à license@abp.io expliquant la situation et nous procéderons ensuite à l'allocation appropriée dans notre système.",
    "RefundPolicy": "Avez-vous une politique de remboursement?",
    "RefundPolicyExplanation": "Vous pouvez demander un remboursement dans les <strong> 30 jours </strong> suivant l'achat de votre licence. Les types de licence Business et Enterprise ont une option de téléchargement de code source, par conséquent, les remboursements ne sont pas disponibles pour les entreprises et les entreprises (et toutes les licences qui incluent un droit de recevoir le code source). De plus, aucun remboursement n'est effectué pour les renouvellements et les achats de deuxième licence.",
    "HowCanIRefundVat": "Comment puis-je rembourser la TVA?",
    "HowCanIRefundVatExplanation1": "Si vous avez effectué le paiement avec 2Checkout, vous pouvez rembourser la TVA via votre compte 2Checkout:",
    "HowCanIRefundVatExplanation2": "Connectez-vous à votre compte <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\"> 2Checkout </a>",
    "HowCanIRefundVatExplanation3": "Trouvez la commande appropriée et appuyez sur \"Rembourser la TVA tardive\" (entrez votre numéro de TVA)",
    "HowCanIGetMyInvoice": "Comment puis-je obtenir ma facture?",
    "HowCanIGetMyInvoiceExplanation": "Il existe 2 passerelles de paiement pour l'achat d'une licence: PayU et 2Checkout. Si vous achetez votre licence via la passerelle 2Checkout, elle envoie la facture PDF à votre adresse e-mail, voir <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How-do-invoices-work\"> Facturation 2Checkout.</a> Si vous achetez via la passerelle PayU ou par virement bancaire, nous préparerons et vous enverrons votre facture. Vous pouvez demander votre facture sur la <a href=\"{0}\"> page de gestion de l'organisation.</a>",
    "Forum": "Forum",
    "SupportExplanation": "ABP Commercial Licences fournit un support de forum premium par une équipe composée d'experts ABP Framework.",
    "PrivateTicket": "Billet privé",
    "PrivateTicketExplanation": "Enterprise License comprend également un support privé avec e-mail et système de ticket.",
    "AbpSuiteExplanation1": "ABP Suite vous permet de créer des pages Web en quelques minutes. C'est un outil .NET Core Global qui peut être installé à partir de la ligne de commande.",
    "AbpSuiteExplanation2": "Il peut créer une nouvelle solution ABP, générer des pages CRUD de la base de données vers le front-end. Pour une présentation technique, consultez <a href=\"{0}\"> le document </a>",
    "FastEasy": "Rapide et facile",
    "AbpSuiteExplanation3": "ABP Suite vous permet de créer facilement des pages CRUD. Il vous suffit de définir votre entité et ses propriétés, laissez le reste à ABP Suite pour vous! ABP Suite génère tout le code nécessaire pour votre page CRUD en quelques secondes. Il prend en charge les interfaces utilisateur Angular, MVC et Blazor.",
    "RichOptions": "Options riches",
    "AbpSuiteExplanation4": "ABP Suite prend en charge plusieurs options d'interface utilisateur telles que <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\"> Razor Pages </a> et <a href=\"https://angular.io\">Angular </a>. Il prend également en charge plusieurs bases de données telles que <a href=\"https://www.mongodb.com\"> MongoDB </a> et toutes les bases de données prises en charge par <strong> EntityFramework Core </strong> (MS SQL Server, Oracle, MySql, PostgreSQL et <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\"> plus </a>).",
    "AbpSuiteExplanation5": "La bonne chose est que vous n'avez pas à vous soucier de ces options. ABP Suite comprend votre type de projet et génère le code de votre projet et place le code généré au bon endroit dans votre projet.",
    "SourceCode": "Code source",
    "AbpSuiteExplanation6": "ABP Suite génère le code source pour vous! Il ne génère pas de fichiers magiques pour générer la page Web. ABP Suite génère le code source pour <strong> Entity, Repository, Application Service, Code First Migration, JavaScript/TypeScript et CSHTML/HTML </strong> ainsi que les interfaces nécessaires. ABP Suite génère également le code selon les <strong> meilleures pratiques </strong> de développement logiciel, vous n'avez donc pas à vous soucier de la qualité du code généré.",
    "AbpSuiteExplanation7": "Puisque vous avez le code source des blocs de construction de la page CRUD générée dans les couches d'application correctes, vous pouvez facilement modifier le code source et injecter votre logique personnalisée/commerciale dans le code généré.",
    "CrossPlatform": "Plateforme croisée",
    "AbpSuiteExplanation8": "ABP Suite est construit avec .NET Core et est multiplateforme. Il fonctionne comme une application Web sur votre ordinateur local. Vous pouvez l'exécuter sur <strong> Windows </strong>, <strong> Mac </strong> et <strong> Linux </strong>",
    "OtherFeatures": "Autres caractéristiques",
    "OtherFeatures1": "Met à jour facilement les packages <strong>NuGet</strong> et <strong>NPM</strong> de votre solution.",
    "OtherFeatures2": "Régénère les pages déjà générées à partir de zéro.",
    "OtherFeatures3": "Crée de nouvelles solutions",
    "ThanksForCreatingProject": "Merci d'avoir créé votre projet!",
    "HotToRunSolution": "Comment faire fonctionner votre solution?",
    "HotToRunSolutionExplanation": "Consultez le document de mise en route pour savoir comment configurer et exécuter votre solution.",
    "GettingStarted": "Commencer",
    "WebAppDevTutorial": "Tutoriel de développement d'applications Web",
    "WebAppDevTutorialExplanation": "Consultez le document du didacticiel de développement d'applications Web pour un exemple de développement étape par étape.",
    "Document": "Document",
    "UsingABPSuiteToCURD": "Utilisation d'ABP Suite pour la génération et l'outillage de pages CRUD",
    "SeeABPSuiteDocument": "Consultez le document ABP Suite pour en savoir plus sur l'utilisation d'ABP Suite.",
    "AskQuestionsOnSupport": "Vous pouvez poser des questions sur le support commercial ABP.",
    "Documentation": "Documentation",
    "SeeModulesDocument": "Voir le document des modules pour une liste de tous les modules commerciaux(pro) et leurs documents.",
    "Pricing": "Tarification",
    "PricingExplanation": "Choisissez les fonctionnalités dont votre entreprise a besoin aujourd'hui. Mettez à niveau facilement au fur et à mesure que votre entreprise se développe.",
    "Team": "Équipe",
    "Business": "Affaires",
    "Enterprise": "Entreprise",
    "Custom": "Personnalisé",
    "IncludedDeveloperLicenses": "Licences de développeur incluses",
    "CustomLicenceOrAdditionalServices": "Besoin d'une licence personnalisée ou de services supplémentaires?",
    "CustomOrVolumeLicense": "Licence personnalisée ou en volume",
    "LiveTrainingSupport": "Formation et assistance en direct",
    "AndMore": "et plus",
    "AdditionalDeveloperLicense": "Licence de développeur supplémentaire",
    "ProjectCount": "Nombre de projets",
    "AllProModules": "Tous les modules pro",
    "AllProThemes": "Tous les thèmes pro",
    "AllProStartupTemplates": "Tous les modèles de démarrage pro",
    "SourceCodeOfAllModules": "Code source de tous les modules",
    "SourceCodeOfAllThemes": "Code source de tous les thèmes",
    "PerpetualLicense": "Licence perpétuelle",
    "UnlimitedServerDeployment": "Déploiement de serveur illimité",
    "YearUpgrade": "Mise à jour d'un an",
    "YearPremiumForumSupport": "1 an de support premium pour le forum",
    "ForumSupportIncidentCountYear": "Nombre d'incidents de support du forum/an",
    "PrivateTicketEmailSupport": "Support privé pour les tickets et e-mail",
    "BuyNow": "Acheter maintenant",
    "PayViaAmexCard": "Comment puis-je payer via ma carte AMEX?",
    "PayViaAmexCardDescription": "La passerelle de paiement par défaut «Iyzico» peut refuser certaines cartes de crédit AMEX en raison des mesures de sécurité. Dans ce cas, vous pouvez payer via la passerelle de paiement alternative «2Checkout».",
    "ThankYou": "Merci",
    "InvalidReCaptchaErrorMessage": "Une erreur s'est produite lors de la vérification de reCAPTCHA. Veuillez réessayer.",
    "CompanyName": "Nom de la compagnie",
    "YourCompanyName": "Le nom de votre société",
    "FirstName": "Prénom",
    "LastName": "Nom de famille",
    "Optional": "Optionnel",
    "YourFirstName": "Ton prénom",
    "YourLastName": "Votre nom de famille",
    "SpecialOffer": "Offre spéciale",
    "SpecialOfferMessage": "Dépêche-toi! Les prix sont valables pour un temps limité.",
    "DiscountRequest": "Demande de remise",
    "DiscountRequestDescribeCustomerQuestion": "Lequel des énoncés suivants vous décrit ?",
    "DiscountRequestStudentEmailMessage": "L'adresse e-mail doit contenir « edu ».",
    "DiscountRequestDeveloperCount": "Combien de développeurs êtes-vous ?",
    "DiscountRequestDeveloperCountExceedMessage": "Nous ne fournissons pas de licence à prix réduit pour les entreprises qui ont plus de {0} développeurs.",
    "DiscountRequestOrganizationName": "Nom de l'entreprise/organisation/école",
    "Website": "Site Internet",
    "GithubUsername": "Nom d'utilisateur GitHub",
    "PhoneNumber": "Numéro de téléphone",
    "Country": "Pays",
    "DescribeABPCommercialUsage": "Décrivez le projet que vous envisagez de développer sur la base d'APB Commercial",
    "DiscountRequestCertifyInformationMessage": "Je certifie que toutes les informations sont vraies et correctes.",
    "DiscountRequestReceived": "Nous avons bien reçu votre demande de remise.",
    "DiscountRequestStatusMessage": "Nous vous répondrons après vérification des informations que vous nous avez fournies.",
    "MVCOrRazorPages": "MVC (pages rasoirs)",
    "Angular": "Angulaire",
    "Blazor": "blouson",
    "New": "Nouveau",
    "MongoDB": "MongoDB",
    "EBookDDD": "Conception axée sur le domaine du livre électronique",
    "PracticalGuideForImplementingDDD": "Ce livre est un guide pratique pour la mise en œuvre du Domain Driven Design avec le framework ABP.",
    "IntroducingDDD": "Présentation de la conception axée sur le domaine",
    "DDDLayersAndCleanArchitecture": "Couches DDD et architecture propre",
    "LayeringOfADotnetSolution": "Superposition d'une solution .NET",
    "ImplementingDDDBuildingBlocks": "Implémentation des blocs de construction DDD",
    "DomainVsApplicationLogic": "Logique de domaine vs logique d'application",
    "SamplesAndDiscussions": "Échantillons et discussions",
    "Free": "Libérer",
    "Download": "Télécharger",
    "DDDEBook": "Livre électronique DDD",
    "ImplementingDDD": "Implémentation de la conception axée sur le domaine",
    "DDDBookExplanation": "Un guide pratique pour la mise en œuvre du Domain Driven Design avec le framework ABP.",
    "Overview": "Aperçu",
    "DDDBookPracticalGuide": "Il s'agit d'un guide pratique pour la mise en œuvre du Domain Driven Design (DDD). Bien que les détails de l'implémentation reposent sur l'infrastructure ABP Framework, les concepts, principes et modèles de base sont applicables à tout type de solution, même s'il ne s'agit pas d'une solution .NET.",
    "TableOfContents": "Table des matières",
    "IntroductionToImplementingDDD": "Introduction à la mise en œuvre de la conception pilotée par domaine",
    "WhatIsDDD": "Qu'est-ce que la conception axée sur le domaine ?",
    "Implementation": "Mise en œuvre",
    "TheBigPicture": "La grande image",
    "TheBuildingBlock": "Le bloc de construction",
    "ExampleUseCase": "Exemple de cas d'utilisation",
    "DomainAndApplicationLogic": "Logique de domaine et logique d'application",
    "Author": "Auteur",
    "PublishedOn": "Publié le",
    "Page": "Page",
    "FreeEBook": "Livre électronique gratuit",
    "EBookSignInForDownload": "Pour télécharger le livre électronique, connectez-vous",
    "SignIn": "S'identifier",
    "Or": "Ou",
    "TellUsAboutYourself": "Parlez-nous un peu de vous",
    "Surname": "Nom de famille",
    "DoYouAgreePrivacyPolicy": "J'accepte les <a href=\"/TermsConditions\">Conditions générales<a/> et la <a href=\"/Privacy\">Politique de confidentialité</a>.",
    "VolosoftMarketingInformationMessage": "Je souhaite obtenir des informations, des conseils et des offres sur les Solutions pour les entreprises et les organisations et d'autres produits et services Volosoft.",
    "VolosoftSharingInformationMessage": "Je souhaite que Volosoft partage mes informations avec des partenaires sélectionnés afin que je puisse recevoir des informations pertinentes sur leurs produits et services.",
    "WeWillSendYouADownloadLink": "Un lien pour télécharger le livre électronique a été envoyé à {0}.<br/> Vérifiez votre boîte de réception/courrier indésirable/spam !",
    "InvalidFormInputs": "Veuillez saisir les informations valides spécifiées sur le formulaire.",
    "DDDBookEmailBody": "Merci. <br /> Pour télécharger votre livre, <a href=\"{0}\">cliquez ici</a>.",
    "FreeDDDEBook": "Livre électronique DDD gratuit",
    "StartFree": "Commencer gratuitement",
    "FreeTrial": "Essai gratuit",
    "AcceptsMarketingCommunications": " Oui, j'aimerais recevoir les communications marketing d'ABP Commercial.",
    "PurposeOfUsage": "But de l'utilisation",
    "Industry": "Industrie",
    "Choose": "- Choisir -",
    "CompanyOrganizationName": "Nom de l'entreprise/organisation",
    "CompanySize": "Taille de l'entreprise",
    "Next": "Prochain",
    "StartTrial": "Commencer mon essai gratuit",
    "ContactUsIssues": "Contactez-nous si vous avez des problèmes",
    "TrialActivatedWarning": "Cher {0}, un utilisateur n'a droit qu'à une seule période d'essai gratuite. Vous avez déjà utilisé votre période d'essai.",
    "ActivationRequirement": "Il ne vous reste plus qu'une étape pour commencer votre essai gratuit.<br>Nous avons envoyé un e-mail à <b>{0}</b> pour activer votre compte. Vérifiez votre boîte de réception/boîtes de courrier indésirable/spam !",
    "SaveAndDownload": "Enregistrer et télécharger",
    "CompanyNameValidationMessage": "Le nom de l'entreprise est trop long !",
    "AddressValidationMessage": "L'adresse est trop longue !",
    "TaxNoValidationMessage": "TAXES/TVA Non, c'est trop long !",
    "NotesValidationMessage": "Le champ Notes est trop long !",
    "CheckYourBillingInfo": "Vous ne pouvez créer votre facture qu'une seule fois ! Vérifiez vos informations de facturation avant de créer votre facture.",
    "Volo.AbpIo.Commercial:030000": "Vous avez déjà utilisé votre période d'essai.",
    "Volo.AbpIo.Commercial:030001": "Ce nom d'organisation existe déjà.",
    "StartYourFreeTrial": "Commencer votre essai gratuit",
    "TrialLicenseModelInvalidErrorMessage": "L'un des champs suivants n'est pas valide : Nom du pays, Taille de l'entreprise, Secteur d'activité ou Objet de l'utilisation.",
    "Trial": "Essai",
    "Purchased": "Acheté",
    "PurchaseLicense": "Licence d'achat",
    "PurchaseTrialLicenseMessage": "La date d'expiration de votre licence est {0}. <br> Si vous souhaitez continuer à utiliser les projets que vous avez créés pendant votre période d'essai gratuite, vous devez modifier les clés de licence dans vos fichiers <code>appsettings.secrets.json</code>. Voici votre clé de licence :",
    "TrialLicenseExpireMessage": "Vous utilisez la licence d'essai et votre licence d'essai expirera le {0}.",
    "TryForFree": "Essayer gratuitement",
    "TrialLicenseExpiredInfo": "Votre période de licence d'essai a expiré !",
    "CommercialNewsletterConfirmationMessage": "J'accepte les <a href=\"https://commercial.abp.io/TermsConditions\">Conditions générales</a> et la <a href=\"https://commercial.abp.io/Privacy\">Politique de confidentialité </a>."
  }
}