{
  "culture": "fr",
  "texts": {
    "OrganizationManagement": "Gestion de l'organisation",
    "OrganizationList": "Liste des organisations",
    "Volo.AbpIo.Commercial:010003": "Vous n'êtes pas propriétaire de cette organisation!",
    "OrganizationNotFoundMessage": "Aucune organisation trouvée!",
    "DeveloperCount": "Développeurs alloués/totaux",
    "QuestionCount": "Questions restantes/totales",
    "Unlimited": "Illimité",
    "Owners": "Propriétaires",
    "Owner": "Propriétaire",
    "AddMember": "Ajouter un membre",
    "AddNewOwner": "Ajouter un nouveau propriétaire",
    "AddNewDeveloper": "Ajouter un nouveau développeur",
    "UserName": "Nom d'utilisateur",
    "Name": "Nom",
    "EmailAddress": "Adresse e-mail",
    "Developers": "Développeurs",
    "LicenseType": "Type de licence",
    "Manage": "Gérer",
    "SetDefault": "Définir par défaut",
    "DefaultOrganization": "Défaut",
    "StartDate": "Date de début",
    "EndDate": "Date de fin",
    "Modules": "Modules",
    "LicenseExtendMessage": "La date de fin de votre licence est étendue au {0}",
    "LicenseUpgradeMessage": "Votre licence est mise à niveau vers {0}",
    "LicenseExtendAdnUpgradeMessage": "Votre licence a été prolongée jusqu'au {0} et votre plan de licence est mis à niveau vers {1}.",
    "LicenseAddDeveloperMessage": "{0} développeurs ajoutés à votre licence",
    "Volo.AbpIo.Commercial:010004": "Impossible de trouver l'utilisateur spécifié! L'utilisateur doit être déjà enregistré.",
    "MyOrganizations": "Mes organisations",
    "ApiKey": "Clé API",
    "UserNameNotFound": "Il n'y a aucun utilisateur avec le nom d'utilisateur {0}",
    "SuccessfullyAddedToNewsletter": "Merci de vous être abonné à notre newsletter!",
    "MyProfile": "Mon profil",
    "EmailNotValid": "S'il vous plaît, mettez une adresse email valide.",
    "JoinOurMarketingNewsletter": "Rejoignez notre newsletter marketing",
    "WouldLikeToReceiveMarketingMaterials": "Je souhaite recevoir des supports marketing tels que des offres de produits et des offres spéciales.",
    "StartUsingYourLicenseNow": "Commencez à utiliser votre licence maintenant!",
    "WelcomePage": "Page d'accueil",
    "UnsubscriptionExpireEmail": "Se désabonner des e-mails de rappel de la date d'expiration de la licence",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Cet abonnement par e-mail ne contient que le rappel de la date d'expiration de votre licence.",
    "UnsubscribeFromLicenseExpireEmails": "Si vous ne souhaitez pas recevoir les e-mails concernant la date d'expiration de votre licence, vous pouvez vous désinscrire à tout moment.",
    "Unsubscribe": "Se désabonner",
    "NotOrganizationMember": "Vous n'êtes membre d'aucune organisation.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Désabonnement réussi",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Vous ne recevrez plus d'e-mails de rappel de la date d'expiration de la licence.",
    "IndexPageHeroSection": "<span class=\"first-line\">Une plate-forme de développement Web</span><span class=\"second-line\"> complète </span><span class=\"third-line\"> intégrée <img src=\"{0}\" width = \"110\" class=\"ml-1\" /> cadre </span>",
    "AbpCommercialShortDescription": "ABP Commercial fournit des modules d'application prédéfinis, des outils de développement rapide d'applications, des thèmes d'interface utilisateur professionnels, un support premium et plus encore.",
    "LiveDemo": "Démo en direct",
    "LiveDemoLead": "<a href=\"{0}\">{1}</a> en utilisant votre compte ABP, <a href=\"{2}\">{3}</a> à abp.io.<br/>Ou remplissez le formulaire ci-dessous pour créer une démo en direct maintenant",
    "ThereIsAlreadyAnAccountWithTheGivenEmailAddress": "Il existe déjà un compte avec l'adresse e-mail fournie: <b>{0}</b><br/> Vous pouvez vous connecter avec votre compte pour continuer.",
    "GetLicence": "Obtenez une licence",
    "Application": "Application",
    "StartupTemplates": "Modèles de démarrage",
    "Startup": "Commencez",
    "Templates": "Modèles",
    "Developer": "Développeur",
    "Tools": "Outils",
    "Premium": "Premium",
    "PremiumSupport": "Assistance Premium",
    "PremiumForumSupport": "Assistance du forum Premium",
    "UI": "UI",
    "Themes": "Thèmes",
    "JoinOurNewsletter": "Rejoignez notre newsletter",
    "Send": "Envoyer",
    "WhatIsABPFramework": "QU'EST-CE QUE LE FRAMEWORK ABP?",
    "OpenSourceBaseFramework": "Framework de base Open Source",
    "ABPFrameworkExplanation": "<p class=\"lead\"> ABP Commercial est basé sur ABP Framework, un framework d'applications Web open source et communautaire pour ASP.NET Core.</p><p> ABP Framework fournit une excellente infrastructure pour écrire maintenable et extensible et du code testable avec les meilleures pratiques.</p><p> Construit et intégré à des outils populaires que vous connaissez déjà. Faible courbe d'apprentissage, adaptation facile, développement confortable.</p>",
    "Modular": "Modulaire",
    "MicroserviceCompatible": "Compatible avec les microservices",
    "DomainDrivenDesignInfrastructure": "Infrastructure de conception pilotée par domaine",
    "MultiTenancy": "Multi-souscrivant",
    "DistributedMessaging": "Messagerie distribuée",
    "DynamicProxying": "Proxying dynamique",
    "BackgroundJobs": "Tâches d'arrière-plan",
    "AuditLogging": "Journalisation d'audit",
    "BLOBStoring": "Stockage BLOB",
    "BundlingMinification": "Bundling et minification",
    "AdvancedLocalization": "Localisation avancée",
    "ManyMore": "Beaucoup plus",
    "ExploreTheABPFramework": "Explorez le Framework ABP",
    "WhyUseTheABPCommercial": "Pourquoi utiliser ABP Commercial?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\"> La création d'applications Web de niveau entreprise peut être complexe et prendre du temps.</p><p> ABP Commercial offre l'infrastructure de base parfaite nécessaire pour tous les ASP.NET Core modernes de niveau entreprise solutions basées. De la conception au déploiement, l'ensemble du cycle de développement est optimisé par les fonctionnalités et modules intégrés d'ABP.</p>",
    "StartupTemplatesShortDescription": "Les modèles de démarrage vous permettent de démarrer votre projet en quelques secondes.",
    "UIFrameworksOptions": "Options de frameworks d'interface utilisateur;",
    "DatabaseProviderOptions": "Options du fournisseur de base de données;",
    "PreBuiltApplicationModules": "Modules d'application prédéfinis",
    "PreBuiltApplicationModulesShortDescription": "Les exigences d'application les plus courantes sont déjà développées pour vous en tant que modules réutilisables.",
    "Account": "Compte",
    "Blogging": "Bloguer",
    "Identity": "Identité",
    "IdentityServer": "Serveur d'identité",
    "Saas": "Saas",
    "LanguageManagement": "Gestion de la langue",
    "TextTemplateManagement": "Gestion des modèles de texte",
    "See All Modules": "VoirTousModules",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "ABP Suite est un outil complémentaire à ABP Commercial.",
    "AbpSuiteExplanation": "Il vous permet de créer des pages Web en quelques minutes. C'est un outil global .NET Core qui peut être installé à partir de la ligne de commande. Il peut créer une nouvelle solution ABP, générer des pages CRUD de la base de données vers le front-end.",
    "Details": "Détails",
    "LeptonTheme": "Thème Lepton",
    "ProfessionalModernUIThemes": "Thèmes d'interface utilisateur professionnels et modernes",
    "LeptonThemeExplanation": "Lepton fournit une gamme de thèmes d'administration Bootstrap qui servent de base solide pour tout projet nécessitant un tableau de bord d'administration.",
    "DefaultTheme": "Thème par défaut",
    "MaterialTheme": "Thème Material",
    "Default2Theme": "Thème par défaut 2",
    "DarkTheme": "Thème sombre",
    "DarkBlueTheme": "Thème bleu foncé",
    "LightTheme": "Thème clair",
    "ProudToWorkWith": "Fier de travailler avec",
    "OurConsumers": "Des centaines d'entreprises et de développeurs dans plus de 70 pays dans le monde font confiance à ABP Commercial.",
    "JoinOurConsumers": "Rejoignez-les et créez rapidement des produits incroyables.",
    "AdditionalServicesExplanation": "Avez-vous besoin de services supplémentaires ou personnalisés? <strong> Nous et nos partenaires pouvons fournir; </strong>",
    "CustomProjectDevelopment": "Développement de projets personnalisés",
    "CustomProjectDevelopmentExplanation": "Développeurs dédiés pour vos projets personnalisés.",
    "PortingExistingProjects": "Portage de projets existants",
    "PortingExistingProjectsExplanation": "Migration de vos anciens projets vers la plateforme ABP.",
    "LiveSupport": "Support en direct",
    "LiveSupportExplanation": "Option d'assistance à distance en direct lorsque vous en avez besoin.",
    "Training": "Formation",
    "TrainingExplanation": "Une formation dédiée pour vos développeurs.",
    "OnBoarding": "Intégration",
    "OnBoardingExplanation": "Aide à la configuration de vos environnements de développement, CI et CD.",
    "PrioritizedTechnicalSupport": "Assistance technique prioritaire",
    "PremiumSupportExplanation": "Outre le grand support communautaire du framework ABP, notre équipe de support répond aux questions techniques et aux problèmes des utilisateurs commerciaux avec une priorité élevée.",
    "SeeTheSupportOptions": "Voir les options de support",
    "Contact": "Contacter",
    "TellUsWhatYouNeed": "Dites-nous ce dont vous avez besoin.",
    "YourMessage": "Votre message",
    "YourFullName": "Votre nom complet",
    "FirstNameField": "Prénom",
    "LastNameField": "Nom de famille",
    "EmailField": "Adresse e-mail",
    "YourEmailAddress": "Votre adresse email",
    "ValidEmailAddressIsRequired": "Une adresse e-mail valide est requise.",
    "HowMayWeHelpYou": "Comment pouvons nous vous aider?",
    "SendMessage": "Envoyer le message",
    "Success": "Succès",
    "WeWillReplyYou": "Nous avons reçu votre message et vous contacterons sous peu.",
    "GoHome": "Retour à l'acceuil",
    "CreateLiveDemo": "Créer une démo en direct",
    "CreateLiveDemoDescription": "Une fois que vous avez soumis ce formulaire, vous recevrez un e-mail contenant le lien de votre démo.",
    "RegisterToTheNewsletter": "Inscrivez-vous à la newsletter pour recevoir des informations concernant ABP.IO, y compris les nouvelles versions, etc.",
    "EnterYourEmailOrLogin": "Saisissez votre adresse e-mail pour créer votre démo ou <a href=\"{0}\"> Connectez-vous </a> à l'aide de votre compte existant.",
    "ApplicationTemplate": "Modèle d'application",
    "ApplicationTemplateExplanation": "Le modèle de démarrage d'application est utilisé pour créer une nouvelle application Web.",
    "EfCoreProvider": "Entity Framework (prend en charge SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\"> et autres </a>)",
    "AlreadyIncludedInTemplateModules": "Les modules suivants sont déjà inclus et configurés dans ce modèle:",
    "ApplicationTemplateArchitecture": "Ce modèle d'application prend également en charge l'architecture à plusieurs niveaux dans laquelle la couche d'interface utilisateur, la couche API et le service d'authentification sont physiquement séparés.",
    "SeeTheGuideOrGoToTheLiveDemo": "Consultez le guide du développeur pour obtenir des informations techniques sur ce modèle ou accédez à la démo en direct.",
    "DeveloperGuide": "Guide du développeur",
    "ModuleTemplate": "Modèle de module",
    "ModuleTemplateExplanation1": "Vous souhaitez créer un module et le réutiliser dans différentes applications? Ce modèle de démarrage prépare tout pour commencer à créer un <strong> module d'application </strong> réutilisable ou un <strong> microservice </strong>.",
    "ModuleTemplateExplanation2": "<p> Vous pouvez prendre en charge un ou plusieurs frameworks d'interface utilisateur, un ou plusieurs fournisseurs de bases de données pour un seul module. Le modèle de démarrage est configuré pour exécuter et <strong> tester votre module </strong> dans une application minimale en plus de l'infrastructure de test d'unité et d'intégration.</p><p> Consultez le guide du développeur pour obtenir des informations techniques sur ce modèle.</p>",
    "WithAllStyleOptions": "avec toutes les options de style",
    "Demo": "Démo",
    "SeeAllModules": "Voir tous les modules",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) est un outil de ligne de commande pour effectuer certaines opérations courantes pour les solutions basées sur ABP.",
    "ABPSuiteEasilyCURD": "ABP Suite est un outil qui vous permet de créer facilement des pages CRUD",
    "WeAreHereToHelp": "Nous sommes ici pour <span class=\"zero-text\"> Aide </span>",
    "BrowseOrAskQuestion": "Vous pouvez parcourir nos rubriques d'aide ou rechercher dans les questions fréquemment posées, ou vous pouvez nous poser une question en utilisant le <a href=\"{0}\" class=\"text-success\"> formulaire de contact </a>.",
    "SearchQuestionPlaceholder": "Rechercher dans les questions fréquemment posées",
    "WhatIsTheABPCommercial": "Qu'est-ce que la publicité ABP?",
    "WhatAreDifferencesThanAbpFramework": "Quelles sont les différences entre le Framework ABP open source et le ABP Commercial?",
    "AbpCommercialMetaTitle": "{0} | ABP Commercial",
    "AbpCommercialMetaDescription": "Une plate-forme de développement Web complète sur ABP Framework avec des modules prédéfinis, des modèles de démarrage, des outils de développement rapide, des thèmes d&#39;interface utilisateur professionnels et un support premium.",
    "ABPCommercialExplanation": "ABP Commercial est un ensemble de modules, d'outils, de thèmes et de services premium basés sur le <a target=\"_blank\" href=\"{0}\"> framework ABP </a> open source. ABP Commercial est développé et soutenu par la même équipe derrière le cadre ABP.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p><a target=\"_blank\" href=\"{0}\"> Framework ABP </a> est un framework de développement d'applications modulaire, thématique et compatible avec les micro-services pour ASP.NET Core. Il fournit une architecture complète et une infrastructure solide pour vous permettre de vous concentrer sur votre propre code métier plutôt que de vous répéter à chaque nouveau projet. Il est basé sur les meilleures pratiques de développement logiciel et les outils populaires que vous connaissez déjà.</p><p> Le framework ABP est entièrement gratuit, open source et géré par la communauté. Il fournit également un thème gratuit et des modules prédéfinis (par exemple, la gestion des identités et la gestion des locataires).</p>",
    "VisitTheFrameworkVSCommercialDocument": "Pour plus d'informations, consultez le lien suivant: <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial ajoute les avantages suivants en plus du cadre ABP;",
    "Professional": "Professionnel",
    "UIThemes": "Thèmes de l'interface utilisateur",
    "EnterpriseModules": "Des <a href=\"{0}\"> modules d'application </a> prédéfinis, prêts pour l'entreprise, riches en fonctionnalités (par exemple, gestion d'Identity Server, gestion SaaS, gestion des langues)",
    "ToolingToSupport": "Outils pour soutenir votre productivité de développement (par exemple, <a href=\"{0}\"> ABP Suite </a>)",
    "PremiumSupportLink": "Assistance <a href=\"{0}\" target=\"_blank\"> Premium </a>",
    "WhatDoIDownloadABPCommercial": "Que dois-je télécharger lorsque j'achète l'ABP Commercial?",
    "CreateUnlimitedSolutions": "Une fois que vous avez acheté une licence commerciale ABP, vous pourrez créer des solutions illimitées comme décrit dans le document <a href=\"{0}\"> Premiers pas </a>.",
    "ABPCommercialSolutionExplanation": "Lorsque vous créez une nouvelle application, vous obtenez une solution Visual Studio (un modèle de démarrage) en fonction de vos préférences. La solution téléchargée contient des modules et des thèmes commerciaux déjà installés et configurés pour vous. Vous pouvez supprimer un module préinstallé ou ajouter un autre module si vous le souhaitez. Tous les modules et thèmes sont utilisés par défaut dans des packages NuGet/NPM.",
    "StartDevelopWithTutorials": "La solution téléchargée est bien architecturée et documentée. Vous pouvez commencer à développer votre propre code d'entreprise basé sur celui-ci en suivant <a href=\"{0}\"> les didacticiels </a>",
    "TryTheCommercialDemo": "Vous pouvez essayer <a href=\"{0}\"> la démonstration </a> pour voir un exemple d'application créé à l'aide du modèle de démarrage ABP Commercial.",
    "HowManyProducts": "Combien de produits/solutions différents puis-je créer à l'aide d'ABP Commercial?",
    "HowManyProductsExplanation": "Il n'y a pas de limite pour créer un projet ABP. Vous pouvez créer autant de projets que vous le souhaitez, les développer et les télécharger sur différents serveurs.",
    "HowManyDevelopers": "Combien de développeurs peuvent travailler sur l'ABP Commercial?",
    "HowManyDevelopersExplanation": "Les licences commerciales ABP sont par développeur. Différents types de licence ont des limites de développeur différentes. Cependant, vous pouvez ajouter plus de développeurs à n'importe quel type de licence chaque fois que vous en avez besoin. Consultez la <a href=\"{0}\"> page des prix </a> pour connaître les types de licence, les limites pour les développeurs et les coûts supplémentaires pour les développeurs.",
    "ChangingLicenseType": "Puis-je changer mon type de licence à l'avenir?",
    "ChangingLicenseTypeExplanation": "Vous pouvez toujours ajouter de nouveaux développeurs dans votre même type de licence. Voir aussi \"Combien de développeurs peuvent travailler sur l'ABP Commercial?\". Vous pouvez également passer à une licence supérieure en payant la différence de prix calculée. Lorsque vous passez à un plan de licence supérieur, vous bénéficiez des avantages du nouveau plan, mais la mise à niveau de la licence ne modifie pas la date d'expiration de la licence.",
    "LicenseExtendUpgradeDiff": "Quelle est la différence entre l'extension de licence et la mise à niveau?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Extension :</strong> en prolongeant/renouvelant votre licence, vous continuerez à bénéficier d&#39;un support premium et à obtenir des mises à jour majeures ou mineures pour les modules et les thèmes. De plus, vous pourrez continuer à créer de nouveaux projets. Et vous pourrez toujours utiliser ABP Suite, ce qui accélère votre développement. Lorsque vous prolongez votre licence, 1 an est ajouté à la date d&#39;expiration de votre licence.<hr/> <strong>Mise à niveau :</strong> en mettant à niveau votre licence, vous serez promu à un plan de licence supérieur, ce qui vous permettra d&#39;obtenir des avantages supplémentaires. Consultez le <a href=\"/pricing\">tableau de comparaison des licences</a> pour voir les différences entre les plans de licence. <strong>En revanche, lors d’une mise à niveau, la date d’expiration de votre licence ne changera pas !</strong> Pour prolonger la date de fin de votre licence, vous devez prolonger votre licence.",
    "LicenseRenewalCost": "Quel est le coût du renouvellement de la licence après 1 an?",
    "LicenseRenewalCostExplanation": "Le prix de renouvellement (extension) de la licence d'équipe standard est de {0} $, la licence d'entreprise standard est de {1} $ et la licence d'entreprise standard est de {2} $. Si vous êtes déjà client, <a href='{3}' target='_blank'>connectez-vous à votre compte</a> pour consulter les tarifs de renouvellement disponibles.",
    "HowDoIRenewMyLicense": "Comment renouveler ma licence?",
    "HowDoIRenewMyLicenseExplanation": "Vous pouvez renouveler votre licence en accédant à la <a href='{0}' target='_blank'> page de gestion de l'organisation </a>. Afin de profiter de nos tarifs réduits de renouvellement anticipé, assurez-vous de renouveler avant l'expiration de votre licence. Cependant, ne vous inquiétez pas de ne pas savoir quand votre opportunité de renouvellement anticipé se termine. Vous recevrez 2 e-mails de rappel avant l'expiration de votre abonnement. Nous les enverrons dans les 30 jours, 7 jours avant l'expiration.",
    "IsSourceCodeIncluded": "Ma licence inclut-elle le code source des modules et thèmes commerciaux?",
    "IsSourceCodeIncludedExplanation1": "Dépend du type de licence que vous avez acheté:",
    "IsSourceCodeIncludedExplanation2": "<strong> Équipe </strong>: votre solution utilise les modules et les thèmes en tant que packages NuGet et NPM. Il n'inclut pas leur code source. De cette façon, vous pouvez facilement mettre à niveau ces modules et thèmes chaque fois qu'une nouvelle version est disponible. Cependant, vous ne pouvez pas obtenir le code source des modules et des thèmes.",
    "IsSourceCodeIncludedExplanation3": "<strong> Entreprise/Entreprise </strong>: en plus de la licence Team, vous pouvez télécharger le code source de tout module ou thème dont vous avez besoin. Vous pouvez même supprimer les références de package NuGet/NPM pour un module particulier et ajouter son code source directement à votre solution pour le modifier complètement.",
    "IsSourceCodeIncludedExplanation4": "<p> L'inclusion du code source d'un module dans votre solution vous donne le maximum de liberté pour personnaliser ce module. Cependant, il ne sera pas possible de mettre à jour automatiquement le module lorsqu'une nouvelle version est publiée.</p><p> Aucune des licences n'inclut le code source d'ABP Suite, qui est un outil externe qui génère du code pour vous et vous aide à votre développement.</p><p> Consultez la <a href=\"{0}\"> page de tarification </a> pour connaître les autres différences entre les types de licence.</p>",
    "ChangingDevelopers": "Puis-je changer les développeurs enregistrés de mon organisation à l'avenir?",
    "ChangingDevelopersExplanation": "En plus d'ajouter de nouveaux développeurs à votre licence, vous pouvez également modifier les développeurs existants (vous pouvez supprimer un développeur et en ajouter un nouveau sur le même siège) sans aucun coût supplémentaire.",
    "WhatHappensWhenLicenseEnds": "Que se passe-t-il à la fin de la période de validité de ma licence ?",
    "WhatHappensWhenLicenseEndsExplanation1": "La licence commerciale ABP est une <a href=\"{0}\" target=\"_blank\">licence perpétuelle</a>. Après l'expiration de votre licence, vous pouvez continuer à développer votre projet. Vous n'êtes pas obligé de renouveler votre licence. Votre licence est livrée avec un plan de mise à jour et d'assistance d'un an. Pour continuer à bénéficier des nouvelles fonctionnalités, des améliorations de performance, des corrections de bogues, de l'assistance et continuer à utiliser ABP Suite, vous devez renouveler votre licence. Lorsque votre licence expire ;",
    "WhatHappensWhenLicenseEndsExplanation2": "Vous ne pouvez pas créer de nouvelles solutions à l'aide d'ABP Commercial, mais vous pouvez continuer à développer vos applications existantes pour toujours.",
    "WhatHappensWhenLicenseEndsExplanation3": "Vous pourrez obtenir des mises à jour pour les modules et thèmes de votre version MINOR (à l'exception des versions RC ou Preview). Par exemple : si vous utilisez la version 3.2.0 d'un module, vous pouvez toujours obtenir des mises à jour pour la version 3.2.x (v3.2.1, v3.2.5... etc.) de ce module. Mais vous ne pouvez pas obtenir de mises à jour pour la prochaine version majeure ou mineure (comme v3.3.0, v3.3.3, 4.x.x.. etc.). Par exemple, lorsque votre licence a expiré, la dernière version était la v4.4.3, et plus tard, la version 4.4.4 et la version 4.5.0 ont été publiées, vous pourrez accéder à la v4.4.X mais vous ne pourrez pas accéder à la v4.5.X.",
    "WhatHappensWhenLicenseEndsExplanation4": "Vous ne pouvez pas installer les nouveaux modules et thèmes ajoutés à la plateforme ABP Commercial après l'expiration de votre licence.",
    "WhatHappensWhenLicenseEndsExplanation5": "Vous ne pouvez pas utiliser la suite ABP.",
    "WhatHappensWhenLicenseEndsExplanation6": "Vous ne pouvez plus bénéficier du <a href=\"{0}\">support premium</a>.",
    "WhatHappensWhenLicenseEndsExplanation7": "Vous pouvez prolonger (renouveler) votre licence si vous souhaitez continuer à bénéficier de ces avantages. Si vous prolongez votre licence dans <strong>{3} jours</strong> après l'expiration de votre licence, les remises suivantes seront appliquées : Licence d'équipe {0} ; Licence commerciale {1} ; Licence Entreprise {2}.",
    "discountForYears": "{0} % de remise pendentif {1} an(s)",
    "WhatHappensWhenLicenseEndsExplanation8": "Les projets ABP que vous avez générés ne sont pas stockés sur nos serveurs. Il est donc de votre responsabilité de conserver le code source que vous téléchargez. Lorsque votre licence expire, il n&#39;y a aucun moyen d&#39;obtenir le code source de votre projet ABP généré.",
    "WhenShouldIRenewMyLicense": "Quand dois-je renouveler ma licence?",
    "WhenShouldIRenewMyLicenseExplanation": "Si vous renouvelez votre licence dans <strong>{3} jours</strong> après l'expiration de votre licence, les remises suivantes seront appliquées : licence d'équipe {0} ; licence commerciale {1} ; licence d'entreprise {2}. Toutefois, si vous renouveler votre licence après <strong>{3} jours</strong> depuis la date d'expiration de votre licence, le prix de renouvellement sera le même que le prix d'achat de la licence et il n'y aura pas de remise sur votre renouvellement.",
    "TrialPlan": "Avez-vous un plan d'essai?",
    "TrialPlanExplanation": "Oui, pour démarrer votre essai gratuit, contactez <a href=\"mailto:marketing@volosoft.com?subject=ABP Commercial — Trial License Request\">marketing@volosoft.com</a> . Nous offrons également une garantie de remboursement de 30 jours pour la licence Team, sans poser de questions ! Vous pouvez demander un remboursement complet dans les 30 premiers jours suivant l&#39;achat de la licence. Nous offrons un remboursement de 60 % sous 30 jours pour les licences Business et Enterprise. En effet, les licences Business et Enterprise contiennent le code source complet de tous les modules et thèmes.",
    "DoYouAcceptBankWireTransfer": "Acceptez-vous les virements bancaires?",
    "DoYouAcceptBankWireTransferExplanation": "Oui, nous acceptons les virements bancaires.<br />Après avoir envoyé les frais de licence par virement bancaire, envoyez-nous par e-mail à accounting@abp.io votre reçu et le type de licence demandé. Nos coordonnées bancaires internationales :",
    "HowToUpgrade": "Comment mettre à niveau des applications existantes lorsqu'une nouvelle version est disponible?",
    "HowToUpgradeExplanation1": "Lorsque vous créez une nouvelle application à l'aide d'ABP Commercial, tous les modules et le thème sont utilisés en tant que packages NuGet et NPM. Ainsi, vous pouvez facilement mettre à jour les packages lorsqu'une nouvelle version est disponible.",
    "HowToUpgradeExplanation2": "Outre les mises à niveau standard de NuGet/NPM, <a href=\"{0}\"> ABP CLI </a> fournit une commande de mise à jour qui recherche et met automatiquement à niveau tous les packages associés à ABP dans votre solution.",
    "DatabaseSupport": "Quels systèmes de base de données sont pris en charge?",
    "DatabaseSupportExplanation": "ABP Framework lui-même est indépendant de la base de données et peut fonctionner avec n'importe quel fournisseur de base de données de par sa nature. Consultez <a href=\"{0}\" target=\"_blank\"> le document d'accès aux données </a> pour obtenir la liste des fournisseurs actuellement mis en œuvre.",
    "UISupport": "Quels frameworks d'interface utilisateur sont pris en charge?",
    "Supported": "Prise en charge",
    "UISupportExplanation": "ABP Framework lui-même est indépendant du framework d'interface utilisateur et peut fonctionner avec n'importe quel framework d'interface utilisateur. Cependant, les modèles de démarrage, les interfaces utilisateur de module et les thèmes n'étaient pas implémentés pour tous les frameworks d'interface utilisateur. Consultez <a href=\"{0}\"> le document de démarrage </a> pour la liste à jour des options d'interface utilisateur.",
    "MicroserviceSupport": "Prend-il en charge l'architecture des micro-services?",
    "MicroserviceSupportExplanation1": "L'un des principaux objectifs du cadre ABP est de fournir une infrastructure pratique pour créer des solutions de micro-services. Consultez le document <a href=\"{0}\"> architecture de micro-service </a> pour comprendre comment cela aide à créer des systèmes de micro-service.",
    "MicroserviceSupportExplanation2": "Tous les modules ABP Commercial sont conçus pour prendre en charge les scénarios de déploiement de micro-services (avec sa propre API et sa propre base de données) en suivant le document <a href=\"{0}\"> bonnes pratiques de développement de modules </a>.",
    "MicroserviceSupportExplanation3": "Nous fournissons un exemple de <a href=\"{0}\"> solution de démonstration de micro-service </a> qui présente une implémentation d'architecture de micro-service pour vous aider à créer votre propre solution.",
    "MicroserviceSupportExplanation4": "Donc, la réponse courte est \"<strong> oui, il prend en charge l'architecture de micro-services </strong>\".",
    "MicroserviceSupportExplanation5": "Cependant, un système de micro-service est une solution et chaque solution aura des exigences différentes, une topologie de réseau, des scénarios de communication, des possibilités d'authentification, des décisions de séparation/partage de base de données, des configurations d'exécution, des intégrations de systèmes tiers et bien d'autres.",
    "MicroserviceSupportExplanation6": "Le Framework ABP et l'ABP Commercial fournissent une infrastructure pour des scénarios de micro-services, des modules compatibles avec les micro-services, des exemples et de la documentation pour vous aider à créer votre propre solution. Mais ne vous attendez pas à télécharger directement la solution de vos rêves préconfigurée pour vous. Vous devrez le comprendre et rassembler certaines parties en fonction de vos besoins.",
    "WhereCanIDownloadSourceCode": "Où puis-je télécharger le code source?",
    "WhereCanIDownloadSourceCodeExplanation": "Vous pouvez télécharger le code source de tous les modules ABP, packages angulaires et thèmes via ABP Suite ou ABP CLI. Voir <a href=\"{0}\"> Comment télécharger le code source? </a>",
    "ComputerLimitation": "Combien d'ordinateurs un développeur peut-il se connecter lors du développement d'ABP?",
    "ComputerLimitationExplanation": "Nous autorisons spécifiquement les <strong> {0} ordinateurs </strong> par développeur individuel/sous licence. Chaque fois qu'un développeur a besoin de développer des produits commerciaux ABP sur une troisième machine, un e-mail doit être envoyé à license@abp.io expliquant la situation et nous procéderons ensuite à l'allocation appropriée dans notre système.",
    "RefundPolicy": "Avez-vous une politique de remboursement?",
    "RefundPolicyExplanation": "Vous pouvez demander un remboursement dans les <strong> 30 jours </strong> suivant l'achat de votre licence. Les types de licence Business et Enterprise ont une option de téléchargement de code source, par conséquent, les remboursements ne sont pas disponibles pour les entreprises et les entreprises (et toutes les licences qui incluent un droit de recevoir le code source). De plus, aucun remboursement n'est effectué pour les renouvellements et les achats de deuxième licence.",
    "HowCanIRefundVat": "Comment puis-je rembourser la TVA?",
    "HowCanIRefundVatExplanation1": "Si vous avez effectué le paiement avec 2Checkout, vous pouvez rembourser la TVA via votre compte 2Checkout:",
    "HowCanIRefundVatExplanation2": "Connectez-vous à votre compte <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\"> 2Checkout </a>",
    "HowCanIRefundVatExplanation3": "Trouvez la commande appropriée et appuyez sur \"Rembourser la TVA tardive\" (entrez votre numéro de TVA)",
    "HowCanIGetMyInvoice": "Comment puis-je obtenir ma facture?",
    "HowCanIGetMyInvoiceExplanation": "Il existe 2 passerelles de paiement pour l'achat d'une licence: PayU et 2Checkout. Si vous achetez votre licence via la passerelle 2Checkout, elle envoie la facture PDF à votre adresse e-mail, voir <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How-do-invoices-work\"> Facturation 2Checkout.</a> Si vous achetez via la passerelle PayU ou par virement bancaire, nous préparerons et vous enverrons votre facture. Vous pouvez demander votre facture sur la <a href=\"{0}\"> page de gestion de l'organisation.</a>",
    "Forum": "Forum",
    "SupportExplanation": "ABP Commercial Licences fournit un support de forum premium par une équipe composée d'experts ABP Framework.",
    "PrivateTicket": "Billet privé",
    "PrivateTicketExplanation": "Enterprise License comprend également un support privé avec e-mail et système de ticket.",
    "AbpSuiteExplanation1": "ABP Suite vous permet de créer des pages Web en quelques minutes. C'est un outil .NET Core Global qui peut être installé à partir de la ligne de commande.",
    "AbpSuiteExplanation2": "Il peut créer une nouvelle solution ABP, générer des pages CRUD de la base de données vers le front-end. Pour une présentation technique, consultez <a href=\"{0}\"> le document </a>",
    "FastEasy": "Rapide et facile",
    "AbpSuiteExplanation3": "ABP Suite vous permet de créer facilement des pages CRUD. Il vous suffit de définir votre entité et ses propriétés, laissez le reste à ABP Suite pour vous! ABP Suite génère tout le code nécessaire pour votre page CRUD en quelques secondes. Il prend en charge les interfaces utilisateur Angular, MVC et Blazor.",
    "RichOptions": "Options riches",
    "AbpSuiteExplanation4": "ABP Suite prend en charge plusieurs options d'interface utilisateur telles que <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\"> Razor Pages </a> et <a href=\"https://angular.io\">Angular </a>. Il prend également en charge plusieurs bases de données telles que <a href=\"https://www.mongodb.com\"> MongoDB </a> et toutes les bases de données prises en charge par <strong> EntityFramework Core </strong> (MS SQL Server, Oracle, MySql, PostgreSQL et <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\"> plus </a>).",
    "AbpSuiteExplanation5": "La bonne chose est que vous n'avez pas à vous soucier de ces options. ABP Suite comprend votre type de projet et génère le code de votre projet et place le code généré au bon endroit dans votre projet.",
    "SourceCode": "Code source",
    "AbpSuiteExplanation6": "ABP Suite génère le code source pour vous! Il ne génère pas de fichiers magiques pour générer la page Web. ABP Suite génère le code source pour <strong> Entity, Repository, Application Service, Code First Migration, JavaScript/TypeScript et CSHTML/HTML </strong> ainsi que les interfaces nécessaires. ABP Suite génère également le code selon les <strong> meilleures pratiques </strong> de développement logiciel, vous n'avez donc pas à vous soucier de la qualité du code généré.",
    "AbpSuiteExplanation7": "Puisque vous avez le code source des blocs de construction de la page CRUD générée dans les couches d'application correctes, vous pouvez facilement modifier le code source et injecter votre logique personnalisée/commerciale dans le code généré.",
    "CrossPlatform": "Plateforme croisée",
    "AbpSuiteExplanation8": "ABP Suite est construit avec .NET Core et est multiplateforme. Il fonctionne comme une application Web sur votre ordinateur local. Vous pouvez l'exécuter sur <strong> Windows </strong>, <strong> Mac </strong> et <strong> Linux </strong>",
    "OtherFeatures": "Autres caractéristiques",
    "OtherFeatures1": "Met à jour facilement les packages <strong>NuGet</strong> et <strong>NPM</strong> de votre solution.",
    "OtherFeatures2": "Régénère les pages déjà générées à partir de zéro.",
    "OtherFeatures3": "Crée de nouvelles solutions",
    "ThanksForCreatingProject": "Merci d'avoir créé votre projet!",
    "HotToRunSolution": "Comment faire fonctionner votre solution?",
    "HotToRunSolutionExplanation": "Consultez le document de mise en route pour savoir comment configurer et exécuter votre solution.",
    "GettingStarted": "Commencer",
    "WebAppDevTutorial": "Tutoriel de développement d'applications Web",
    "WebAppDevTutorialExplanation": "Consultez le document du didacticiel de développement d'applications Web pour un exemple de développement étape par étape.",
    "Document": "Document",
    "UsingABPSuiteToCURD": "Utilisation d'ABP Suite pour la génération et l'outillage de pages CRUD",
    "SeeABPSuiteDocument": "Consultez le document ABP Suite pour en savoir plus sur l'utilisation d'ABP Suite.",
    "AskQuestionsOnSupport": "Vous pouvez poser des questions sur le support commercial ABP.",
    "Documentation": "Documentation",
    "SeeModulesDocument": "Voir le document des modules pour une liste de tous les modules commerciaux(pro) et leurs documents.",
    "Pricing": "Tarification",
    "PricingExplanation": "Choisissez les fonctionnalités dont votre entreprise a besoin aujourd'hui. Mettez à niveau facilement au fur et à mesure que votre entreprise se développe.",
    "Team": "Équipe",
    "Business": "Affaires",
    "Enterprise": "Entreprise",
    "Custom": "Personnalisé",
    "IncludedDeveloperLicenses": "Licences de développeur incluses",
    "CustomLicenceOrAdditionalServices": "Besoin d'une licence personnalisée ou de services supplémentaires?",
    "CustomOrVolumeLicense": "Licence personnalisée ou en volume",
    "LiveTrainingSupport": "Formation et assistance en direct",
    "AndMore": "et plus",
    "AdditionalDeveloperLicense": "Licence de développeur supplémentaire",
    "ProjectCount": "Nombre de projets",
    "AllProModules": "Tous les modules pro",
    "AllProThemes": "Tous les thèmes pro",
    "AllProStartupTemplates": "Tous les modèles de démarrage pro",
    "SourceCodeOfAllModules": "Code source de tous les modules",
    "SourceCodeOfAllThemes": "Code source de tous les thèmes",
    "PerpetualLicense": "Licence perpétuelle",
    "UnlimitedServerDeployment": "Déploiement de serveur illimité",
    "YearUpgrade": "Mise à jour d'un an",
    "YearPremiumForumSupport": "1 an de support premium pour le forum",
    "ForumSupportIncidentCountYear": "Nombre d'incidents de support du forum/an",
    "PrivateTicketEmailSupport": "Support privé pour les tickets et e-mail",
    "BuyNow": "Acheter maintenant",
    "PayViaAmexCard": "Comment puis-je payer via ma carte AMEX?",
    "PayViaAmexCardDescription": "La passerelle de paiement par défaut «Iyzico» peut refuser certaines cartes de crédit AMEX en raison des mesures de sécurité. Dans ce cas, vous pouvez payer via la passerelle de paiement alternative «2Checkout».",
    "ThankYou": "Merci",
    "InvalidReCaptchaErrorMessage": "Une erreur s'est produite lors de la vérification de reCAPTCHA. Veuillez réessayer.",
    "CompanyName": "Nom de la compagnie",
    "YourCompanyName": "Le nom de votre société",
    "FirstName": "Prénom",
    "LastName": "Nom de famille",
    "Optional": "Optionnel",
    "YourFirstName": "Ton prénom",
    "YourLastName": "Votre nom de famille",
    "SpecialOffer": "Offre spéciale",
    "SpecialOfferMessage": "Dépêche-toi! Les prix sont valables pour un temps limité.",
    "DiscountRequest": "Demande de remise",
    "DiscountRequestDescribeCustomerQuestion": "Lequel des énoncés suivants vous décrit ?",
    "DiscountRequestStudentEmailMessage": "L'adresse e-mail doit contenir « edu ».",
    "DiscountRequestDeveloperCount": "Combien de développeurs êtes-vous ?",
    "DiscountRequestDeveloperCountExceedMessage": "Nous ne fournissons pas de licence à prix réduit pour les entreprises qui ont plus de {0} développeurs.",
    "DiscountRequestOrganizationName": "Nom de l'entreprise/organisation/école",
    "Website": "Site Internet",
    "GithubUsername": "Nom d'utilisateur GitHub",
    "PhoneNumber": "Numéro de téléphone",
    "Country": "Pays",
    "DescribeABPCommercialUsage": "Décrivez le projet que vous envisagez de développer sur la base d'APB Commercial",
    "DiscountRequestCertifyInformationMessage": "Je certifie que toutes les informations sont vraies et correctes.",
    "DiscountRequestReceived": "Nous avons bien reçu votre demande de remise.",
    "DiscountRequestStatusMessage": "Nous vous répondrons après vérification des informations que vous nous avez fournies.",
    "MVCOrRazorPages": "MVC (pages rasoirs)",
    "Angular": "Angulaire",
    "Blazor": "blouson",
    "New": "Nouveau",
    "MongoDB": "MongoDB",
    "EBookDDD": "Conception axée sur le domaine du livre électronique",
    "PracticalGuideForImplementingDDD": "Ce livre est un guide pratique pour la mise en œuvre du Domain Driven Design avec le framework ABP.",
    "IntroducingDDD": "Présentation de la conception axée sur le domaine",
    "DDDLayersAndCleanArchitecture": "Couches DDD et architecture propre",
    "LayeringOfADotnetSolution": "Superposition d'une solution .NET",
    "ImplementingDDDBuildingBlocks": "Implémentation des blocs de construction DDD",
    "DomainVsApplicationLogic": "Logique de domaine vs logique d'application",
    "SamplesAndDiscussions": "Échantillons et discussions",
    "Free": "Libérer",
    "Download": "Télécharger",
    "DDDEBook": "Livre électronique DDD",
    "ImplementingDDD": "Implémentation de la conception axée sur le domaine",
    "DDDBookExplanation": "Un guide pratique pour la mise en œuvre du Domain Driven Design avec le framework ABP.",
    "Overview": "Aperçu",
    "DDDBookPracticalGuide": "Il s'agit d'un guide pratique pour la mise en œuvre du Domain Driven Design (DDD). Bien que les détails de l'implémentation reposent sur l'infrastructure ABP Framework, les concepts, principes et modèles de base sont applicables à tout type de solution, même s'il ne s'agit pas d'une solution .NET.",
    "TableOfContents": "Table des matières",
    "IntroductionToImplementingDDD": "Introduction à la mise en œuvre de la conception pilotée par domaine",
    "WhatIsDDD": "Qu'est-ce que la conception axée sur le domaine ?",
    "Implementation": "Mise en œuvre",
    "TheBigPicture": "La grande image",
    "TheBuildingBlock": "Le bloc de construction",
    "ExampleUseCase": "Exemple de cas d'utilisation",
    "DomainAndApplicationLogic": "Logique de domaine et logique d'application",
    "Author": "Auteur",
    "PublishedOn": "Publié le",
    "Page": "Page",
    "FreeEBook": "Livre électronique gratuit",
    "EBookSignInForDownload": "Pour télécharger le livre électronique, connectez-vous",
    "SignIn": "S'identifier",
    "Or": "Ou",
    "TellUsAboutYourself": "Parlez-nous un peu de vous",
    "Surname": "Nom de famille",
    "DoYouAgreePrivacyPolicy": "J'accepte les <a href=\"/TermsConditions\">Conditions générales<a/> et la <a href=\"/Privacy\">Politique de confidentialité</a>.",
    "VolosoftMarketingInformationMessage": "Je souhaite obtenir des informations, des conseils et des offres sur les Solutions pour les entreprises et les organisations et d'autres produits et services Volosoft.",
    "VolosoftSharingInformationMessage": "Je souhaite que Volosoft partage mes informations avec des partenaires sélectionnés afin que je puisse recevoir des informations pertinentes sur leurs produits et services.",
    "WeWillSendYouADownloadLink": "Un lien pour télécharger le livre électronique a été envoyé à {0}.<br/> Vérifiez votre boîte de réception/courrier indésirable/spam !",
    "InvalidFormInputs": "Veuillez saisir les informations valides spécifiées sur le formulaire.",
    "DDDBookEmailBody": "Merci. <br /> Pour télécharger votre livre, <a href=\"{0}\">cliquez ici</a>.",
    "StartFree": "Commencer gratuitement",
    "FreeTrial": "Essai gratuit",
    "AcceptsMarketingCommunications": " Oui, j'aimerais recevoir les communications marketing d'ABP Commercial.",
    "PurposeOfUsage": "But de l'utilisation",
    "Choose": "- Choisir -",
    "CompanyOrganizationName": "Nom de l'entreprise/organisation",
    "CompanySize": "Taille de l'entreprise",
    "Next": "Prochain",
    "StartTrial": "Commencer mon essai gratuit",
    "ContactUsQuestions": "Contactez nous si vous avez des questions",
    "TrialActivatedWarning": "Un utilisateur n'a droit qu'à 1 période d'essai gratuite. Vous avez déjà utilisé votre période d'essai.",
    "ActivationRequirement": "Vous n&#39;êtes plus qu&#39;à une étape du début de votre essai.<br> Après avoir vérifié vos informations, nous activerons votre licence. Une fois votre licence activée, nous enverrons un e-mail à <b>{0}</b> . Ne vous inquiétez pas, ce processus ne prendra pas longtemps !",
    "SaveAndDownload": "Enregistrer et télécharger",
    "CompanyNameValidationMessage": "Le nom de l'entreprise est trop long !",
    "AddressValidationMessage": "L'adresse est trop longue !",
    "TaxNoValidationMessage": "TAXES/TVA Non, c'est trop long !",
    "NotesValidationMessage": "Le champ Notes est trop long !",
    "CheckYourBillingInfo": "Vous ne pouvez créer votre facture qu'une seule fois ! Vérifiez vos informations de facturation avant de créer votre facture.",
    "StartYourFreeTrial": "Commencer votre essai gratuit",
    "TrialLicenseModelInvalidErrorMessage": "L'un des champs suivants n'est pas valide : Nom du pays, Taille de l'entreprise, Secteur d'activité ou Objet de l'utilisation.",
    "Trial": "Essai",
    "Purchased": "Acheté",
    "PurchaseNow": "Achetez maintenant",
    "PurchaseTrialLicenseMessage": "La date d'expiration de votre licence est {0}. <br> Si vous souhaitez continuer à utiliser les projets que vous avez créés pendant votre période d'essai gratuite, vous devez modifier les clés de licence dans vos fichiers <code>appsettings.secrets.json</code>. Voici votre clé de licence :",
    "TrialLicenseExpireMessage": "Vous utilisez la licence d'essai et votre licence d'essai expirera le {0}.",
    "TryForFree": "Essayer gratuitement",
    "TrialLicenseExpiredInfo": "Votre période de licence d'essai a expiré !",
    "DowngradeLicensePlan": "Puis-je passer à un plan de licence inférieur à l'avenir ?",
    "DowngradeLicensePlanExplanation": "Vous ne pouvez pas rétrograder votre plan de licence existant. Mais vous pouvez acheter un nouveau plan de licence inférieur et continuer votre développement sur la nouvelle licence. Après avoir acheté une licence inférieure, il vous suffit de vous connecter à votre nouveau plan de licence via la commande CLI d'ABP : ` abp login <nom d'utilisateur> -o <organisation> `.",
    "LicenseTransfer": "Une licence peut-elle être transférée d'un développeur à un autre ?",
    "LicenseTransferExplanation": "Oui ! Lorsque vous achetez une licence, vous en devenez le détenteur et vous avez donc accès à la page de gestion de l'organisation. Une organisation a des rôles de propriétaire et de développeur. Les propriétaires peuvent gérer les sièges des développeurs et leur assigner des développeurs. Chaque développeur assigné se connectera au système via la commande ABP CLI et disposera d'autorisations de développement et de support.",
    "UserOwnerDescription": "Le « Propriétaire » de l&#39;organisation est l&#39;administrateur de ce compte. Il gère l&#39;organisation en achetant des licences et en attribuant des développeurs. Un « propriétaire » ne peut pas écrire de code dans les projets commerciaux ABP, ne peut pas télécharger les exemples de projets ABP et ne peut pas poser de questions sur le site Web d&#39;assistance. Si vous souhaitez faire tout cela, vous devez également vous ajouter en tant que développeur.",
    "UserDeveloperDescription": "Les « développeurs » peuvent écrire du code dans les projets commerciaux ABP, télécharger les exemples de projets ABP et poser des questions sur le site Web d&#39;assistance. En revanche, les « Développeurs » ne peuvent pas gérer cette organisation.",
    "RemoveCurrentUserFromOrganizationWarningMessage": "Vous vous retirez de votre propre organisation. Vous ne pourrez plus gérer cette organisation, confirmez-vous ?",
    "RenewExistingOrganizationOrCreateNewOneMessage": "Vous pouvez renouveler la licence de votre (vos) organisation(s) en cliquant sur le(s) bouton(s) ci-dessous « Prolonger maintenant » et vous pouvez ainsi prolonger la date d&#39;expiration de la licence d&#39;un an. Si vous continuez à payer, vous aurez une nouvelle organisation. Vous souhaitez continuer avec une nouvelle organisation ?",
    "PurchaseTrialOrganizationOrCreateNewOneMessage": "Vous disposez d&#39;une licence d&#39;essai. Pour acheter votre licence d&#39;essai, cliquez sur le bouton Acheter maintenant. Si vous continuez à payer, vous aurez une nouvelle organisation. Vous souhaitez continuer avec une nouvelle organisation ?",
    "ExtendNow": "Prolonger maintenant",
    "CreateNewOrganization": "Créer une nouvelle organisation",
    "RenewLicenseEarly": "Si je renouvelle ma licence plus tôt, obtiendrai-je l'année complète ?",
    "RenewLicenseEarylExplanation": "Lorsque vous renouvelez votre licence avant la date d'expiration de votre licence, 1 an sera ajouté à la date d'expiration de votre licence. Par exemple, si votre licence expire le {0}-06-06 et que vous la renouvelez le {0}-01-01, la nouvelle date d'expiration de votre licence sera le {1}-06-06.",
    "OpenSourceWebApplication": "Application Web open source",
    "CompleteWebDevelopment": "Un développement web complet",
    "ABPFrameworkDescription": "ABP Framework est une infrastructure complète pour créer des applications Web modernes en suivant les meilleures pratiques de développement logiciel et les conventions.",
    "CommunityDescription": "Partagez vos expériences avec le framework ABP !",
    "GetStarted": "Commencer",
    "Views": "vues",
    "LatestPosts": "Derniers messages",
    "PreBuiltApplication": "Application pré-construite",
    "DatabaseProviders": "Fournisseurs de bases de données",
    "UIFrameworks": "Cadres d&#39;interface utilisateur",
    "UsefulLinks": "Liens utiles",
    "Platform": "Plate-forme",
    "CoolestCompaniesUseABPCommercial": "Les entreprises les plus cool utilisent déjà <span class=\"fw-bold\">ABP Commercial.</span>",
    "UserInterface": "Interface utilisateur",
    "APIGateway": "Passerelle API",
    "Microservice": "Microservice",
    "Database": "Base de données",
    "Architecture": "Architecture",
    "MicroserviceArchitectureExplanation": "Il s&#39;agit d&#39;une architecture de solution complète composée de plusieurs applications, passerelles API, microservices et bases de données pour créer une solution de microservices évolutive avec les dernières technologies.",
    "BusinessLogic": "Logique métier",
    "DataAccessLayer": "Couche d&#39;accès aux données",
    "Monolith": "Monolithe",
    "ModularArchitectureExplanation": "Ce modèle de démarrage fournit une architecture de solution en couches, modulaire et basée sur DDD pour créer une base de code propre et maintenable.",
    "SeeDetails": "Voir les détails",
    "SeeDocumentation": "Consultez la documentation",
    "Bs5Compatible": "Thème professionnel compatible Bootstrap 5, parfait pour votre site Web d&#39;administration.",
    "LeptonXTheme": "Thème LeptonX",
    "LeptonXDark": "LeptonX sombre",
    "LeptonXLight": "Lumière LeptonX",
    "LeptonXSemiDark": "LeptonX semi-foncé",
    "BuiltOnBs5Library": "Construit sur la bibliothèque Bootstrap 5",
    "FullyCompatibleWithBs5": "100% compatible avec la structure HTML et les classes CSS Bootstrap 5",
    "ResponsiveAndMobileCompatible": "Réactif, compatible mobile, support RTL",
    "ProvidesStylesForDatatables": "Fournit des styles pour les tables de données",
    "MultipleLayoutOptions": "Plusieurs options de mise en page",
    "EasilyInstallAndUpgrade": "Installation et mise à niveau faciles",
    "SupportForum": "Forum d&#39;entraide",
    "TrustedBy": "Approuvé par",
    "OurPricing": "Nos <span class=\"gradient-commercial\">tarifs</span>",
    "Plans": "Des plans",
    "NameSurname": "Prénom / nom de famille",
    "Unspecified": "Non spécifié",
    "LicenceType": "Type de licence",
    "LicenseDiscountWarning": "CETTE PAGE DE RÉDUCTION UTILISE LE CODE DE RÉDUCTION PAR DÉFAUT ET POUR LES DÉVELOPPEURS VOLOSOFT. LES LIENS D’ACHAT CI-DESSOUS NE FONCTIONNENT PAS.",
    "DiscountedLicenseExplanation": "Ces prix de licence sont destinés aux petites startups, aux développeurs individuels, aux étudiants, aux organisations et projets à but non lucratif !",
    "General": "Général",
    "License": "Licence",
    "Development": "Développement",
    "Payment": "Paiement",
    "WatchExplainerVideo": "On se retrouve! Regarder la vidéo explicative",
    "LightDarkAndSemiDarkThemes": "Clair, foncé et semi-foncé",
    "LeptonXThemeExplanation": "Lepton Theme peut changer votre thème en fonction des paramètres de votre système.",
    "PRO": "PRO",
    "WelcomeToABPCommercial": "Bienvenue chez <span class=\"gradient-commercial\">ABP Commercial !</span>",
    "YourAccountDetails": "Détails de votre compte",
    "OrganizationName": "nom de l&#39;organisation",
    "AddDevelopers": "Ajouter des développeurs",
    "StartDevelopment": "Commencer le développement",
    "CreateAndRunApplicationUsingStartupTemplate": "Découvrez comment créer et exécuter une nouvelle application Web à l&#39;aide du modèle de démarrage ABP Commercial.",
    "CommunityDescription2": "<span class=\"fw-6\">community.abp.io</span> est un endroit où les gens peuvent partager des articles liés à l&#39;ABP. Recherchez des articles, des didacticiels, des exemples de code, des études de cas et rencontrez des personnes dans le même sens que vous.",
    "UseABPSuiteExplanation": "Utilisez ABP Suite pour télécharger le code source des modules et des thèmes.",
    "ManageModulesWithSuite": "Vous pouvez également gérer vos modules ABP avec Suite.",
    "LearnHowToInstallSuite": "Découvrez comment installer et utiliser ABP Suite.",
    "SeeMore": "Voir plus",
    "SeeLess": "Voir moins",
    "LayeredSolutionStructure": "Structure de solution en couches",
    "LayeredSolutionStructureExplanation": "La solution est basée sur des principes et des modèles de conception pilotée par domaine pour isoler votre logique métier de l&#39;infrastructure et des intégrations et pour maximiser la maintenabilité et la réutilisation du code. ABP Framework fournit déjà des abstractions, des classes de base et des guides pour véritablement implémenter DDD pour votre application.",
    "MultipleUIOptions": "Plusieurs options d&#39;interface utilisateur",
    "MultipleUIOptionsExplanation": "Nous aimons différentes façons de créer l’interface utilisateur. Cette solution de démarrage fournit trois options de structure d&#39;interface utilisateur différentes pour votre application métier.",
    "MultipleDatabaseOptions": "Plusieurs options de base de données",
    "MultipleDatabaseOptionsExplanation": "Vous disposez de deux options de fournisseur de base de données (en plus d’utiliser les deux dans une seule application). Utilisez Entity Framework Core pour travailler avec n&#39;importe quelle base de données relationnelle et utilisez éventuellement Dapper lorsque vous devez écrire des requêtes de bas niveau pour de meilleures performances. MongoDB est une autre option si vous devez utiliser une base de données NoSQL basée sur des documents. Bien que ces fournisseurs soient bien intégrés, abstraits et préconfigurés, vous pouvez réellement interagir avec n&#39;importe quel système de base de données que vous pouvez utiliser avec .NET.",
    "ModularArchitectureExplanation2": "La modularité est un citoyen de premier ordre dans la plateforme ABP.IO. Toutes les fonctionnalités de l&#39;application sont réparties dans des modules optionnels bien isolés. La solution de démarrage est déjà livrée avec les <a href=\"/modules\" class=\"text-primary\">modules fondamentaux ABP Commercial</a> préinstallés. Vous pouvez également créer vos propres modules pour construire un système modulaire pour votre propre application.",
    "MultiTenancyForSaasBusiness": "Multilocation pour votre entreprise SaaS",
    "MultiTenancyForSaasBusinessExplanation": "ABP Commercial fournit un système multi-tenant complet de bout en bout pour créer vos systèmes SaaS (Software-as-a-Service). Il permet aux locataires de partager ou d&#39;avoir leurs propres bases de données avec un système de création et de migration de bases de données à la volée.",
    "MicroserviceStartupSolution": "Solution de démarrage de microservices",
    "MicroserviceArchitectureExplanation2": "Vous pouvez l&#39;obtenir pour votre prochain système de microservices afin de profiter de la solution de base prédéfinie et de l&#39;expérience distillée.",
    "PreIntegratedTools": "Pré-intégré aux outils populaires",
    "PreIntegratedToolsExplanation": "La solution est déjà intégrée aux outils et technologies standard de l&#39;industrie, tandis que vous pouvez toujours les modifier et les intégrer à vos outils préférés.",
    "SingleSignOnAuthenticationServer": "Serveur d&#39;authentification à authentification unique",
    "SingleSignOnAuthenticationServerExplanation": "La solution dispose d&#39;une application serveur d&#39;authentification qui est utilisée par les autres applications comme serveur d&#39;authentification unique avec les fonctionnalités de gestion des accès API. Il est basé sur IdentityServer.",
    "WebAppsWithGateways": "2 applications Web avec 2 passerelles API",
    "WebAppsWithGatewaysExplanation": "La solution contient deux applications web, chacune disposant d&#39;une passerelle API dédiée (BFF - Backend For Frontend pattern).",
    "BackOfficeApplication": "Application de back-office",
    "BackOfficeApplicationExplanation": "L&#39;application Web réelle de votre système, avec plusieurs options de structure d&#39;interface utilisateur. Vous pouvez créer tout type d’application métier.",
    "LandingWebsite": "Site Web d&#39;atterrissage",
    "LandingWebsiteExplanation": "Un site Web de destination/public générique qui peut être utilisé à plusieurs fins, comme présenter votre entreprise, vendre vos produits, etc.",
    "ABPFrameworkEBook": "Livre électronique Maîtriser le cadre ABP",
    "MasteringAbpFrameworkEBookDescription": "Inclus dans votre licence commerciale ABP",
    "FullName": "Nom et prénom",
    "LicenseTypeNotCorrect": "Le type de licence n&#39;est pas correct !",
    "Trainings": "Formations",
    "ChooseTrainingPlaceholder": "Choisissez la formation...",
    "DoYouNeedTrainings": "Avez-vous besoin d&#39;une de ces formations ?",
    "DoYouNeedTraining": "Avez-vous besoin de {0} formation ?",
    "GetInTouchUs": "Prenez contact avec nous",
    "ForMoreInformationClickHere": "Pour plus d&#39;informations, cliquez <a href='{0}'>ici.</a>",
    "ForMoreInformationClickHereByClass": "<span class=\"{1}\">Pour plus d&#39;informations, cliquez</span> <a href='{0}'>ici.</a>",
    "IsGetOnboardingTraining": "Souhaitez-vous suivre une formation d’intégration et de développement d’applications Web ?",
    "OnboardingWebApplicationDevelopmentTrainingMessage": "Pour planifier votre calendrier de formation, veuillez contacter {0} après avoir créé l&#39;organisation.",
    "CustomPurchaseMessage": "Pour l&#39;étape suivante, cliquez sur {0} pour nous contacter.",
    "Note": "Note",
    "AdditionalNote": "Note supplémentaire",
    "OnboardingTrainingFaqTitle": "Avez-vous une formation d'accueil ABP ?",
    "OnboardingTrainingFaqExplanation": "Oui, nous avons des services de formation ABP pour vous aider à démarrer rapidement votre projet ABP. Vous en apprendrez plus sur l'ABP auprès d'un membre de l'équipe principale d'ABP et vous acquerrez les compétences nécessaires pour commencer votre projet ABP. Dans la formation d'intégration, nous vous expliquerons comment configurer votre environnement de développement, installer les outils requis, créer une page CRUD entièrement fonctionnelle. La formation sera en direct et l'application Zoom sera utilisée, et nous sommes ouverts à l'utilisation d'autres plateformes de réunion en ligne. La langue de la formation sera l'anglais. Vous pouvez également poser vos questions sur l'ABP pendant les séances. Une heure et une date convenables seront prévues pour les deux parties. Pour obtenir plus d'informations, contactez-nous à <a href=\"mailto:info@abp.io\">info@abp.io</a>.",
    "AddBasket": "ajouter au panier",
    "SendTrainingRequest": "Envoyer une demande de formation",
    "OnlyEnglishVersionOfThisDocumentIsTheRecentAndValid": "* La version anglaise de ce document est la plus à jour et la version anglaise prévaudra en cas de litige.",
    "Pricing_Page_Title": "Tarifs et forfaits",
    "Pricing_Page_Description": "Choisissez les caractéristiques et fonctionnalités dont votre entreprise a besoin aujourd’hui. Achetez une licence commerciale ABP et créez un nombre illimité de projets.",
    "Pricing_Page_HurryUp": "Dépêche-toi!",
    "Pricing_Page_BuyLicense": "Achetez une licence aux <strong>tarifs 2021</strong> jusqu&#39;au 16 janvier !",
    "Pricing_Page_ValidForExistingCustomers": "Également valable pour les clients existants et les renouvellements de licence.",
    "Pricing_Page_Hint1": "Le prix de la licence comprend un certain nombre de postes développeurs. Si vous avez plus de développeurs, vous pouvez toujours acheter des sièges supplémentaires.",
    "Pricing_Page_Hint2": "Vous pouvez acheter davantage de licences de développeur maintenant ou ultérieurement. Les licences sont basées sur le poste, vous pouvez donc transférer un poste d&#39;un développeur à un autre.",
    "Pricing_Page_Hint3": "Vous pouvez développer un nombre illimité de produits différents avec votre licence.",
    "Pricing_Page_Hint4": "ABP Suite est un outil d&#39;aide à votre développement pour améliorer votre productivité. Il prend en charge la génération de pages CRUD et la création de nouveaux projets.",
    "Pricing_Page_Hint5": "Vous pouvez utiliser tous les modules prédéfinis dans vos applications.",
    "Pricing_Page_Hint6": "Vous pouvez utiliser tous les thèmes prédéfinis dans vos applications.",
    "Pricing_Page_Hint7": "Un modèle de démarrage est une solution Visual Studio pour vous permettre de démarrer votre projet. Tous les modules fondamentaux sont ajoutés et préconfigurés pour vous.",
    "Pricing_Page_Hint8": "Le livre électronique Mastering ABP Framework explique comment mettre en œuvre des solutions .NET avec les meilleures pratiques. Il est vendu sur Amazon.com et vous pouvez télécharger le livre gratuitement avec votre licence.",
    "Pricing_Page_Hint9": "Vous pouvez télécharger le code source de n&#39;importe quel module. Vous souhaiterez peut-être ajouter le code source à votre solution pour apporter des modifications radicales ou simplement le conserver pour vous pour des raisons de sécurité.",
    "Pricing_Page_Hint10": "Les licences sont à vie. Cela signifie que vous pouvez continuer à développer votre application pour toujours. L&#39;accès à la dernière version et l&#39;assistance sont accordés pendant la période de licence (1 an sauf si vous la renouvelez).",
    "Pricing_Page_Hint11": "Aucune restriction de déploiement ! Vous pouvez déployer sur autant de serveurs que vous le souhaitez, y compris les services cloud ou sur site.",
    "Pricing_Page_Hint12": "Vous pouvez mettre à jour les modules, thèmes et outils vers la dernière version pendant votre période de licence active. Une fois votre licence expirée, vous devez la renouveler pour continuer à recevoir des mises à jour concernant les corrections de bogues, les nouvelles fonctionnalités et les améliorations.",
    "Pricing_Page_Hint13": "Vous pouvez bénéficier du support premium pendant un an (vous pouvez renouveler votre licence pour la prolonger).",
    "Pricing_Page_Hint14": "Les licences Team et Business ont une limite de nombre d’incidents/questions. Si vous achetez des licences de développeur supplémentaires, votre limite d&#39;incidents augmente de {0} (pour la licence Team) ou de {1} (pour la licence Business) par développeur.",
    "Pricing_Page_Hint15": "Seule la licence Entreprise inclut un support privé. Vous pouvez envoyer un e-mail directement à l&#39;équipe ABP ou poser des questions sur support.abp.io avec une option de ticket privé. Les billets privés ne sont pas visibles au public.",
    "Pricing_Page_Hint16": "Vous pouvez télécharger le code source de tous les thèmes ABP. Vous souhaiterez peut-être ajouter le code source à votre solution pour apporter des modifications radicales ou simplement le conserver pour vous pour des raisons de sécurité.",
    "Pricing_Page_Testimonial_1": "ABP Commercial a permis à SC Ventures de fournir une plate-forme SaaS de base de données silo multi-locataires de qualité bancaire en 9 mois pour prendre en charge le financement de la chaîne d&#39;approvisionnement des comptes clients et des comptes créditeurs de factures de valeur importante provenant de plusieurs points d&#39;ancrage intégrés. La modularité d&#39;ABP a permis à l&#39;équipe de livrer en un temps record, de réussir tous les VAPT et de déployer la pile de microservices conteneurisés via CI/CD complet et des pipelines en production.",
    "Pricing_Page_Testimonial_2": "Nous voyons l’intérêt d’utiliser ABP Commercial pour réduire les frais généraux des projets de développement personnalisés. L&#39;équipe est capable d&#39;unifier le modèle de code dans différents flux de projet. Nous voyons plus de potentiel dans le cadre pour créer de nouvelles fonctionnalités plus rapidement qu’auparavant. Nous sommes convaincus que nous verrons constamment l’intérêt de tirer parti d’ABP Commercial.",
    "Pricing_Page_Testimonial_3": "Nous adorons l&#39;ABP. Nous n’avons pas besoin de tout écrire à partir de zéro. Nous partons de fonctionnalités prêtes à l&#39;emploi et nous nous concentrons uniquement sur ce que nous avons réellement besoin d&#39;écrire. De plus, ABP est bien architecturé et le code est de haute qualité avec moins de bugs. Si nous devions écrire nous-mêmes tout ce dont nous avions besoin, cela nous prendrait peut-être des années. Une autre chose que nous aimons est que la nouvelle version, la résolution de problèmes ou l&#39;amélioration sort très bientôt toutes les deux semaines. Nous n&#39;attendons pas trop longtemps.",
    "Pricing_Page_Testimonial_4": "ABP Commercial est un produit fantastique que je recommande. Produits commerciaux à commercialiser pour nos clients sur une seule plateforme configurable. Le point de départ est que le cadre et les outils fournis à toute équipe valent chaque centime. ABP Commercial était la solution la mieux adaptée à nos besoins.",
    "Pricing_Page_Testimonial_5": "ABP Framework n&#39;est pas seulement un framework, mais c&#39;est également un guide pour le développement/gestion de projets, car il fournit des formations DDD, GenericRepository, DI, Microservice et Modularité. Même si vous n&#39;utilisez pas le framework lui-même, vous pouvez vous développer avec docs.abp.io qui est bien préparé de manière professionnelle (OpenIddict, Redis, Quartz etc.). Étant donné que de nombreux éléments sont prédéfinis, cela réduit considérablement le temps de développement du projet (tels que la page de connexion, la gestion des exceptions, le filtrage des données, l&#39;amorçage, la journalisation d&#39;audit, la localisation, le contrôleur API automatique, etc.). À titre d&#39;exemple tiré de notre application, j&#39;ai utilisé Local Event Bus pour le contrôle des stocks. Ainsi, je suis capable de gérer les mouvements de commandes en écrivant stock handler. C&#39;est merveilleux de ne pas perdre de temps pour CreationTime, CreatorId. Ils sont remplis automatiquement.",
    "Pricing_Page_Testimonial_6": "ABP Framework est un bon framework mais il lui faut du temps pour comprendre les différentes couches, classes et bibliothèques qu&#39;il utilise (notamment ABP). J&#39;ai passé beaucoup de temps à lire la base de code, mais ABP Commercial nous a fait gagner du temps dans la création des entités de spécialité (AR) du projet et du référentiel lié à chacune d&#39;elles. J&#39;ai également aimé l&#39;approche utilisée dans ABP qui est très mature ; nous savons qu&#39;il est basé sur DDD et monolithe.",
    "Pricing_Page_Testimonial_7": "En tant que startup, nous devons itérer rapidement et consacrer un minimum de temps aux fonctionnalités passe-partout et non essentielles. \n Nos ingénieurs vont des ingénieurs très expérimentés aux ingénieurs juniors, et nous avions besoin d&#39;une compréhension commune et d&#39;un moyen de partager les connaissances techniques et du domaine, ABP nous a permis de le faire grâce à leurs excellents guides et documentation. \n Il y a des choses dont nous n&#39;avons pas eu à nous soucier puisqu&#39;elles fonctionnent immédiatement avec ABP. \n ABP nous a aidé à rationaliser le prototypage et le développement rapides, moins de 4 semaines entre la création des fonctionnalités et la production. Avec toutes ses fonctionnalités premium incluses dans la licence, ABP nous a offert « Startup in a Box » du côté du génie logiciel.",
    "Pricing_Page_Testimonial_8": "Je recommanderais ABP commercial à tous ceux qui souhaitent élargir la gamme de produits proposés à leurs clients. C&#39;est fantastique lorsqu&#39;il faut utiliser un environnement d&#39;entreprise distribué (Angular, WPF, Win&amp;Linux). En plus de leurs produits, nous apprécions leur assistance, qui rend notre travail plus rapide et plus facile. Nous savons déjà que nous avons trouvé un excellent partenaire pour l&#39;avenir qui nous aidera à développer notre activité.",
    "Pricing_Page_Testimonial_9": "Nous sommes une entreprise de 2 salariés en activité depuis plus de 20 ans. \n En ce qui concerne notre expérience avec ABP Commercial, nous avons été approchés par un client qui nous a demandé de développer une nouvelle application de ressources humaines dans un environnement moderne pour remplacer son application Access vieille de 25 ans. Nous avons décidé de passer d&#39;une solution de bureau à une solution Web. \n \n À l&#39;époque, nous avions très peu de connaissances sur les applications Web et .NET, mais nous sommes tombés sur ABP Commercial et, avec l&#39;aide d&#39;ABP Framework, de la documentation technique et d&#39;ABP Suite, nous avons pu non seulement développer l&#39;application pour les spécifications du client, mais aussi travailler avec succès dans un environnement .NET en un an.",
    "AbpBookDownloadArea_ClaimYourEBook": "Réclamez votre livre électronique <span class='gradient-framework'>Mastering ABP Framework</span>",
    "AddMemberModal_Warning_1": "Si le <strong>nom d&#39;utilisateur</strong> que vous essayez d&#39;ajouter n&#39;existe pas dans le système, veuillez demander au membre de votre équipe de s&#39;inscrire sur <a href='{0}/Account/Register'>{0}</a> et de partager le nom d&#39;utilisateur de son compte avec vous.",
    "MyOrganizations_Detail_WelcomeMessage": "Bienvenue dans votre organisation, {0}",
    "MyOrganizations_Detail_OrganizationManagement": "<span class=\"gradient-commercial\">Gestion</span> de l&#39;organisation",
    "OrganizationDisplayName": "Nom d’affichage de l’organisation",
    "MyOrganizations_Detail_EditDisplayName": "Modifier le nom d&#39;affichage",
    "MyOrganizations_Detail_UpgradeYourLicense": "Mettez à niveau votre licence",
    "MyOrganizations_Detail_LicenseStartAndExpiryDate": "Date de début de la licence - Date d&#39;expiration",
    "MyOrganizations_Detail_OwnerRightInfo": "Vous utilisez {0} de vos {1} droits de propriétaire.",
    "MyOrganizations_Detail_CopyApiKey": "Copiez la clé",
    "MyOrganizations_Detail_ApiKeyDescription": "La clé API est le jeton des packages PRO hébergés sur <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{1}.</a>",
    "MyOrganizations_Detail_YourPrivateNugetSource": "Votre source NuGet privée est <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{0}</a>",
    "MyOrganizations_Detail_PrivateNugetSourceWarning": "Ceci est automatiquement ajouté en tant que flux à votre NuGet.Config dans votre solution ABP. Ne partagez pas votre clé privée avec des utilisateurs non autorisés !",
    "MyOrganizations_Detail_DeveloperSeatInfo": "Vous utilisez {0} de vos {1} postes de développeur.",
    "NeedMoreSeatsForYourTeam": "Besoin de plus de sièges pour votre équipe ?",
    "MyOrganizations_Detail_PricePerYear": "{0} / par an",
    "MyOrganizations_Detail_PurchaseDeveloperSeats": "Acheter des sièges de développeur",
    "Invoices": "Factures",
    "RequestInvoice": "Demande la facture",
    "OrderNumber": "Numéro de commande",
    "Date": "Date",
    "Products": "Des produits",
    "TotalPrice": "Prix total",
    "ThereIsNoInvoice": "Il n&#39;y a pas de facture",
    "MyOrganizations_Detail_PaymentProviderInfo": "Si vous avez acheté votre licence via la passerelle <i>{0}</i> , celle-ci envoie la facture PDF à votre adresse e-mail, voir <a href=\"{1}\" target=\"_blank\">Facturation {0}.</a>",
    "MyOrganizations_Detail_PayUInfo": "Si vous avez acheté via la passerelle <i>Iyzico</i> , cliquez sur le bouton « Demander une facture » et remplissez les informations de facturation.",
    "MyOrganizations_Detail_ConclusionInfo": "Votre demande de facture sera finalisée dans un délai de {0} jours ouvrés.",
    "ExtendYourLicense": "Prolongez votre licence <span class=\"text-primary\">{0}</span>",
    "Continue": "Continuer",
    "PurchaseLicense": "Acheter la licence {0}",
    "DownloadInvoiceModal_DownloadInvoice": "Télécharger la facture",
    "DownloadInvoiceModal_SaveInformationOnlyOnce": "Vous ne pouvez enregistrer vos informations de facturation qu&#39;une seule fois.",
    "InvoiceModal_EnterCompanyName": "Entrez le nom légal de votre entreprise...",
    "InvoiceModal_EnterCompanyAddress": "Entrez l&#39;adresse légale de votre société...",
    "InvoiceModal_EnterTaxNumber": "Entrez votre numéro de FISCAL/TVA si disponible...",
    "RequestInvoiceModal_EnterNotes": "Saisissez votre message supplémentaire concernant votre facture...",
    "PrePayment_PayWithIyzico": "Vous paierez avec Iyzico",
    "ContinueToCheckout": "Continuer à payer",
    "PrePayment_IyzicoRedirectionInfo": "Vous serez redirigé vers la passerelle de paiement Iyzico pour finaliser votre achat en toute sécurité.",
    "PrePayment_IyzicoAcceptVisaAndMasterCard": "Iyzico accepte Visa et MasterCard.",
    "Purchase": "Achat",
    "AcceptTermsAndConditions": "J&#39;ai lu, compris et accepté la <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">politique de confidentialité</a> , <a href=\"{1}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">les termes et conditions</a> et <a href=\"{2}\" target=\"_blank\" class=\"text-primary\">le CLUF.</a>",
    "AcceptTermsAndConditionsWarningMessage": "Veuillez accepter la politique de confidentialité et les termes et conditions",
    "SelectGatewayToContinue": "Veuillez sélectionner une passerelle pour continuer !",
    "GatewaySelection_SelectGateway": "Sélectionnez une passerelle de paiement",
    "GatewaySelection_RedirectionMessage": "Ensuite, vous serez redirigé vers le site Web de la passerelle de paiement sélectionnée pour la transaction.",
    "PaymentSucceed_PaymentSuccessMessage": "Paiement réussi",
    "PaymentSucceed_ThanksForPurchase": "Merci pour votre achat!",
    "PaymentSucceed_CreateYourOrganization": "Créez votre organisation",
    "PaymentSucceed_AddMeAsDeveloper": "Je suis aussi développeur, ajoutez-moi en tant que développeur à mon organisation.",
    "PaymentSucceed_CreateOrganization": "Créer une organisation",
    "PaymentSucceed_OrganizationDescription": "Une organisation est composée de développeurs et de propriétaires. Les développeurs sont des utilisateurs qui écrivent du code sur le projet ABP et bénéficieront du site Web <a href=\"{0}\" target=\"_blank\">{1}</a> . Les propriétaires sont des utilisateurs qui attribuent des postes de développeur et gèrent les licences.",
    "PaymentSucceed_ViewOrganization": "Cliquez ici pour voir l&#39;organisation",
    "Purchase_TotalAnnualPrice": "TOTAL <small class=\"opacity-50\">(cotisation annuelle)</small>",
    "Purchase_TrainingPrice": "Prix de la formation",
    "Purchase_OnboardingTraining": "Formation en direct sur l&#39;intégration et le développement d&#39;applications Web",
    "TotalDeveloperPrice": "Prix total du développeur",
    "Purchase_PricePerDeveloper": "<span>{0} {1}</span> par développeur",
    "Purchase_IncludedDeveloperInfo": "{0} {1} inclus.",
    "Purchase_LicenseExtraDeveloperPurchaseMessage": "La <span class=\"fw-bold\">licence {0}</span> inclut {1} développeurs. Vous pouvez ajouter des développeurs supplémentaires.",
    "StartupTemplates_Page_Title": "Modèles de démarrage ABP",
    "StartupTemplates_Page_Description": "ABP Commercial vous permet de créer des solutions avec n’importe quel niveau de complexité. Il fournit deux principales solutions de démarrage prédéfinies. Vous pouvez sélectionner celui qui correspond le mieux à vos besoins et créer votre propre solution personnalisée par-dessus.",
    "MicroserviceStartupSolutionForDotnet": "Solution de démarrage de microservices pour .NET",
    "MonolithSolutionForDotnet": "Solution monolithique (modulaire) pour .NET",
    "TrainingDetailsHeaderInfo_TrainingHour": "{0} heure(s)",
    "Trainings_Content": "Contenu de la formation",
    "Trial_Page_StartYourFreeTrial": "Commencer votre <span class=\"gradient-commercial\">essai gratuit</span>",
    "TrialLicenseFeatures": "Vous pourrez bénéficier de toutes les fonctionnalités commerciales d&#39;ABP",
    "TrialPeriodDays": "Vous disposerez d&#39;une licence d&#39;équipe de {0} jours",
    "TrialForumSupportIncident": "Vous aurez {0} incidents d&#39;assistance sur le forum",
    "Contact_Page_Title": "Contact avec l&#39;équipe de développement ABP",
    "Contact_Page_Description": "Contactez l&#39;équipe de développement ABP si vous avez besoin d&#39;aide ou partagez vos réflexions et opinions ! L&#39;équipe d&#39;assistance ABP est prête à vous aider.",
    "Demo_Page_Title": "Créer une démo",
    "Demo_Page_Description": "Créez une démo gratuite pour voir un exemple d&#39;application créée à l&#39;aide du modèle de démarrage ABP Commercial. Ne vous répétez pas pour les exigences courantes des applications.",
    "Discounted_Page_Title": "Tarif réduit",
    "Discounted_Page_Description": "Choisissez les caractéristiques et fonctionnalités dont votre entreprise a besoin aujourd’hui. Achetez une licence commerciale ABP et créez des projets illimités",
    "Faq_Page_Title": "Foire aux questions (FAQ)",
    "Faq_Page_Description": "Avez-vous des questions? Recherchez les questions fréquemment posées ou posez-nous une question en utilisant le formulaire de contact.",
    "Faq_Page_SwiftCode": "Code rapide",
    "Faq_Page_BankName": "Nom de banque",
    "Faq_Page_AccountName": "Nom du compte",
    "Faq_Page_AccountNumber": "Numéro de compte",
    "Faq_Page_Currency": "Devise",
    "Faq_Page_VatNumber": "numéro de TVA",
    "Faq_Page_OtherCurrenciesInfo": "Pour les autres devises, voir <a href='{0}'>tous les comptes</a>",
    "ProjectCreatedSuccess_Page_Title": "Votre projet créé",
    "ProjectCreatedSuccess_Page_Description": "Votre projet ABP créé avec succès !",
    "Suite_Page_Title": "Suite PAA",
    "Suite_Page_Description": "ABP Commercial fournit des outils de développement d&#39;applications rapides pour augmenter la productivité des développeurs. ABP Suite vous permet de créer facilement des pages CRUD.",
    "Themes_Page_Title": "Thèmes PBA",
    "Themes_Page_Description": "ABP Commercial propose plusieurs thèmes d’interface utilisateur professionnels et modernes. Créez une démo gratuite pour avoir un aperçu rapide de ce à quoi ressemble l&#39;interface utilisateur.",
    "Tools_Page_Title": "Outils de développement rapide d&#39;applications",
    "Tools_Page_Description": "ABP Commercial fournit des outils de développement d&#39;applications rapides pour augmenter la productivité des développeurs. ABP Suite vous permet de créer facilement des pages CRUD.",
    "DeveloperPrice": "Prix du développeur",
    "AdditionalDeveloperPaymentInfoSection_AdditionalDevelopers": "{0} <small>développeurs</small>",
    "LicenseRemainingDays": "pendant <span>{0}</span> jours",
    "ExtendPaymentInfoSection_Description": "En prolongeant/renouvelant votre licence, vous continuerez à bénéficier <a href=\"{0}\" target=\"_blank\">d&#39;une assistance premium</a> . Vous pourrez également obtenir des mises à jour majeures ou mineures pour les modules et thèmes. Vous pourrez continuer à créer de nouveaux projets. Et vous pourrez toujours utiliser <a href=\"{1}\" target=\"_blank\">ABP Suite</a> qui accélère votre développement.",
    "LicenseRenewalPrice": "Prix de renouvellement de licence",
    "LicensePrice": "Prix de la licence",
    "TrialLicensePaymentInfoSection_Description": "<strong>Acheter une licence :</strong> en achetant une licence, vous continuerez à bénéficier <a href=\"{0}\" target=\"_blank\" rel=\"noopener\">d&#39;une assistance premium</a> . Vous pourrez également obtenir des mises à jour majeures ou mineures pour les modules et thèmes. Vous pourrez continuer à créer de nouveaux projets. Et vous pourrez toujours utiliser <a href=\"{1}\" target=\"_blank\" rel=\"noopener\">ABP Suite</a> qui accélère votre développement.<br> Consultez le <a href=\"{2}\" target=\"_blank\" rel=\"noopener\">tableau de comparaison des licences</a> pour vérifier les différences entre les types de licences.",
    "SelectTargetLicense": "Sélectionnez la licence cible",
    "UpgradePaymentInfoSection_ExtendMyLicenseForOneYear": "Oui, prolonger la date d&#39;expiration de ma licence d&#39;un an.",
    "UpgradePaymentInfoSection_WantToExtendLicense": "Vous souhaitez prolonger votre licence d&#39;1 an supplémentaire ?",
    "UpgradePaymentInfoSection_UpgradingWillNotExtendLicense": "La mise à niveau ne prolongera pas la date d&#39;expiration de votre licence !",
    "UpgradePaymentInfoSection_LicenseUpgradeDescription": "En mettant à niveau votre licence, vous serez promu à un type de licence supérieur, ce qui vous permettra d&#39;obtenir des avantages supplémentaires. Consultez le <a href=\"/Pricing\" target=\"_blank\">tableau de comparaison des licences</a> pour vérifier les différences entre les types de licences.",
    "Landing_Page_CustomerStories": "Témoignages de clients",
    "Landing_Page_OurGreatCustomers": "Nos grands clients",
    "Landing_Page_WebApplicationFramework": "Cadre d&#39;applications Web",
    "Landing_Page_WebDevelopmentPlatform": "Plateforme de développement Web",
    "Landing_Page_CompleteWebDevelopmentPlatform": "Plateforme complète de développement Web",
    "Landing_Page_TryFreeDemo": "Essayez la démo gratuite",
    "Landing_Page_StartingPointForWebApplications": "Le point de départ des applications Web basées sur ASP.NET Core ! Il est basé sur le framework ABP pour un meilleur développement Web.",
    "Landing_Page_AbpProvidesSoftwareInfrastructure": "ABP Framework fournit une infrastructure logicielle pour développer d&#39;excellentes applications Web avec les meilleures pratiques.",
    "Landing_Page_MicroserviceCompatibleArchitecture": "Architecture compatible avec les microservices",
    "Landing_Page_PreBuiltApplicationModulesAndThemes": "Modules et thèmes d&#39;application pré-construits",
    "Landing_Page_MultiTenantArchitecture": "Architecture multi-locataires",
    "Landing_Page_MultiTenancyDescription": "Les applications SaaS simplifiées ! Multilocation intégrée de la base de données à l&#39;interface utilisateur.",
    "Landing_Page_DDDIntroduction": "Conçu et développé sur la base des modèles et principes DDD. Fournit un modèle en couches pour votre application.",
    "Landing_Page_CrossCuttingConcernsInfo": "Infrastructure complète pour l&#39;autorisation, la validation, la gestion des exceptions, la mise en cache, la journalisation d&#39;audit, la gestion des transactions et bien plus encore.",
    "Landing_Page_PreBuiltApplicationModules": "Modules d&#39;application pré-construits qui incluent les exigences les plus courantes en matière d&#39;applications Web.",
    "Landing_Page_ChatModule": "Chat",
    "Landing_Page_DocsModule": "Documents",
    "Landing_Page_FileManagementModule": "Gestion de fichiers",
    "Landing_Page_CustomerStory_1": "ABP Commercial a permis à SC Ventures de fournir une plate-forme SaaS de base de données silo multi-locataires de qualité bancaire en 9 mois pour prendre en charge le financement de la chaîne d&#39;approvisionnement des comptes clients et des comptes créditeurs de factures de valeur importante provenant de plusieurs points d&#39;ancrage intégrés. La modularité d&#39;ABP a permis à l&#39;équipe de livrer en un temps record, de réussir tous les VAPT et de déployer la pile de microservices conteneurisés via CI/CD complet et des pipelines en production.",
    "Landing_Page_CustomerStory_2": "Nous voyons l’intérêt d’utiliser ABP Commercial pour réduire les frais généraux des projets de développement personnalisés. L&#39;équipe peut unifier le modèle de code dans différents flux de projet. Nous voyons plus de potentiel dans le cadre pour créer de nouvelles fonctionnalités plus rapidement qu’auparavant. Nous sommes convaincus que nous verrons constamment l’intérêt de tirer parti d’ABP Commercial.",
    "Landing_Page_CustomerStory_3": "Nous adorons l&#39;ABP. Nous n’avons pas besoin de tout écrire à partir de zéro. Nous partons de fonctionnalités prêtes à l&#39;emploi et nous nous concentrons uniquement sur ce que nous avons réellement besoin d&#39;écrire. De plus, ABP est bien architecturé et le code est de haute qualité avec moins de bugs. Si nous devions écrire nous-mêmes tout ce dont nous avions besoin, cela nous prendrait peut-être des années. Une autre chose que nous aimons est que la nouvelle version, la résolution de problèmes ou l&#39;amélioration sort très bientôt \n toutes les deux semaines. Nous n&#39;attendons pas trop longtemps.",
    "Landing_Page_CustomerStory_4": "ABP Commercial est un produit fantastique que je recommande. Produits commerciaux à commercialiser pour nos clients sur une seule plateforme configurable. Le point de départ est que le cadre et les outils fournis à toute équipe valent chaque centime. ABP Commercial était la solution la mieux adaptée à nos besoins.",
    "Landing_Page_AdditionalServices": "Licence personnalisée ou en volume, intégration, formation et assistance en direct, développement de projets personnalisés, portage de projets existants et bien plus encore...",
    "Landing_Page_IncludedDeveloperLicenses": "Inclus <strong>{0}</strong> licences de développeur",
    "Landing_Page_SeeOnDemo": "Voir sur Démo",
    "Landing_Page_LeptonThemes": "Thèmes Lepton",
    "Landing_Page_AccountModuleDescription_1": "Ce module implémente le système d&#39;authentification d&#39;une application ;",
    "Landing_Page_AccountModuleDescription_2": "Fournit une page <strong>de connexion</strong> avec le nom d&#39;utilisateur et le mot de passe",
    "Landing_Page_AccountModuleDescription_3": "Fournit une page <strong>d&#39;inscription</strong> pour créer un nouveau compte.",
    "Landing_Page_AccountModuleDescription_4": "Fournit une page <strong>de mot de passe oublié</strong> pour envoyer un lien <strong>de réinitialisation de mot de passe</strong> par e-mail.",
    "Landing_Page_AccountModuleDescription_5": "Fournit une fonctionnalité <strong>de confirmation par e-mail</strong> avec l’interface utilisateur.",
    "Landing_Page_AccountModuleDescription_6": "Implémente une authentification <strong>à deux facteurs</strong> (SMS et e-mail).",
    "Landing_Page_AccountModuleDescription_7": "Implémente <strong>le verrouillage de l&#39;utilisateur</strong> (verrouille le compte pendant la durée définie lorsqu&#39;un certain nombre d&#39;échecs de connexion se produisent en raison d&#39;informations d&#39;identification non valides dans un certain intervalle de temps).",
    "Landing_Page_AccountModuleDescription_8": "Implémente l’interface utilisateur et les fonctionnalités du serveur d’authentification <strong>Identity Server</strong> .",
    "Landing_Page_AccountModuleDescription_9": "Permet de <strong>basculer entre les locataires</strong> dans un environnement multi-tenant.",
    "Landing_Page_AccountModuleDescription_10": "Permet de changer la <strong>langue de l&#39;interface utilisateur</strong> de l&#39;application.",
    "Landing_Page_AuditLoggingModuleDescription_1": "Ce module fournit l&#39;interface utilisateur de reporting des journaux d&#39;audit pour l&#39;infrastructure d&#39;audit. Permet de rechercher, filtrer et afficher les entrées du journal d&#39;audit et les journaux de modifications d&#39;entité.",
    "Landing_Page_AuditLoggingModuleDescription_2": "Une entrée du journal d&#39;audit comprend des données critiques sur chaque demande client :",
    "Landing_Page_AuditLoggingModuleDescription_3": "URL, navigateur, adresse IP, nom du client",
    "Landing_Page_AuditLoggingModuleDescription_4": "L&#39;utilisateur",
    "Landing_Page_AuditLoggingModuleDescription_5": "Méthode HTTP, code d&#39;état de retour HTTP",
    "Landing_Page_AuditLoggingModuleDescription_6": "Succès/échec, détails de l&#39;exception si disponibles",
    "Landing_Page_AuditLoggingModuleDescription_7": "Durée d&#39;exécution de la demande",
    "Landing_Page_AuditLoggingModuleDescription_8": "Les entités ont été créées, supprimées ou mises à jour dans cette requête (avec propriétés modifiées).",
    "Landing_Page_BloggingModuleDescription_1": "Ce module ajoute un simple blog à votre application ABP ;",
    "Landing_Page_BloggingModuleDescription_2": "Permet de créer plusieurs blogs dans une seule application.",
    "Landing_Page_BloggingModuleDescription_3": "Prend en charge le format Markdown.",
    "Landing_Page_BloggingModuleDescription_4": "Permet d&#39;écrire un commentaire pour un article.",
    "Landing_Page_BloggingModuleDescription_5": "Permet d&#39;attribuer des balises aux articles du blog.",
    "Landing_Page_BloggingModuleDescription_6": "Consultez le site Web <a href=\"blog.abp.io\">blog.abp.io</a> comme exemple en direct du module de blogging.",
    "Landing_Page_ChatModuleDescription_1": "Ce module est utilisé pour la messagerie en temps réel entre les utilisateurs de l&#39;application.",
    "Landing_Page_ChatModuleDescription_2": "Messagerie en temps réel sur la page de chat.",
    "Landing_Page_ChatModuleDescription_3": "Recherchez des utilisateurs dans l&#39;application pour de nouvelles conversations.",
    "Landing_Page_ChatModuleDescription_4": "Liste de contacts pour les conversations récentes.",
    "Landing_Page_ChatModuleDescription_5": "Nouvelles notifications de message lorsque l&#39;utilisateur consulte une autre page.",
    "Landing_Page_ChatModuleDescription_6": "Badge du nombre total de messages non lus sur l’icône du menu.",
    "Landing_Page_ChatModuleDescription_7": "Nombre de messages non lus pour chaque conversation.",
    "Landing_Page_ChatModuleDescription_8": "Conversations chargées paresseuses.",
    "Landing_Page_DocsModuleDescription_1": "Ce module permet de créer des sites internet de documentation technique ;",
    "Landing_Page_DocsModuleDescription_2": "<strong>Intégration GitHub</strong> intégrée : écrivez et gérez directement des documents sur GitHub.",
    "Landing_Page_DocsModuleDescription_3": "Prise en charge <strong>du versioning</strong> directement intégrée aux versions de GitHub.",
    "Landing_Page_DocsModuleDescription_4": "Prend en charge <strong>plusieurs langues</strong> (avec prise en charge de la langue par défaut).",
    "Landing_Page_DocsModuleDescription_5": "Prend en charge les formats <strong>Markdown</strong> et HTML.",
    "Landing_Page_DocsModuleDescription_6": "Fournit une section <strong>de navigation</strong> et une section <strong>de présentation</strong> .",
    "Landing_Page_DocsModuleDescription_7": "Permet d&#39;héberger la documentation <strong>de plusieurs projets</strong> dans une seule application.",
    "Landing_Page_DocsModuleDescription_8": "Liens vers le fichier sur GitHub, afin que tout le monde puisse facilement contribuer en cliquant sur le <strong>lien Modifier</strong> .",
    "Landing_Page_DocsModuleDescription_9": "En plus de la source GitHub, permet d&#39;utiliser simplement un dossier comme source de documentation.",
    "Landing_Page_FileManagementModuleDescription_1": "Téléchargez, téléchargez et organisez des fichiers dans une structure de dossiers hiérarchique.",
    "Landing_Page_FileManagementModuleDescription_2": "Ce module est utilisé pour télécharger, télécharger et organiser des fichiers dans une structure de dossiers hiérarchique. Il est également compatible avec la multi-location et vous pouvez déterminer la taille limite totale de vos locataires.",
    "Landing_Page_FileManagementModuleDescription_3": "Ce module est basé sur le système <a href=\"https://docs.abp.io/en/abp/latest/Blob-Storing\">BLOB Storing</a> , il peut donc utiliser différents fournisseurs de stockage pour stocker le contenu des fichiers.",
    "Landing_Page_IdentityModuleDescription_1": "Ce module implémente le système Utilisateur et Rôle d&#39;une application ;",
    "Landing_Page_IdentityModuleDescription_2": "Construit sur la bibliothèque <a href=\"https://docs.microsoft.com/en-us/aspnet/core/security/authentication/identity\">ASP.NET Core Identity de Microsoft</a> .",
    "Landing_Page_IdentityModuleDescription_3": "Gérez <strong>les rôles</strong> et <strong>les utilisateurs</strong> dans le système. Un utilisateur est autorisé à avoir <strong>plusieurs rôles</strong> .",
    "Landing_Page_IdentityModuleDescription_4": "Définissez <strong>les autorisations</strong> aux niveaux de rôle et d’utilisateur.",
    "Landing_Page_IdentityModuleDescription_5": "Activer/désactiver <strong>l&#39;authentification à deux facteurs</strong> et <strong>le verrouillage</strong> utilisateur par utilisateur.",
    "Landing_Page_IdentityModuleDescription_6": "Gérer <strong>le profil utilisateur</strong> de base et <strong>le mot de passe</strong> .",
    "Landing_Page_IdentityModuleDescription_7": "Gérez <strong>les types de réclamations</strong> dans le système, définissez les réclamations sur les rôles et les utilisateurs.",
    "Landing_Page_IdentityModuleDescription_8": "Page de configuration pour gérer <strong>la complexité des mots de passe</strong> , la connexion des utilisateurs, le compte et le verrouillage.",
    "Landing_Page_IdentityModuleDescription_9": "Prend en charge l&#39;authentification <strong>LDAP</strong> .",
    "Landing_Page_IdentityModuleDescription_10": "Fournit une vérification <strong>de l’e-mail et du numéro de téléphone</strong> .",
    "Landing_Page_IdentityModuleDescription_11": "Prend en charge les intégrations de connexion sociale (Twitter, Facebook, GitHub etc...).",
    "Landing_Page_IdentityModuleDescription_12": "Gérer <strong>les unités d&#39;organisation</strong> dans le système.",
    "Landing_Page_PaymentModuleDescription_1": "Fournit l’intégration de différentes passerelles de paiement.",
    "Landing_Page_PaymentModuleDescription_2": "Ce module fournit une intégration pour les passerelles de paiement, afin que vous puissiez facilement obtenir le paiement de vos clients.",
    "Landing_Page_PaymentModuleDescription_3": "Ce module prend en charge les passerelles de paiement suivantes",
    "Welcome_Page_UseSameCredentialForCommercialWebsites": "Utilisez les mêmes informations d&#39;identification pour <a href=\"https://commercial.abp.io\" class=\"text-primary\">commercial.abp.io</a> et <a href=\"https://support.abp.io\" class=\"text-primary\">support.abp.io</a> .",
    "WatchCrudPagesVideo": "Regardez la vidéo « Création de pages CRUD avec ABP Suite » !",
    "WatchGeneratingFromDatabaseVideo": "Regardez la vidéo « Suite ABP : Générer des pages CRUD à partir de tables de base de données existantes » !",
    "WatchTakeCloserLookVideo": "Regardez la vidéo « Regardons de plus près la génération de code : ABP Suite » !",
    "ConfirmedEmailAddressRequiredToStartTrial": "Vous devez disposer d&#39;une adresse e-mail confirmée pour démarrer une licence d&#39;essai.",
    "EmailVerificationMailNotSent": "Impossible d&#39;envoyer le courrier de vérification de l&#39;e-mail.",
    "GetConfirmationEmail": "<a href=\"javascript:void(0);\" id=\"{0}\" class=\"text-decoration-underline\">Cliquez ici pour recevoir un e-mail de vérification</a> si vous ne l&#39;avez pas déjà reçu.",
    "WhichLicenseTypeYouAreInterestedIn": "Quel type de licence vous intéresse ?",
    "DontTakeOurWordForIt": "Ne nous croyez pas sur parole...",
    "ReadAbpCommercialUsersWantYouToKnow": "Lisez ce que les utilisateurs d’ABP Commercial veulent que vous sachiez",
    "Testimonial_ShortDescription_1": "La modularité d&#39;ABP a permis à l&#39;équipe de livrer dans les délais.",
    "Testimonial_ShortDescription_2": "Créez de nouvelles fonctionnalités plus rapidement qu’auparavant.",
    "Testimonial_ShortDescription_3": "Nous partons de fonctionnalités prêtes à l&#39;emploi et nous nous concentrons uniquement sur ce que nous avons réellement besoin d&#39;écrire.",
    "Testimonial_ShortDescription_4": "ABP Commercial était la solution la mieux adaptée à nos besoins.",
    "OnlineReviewersOnAbpCommercial": "Avis en ligne sur ABP Commercial",
    "SeeWhatToldAboutAbpCommercial": "Voyez ce qui a été dit sur ABP Commercial et écrivez vos réflexions si vous le souhaitez.",
    "BlazoriseLicense": "Faut-il acheter une licence Blazorise ?",
    "BlazoriseLicenseExplanation": "Nous avons conclu un accord entre Volosoft et Megabit, dans le cadre duquel la licence Blazorise est intégrée aux produits ABP Commercial, de sorte que nos clients n'ont pas besoin d'acheter une licence Blazorise supplémentaire.",
    "ExtendPaymentInfoSection_DeveloperPrice": "{0}x développeurs supplémentaires",
    "ExtendPaymentInfoSection_DiscountRate": "Remise {0} %",
    "TotalNetPrice": "Prix net total",
    "EFCore": "Noyau du cadre d&#39;entité",
    "All": "Tous",
    "Mvc": "MVC",
    "DataBaseProvider": "Fournisseur de données",
    "UIFramework": "Cadre d&#39;interface utilisateur",
    "LeptonXThemeForDashboard": "Thème LeptonX pour votre tableau de bord d&#39;administration par",
    "AbpPlatform": "Plateforme PBA",
    "YouDeserveGoodUXUI": "Vous méritez une bonne UI et une meilleure UX. Le thème LeptonX d&#39;ABP est là pour le servir.",
    "ViewLiveDemo": "Voir la démo du thème en direct",
    "GetLeptonX": "Obtenez LeptonX maintenant",
    "SeeLeptonXDocumentation": "Voir la documentation LeptonX",
    "SeeLeptonDocumentation": "Voir la documentation Lepton",
    "SimplifiedMenu": "Menu simplifié",
    "SimplifiedMenuDescription": "Vous pouvez facilement trouver la page que vous recherchez en filtrant le menu",
    "YourFavoritePages": "Vos pages préférées à votre portée",
    "YourFavoritePagesDescription": "Ajoutez ou supprimez facilement la page des favoris en cliquant sur l&#39;icône étoile dans le coin supérieur droit de la page.",
    "BreadCrumbs": "Fil d&#39;Ariane pour une commutation transparente",
    "BreadCrumbsDescription": "Grâce à Breadcrumb, vous pouvez basculer vers les pages du même niveau en un seul clic, même lorsque le menu de gauche est fermé, et cela fonctionne sur tablette et mobile responsive !",
    "YourMenu": "Votre menu comme vous le souhaitez",
    "YourMenuDescription": "Personnalisez les icônes et les listes déroulantes directement cliquables du menu utilisateur à votre guise. Le menu utilisateur est entièrement personnalisable selon vos besoins",
    "RtlSupport": "Prise en charge RTL pour votre langue",
    "RtlSupportDescription": "LeptonX Theme prend en charge RTL pour votre langue. Les options de langue se trouvent dans le menu des paramètres pour vous permettre de changer la langue.",
    "YourColors": "Vos couleurs sur l&#39;interface utilisateur de votre tableau de bord d&#39;administration",
    "YourColorsDescription": "Le thème LeptonX fonctionne selon les préférences de votre système et propose des options de thème clair du tableau de bord, de thème sombre du tableau de bord et de thème semi-sombre du tableau de bord.",
    "ArrangeContentWidth": "Organisez facilement la largeur de votre contenu",
    "ArrangeContentWidthDescription": "Modifiez facilement la largeur de votre zone de contenu.",
    "LeptonXCompatibleWith": "Le thème LeptonX est compatible avec",
    "MobileResponsiveTemplate": "Modèle adapté aux mobiles",
    "MobileResponsiveTemplateDescription1": "Accédez à votre tableau de bord d&#39;administration LeptonX depuis n&#39;importe quel appareil de votre choix.",
    "MobileResponsiveTemplateDescription2": "Il est conçu pour que vous puissiez l’utiliser facilement sur chacun de vos appareils. Il est réactif sur les appareils mobiles et les tailles de tablettes.",
    "TopMenuLayoutOption": "Option de disposition du menu supérieur",
    "TopMenuLayoutOptionDescription1": "Si vous souhaitez configurer votre site Web avec le même tableau de bord d&#39;administration, il est possible de le faire avec LeptonX Theme !",
    "TopMenuLayoutOptionDescription2": "Essayez simplement la disposition du menu supérieur de LeptonX pour y parvenir !",
    "EasilyCustomizable": "Facilement personnalisable aux couleurs de votre marque",
    "EasilyCustomizableDescription1": "Vous pouvez personnaliser le thème LeptonX en utilisant seulement quelques variables SCSS. Pas de remplacement, pas de charge CSS supplémentaire !",
    "EasilyCustomizableDescription2": "Avec LeptonX, vous pouvez organiser votre tableau de bord d&#39;administration comme bon vous semble.",
    "IndependentLayout": "Zone de mise en page et de contenu indépendante",
    "IndependentLayoutDescription1": "L&#39;infrastructure de mise en page de LeptonX a été conçue complètement séparément du contenu.",
    "IndependentLayoutDescription2": "Cela signifie que vous pouvez librement concevoir votre projet avec une structure de contenu autre que Bootstrap si vous le souhaitez.",
    "MostUsedLibraries": "Bibliothèques les plus utilisées intégrées à LeptonX",
    "MostUsedLibrariesDescription1": "LeptonX contient vos bibliothèques les plus utilisées. Il vous permet d&#39;utiliser sans effort des bibliothèques telles que ApexCharts, DataTables, DropZone, FullCalender, JSTree, Select2 et Toastr.",
    "MostUsedLibrariesDescription2": "LeptonX prend également en charge les bibliothèques spécifiques à MVC Angular et Blazor.",
    "CreateAndCustomize": "Créez et personnalisez les pages dont vous avez besoin en quelques secondes avec les pages personnalisées LeptonX",
    "CreateAndCustomizeDescription": "En utilisant LeptonX Theme, vous avez également accès à de nombreuses pages HTML prédéfinies. Celles-ci incluent de nombreuses pages telles que la page de connexion, le blog, la FAQ, la liste d&#39;abonnement, la facture, les prix et la gestion des fichiers.",
    "LeptonThemeForAdmin": "Thème Lepton pour votre tableau de bord d&#39;administration par",
    "LeptonThemeForAdminDescription": "Le thème Lepton est toujours disponible et sera maintenu. Si vous souhaitez passer au thème LeptonX en tant qu&#39;utilisateur du thème Lepton, vous pouvez consulter la documentation pour savoir comment procéder.",
    "LeptonCompatibleWith": "Le thème Lepton est compatible avec",
    "BlackFridayDiscount": "Remise Black Friday",
    "UpgradePaymentInfoSection_DeveloperPrice": "{0} pour {1} développeurs supplémentaires",
    "Upgrade": "Mise à niveau",
    "Renewal": "Renouvellement",
    "UpgradePaymentInfoSection_LicensePrice": "{0} licence",
    "UpgradePaymentInfoSection_LicenseRenewalPrice": "Renouvellement de licence",
    "Total": "Total",
    "SupportPolicyFaqTitle": "Quelle est votre politique de soutien ?",
    "SupportPolicyFaqExplanation": "Nous ne prenons en charge que la version active et la version majeure précédente. Nous ne garantissons pas la publication d'un correctif pour la troisième version majeure et la version majeure antérieure. Par exemple, si la version active est 7.0.0, nous publierons des correctifs pour les versions 6.x.x et 7.x.x. En outre, nous n'assurons le support que pour les problèmes liés à ABP Framework et ABP Commercial. Cela signifie qu'aucun support n'est fourni pour les applications tierces, les services cloud et les autres bibliothèques périphériques utilisées par les produits ABP. Nous ferons des efforts commercialement raisonnables pour fournir à nos clients une assistance technique pendant les heures de bureau officielles de \"Volosoft Bilisim A.S\". D'autre part, nous ne nous engageons pas à respecter un accord de niveau de service (SLA) sur le temps de réponse, mais nous essaierons de répondre aux problèmes techniques aussi rapidement que possible pendant nos heures de travail officielles. Sauf accord spécial avec le client, nous ne fournissons une assistance qu'à l'adresse https://support.abp.io. Nous disposons également d'une assistance privée par courrier électronique, qui n'est accessible qu'aux détenteurs d'une licence d'entreprise.",
    "TotalDevelopers": "Total : {0} développeur(s)",
    "CustomPurchaseExplanation": "Adapté à vos besoins spécifiques",
    "WhereDidYouHearAboutUs": "Où avez vous entendu parler de nous?",
    "Twitter": "Twitter",
    "Facebook": "Facebook",
    "Youtube": "Youtube",
    "Google": "Google",
    "Github": "GitHub",
    "Friend": "D&#39;un ami",
    "Other": "Autre",
    "WhereDidYouHearAboutUs_explain": "Précisez...",
    "DeletingMemberWarningMessage": "&quot;{0}&quot; sera supprimé de la liste des développeurs. Si vous le souhaitez, vous pourrez attribuer ce siège vide à un autre développeur ultérieurement.",
    "AdditionalInfo": "Si le nombre de sièges de développeur est supérieur à vos besoins, vous pouvez les réduire. Vous pouvez envoyer un e-mail à <a href=\"mailto:info@abp.io\">info@abp.io</a> pour supprimer certains de vos postes de développeur. La suppression des postes de développeur inutilisés réduira le coût de renouvellement de la licence. Si vous le souhaitez, vous pouvez racheter des postes de développeur supplémentaires pendant votre période de licence active. Notez que, étant donné qu&#39;il y a {0} développeurs dans ce package de licence, vous ne pouvez pas réduire ce nombre.",
    "LinkExpiredErrorMessage": "Le lien auquel vous essayez d&#39;accéder est expiré.",
    "ExpirationDate": "Date d&#39;expiration",
    "SpringCampaignDiscount": "Remise sur la campagne de printemps",
    "WhyUseAbpIoPlatform": "Pourquoi devrais-je utiliser la plateforme ABP.IO au lieu de créer une nouvelle solution à partir de zéro ?",
    "WhyUseAbpIoPlatformFaqExplanation": "Consultez <a href=\"/why-abp-io \">cette page</a> pour une explication détaillée des raisons pour lesquelles l&#39;utilisation de la plateforme ABP.IO présente un avantage significatif par rapport à tout faire vous-même.",
    "EulaPageTitle": "Contrat de licence utilisateur final (CLUF)",
    "PrivacyPolicyPageTitle": "Politique de confidentialité - Politique de cookies",
    "TermsConditionsPageTitle": "Termes et conditions",
    "TrainingsPageTitle": "Forfaits de formation ABP",
    "ModulesPageTitle": "Modules d&#39;application pré-construits ABP",
    "Volo.AbpIo.Commercial:040001": "La clé d&#39;accès à l&#39;API est incorrecte.",
    "GetLepton": "Obtenez Lepton maintenant",
    "MyOrganizations_Detail_LicenseStartDate": "Date de début de licence",
    "MyOrganizations_Detail_LicenseExpiryDate": "Date d&#39;expiration",
    "BlazoriseSupport": "Comment puis-je obtenir la clé de licence Blazorise et l&#39;assistance de l&#39;équipe Blazorise ?",
    "BlazoriseSupportExplanation": "Suivez les étapes ci-dessous pour obtenir l&#39;assistance de l&#39;équipe Blazorise et obtenir votre clé de licence Blazorise :",
    "BlazoriseSupportExplanation1": "Créez un nouveau compte sur <a href=\"https://blazorise.com/support/register\">blazorise.com/support/register</a> avec la même adresse e-mail que votre compte abp.io. Laissez l&#39;entrée &quot;Clé de licence&quot; vide. <strong>Il doit s&#39;agir de la même adresse email que votre compte email sur abp.io</strong> .",
    "BlazoriseSupportExplanation2": "Vérifiez votre adresse e-mail en cochant votre boîte e-mail. Vérifiez votre boîte spam si vous ne voyez pas d&#39;e-mail dans votre boîte de réception !",
    "BlazoriseSupportExplanation3": "Connectez-vous au site Web d&#39;assistance Blazorise à l&#39; <a href=\"https://blazorise.com/support/login\">adresse blazorise.com/support/login</a> .",
    "BlazoriseSupportExplanation4": "Si vous disposez d&#39;une licence ABP Commercial active, vous disposerez également d&#39;une licence Blazorise PRO. Vous pouvez obtenir votre clé de licence Blazorise sur <a href=\"https://blazorise.com/support/user/manage/license\">blazorise.com/support/user/manage/license</a> .",
    "BlazoriseSupportExplanation5": "Vous pouvez publier vos questions sur le site Web d&#39;assistance et générer un jeton de produit pour votre application.",
    "AbpLiveTrainingPackages": "Forfaits de formation ABP en direct",
    "Releases": "Sorties",
    "ReleasesDescription": "Journaux de publication d’ABP Commercial.",
    "ReleaseDate": "Date de sortie",
    "Labels": "Étiquettes",
    "PreRelease": "Pré-version",
    "AllTypes": "Tous les types",
    "Enhancement": "Renforcement",
    "Bug": "Bogue",
    "Feature": "Fonctionnalité",
    "AllUIs": "Toutes les interfaces utilisateur",
    "MVC": "MVC",
    "BlazorServer": "Serveur Blazor",
    "MAUI": "MAUI",
    "HowItWorks_Page_Title": "Comment ça fonctionne?",
    "HowItWorks_Page_Description": "ABP Framework étend la plateforme .NET. Ainsi, tout ce que vous pouvez faire avec une simple solution .NET est déjà possible avec l’ABP Framework. Cela facilite le démarrage avec une faible courbe d’apprentissage.",
    "HowItWorks_Description1": "ABP Framework étend la plateforme .NET. Ainsi, tout ce que vous pouvez faire avec une simple solution .NET est déjà possible avec l’ABP Framework. Cela facilite le démarrage avec une faible courbe d’apprentissage.",
    "HowItWorks_Description2": "Une fois que vous aurez commencé à apprendre et à utiliser les fonctionnalités d’ABP Framework, développer votre logiciel sera bien plus agréable que jamais.",
    "HowItWorks_Description3": "Cette page explique essentiellement comment utiliser la plateforme ABP.IO en tant que développeur .NET.",
    "CreateANewSolution": "Créer une nouvelle solution .NET",
    "CreateANewSolution_Description1": "Tout commence par la création d’une nouvelle solution .NET intégrée à ABP.",
    "StartWithStartupTemplates": "Démarrez l&#39;un des <a href=\"/startup-templates\">modèles de solution de démarrage</a> prédéfinis",
    "SimpleMonolithApplicationTemplate": "Modèle d&#39;application monolithique simple",
    "LayeredApplicationTemplate": "Modèle d&#39;application en couches",
    "MicroserviceSolutionTemplate": "Modèle de solution de microservices",
    "CreateEmptySolutionAndUseAbp": "Ou créez une nouvelle solution .NET vide et installez vous-même <a href=\"https://abp.io/packages\" target=\"_blank\">les packages</a> ABP NuGet et NPM.",
    "CreatingSolutionWithMultipleOptions": "Il existe plusieurs options d&#39;interface utilisateur et de base de données lors de la création d&#39;une nouvelle solution.",
    "UIFrameworkOptions": "Options du cadre d&#39;interface utilisateur",
    "DotnetSolutionWithoutDependency": "Vous disposez désormais d’une solution .NET standard sur votre ordinateur local qui ne dépend d’aucune plate-forme cloud ou d’un service externe.",
    "CheckTheDocumentForDetails": "Vous pouvez consulter le document <a href=\"{0}\" target=\"_blank\">{1}</a> pour plus de détails.",
    "UIAndDatabaseIndependent": "ABP peut fonctionner avec n&#39;importe quelle interface utilisateur et n&#39;importe quel fournisseur de base de données pris en charge par .NET. \n Cependant, ces fournisseurs d&#39;interface utilisateur et de base de données sont pré-intégrés et bien documentés.",
    "InstallAbpModules": "Installer les modules ABP",
    "DevelopYourSolution": "Développez votre solution",
    "DeployAnywhere": "Déployer n&#39;importe où",
    "InstallAbpModule_Description1": "ABP est un framework de développement d&#39;applications modulaire. Les modèles de solutions de démarrage sont déjà livrés avec les modules essentiels installés. \n Mais il existe d&#39;autres modules d&#39;application que vous souhaiterez peut-être utiliser dans votre solution.",
    "InstallAbpModule_Description2": "Chaque module se compose de quelques packages NuGet et NPM et dispose d&#39;un document d&#39;installation. <a href=\"/tools/suite\">ABP Suite</a> effectue la plupart du travail automatiquement, puis vous configurez ou ajustez manuellement le module en fonction de sa documentation.",
    "DevelopYourSolution_Description1": "L&#39;infrastructure d&#39;ABP vous permet de vous <b class=\"text-white\">concentrer sur votre propre code métier</b> en automatisant le travail répétitif et en fournissant une infrastructure et <a href=\"https://abp.io/features\" target=\"_blank\">des fonctionnalités</a> d&#39;application prédéfinies.",
    "DevelopYourSolution_Description2": "Dans le bloc de code suivant, vous pouvez voir comment le framework ABP s&#39;intègre de manière transparente dans votre code et automatise les tâches répétitives pour vous.",
    "DevelopYourSolution_Description3": "Même dans ce bloc de shortcode, ABP fait beaucoup de choses pour vous.",
    "DevelopYourSolution_Description4": "Il fournit des classes de base pour appliquer des conventions, comme <a href=\"https://docs.abp.io/en/abp/latest/Dependency-Injection\" target=\"_blank\">l&#39;injection de dépendances</a> \n . Les services <a href=\"https://docs.abp.io/en/abp/latest/Repositories\" target=\"_blank\">de référentiel</a> génériques \n fournissent un moyen \n pratique d&#39;interagir avec la base de données. <a href=\"https://docs.abp.io/en/abp/latest/Authorization\" target=\"_blank\">L&#39;autorisation</a> déclarative \n fonctionne avec un système d&#39;autorisation affiné.",
    "DevelopYourSolution_Description5": "ABP automatise complètement <a href=\"https://docs.abp.io/en/abp/latest/Unit-Of-Work\" target=\"_blank\">l&#39;unité de travail</a> \n (pour la connexion à la base de données et la gestion des transactions), <a href=\"https://docs.abp.io/en/abp/latest/Exception-Handling\" target=\"_blank\">la gestion des exceptions</a> \n , <a href=\"https://docs.abp.io/en/abp/latest/Validation\" target=\"_blank\">la validation</a> \n \n et <a href=\"https://docs.abp.io/en/abp/latest/Audit-Logging\" target=\"_blank\">la journalisation d&#39;audit</a> . Il fournit de nombreux autres éléments de base pour simplifier vos tâches de développement quotidiennes et vous concentrer sur votre propre code tout en créant des applications \n prêtes pour la production.",
    "DevelopYourSolution_Description6": "Vous pouvez imaginer à quel point ce bloc de code peut être long et compliqué si vous le faisiez manuellement.",
    "SuiteCrudGenerationInFewSeconds": "En plus de coder manuellement votre solution, vous pouvez créer des pages CRUD avancées entièrement fonctionnelles en quelques minutes à l&#39;aide des outils ABP Suite. Il génère le code dans votre solution, afin que vous puissiez l&#39;affiner en fonction de vos besoins personnalisés.",
    "DeployAnywhere_Description1": "En fin de compte, vous disposez d’une solution purement .NET. Vous pouvez déployer votre solution sur votre propre serveur, sur une plateforme cloud, sur Kubernetes ou partout où vous le souhaitez. Vous pouvez déployer sur autant de serveurs que vous le souhaitez. ABP est un outil indépendant de l’environnement de déploiement.",
    "ExpertiseAbpFramework": "Expertise du cadre ABP",
    "ExpertiseAbpFramework_Description1": "Vous souhaitez aller au-delà des bases et acquérir une expertise avec la plateforme ABP.IO ?",
    "FreeDownload": "Téléchargement Gratuit",
    "Read": "Lire",
    "HavingTrouble": "Avoir des problèmes?",
    "HavingTrouble_Description1": "Vous rencontrez des difficultés pour développer votre solution ? Nous sommes ici! Utilisez la plateforme de support ABP \n ou envoyez un e-mail pour obtenir de l&#39;aide directement auprès des membres de l&#39;équipe Core ABP Framework.",
    "WeAreHereToHelp_Description1": "Vous pouvez parcourir nos rubriques d&#39;aide ou effectuer une recherche dans la foire aux questions, \n ou vous pouvez nous poser une question en utilisant le formulaire de contact.",
    "OtherModules": "Autres modules",
    "OtherModules_Description1": "Compte, journalisation d&#39;audit, chat, kit CMS, gestion de fichiers, formulaires, RGPD, identité, gestion des langues, paiement, Saas et plus encore...",
    "HowItWorks_DatabaseProviderOptions": "Options du fournisseur de base de données",
    "SeeFAQ": "Voir FAQ",
    "ReleaseLogs": "Journaux de version",
    "ReleaseLogs_Tag": "{0} Journaux de version",
    "ReleaseLogs_Pr": "Demande d&#39;extraction n° {0} - {1}",
    "NoLabels": "Pas d&#39;étiquettes",
    "DoesTheSubscriptionRenewAutomatically": "L&#39;abonnement se renouvelle-t-il automatiquement ?",
    "DoesTheSubscriptionRenewAutomaticallyExplanation": "L&#39;ABP Commercial ne dispose pas d&#39;un modèle de facturation à renouvellement automatique. <strong>Votre abonnement ne sera donc pas automatiquement renouvelé</strong> à la fin de votre période de licence. Si vous souhaitez continuer à bénéficier des avantages d&#39;ABP Commercial, vous devez le renouveler manuellement sur la <a href=\"/my-organizations\">page de gestion de l&#39;organisation</a> . Si vous avez plusieurs organisations, cliquez sur le bouton « Gérer » de votre organisation expirante, puis cliquez sur le bouton « Prolonger maintenant » pour renouveler votre licence. Vous pouvez également consulter la <a href=\"/faq#what-happens-when-license-ends\">section Que se passe-t-il à la fin de ma licence ?</a> section.",
    "ExtraQuestionCreditsFaqTitle": "Puis-je acheter des crédits supplémentaires pour des questions d&#39;assistance ?",
    "ExtraQuestionCreditsFaqExplanation": "Oui, vous pouvez. Pour acheter des crédits de questions supplémentaires, envoyez un e-mail à <a href=\"mailto:info@abp.io\">info@abp.io</a> avec le nom de votre organisation. Voici la liste de prix pour les crédits de questions supplémentaires :<ul><li> Pack de 50 questions 999$</li><li> Pack de 25 questions 625$</li><li> Pack de 15 questions 450 $</li></ul>",
    "AlreadyBetaTester": "Vous avez déjà rejoint le programme bêta-testeur.",
    "AbpStudio": "Studio ABP",
    "AbpStudio_Description": "ABP Studio est toujours en développement. Vous pouvez remplir le formulaire ci-dessous pour être l&#39;un des premiers utilisateurs.",
    "AbpStudio_Description1": "ABP Studio est une <span class=\"text-highlight-white\">application de bureau multiplateforme</span> destinée aux développeurs ABP.",
    "AbpStudio_Description2": "Il est <span class=\"text-highlight-white\">bien intégré</span> au framework ABP et vise à vous fournir un environnement de développement confortable en <span class=\"text-highlight-white\">automatisant les choses, en fournissant des informations</span> sur votre solution, en facilitant grandement <span class=\"text-highlight-white\">le développement, l&#39;exécution</span> et <span class=\"text-highlight-white\">le déploiement</span> de vos solutions.",
    "AbpStudio_ComingSoon": "Bientôt disponible <span class=\"opacity-50 ms-0 ms-md-3 d-block d-md-inline-block \">Date de sortie bêta prévue : 4e trimestre 2023.</span>",
    "AbpStudio_PlannedPreviewDate": "Date de sortie prévue de l’aperçu : 4e trimestre 2023.",
    "BetaRequest": "Demande bêta",
    "CreateNewSolutions": "Créer de nouvelles solutions",
    "CreateNewSolutions_Description1": "Vous pouvez facilement créer des applications simples jusqu&#39;à des solutions modulaires monolithiques ou microservices avec de nombreuses options. Vous obtenez une solution logicielle de base complète et prête pour la production pour votre entreprise.",
    "ArchitectYourSolutions": "Architectez vos solutions",
    "ArchitectYourSolutions_Description1": "Créez plus facilement des structures de solutions monolithiques-modulaires et microservices en créant des modules ou des services et en établissant des relations entre eux. Vous pouvez également installer ou désinstaller des modules d&#39;application prédéfinis.",
    "ExploreYourSolution": "Explorez votre solution",
    "ExploreYourSolution_Description1": "ABP Studio affiche une vue générale des composants de votre solution et des modules dont dépend votre solution. Vous pouvez explorer des entités, des services, des API HTTP et bien plus encore sans avoir besoin d&#39;ouvrir votre base de code.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze": "Exécutez des solutions multi-applications ou microservices en un clin d&#39;œil",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description1": "Exécutez un, <span class=\"text-highlight-white\">plusieurs</span> ou <span class=\"text-highlight-white\">tous les services</span> en un seul clic. De cette façon, il est très simple d&#39;arrêter un service, de l&#39;exécuter dans Visual Studio pour <span class=\"text-highlight-white\">le tester</span> ou <span class=\"text-highlight-white\">le déboguer</span> .",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description2": "Consultez une liste de services, affichez <span class=\"text-highlight-white\">les requêtes HTTP en temps réel</span> et <span class=\"text-highlight-white\">le nombre d&#39;exceptions</span> pour chaque service.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description3": "Voir tous les détails de toutes <span class=\"text-highlight-white\">les requêtes HTTP</span> arrivant sur n&#39;importe quel service.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description4": "Explorez <span class=\"text-highlight-white\">les détails des exceptions</span> en temps réel dans n&#39;importe quel service, filtrez et recherchez facilement.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description5": "Affichez les <span class=\"text-highlight-white\">journaux d&#39;application</span> , filtrez par niveau de journal ou recherchez par texte.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description6": "<span class=\"text-highlight-white\">Parcourez</span> l’interface utilisateur de votre application sans quitter l’exécuteur de solution.",
    "IntegrateToYourKubernetesCluster": "Intégrez à votre cluster Kubernetes",
    "IntegrateToYourKubernetesCluster_Description1": "<span class=\"text-highlight-white\">Connectez votre environnement de développement local à un cluster Kubernetes local ou distant</span> , où ce cluster exécute déjà votre solution de microservice.",
    "IntegrateToYourKubernetesCluster_Description2": "Accédez à n&#39;importe quel service dans Kubernetes avec son nom de service comme DNS, tout comme s&#39;il s&#39;exécute sur votre ordinateur local.",
    "IntegrateToYourKubernetesCluster_Description3": "<span class=\"text-highlight-white\">Interceptez n&#39;importe quel service</span> de ce cluster afin que tout le <span class=\"text-highlight-white\">trafic vers le service intercepté soit automatiquement redirigé vers votre service</span> qui s&#39;exécute sur votre ordinateur local. Lorsque votre service doit utiliser un service dans Kubernetes, le trafic est redirigé vers le cluster, tout comme votre service local s&#39;exécute dans Kubernetes.",
    "GetInformed": "Informez-vous",
    "Studio_GetInformed_Description1": "Laissez vos coordonnées pour <span class=\"text-highlight-white\">être informé</span> et <span class=\"text-highlight-white\">essayez-le dès</span> le lancement d&#39;ABP Studio.",
    "Studio_GetInformed_Description2": "Date de sortie prévue de l’aperçu : T3 2023.",
    "ThankYou!": "Merci!",
    "SendBetaRequest": "Envoyer une demande bêta",
    "YouJoinedTheBetaTesterProgram": "Vous avez rejoint le programme de bêta-testeur d&#39;ABP Studio.",
    "PricingExplanation2": "Garantie de remboursement de 30 jours — <a href=\"/faq#refund-policy\">En savoir plus</a>",
    "MoneyBackGuaranteeText": "* Garantie de remboursement de 30 jours sur toutes les licences ! Remboursement à 100 % sur les licences Team, remboursement à 60 % sur les licences Business et Enterprise sous 30 jours.",
    "MobileApplicationStartupTemplates": "Modèles de démarrage d&#39;applications mobiles",
    "MobileApplicationStartupTemplates_Description1": "Modèles de démarrage d&#39;applications mobiles intégrés pour vos solutions ABP Commercial.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates": "Créez de puissantes applications métier à l&#39;aide des modèles de démarrage mobile ABP",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description1": "ABP Commercial fournit deux modèles de démarrage d&#39;applications mobiles implémentés avec <span class=\"text-highlight\">React Native</span> et <span class=\"text-highlight\">.NET MAUI.</span> Lorsque vous créez votre nouvelle solution basée sur ABP, vous disposerez également d&#39;applications de démarrage de base connectées à vos API backend.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description2": "L&#39;application dispose d&#39;un cycle de jetons d&#39;authentification prédéfini, <span class=\"text-highlight\">d&#39;une prise en charge multilingue, d&#39;une prise en charge multi-tenant, d&#39;une connexion, d&#39;un mot de passe oublié, d&#39;une gestion de profil et d&#39;une page de gestion des utilisateurs</span> . Vous pouvez ajouter votre propre logique métier et la personnaliser en fonction de vos besoins.",
    "TwoFrameworkOptions": "Deux options de cadre",
    "TwoFrameworkOptions_Description": "ABP fournit des modèles de démarrage mobile <span class=\"text-highlight\">React Native</span> et <span class=\"text-highlight\">.NET MAUI</span> . De cette façon, vous pourrez choisir celui qui correspond le mieux à vos besoins. Les deux applications réutilisent le code au taux le plus élevé entre les plateformes iOS et Android.",
    "PreIntegratedToYourBackend": "Pré-intégré à votre backend",
    "PreIntegratedToYourBackend_Description": "Les applications ABP Mobile sont pré-intégrées à vos API backend. Il obtient un jeton d&#39;authentification valide du serveur et effectue des demandes authentifiées.",
    "MultiLanguage": "Multilingue",
    "MultiLanguage_Description": "Il prend déjà en charge plus de 10 langues prêtes à l&#39;emploi. Vous pouvez également ajouter les langues suivantes.",
    "Arabic": "arabe",
    "Czech": "tchèque",
    "English": "Anglais",
    "Hungarian": "hongrois",
    "Finnish": "finlandais",
    "French": "Français",
    "Hindi": "hindi",
    "Portuguese": "Portugais",
    "Italian": "italien",
    "Russian": "russe",
    "Slovak": "slovaque",
    "Turkish": "turc",
    "EngageAndRetainYourCustomersWithABPMobileApps": "Engagez et fidélisez vos clients avec les applications mobiles ABP",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description1": "Vos clients souhaitent gérer leurs produits et abonnements de n&#39;importe où et à tout moment. Cela oblige les organisations à créer des applications mobiles permettant aux clients de répondre à leurs demandes rapidement et de manière transparente.",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description2": "Avec les applications ABP Mobile, vous pouvez créer des applications mobiles natives de haute qualité pour Android et iOS… En utilisant une base de code unique et sans compromettre la sécurité, la qualité ou l&#39;évolutivité.",
    "OneCodeBaseMultipleDevices": "Une base de code pour plusieurs appareils",
    "OneCodeBaseMultipleDevices_Description": "Les applications ABP Mobile sont multiplateformes. Ils sont prêts à être installés et exécutés sur les appareils iOS et Android, et s’adaptent à différents facteurs de forme à l’aide d’une base de code unique. Les développeurs n&#39;ont besoin de créer l&#39;interface utilisateur et le code frontal qu&#39;une seule fois, il n&#39;est pas nécessaire d&#39;adapter le code pour chaque appareil que vous souhaitez prendre en charge.",
    "ComesWithTheSourceCode": "Livré avec le code source",
    "ComesWithTheSourceCode_Description": "Les applications mobiles sont fournies avec le code source. Personnalisez facilement l&#39;UX/UI de vos applications pour respecter les directives de marque.",
    "Purchase_OneYearPrice": "Prix 1 an",
    "Purchase_DeveloperSeatCount": "Nombre de sièges de développeur",
    "Purchase_DevelopersAlreadyIncluded": "{0} développeurs déjà inclus",
    "1Year": "1 an",
    "{0}Years": "{0} ans",
    "1YearLicense": "Licence 1 an",
    "{0}YearsLicense": "{0} ans de licence",
    "1AdditionalDeveloper": "1 développeur supplémentaire",
    "{0}AdditionalDevelopers": "{0} Développeurs supplémentaires",
    "Discount": "Remise ({0} %)",
    "Summary": "Résumé",
    "TrainingPack": "Dossier de formation",
    "TrainingPackDiscount": "Remise sur les packs de formation",
    "Purchase_OnboardingTraining_Description": "Ce forfait de formation en direct est valable pour une classe de 8 étudiants et cette remise n&#39;est valable que lorsqu&#39;elle est achetée avec la nouvelle licence. <a href=\"{0}\" class=\"text-white\">Apprendre encore plus<i class=\"fa fa-external-link ms-1\"></i></a>",
    "Purchase_Save": "{0} % <span class=\"save ms-1\">d&#39;économies {1} {2}</span>",
    "RemoveBasket": "Retirer du panier",
    "WhyABPIOPlatform?": "Pourquoi <span class=\"gradient-commercial\">la plateforme ABP.IO</span> ?",
    "DocumentAim": "Ce document vise à répondre à la grande question :",
    "DocumentAim_Description": "&quot;Pourquoi devriez-vous utiliser la plateforme ABP.IO au lieu de créer une nouvelle solution à partir de zéro ?&quot;",
    "DocumentAim_Description2": "Le document présente les défis liés à la création d&#39;une solution logicielle moderne et explique comment ABP relève ces défis.",
    "CreatingANewSolution": "Créer une nouvelle solution",
    "CreatingANewSolution_Description": "Lorsque vous devez démarrer une nouvelle solution, vous devez vous poser de nombreuses questions et vous devez consacrer beaucoup de temps avant de commencer à écrire votre tout premier code métier.",
    "CreatingAnEmptySolution": "Créer une solution vide",
    "THEPROBLEM": "LE PROBLÈME",
    "CreatingAnEmptySolution_THEPROBLEM_Description": "Même créer une solution presque vide est un défi ;",
    "CreatingAnEmptySolution_THEPROBLEM_Description2": "Comment organisez-vous votre base de code à travers les projets ?",
    "CreatingAnEmptySolution_THEPROBLEM_Description3": "Que sont les couches et comment interagissent-elles ?",
    "CreatingAnEmptySolution_THEPROBLEM_Description4": "Comment intégrer une bibliothèque et des systèmes tiers ?",
    "CreatingAnEmptySolution_THEPROBLEM_Description5": "Comment mettre en place les tests automatisés ?",
    "ABPSOLUTION": "SOLUTION PA",
    "CreatingAnEmptySolution_ABPSOLUTION_Description": "ABP fournit une <a href=\"https://docs.abp.io/en/abp/latest/Startup-Templates/Application\" target=\"_blank\">solution de démarrage</a> bien architecturée, en couches et prête pour la production, basée sur les principes <a href=\"https://docs.abp.io/en/abp/latest/Domain-Driven-Design\" target=\"_blank\">de Domain Driven Design</a> . La solution comprend également une unité préconfigurée et des projets <a href=\"https://docs.abp.io/en/abp/latest/Testing\" target=\"_blank\">de tests</a> d&#39;intégration pour chaque couche.",
    "CommonLibraries": "Bibliothèques communes",
    "CommonLibraries_THEPROBLEM_Description": "Quelles bibliothèques devez-vous utiliser pour implémenter les exigences communes ? L&#39;écosystème de développement logiciel est très dynamique, ce qui rend difficile de se tenir au courant des derniers outils, bibliothèques, tendances et approches.",
    "CommonLibraries_ABPSOLUTION_Description": "ABP pré-intègre des bibliothèques populaires, matures et à jour dans la solution. Vous n&#39;avez pas besoin de passer du temps à les intégrer ou à les faire communiquer entre eux. Ils fonctionnent correctement dès la sortie de la boîte.",
    "UITheme&Layout": "Thème et mise en page de l&#39;interface utilisateur",
    "UITheme&Layout_THEPROBLEM_Description": "Lorsqu’on aborde les problèmes d’assurance-chômage, toute une série de défis surgissent. Il s&#39;agit notamment de jeter les bases d&#39;un kit d&#39;interface utilisateur réactif, contemporain et adaptable avec une apparence cohérente et une multitude de fonctionnalités telles que des menus de navigation, des en-têtes, des barres d&#39;outils, des pieds de page, des widgets, etc.",
    "UITheme&Layout_THEPROBLEM_Description2": "Même si vous optez pour un thème préconçu, son intégration transparente dans votre projet pourrait nécessiter des jours de développement. Un obstacle supplémentaire réside dans la mise à niveau de ces thèmes. Fréquemment, la structure HTML/CSS du thème s&#39;entremêle avec le code de votre interface utilisateur, ce qui rend les futures modifications ou mises à niveau du thème complexes. Cette imbrication du code et de la conception complique la flexibilité des ajustements sur toute la ligne.",
    "UITheme&Layout_ABPSOLUTION_Description": "ABP Framework propose un système de thème distinctif qui libère votre code d&#39;interface utilisateur des contraintes de thème. Les thèmes existent de manière isolée, regroupés sous forme de packages NuGet ou NPM, ce qui rend l&#39;installation ou la mise à niveau du thème en quelques minutes. Tout en conservant la possibilité de développer votre thème personnalisé ou d&#39;en intégrer un existant, ABP Commercial présente une collection de thèmes raffinés et contemporains.",
    "UITheme&Layout_ABPSOLUTION_Description2": "De plus, il existe des fournisseurs de composants d&#39;interface utilisateur comme Telerik et DevExpress. Cependant, ces fournisseurs fournissent principalement des composants individuels, ce qui vous oblige à établir votre système de mise en page. Lorsque vous travaillez dans des projets basés sur ABP, vous pouvez intégrer ces bibliothèques de manière transparente, comme vous le feriez dans n&#39;importe quel autre projet.",
    "TestInfrastructure": "Infrastructure de tests",
    "TestInfrastructure_THEPROBLEM_Description": "Établir un environnement de test robuste est une entreprise qui prend du temps. Cela implique la mise en place de projets de test dédiés au sein de votre solution, la sélection minutieuse des outils nécessaires, la création de simulations de services et de bases de données, la création de classes de base essentielles et de services utilitaires pour minimiser le code redondant entre les tests et l&#39;exécution de diverses tâches connexes.",
    "TestInfrastructure_ABPSOLUTION_Description": "Les modèles de démarrage ABP sont livrés pré-équipés de projets de test configurés, rationalisant ainsi le processus pour vous. Cela signifie que dès le premier jour, vous pouvez facilement commencer à écrire votre code de test unitaire ou d&#39;intégration initial sans délai.",
    "CodingStandards&Training": "Normes de codage et formation",
    "CodingStandards&Training_THEPROBLEM_Description": "Après avoir configuré la solution pour le développement, vous devez généralement enseigner aux développeurs comment fonctionne le système et comment le construire en utilisant les mêmes méthodes convenues. Même si vous leur donnez une formation, maintenir la documentation à jour peut s’avérer difficile. Au fil du temps, chaque développeur peut écrire du code à sa manière, ce qui entraîne des règles d&#39;écriture de code différentes les unes des autres.",
    "CodingStandards&Training_ABPSOLUTION_Description": "La solution ABP est déjà bien organisée et comporte des explications claires. Des didacticiels et des guides étape par étape vous montrent exactement comment travailler sur un projet ABP.",
    "KeepingYourSolutionUpToDate": "Garder votre solution à jour",
    "KeepingYourSolutionUpToDate_THEPROBLEM_Description": "Après avoir démarré votre développement, vous devez suivre les nouvelles versions des bibliothèques que vous utilisez pour les mises à niveau et les correctifs.",
    "KeepingYourSolutionUpToDate_ABPSOLUTION_Description": "Nous mettons régulièrement à jour tous les packages vers les dernières versions et les testons avant la version stable. Lorsque vous mettez à jour l&#39;ABP Framework, toutes ses dépendances sont mises à niveau vers la technologie de pointe.",
    "DRY": "Ne vous répétez pas !",
    "DRY_Description": "La création d&#39;une solution de base prend beaucoup de temps et nécessite une bonne expérience en architecture. Cependant, ce n’est qu’un début ! Au fur et à mesure que vous commencerez à développer, vous devrez probablement écrire beaucoup de code répétitif ; ce serait formidable si tout cela pouvait être géré automatiquement.",
    "DRY_Description2": "ABP automatise et simplifie autant que possible la répétition du code en suivant la convention sur le principe de configuration. Cependant, cela ne vous limite pas lorsque vous devez passer en vitesse manuelle. Le contrôle est toujours entre vos mains.",
    "Authentication": "Authentification",
    "Authentication_THEPROBLEM_Description": "Authentification unique, intégration Active Directory/LDAP, intégration OpenIddict, connexions sociales, authentification à deux facteurs, mot de passe oublié/réinitialisé, activation par e-mail, enregistrement d&#39;un nouvel utilisateur, contrôle de la complexité du mot de passe, verrouillage du compte en cas d&#39;échec des tentatives, affichage des tentatives de connexion infructueuses... etc. Nous savons que toutes ces exigences génériques vous sont familières. Tu n&#39;es pas seul!",
    "Authentication_ABPSOLUTION_Description": "ABP Framework et la version commerciale fournissent tous ces éléments standards pré-implémentés pour vous sous forme de module de compte réutilisable. Vous activez et configurez simplement ce dont vous avez besoin.",
    "CrossCuttingConcerns": "Préoccupations transversales",
    "CrossCuttingConcerns_THEPROBLEM_Description": "Les préoccupations transversales constituent la logique répétitive fondamentale qui doit être mise en œuvre pour chaque cas d’utilisation. Quelques exemples;",
    "CrossCuttingConcerns_THEPROBLEM_Description2": "Démarrage des transactions, validation du succès et restauration des erreurs.",
    "CrossCuttingConcerns_THEPROBLEM_Description3": "Gérer et signaler les exceptions, renvoyer une réponse d&#39;erreur appropriée aux clients et gérer les cas d&#39;erreur côté client.",
    "CrossCuttingConcerns_THEPROBLEM_Description4": "Mettre en œuvre l&#39;autorisation et la validation, renvoyer les réponses appropriées et les gérer côté client.",
    "CrossCuttingConcerns_ABPSOLUTION_Description": "ABP Framework automatise ou simplifie toutes les préoccupations transversales courantes. Vous écrivez uniquement le code qui compte pour votre entreprise et ABP gère le reste selon des conventions.",
    "ArchitecturalInfrastructure": "Infrastructure architecturale",
    "ArchitecturalInfrastructure_THEPROBLEM_Description": "Vous devez généralement créer une infrastructure pour mettre en œuvre correctement votre architecture. Par exemple, vous implémentez généralement le modèle Repository. Vous définissez certaines classes de base pour simplifier et standardiser afin de créer des entités, des services, des contrôleurs et d&#39;autres objets.",
    "ArchitecturalInfrastructure_ABPSOLUTION_Description": "ABP Framework fournit tout cela et bien plus encore. Il est mature et bien documenté.",
    "EnterpriseApplicationRequirements": "Exigences relatives aux applications d&#39;entreprise",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description": "Il existe de nombreuses exigences que vous implémentez à plusieurs reprises dans chaque application métier ;",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description2": "Système d&#39;autorisation détaillé et gestion des autorisations sur l&#39;interface utilisateur en fonction des rôles et des utilisateurs.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description3": "Rédaction de journaux d&#39;audit et d&#39;historiques d&#39;entités pour suivre lorsqu&#39;un utilisateur modifie un enregistrement de base de données.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description4": "Effectuez la suppression logicielle de vos entités, afin qu&#39;elles soient marquées comme supprimées au lieu d&#39;être supprimées physiquement de la base de données et de filtrer automatiquement les entités supprimées dans vos requêtes.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description5": "Création d&#39;abstractions et de wrappers pour consommer vos API backend à partir du code frontend.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description6": "Mise en file d&#39;attente et exécution des tâches en arrière-plan.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description7": "Gestion de plusieurs fuseaux horaires dans un système global.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description8": "Partage de la logique de validation, de localisation et d&#39;autorisation entre le serveur et le client.",
    "EnterpriseApplicationRequirements_ABPSOLUTION_Description": "ABP fournit une infrastructure pour mettre en œuvre facilement ces exigences. Encore une fois, vous ne perdez pas votre temps précieux à réimplémenter tout cela encore et encore.",
    "GeneratingInitialCode&Tooling": "Génération du code initial et des outils",
    "GeneratingInitialCode&Tooling_THEPROBLEM_Description": "Vous créerez de nombreuses pages similaires dans une application Web typique. La plupart d’entre eux effectueront des opérations CRUD similaires. Il est très fastidieux et sujet aux erreurs de créer de telles pages à plusieurs reprises.",
    "GeneratingInitialCode&Tooling_ABPSOLUTION_Description": "<a href=\"/tools/suite\">ABP Suite</a> peut générer une page CRUD complète pour vos entités en quelques secondes. Le code généré est superposé et propre. Toutes les exigences standards de validation et d’autorisation sont mises en œuvre. De plus, des classes de tests unitaires sont générées. Une fois que vous obtenez une page entièrement opérationnelle, vous pouvez la modifier en fonction des besoins de votre entreprise.",
    "IntegratingTo3rdPartyLibrariesAndSystems": "Intégration à des bibliothèques et des systèmes tiers",
    "IntegratingTo3rdPartyLibrariesAndSystems_THEPROBLEM_Description": "La plupart des bibliothèques sont conçues comme étant de bas niveau et vous effectuez généralement un certain travail pour les intégrer correctement sans répéter le même code d&#39;intégration et de configuration partout dans votre solution. Par exemple, supposons que vous deviez utiliser RabbitMQ pour implémenter votre bus d&#39;événements distribués. Tout ce que vous voulez faire, c&#39;est ; envoyer un message dans une file d&#39;attente et gérer les messages entrants. Mais vous devez comprendre les modèles de messagerie, les files d’attente et les détails des échanges. Pour écrire du code efficace, vous devez créer un pool pour gérer les connexions, les clients et les canaux. Vous devez également gérer les exceptions, les messages ACK, la reconnexion à RabbitMQ en cas d&#39;échec, etc.",
    "IntegratingTo3rdPartyLibrariesAndSystems_ABPSOLUTION_Description": "Par exemple, l&#39;intégration RabbitMQ Distributed Event Bus d&#39;ABP résume tous ces détails. Vous envoyez et recevez des messages sans agitation. Avez-vous besoin d’écrire du code de bas niveau ? Pas de problème, vous pouvez toujours le faire. ABP ne vous restreint pas lorsque vous devez utiliser les fonctionnalités de bas niveau de la bibliothèque que vous utilisez.",
    "WhyNotBuildYourOwnFramework?": "Pourquoi ne pas créer votre propre framework ?",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description": "Toute l’infrastructure, même de la manière la plus simple, prend beaucoup de temps à construire, entretenir et documenter. Il grossit avec le temps et il devient difficile de le maintenir dans votre solution. Les séparer en un projet réutilisable est le point de départ pour construire votre propre cadre interne.",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description2": "Construire, documenter, former et maintenir un cadre interne est vraiment difficile. Si vous ne disposez pas d&#39;une équipe de framework expérimentée et dédiée, votre framework interne devient rapidement un code hérité non documenté que personne ne peut plus comprendre et maintenir. En revanche, ces frameworks sont généralement développés par un ou deux développeurs dans l’équipe. Et ces gars-là deviennent un silo de connaissances. C&#39;est bien pour eux mais mauvais pour l&#39;entreprise car ils sont l&#39;unique point d&#39;échec du projet <a href=\"https://en.wikipedia.org/wiki/Single_point_of_failure\">-SPOF-</a> . Une fois qu’ils quittent l’entreprise, le projet échoue considérablement.",
    "WhyNotBuildYourOwnFramework_ABPSOLUTION_Description": "ABP Framework est un cadre d&#39;application communautaire, bien documenté, mature et générique. Une équipe de développeurs hautement expérimentés travaille dur pour le maintenir à jour, facile à comprendre et confortable à utiliser. L&#39;utilisation d&#39;un cadre aussi stable vous permet de vous concentrer sur votre propre code commercial et d&#39;obtenir l&#39;aide d&#39;experts sur le cadre chaque fois que vous en avez besoin.",
    "ArchitecturalInfrastructure_Description": "Les applications SaaS, les systèmes modulaires ou les microservices sont les modèles logiciels d&#39;entreprise les plus utilisés. La construction de tels systèmes nécessite non seulement une bonne compréhension et une bonne expérience, mais nécessite également une infrastructure logicielle solide. Sinon, vous vous retrouverez à déployer de gros efforts pour prendre en charge ces détails architecturaux dans votre base de code.",
    "Modularity": "Modularité",
    "Modularity_THEPROBLEM_Description": "Construire un système véritablement modulaire n’est pas facile ! Tous les aspects du système (base de données, entités, API, pages/composants de l&#39;interface utilisateur) peuvent être divisés en modules, et chaque module peut être réutilisé sans les autres. Le simple ASP.NET Core ne fournit pas une telle architecture modulaire. Si vous en avez besoin, vous devriez y réfléchir à partir de zéro.",
    "Modularity_ABPSOLUTION_Description": "L&#39;ABP Framework est né pour être une structure de développement d&#39;applications modulaire. Chaque fonctionnalité du framework est développée pour être compatible avec la modularité. La documentation et les guides expliquent comment développer des modules réutilisables de manière standard.",
    "SaaSMultiTenancy": "SaaS / Multilocation",
    "SaaSMultiTenancy_THEPROBLEM_Description": "<a href=\"https://docs.abp.io/en/abp/latest/Multi-Tenancy\">La multi-location</a> est un moyen courant de mettre en œuvre des systèmes SaaS. Cependant, la mise en œuvre d’une infrastructure multi-tenant cohérente peut s’avérer compliquée.",
    "SaaSMultiTenancy_ABPSOLUTION_Description": "ABP Framework fournit une infrastructure multi-tenant complète et extrait la complexité de votre code métier. Le code de votre application sera principalement compatible avec la multi-location, tandis que l&#39;ABP Framework isole automatiquement la base de données, le cache et les autres détails des locataires les uns des autres. Il prend en charge une base de données unique, une base de données par locataire et des approches hybrides. Il configure correctement les bibliothèques comme Microsoft Identity et OpenIddict, qui ne sont normalement pas compatibles avec la multi-location.",
    "Microservices": "Microservices",
    "Microservices_THEPROBLEM_Description": "La création d&#39;un système de microservices nécessite de nombreux détails d&#39;infrastructure : l&#39;authentification et l&#39;autorisation des applications et des microservices ainsi que la mise en œuvre de modèles de messagerie asynchrone et de communication synchrone (Rest/GRPC) entre les microservices sont les problèmes les plus fondamentaux.",
    "Microservices_ABPSOLUTION_Description": "L&#39;ABP Framework fournit des services, <a href=\"https://docs.abp.io/en/abp/latest/Microservice-Architecture\" target=\"_blank\">des guides</a> et des exemples pour vous aider à mettre en œuvre votre solution de microservices à l&#39;aide des outils standard du secteur.",
    "Microservices_ABPSOLUTION_Description2": "ABP Commercial va même plus loin et fournit un <a href=\"https://docs.abp.io/en/commercial/latest/startup-templates/microservice/index\" target=\"_blank\">modèle de démarrage</a> complet pour démarrer votre solution de microservices.",
    "PreBuiltModules": "Modules pré-construits",
    "PreBuiltModules_THEPROBLEM_Description": "Nous avons tous des exigences commerciales similaires mais légèrement différentes. Cependant, nous devrions tous réinventer la roue puisque le code de personne ne peut fonctionner directement dans notre solution. Ils font tous partie intégrante d’une solution plus vaste.",
    "PreBuiltModules_ABPSOLUTION_Description": "<a href=\"/modules\">Les modules</a> ABP Commercial fournissent de nombreux modules d&#39;application réutilisables comme le paiement, le chat, la gestion de fichiers, les rapports de journaux d&#39;audit... etc. Tous ces modules s&#39;installent facilement dans votre solution et fonctionnent directement. Nous ajoutons constamment de nouveaux modules.",
    "PreBuiltModules_ABPSOLUTION_Description2": "Tous les modules sont conçus pour être personnalisables en fonction des besoins de votre entreprise. Si vous avez besoin d&#39;un contrôle total, vous pouvez télécharger le code source complet de n&#39;importe quel module et le personnaliser entièrement en fonction des besoins spécifiques de votre entreprise.",
    "ABPCommunity": "Communauté ABP",
    "ABPCommunity_Description": "Enfin, faire partie d&#39;une grande communauté où tout le monde suit des styles et des principes de codage similaires et partage une infrastructure commune apporte du pouvoir lorsque vous rencontrez des problèmes ou avez besoin d&#39;aide pour prendre des décisions de conception. Puisque nous écrivons du code de la même manière, nous pouvons bien mieux nous entraider. ABP est un projet soutenu par la communauté avec plus de 10 000 étoiles sur GitHub.",
    "ABPCommunity_Description2": "Il est facile de partager du code ou même des bibliothèques réutilisables entre développeurs ABP. Un extrait de code qui fonctionne pour vous fonctionnera également pour les autres. Il existe de nombreux exemples et didacticiels que vous pouvez directement implémenter pour votre application.",
    "ABPCommunity_Description3": "Lorsque vous embauchez un développeur qui a déjà travaillé avec l&#39;architecture ABP, il comprendra immédiatement votre solution et commencera le développement dans un délai très court.",
    "WhyAbpIo_Page_Title": "Pourquoi la plateforme ABP.IO ?",
    "AbpStudio_Page_Title": "Studio ABP",
    "CampaignInfo": "Achetez une nouvelle licence ou renouvelez votre licence existante et <span class=\"text-white\">bénéficiez de 2 mois supplémentaires</span> sans frais supplémentaires ! Cette offre est valable pour tous les plans de licence. Assurez-vous de profiter de cette promotion à durée limitée pour étendre votre accès aux fonctionnalités et mises à niveau premium.",
    "HurryUpLastDay": "Dépêche-toi! Dernier jour : {0}",
    "CreatingCRUDPagesWithABPSuite": "Création de pages CRUD avec ABP Suite",
    "Testimonials": "Témoignages",
    "MultipleYearDiscount": "Remise sur plusieurs années",
    "CampaignDiscountText": "Remise du vendredi noir",
    "CampaignDiscountName": "Vendredi noir",
    "CampaignName:BlackFriday": "Vendredi noir"
  }
}