{
  "culture": "hi",
  "texts": {
    "OrganizationManagement": "संगठन का प्रबंधन",
    "OrganizationList": "संगठन सूची",
    "Volo.AbpIo.Commercial:010003": "आप इस संगठन के मालिक नहीं हैं!",
    "OrganizationNotFoundMessage": "कोई संगठन नहीं मिला!",
    "DeveloperCount": "आवंटित/कुल डेवलपर्स",
    "QuestionCount": "शेष/कुल प्रश्न",
    "Unlimited": "असीमित",
    "Owners": "मालिकों",
    "Owner": "मालिक",
    "AddMember": "सदस्य जोड़ें",
    "AddNewOwner": "नया स्वामी जोड़ें",
    "AddNewDeveloper": "नया डेवलपर जोड़ें",
    "UserName": "उपयोगकर्ता नाम",
    "Name": "नाम",
    "EmailAddress": "ईमेल पता",
    "Developers": "डेवलपर्स",
    "LicenseType": "लाइसेंस के प्रकार",
    "Manage": "प्रबंधित",
    "SetDefault": "डिफाल्ट के रूप में सेट",
    "DefaultOrganization": "गलती करना",
    "StartDate": "आरंभ करने की तिथि",
    "EndDate": "समाप्ति तिथि",
    "Modules": "मॉड्यूल",
    "LicenseExtendMessage": "आपकी लाइसेंस समाप्ति तिथि {0} तक बढ़ा दी गई है",
    "LicenseUpgradeMessage": "आपका लाइसेंस {0} में अपग्रेड किया गया है",
    "LicenseExtendAdnUpgradeMessage": "आपका लाइसेंस {0} तक बढ़ा दिया गया है और आपकी लाइसेंस योजना को {1} में अपग्रेड कर दिया गया है।",
    "LicenseAddDeveloperMessage": "{0} डेवलपर्स ने आपके लाइसेंस में जोड़ा",
    "Volo.AbpIo.Commercial:010004": "निर्दिष्ट उपयोगकर्ता नहीं मिल सकता है! उपयोगकर्ता को पहले से ही पंजीकृत होना चाहिए।",
    "MyOrganizations": "मेरे संगठन",
    "ApiKey": "एपीआई कुंजी",
    "UserNameNotFound": "उपयोगकर्ता नाम {0} का कोई उपयोगकर्ता नहीं है",
    "SuccessfullyAddedToNewsletter": "हमारे न्यूज़लेटर की सदस्यता के लिए धन्यवाद!",
    "MyProfile": "मेरी प्रोफाइल",
    "EmailNotValid": "कृपया एक वैध ई - मेल एड्रेस डालें।",
    "JoinOurMarketingNewsletter": "हमारे विपणन समाचार पत्र में शामिल हों",
    "WouldLikeToReceiveMarketingMaterials": "मैं उत्पाद सौदों और विशेष प्रस्तावों जैसे विपणन सामग्री प्राप्त करना चाहता हूं।",
    "StartUsingYourLicenseNow": "अब अपने लाइसेंस का उपयोग शुरू करें!",
    "WelcomePage": "स्वागत पृष्ठ",
    "UnsubscriptionExpireEmail": "लाइसेंस समाप्ति तिथि अनुस्मारक ईमेल से सदस्यता समाप्त करें",
    "UnsubscribeLicenseExpireEmailReminderMessage": "इस ईमेल सदस्यता में केवल आपकी लाइसेंस समाप्ति तिथि याद दिलाने की होती है।",
    "UnsubscribeFromLicenseExpireEmails": "यदि आप अपने लाइसेंस की समाप्ति तिथि के बारे में ईमेल प्राप्त नहीं करना चाहते हैं, तो आप किसी भी समय अपनी सदस्यता समाप्त कर सकते हैं।",
    "Unsubscribe": "सदस्यता रद्द",
    "NotOrganizationMember": "आप किसी संगठन के सदस्य नहीं हैं।",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "सफलतापूर्वक सदस्यता समाप्त कर दी गई",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "अब आपको लाइसेंस समाप्ति तिथि अनुस्मारक ईमेल प्राप्त नहीं होंगे।",
    "IndexPageHeroSection": "<span class=\"first-line\">एक पूर्ण</span><span class=\"second-line\"> वेब डेवलपमेंट प्लेटफॉर्म</span><span class=\"third-line\">बिल्ट-ऑन <img src=\"{0}\" width=\"110\" class=\"ml-1\" /> Framework</span>",
    "AbpCommercialShortDescription": "एबीपी कमर्शियल प्री-बिल्ट एप्लिकेशन मॉड्यूल, रैपिड एप्लिकेशन डेवलपमेंट टूलिंग, पेशेवर यूआई थीम, प्रीमियम सपोर्ट आदि प्रदान करता है।",
    "LiveDemo": "लाइव डेमो",
    "LiveDemoLead": "<a href=\"{0}\">{1}</a> अपने एबीपी खाते का उपयोग करते हुए, <a href=\"{2}\">{3}</a> abp.io पर आपका स्वागत है। <br/> या अब एक लाइव डेमो बनाने के लिए नीचे दिए गए फॉर्म को भरें",
    "ThereIsAlreadyAnAccountWithTheGivenEmailAddress": "दिए गए ईमेल पते <b>{0}</b> के साथ पहले से ही एक खाता है। <br/> आप अपने खाते से लॉगिन करके आगे बढ़ सकते हैं।",
    "GetLicence": "एक लाइसेंस प्राप्त करें",
    "Application": "आवेदन",
    "StartupTemplates": "स्टार्टअप टेम्पलेट",
    "Startup": "चालू होना",
    "Templates": "टेम्पलेट्स",
    "Developer": "डेवलपर",
    "Tools": "उपकरण",
    "Premium": "प्रीमियम",
    "PremiumSupport": "प्रीमियम सहायता",
    "PremiumForumSupport": "प्रीमियम फोरम समर्थन",
    "UI": "यूआई",
    "Themes": "विषयों",
    "JoinOurNewsletter": "हमारे समाचार पत्र शामिल हों",
    "Send": "संदेश",
    "WhatIsABPFramework": "ABP फ्रेमवर्क क्या है?",
    "OpenSourceBaseFramework": "ओपन सोर्स बेस फ्रेमवर्क",
    "ABPFrameworkExplanation": "<p class=\"lead\"> ABP कमर्शियल ASP.NET Core पर एक खुला स्रोत और समुदाय संचालित वेब एप्लीकेशन फ्रेमवर्क है। और सर्वोत्तम प्रथाओं के साथ परीक्षण योग्य कोड। </p><p> आप पहले से ही जानते हैं कि लोकप्रिय उपकरणों पर निर्मित और एकीकृत। कम सीखने की अवस्था, आसान अनुकूलन, आरामदायक विकास। </p>",
    "Modular": "मॉड्यूलर",
    "MicroserviceCompatible": "माइक्रोसिस्ट सेवा संगत",
    "DomainDrivenDesignInfrastructure": "डोमेन संचालित डिज़ाइन इन्फ्रास्ट्रक्चर",
    "MultiTenancy": "बहु किरायेदारी",
    "DistributedMessaging": "वितरित संदेश",
    "DynamicProxying": "गतिशील प्रॉक्सी",
    "BackgroundJobs": "बैकग्राउंड जॉब्स",
    "AuditLogging": "ऑडिट लॉगिंग",
    "BLOBStoring": "ब्लॉब भंडारण",
    "BundlingMinification": "बंडलिंग और न्यूनतमकरण",
    "AdvancedLocalization": "उन्नत स्थानीयकरण",
    "ManyMore": "बहुत सारी",
    "ExploreTheABPFramework": "ABP फ्रेमवर्क का अन्वेषण करें",
    "WhyUseTheABPCommercial": "एबीपी कमर्शियल का उपयोग क्यों करें?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\"> बिल्डिंग एंटरप्राइज-ग्रेड वेब एप्लिकेशन जटिल और समय लेने वाली हो सकती हैं। </p><p> ABP कमर्शियल सभी आधुनिक एंटरप्राइज-ग्रेड ASP.NET Core के लिए आवश्यक सही आधारभूत संरचना प्रदान करता है। आधारित समाधान। डिज़ाइन से परिनियोजन तक, संपूर्ण विकास चक्र ABP की अंतर्निहित विशेषताओं और मॉड्यूल द्वारा सशक्त है। </p>",
    "StartupTemplatesShortDescription": "स्टार्टअप टेम्प्लेट आपको कुछ ही सेकंड में अपने प्रोजेक्ट के लिए जंप-स्टार्ट करते हैं।",
    "UIFrameworksOptions": "यूआई चौखटे विकल्प;",
    "DatabaseProviderOptions": "डेटाबेस प्रदाता विकल्प;",
    "PreBuiltApplicationModules": "पूर्व निर्मित अनुप्रयोग मॉड्यूल",
    "PreBuiltApplicationModulesShortDescription": "अधिकांश सामान्य अनुप्रयोग आवश्यकताएं आपके लिए पुन: प्रयोज्य मॉड्यूल के रूप में पहले से ही विकसित हैं।",
    "Account": "लेखा",
    "Blogging": "ब्लॉगिंग",
    "Identity": "पहचान",
    "IdentityServer": "पहचान सर्वर",
    "Saas": "सास",
    "LanguageManagement": "भाषा प्रबंधन",
    "TextTemplateManagement": "पाठ टेम्पलेट प्रबंधन",
    "See All Modules": "SeeAllModules",
    "ABPSuite": "एबीपी सूट",
    "AbpSuiteShortDescription": "ABP सुइट ABP वाणिज्यिक का एक पूरक उपकरण है।",
    "AbpSuiteExplanation": "यह आपको कुछ ही मिनटों में वेब पेज बनाने की अनुमति देता है। यह .NET कोर ग्लोबल टूल है जिसे कमांड लाइन से इंस्टॉल किया जा सकता है। यह एक नया ABP समाधान बना सकता है, डेटाबेस से फ्रंट-एंड तक CRUD पेज बना सकता है।",
    "Details": "विवरण",
    "LeptonTheme": "लिप्टन थीम",
    "ProfessionalModernUIThemes": "पेशेवर, आधुनिक यूआई थीम",
    "LeptonThemeExplanation": "लेप्टान बूटस्ट्रैप व्यवस्थापक थीम का एक सरगम प्रदान करता है जो किसी भी परियोजना के लिए एक ठोस नींव के रूप में कार्य करता है जिसमें व्यवस्थापक डैशबोर्ड की आवश्यकता होती है।",
    "DefaultTheme": "पूर्व निर्धारित विषय",
    "MaterialTheme": "सामग्री थीम",
    "Default2Theme": "डिफ़ॉल्ट 2 थीम",
    "DarkTheme": "डार्क थीम",
    "DarkBlueTheme": "डार्क ब्लू थीम",
    "LightTheme": "प्रकाश थीम",
    "ProudToWorkWith": "गर्व के साथ काम करने के लिए",
    "OurConsumers": "दुनिया भर में 70 से अधिक देशों के सैकड़ों उद्यम और डेवलपर्स एबीपी कमर्शियल पर निर्भर हैं।",
    "JoinOurConsumers": "उनके साथ जुड़ें और तेजी से अद्भुत उत्पादों का निर्माण करें।",
    "AdditionalServicesExplanation": "क्या आपको अतिरिक्त या कस्टम सेवाओं की आवश्यकता है? <strong> हम और हमारे साथी प्रदान कर सकते हैं; </strong>",
    "CustomProjectDevelopment": "कस्टम परियोजना विकास",
    "CustomProjectDevelopmentExplanation": "अपने कस्टम प्रोजेक्ट्स के लिए समर्पित डेवलपर्स।",
    "PortingExistingProjects": "मौजूदा परियोजनाओं को पोर्ट करना",
    "PortingExistingProjectsExplanation": "एबीपी प्लेटफॉर्म पर अपनी विरासत परियोजनाओं को माइग्रेट करना।",
    "LiveSupport": "लाइव सहायता",
    "LiveSupportExplanation": "जरूरत पड़ने पर लाइव रिमोट सपोर्ट का विकल्प।",
    "Training": "प्रशिक्षण",
    "TrainingExplanation": "अपने डेवलपर्स के लिए समर्पित प्रशिक्षण।",
    "OnBoarding": "ज्ञानप्राप्ति",
    "OnBoardingExplanation": "अपने विकास, CI और सीडी वातावरण को सेटअप करने में मदद करें।",
    "PrioritizedTechnicalSupport": "प्राथमिक तकनीकी सहायता",
    "PremiumSupportExplanation": "एबीपी ढांचे के महान सामुदायिक समर्थन के अलावा, हमारी सहायता टीम उच्च प्राथमिकता वाले वाणिज्यिक उपयोगकर्ताओं की तकनीकी सवालों और समस्याओं का जवाब देती है।",
    "SeeTheSupportOptions": "समर्थन विकल्प देखें",
    "Contact": "संपर्क करें",
    "TellUsWhatYouNeed": "अपनी ज़रूरत के बारे में हमें बताएं।",
    "YourMessage": "आपका संदेश",
    "YourFullName": "आपका पूरा नाम",
    "FirstNameField": "पहला नाम",
    "LastNameField": "उपनाम",
    "EmailField": "ईमेल पता",
    "YourEmailAddress": "आपका ईमेल पता",
    "ValidEmailAddressIsRequired": "एक वैध ईमेल पता आवश्यक है।",
    "HowMayWeHelpYou": "हम कैसे आपकी सहायता कर सकते हैं?",
    "SendMessage": "मेसेज भेजें",
    "Success": "सफलता",
    "WeWillReplyYou": "हमें आपका संदेश प्राप्त हुआ और शीघ्र ही संपर्क में आएगा।",
    "GoHome": "घर जाओ",
    "CreateLiveDemo": "लाइव डेमो बनाएँ",
    "CreateLiveDemoDescription": "एक बार जब आप इस फॉर्म को जमा करते हैं, तो आपको अपने डेमो लिंक को समेत एक ईमेल प्राप्त होगा।",
    "RegisterToTheNewsletter": "ABP.IO के बारे में जानकारी प्राप्त करने के लिए न्यूज़लेटर के लिए रजिस्टर करें, जिसमें नई रिलीज़ आदि शामिल हैं।",
    "EnterYourEmailOrLogin": "अपना डेमो बनाने के लिए अपना ई-मेल पता दर्ज करें या अपने मौजूदा खाते का उपयोग करके <a href=\"{0}\">लॉगिन करें</a>।",
    "ApplicationTemplate": "एप्लिकेशन टेम्पलेट",
    "ApplicationTemplateExplanation": "एप्लिकेशन स्टार्टअप टेम्पलेट का उपयोग एक नया वेब एप्लिकेशन बनाने के लिए किया जाता है।",
    "EfCoreProvider": "इकाई ढाँचा (SQL सर्वर, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\"> और अन्य </a> का समर्थन करता है)",
    "AlreadyIncludedInTemplateModules": "निम्नलिखित मॉड्यूल पहले से ही इस टेम्पलेट में शामिल और कॉन्फ़िगर किए गए हैं:",
    "ApplicationTemplateArchitecture": "यह एप्लिकेशन टेम्पलेट tiered आर्किटेक्चर का भी समर्थन करता है जहां UI लेयर, API लेयर और ऑथेंटिकेशन सर्विस को शारीरिक रूप से अलग किया जाता है।",
    "SeeTheGuideOrGoToTheLiveDemo": "इस टेम्पलेट के बारे में तकनीकी जानकारी के लिए डेवलपर गाइड देखें या लाइव डेमो पर जाएं।",
    "DeveloperGuide": "डेवलपर गाइड",
    "ModuleTemplate": "मॉड्यूल टेम्पलेट",
    "ModuleTemplateExplanation1": "आप एक मॉड्यूल बनाना और विभिन्न अनुप्रयोगों में पुन: उपयोग करना चाहते हैं? यह स्टार्टअप टेम्पलेट एक पुन: प्रयोज्य <strong> अनुप्रयोग मॉड्यूल </strong> या <strong> microservice </strong> बनाने के लिए शुरू करने के लिए सब कुछ तैयार करता है।",
    "ModuleTemplateExplanation2": "<p> आप एकल मॉड्यूल के लिए एकल या एकाधिक UI फ्रेमवर्क, एकल या एकाधिक डेटाबेस प्रदाता का समर्थन कर सकते हैं। स्टार्टअप टेम्प्लेट को चलाने के लिए कॉन्फ़िगर किया गया है और <strong> अपने मॉड्यूल का परीक्षण करें </strong> यूनिट और एकीकरण परीक्षण के बुनियादी ढांचे के अलावा न्यूनतम आवेदन में। </p><p> इस टेम्पलेट के बारे में तकनीकी जानकारी के लिए डेवलपर गाइड देखें। </p>",
    "WithAllStyleOptions": "सभी शैली विकल्पों के साथ",
    "Demo": "डेमो",
    "SeeAllModules": "सभी मॉड्यूल देखें",
    "ABPCLIExplanation": "ABP CLI (कमांड लाइन इंटरफेस) ABP आधारित समाधानों के लिए कुछ सामान्य ऑपरेशन करने के लिए एक कमांड लाइन टूल है।",
    "ABPSuiteEasilyCURD": "एबीपी सूट एक उपकरण है जो आपको आसानी से CRUD पेज बनाने की अनुमति देता है",
    "WeAreHereToHelp": "हम यहाँ हैं <span class=\"zero-text\"> मदद </span>",
    "BrowseOrAskQuestion": "आप हमारे सहायता विषयों को ब्राउज़ कर सकते हैं या अक्सर पूछे जाने वाले प्रश्नों में खोज कर सकते हैं, या आप <a href=\"{0}\" class=\"text-success\">संपर्क फ़ॉर्म</a> का उपयोग करके हमसे एक प्रश्न पूछ सकते हैं।",
    "SearchQuestionPlaceholder": "अक्सर पूछे जाने वाले प्रश्नों में खोजें",
    "WhatIsTheABPCommercial": "ABP कमर्शियल क्या है?",
    "WhatAreDifferencesThanAbpFramework": "ओपन सोर्स ABP फ्रेमवर्क और ABP कमर्शियल के बीच क्या अंतर हैं?",
    "AbpCommercialMetaTitle": "{0} | एबीपी कमर्शियल",
    "AbpCommercialMetaDescription": "पूर्व-निर्मित मॉड्यूल, स्टार्टअप टेम्पलेट, रैपिड डेव टूल, प्रो यूआई थीम और प्रीमियम समर्थन के साथ एबीपी फ्रेमवर्क पर एक व्यापक वेब विकास मंच।",
    "ABPCommercialExplanation": "एबीपी कमर्शियल ओपन सोर्स <a target=\"_blank\" href=\"{0}\">ABP फ्रेमवर्क</a> के शीर्ष पर निर्मित प्रीमियम मॉड्यूल, टूल, थीम और सेवाओं का एक सेट है। एबीपी कमर्शियल को एबीपी ढांचे के पीछे उसी टीम द्वारा विकसित और समर्थित किया जा रहा है।",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p><a target=\"_blank\" href=\"{0}\">ABP फ्रेमवर्क</a> ASP.NET कोर के लिए एक मॉड्यूलर, थीम योग्य, माइक्रो-सर्विस संगत एप्लिकेशन डेवलपमेंट फ्रेमवर्क है। यह आपको हर नई परियोजना के लिए खुद को दोहराने के बजाय अपने स्वयं के व्यवसाय कोड पर ध्यान केंद्रित करने के लिए एक पूर्ण वास्तुकला और एक मजबूत बुनियादी ढांचा प्रदान करता है। यह सॉफ्टवेयर विकास सर्वोत्तम प्रथाओं और लोकप्रिय टूल पर आधारित है जिन्हें आप पहले से जानते हैं। </p><p> एबीपी ढांचा पूरी तरह से मुक्त, खुला स्रोत और समुदाय संचालित है। यह एक मुफ्त थीम और कुछ पूर्व-निर्मित मॉड्यूल (जैसे पहचान प्रबंधन और किरायेदार प्रबंधन) भी प्रदान करता है।</p>",
    "VisitTheFrameworkVSCommercialDocument": "अधिक जानकारी के लिए, निम्न लिंक पर जाएँ <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "एबीपी वाणिज्यिक एबीपी ढांचे के शीर्ष पर निम्नलिखित लाभ जोड़ता है;",
    "Professional": "पेशेवर",
    "UIThemes": "यूआई थीम",
    "EnterpriseModules": "एंटरप्राइज़ तैयार, सुविधा संपन्न, पूर्व-निर्मित <a href=\"{0}\">एप्लिकेशन मॉड्यूल</a> (उदा. पहचान सर्वर प्रबंधन, SaaS प्रबंधन, भाषा प्रबंधन)",
    "ToolingToSupport": "आपकी विकास उत्पादकता का समर्थन करने के लिए टूलिंग (उदा.<a href=\"{0}\">ABP Suite</a>)",
    "PremiumSupportLink": "प्रीमियम <a href=\"{0}\" target=\"_blank\">समर्थन</a>",
    "WhatDoIDownloadABPCommercial": "जब मैं एबीपी कमर्शियल खरीदता हूं तो क्या डाउनलोड करता हूं?",
    "CreateUnlimitedSolutions": "एक बार जब आप एबीपी वाणिज्यिक लाइसेंस खरीद लेते हैं, तो आप असीमित समाधान बनाने में सक्षम होंगे जैसा कि <a href=\"{0}\">आरंभ करना</a> दस्तावेज़ में वर्णित है।",
    "ABPCommercialSolutionExplanation": "जब आप एक नया एप्लिकेशन बनाते हैं, तो आपको अपनी प्राथमिकताओं के आधार पर एक विज़ुअल स्टूडियो समाधान (एक स्टार्टअप टेम्प्लेट) मिलता है। डाउनलोड किए गए समाधान में आपके लिए पहले से इंस्टॉल और कॉन्फ़िगर किए गए वाणिज्यिक मॉड्यूल और थीम हैं। यदि आप चाहें तो आप पहले से स्थापित मॉड्यूल को हटा सकते हैं या किसी अन्य मॉड्यूल को जोड़ सकते हैं। सभी मॉड्यूल और थीम डिफ़ॉल्ट रूप से एक NuGet/NPM पैकेज का उपयोग किया जाता है।",
    "StartDevelopWithTutorials": "डाउनलोड किया गया समाधान अच्छी तरह से संरचित और प्रलेखित है। आप <a href=\"{0}\">ट्यूटोरियल</a> . का अनुसरण करके इसके आधार पर अपना खुद का व्यवसाय कोड विकसित करना शुरू कर सकते हैं",
    "TryTheCommercialDemo": "ABP कमर्शियल स्टार्टअप टेम्प्लेट का उपयोग करके बनाए गए एक नमूना एप्लिकेशन को देखने के लिए आप <a href=\"{0}\">डेमो</a> आज़मा सकते हैं।",
    "HowManyProducts": "ABP वाणिज्यिक का उपयोग करके मैं कितने विभिन्न उत्पाद/समाधान बना सकता हूं?",
    "HowManyProductsExplanation": "ABP प्रोजेक्ट बनाने की कोई सीमा नहीं है। आप जितने चाहें उतने प्रोजेक्ट बना सकते हैं, उन्हें विकसित कर सकते हैं और उन्हें विभिन्न सर्वरों पर अपलोड कर सकते हैं।",
    "HowManyDevelopers": "एबीपी कमर्शियल पर कितने डेवलपर काम कर सकते हैं?",
    "HowManyDevelopersExplanation": "एबीपी वाणिज्यिक लाइसेंस प्रति डेवलपर हैं। विभिन्न लाइसेंस प्रकारों की अलग-अलग डेवलपर सीमाएँ होती हैं। हालांकि, जब भी आपको आवश्यकता हो, आप किसी भी प्रकार के लाइसेंस में अधिक डेवलपर जोड़ सकते हैं। लाइसेंस प्रकारों, डेवलपर सीमाओं और अतिरिक्त डेवलपर लागतों के लिए <a href=\"{0}\">कीमतें</a> पृष्ठ देखें।",
    "ChangingLicenseType": "क्या मैं भविष्य में अपना लाइसेंस प्रकार बदल सकता हूं?",
    "ChangingLicenseTypeExplanation": "आप अपने समान लाइसेंस प्रकार में हमेशा नए डेवलपर्स को जोड़ सकते हैं। यह भी देखें \"एबीपी कमर्शियल पर कितने डेवलपर काम कर सकते हैं?\"। आप गणना मूल्य अंतर का भुगतान करके एक उच्च लाइसेंस के लिए भी अपग्रेड कर सकते हैं। जब आप उच्च लाइसेंस योजना में अपग्रेड करते हैं, तो आपको नई योजना का लाभ मिलता है, लेकिन लाइसेंस अपग्रेड लाइसेंस की समाप्ति की तारीख को नहीं बदलता है।",
    "LicenseExtendUpgradeDiff": "लाइसेंस विस्तार और उन्नयन के बीच क्या अंतर है?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>विस्तार:</strong> अपने लाइसेंस का विस्तार/नवीकरण करने से, आपको प्रीमियम समर्थन मिलता रहेगा और मॉड्यूल और थीम के लिए बड़े या छोटे अपडेट मिलते रहेंगे। इसके अलावा, आप नई परियोजनाएं बनाना जारी रख सकेंगे। और आप अभी भी एबीपी सुइट का उपयोग कर पाएंगे, जो आपके विकास को गति देता है। जब आप अपना लाइसेंस बढ़ाते हैं, तो आपके लाइसेंस की समाप्ति तिथि में 1 वर्ष जोड़ दिया जाता है।<hr/> <strong>अपग्रेड करना:</strong> अपने लाइसेंस को अपग्रेड करके, आपको एक उच्च लाइसेंस योजना में पदोन्नत किया जाएगा, जो आपको अतिरिक्त लाभ प्राप्त करने की अनुमति देगा। लाइसेंस योजनाओं के बीच अंतर देखने के लिए <a href=\"/pricing\">लाइसेंस तुलना तालिका</a> देखें। <strong>दूसरी ओर, जब आप अपग्रेड करते हैं, तो आपके लाइसेंस की समाप्ति तिथि नहीं बदलेगी!</strong> अपने लाइसेंस की अंतिम तिथि बढ़ाने के लिए, आपको अपना लाइसेंस बढ़ाना होगा।",
    "LicenseRenewalCost": "1 वर्ष के बाद लाइसेंस नवीनीकरण लागत क्या है?",
    "LicenseRenewalCostExplanation": "मानक टीम लाइसेंस का नवीनीकरण (विस्तार) मूल्य ${0} है, मानक व्यवसाय लाइसेंस ${1} है और मानक एंटरप्राइज़ लाइसेंस ${2} है। यदि आप पहले से ही एक ग्राहक हैं, तो उपलब्ध नवीनीकरण मूल्य निर्धारण की समीक्षा के लिए <a href='{3}' target='_blank'>अपने खाते में लॉग इन करें</a>।",
    "HowDoIRenewMyLicense": "मैं अपने लाइसेंस का नवीनीकरण कैसे करूँ?",
    "HowDoIRenewMyLicenseExplanation": "आप <a href='{0}' target='_blank'>संगठन प्रबंधन पृष्ठ</a> पर नेविगेट करके अपने लाइसेंस का नवीनीकरण कर सकते हैं। हमारी रियायती प्रारंभिक नवीनीकरण दरों का लाभ उठाने के लिए, अपने लाइसेंस की समय सीमा समाप्त होने से पहले नवीनीकरण करना सुनिश्चित करें। हालाँकि, यह जानने की चिंता न करें कि आपका प्रारंभिक नवीनीकरण अवसर कब बंद होगा। आपकी सदस्यता समाप्त होने से पहले आपको 2 अनुस्मारक ई-मेल प्राप्त होंगे। हम उन्हें समाप्ति से ७ दिन पहले, ३० दिनों में भेजेंगे।",
    "IsSourceCodeIncluded": "क्या मेरे लाइसेंस में वाणिज्यिक मॉड्यूल और थीम का स्रोत कोड शामिल है?",
    "IsSourceCodeIncludedExplanation1": "आपके द्वारा खरीदे गए लाइसेंस प्रकार पर निर्भर करता है:",
    "IsSourceCodeIncludedExplanation2": "<strong> टीम </ strong>: आपका समाधान मॉड्यूल और थीम को NuGet और NPM पैकेज के रूप में उपयोग करता है। इसमें उनका स्रोत कोड शामिल नहीं है। इस तरह, जब भी कोई नया संस्करण उपलब्ध हो, आप इन मॉड्यूल और थीम को आसानी से अपग्रेड कर सकते हैं। हालाँकि, आप मॉड्यूल और थीम के स्रोत कोड प्राप्त नहीं कर सकते।",
    "IsSourceCodeIncludedExplanation3": "<strong> व्यवसाय/उद्यम </ strong>: टीम लाइसेंस के अतिरिक्त, आप किसी भी मॉड्यूल या थीम की आवश्यकता के स्रोत कोड को डाउनलोड करने में सक्षम हैं। तुम भी एक विशेष मॉड्यूल के लिए NuGet/NPM पैकेज संदर्भ निकाल सकते हैं और इसे पूरी तरह से बदलने के लिए अपने समाधान के लिए अपने स्रोत कोड को सीधे जोड़ सकते हैं।",
    "IsSourceCodeIncludedExplanation4": "<p>अपने समाधान में मॉड्यूल के स्रोत कोड को शामिल करने से आपको उस मॉड्यूल को अनुकूलित करने की अधिकतम स्वतंत्रता मिलती है। हालांकि, नया संस्करण जारी होने पर मॉड्यूल को स्वचालित रूप से अपग्रेड करना संभव नहीं होगा।</p><p>किसी भी लाइसेंस में एबीपी सूट स्रोत कोड शामिल नहीं है, जो एक बाहरी उपकरण है जो आपके लिए कोड उत्पन्न करता है और सहायता करता है। आपके विकास के लिए।</p><p>लाइसेंस प्रकारों के बीच अन्य अंतरों के लिए <a href=\"{0}\">मूल्य निर्धारण</a> पृष्ठ देखें।</p>",
    "ChangingDevelopers": "क्या मैं भविष्य में अपने संगठन के पंजीकृत डेवलपर्स को बदल सकता हूं?",
    "ChangingDevelopersExplanation": "अपने लाइसेंस में नए डेवलपर्स को जोड़ने के अलावा, आप मौजूदा डेवलपर्स को भी बदल सकते हैं (आप एक डेवलपर को हटा सकते हैं और एक ही सीट पर एक नया जोड़ सकते हैं) बिना किसी अतिरिक्त लागत के।",
    "WhatHappensWhenLicenseEnds": "मेरी लाइसेंस अवधि समाप्त होने पर क्या होता है?",
    "WhatHappensWhenLicenseEndsExplanation1": "ABP वाणिज्यिक लाइसेंस एक <a href=\"{0}\" target=\"_blank\">स्थायी लाइसेंस</a> है। आपका लाइसेंस समाप्त होने के बाद, आप अपना प्रोजेक्ट विकसित करना जारी रख सकते हैं। और आप अपने लाइसेंस को नवीनीकृत करने के लिए बाध्य नहीं हैं। आपका लाइसेंस एक साल के अपडेट और आउट ऑफ बॉक्स सपोर्ट प्लान के साथ आता है। नई सुविधाएँ, प्रदर्शन संवर्द्धन, बग फिक्स, समर्थन और ABP सूट का उपयोग जारी रखने के लिए, आपको अपने लाइसेंस को नवीनीकृत करने की आवश्यकता है। जब आपका लाइसेंस समाप्त हो जाता है;",
    "WhatHappensWhenLicenseEndsExplanation2": "आप ABP कमर्शियल का उपयोग करके नए समाधान नहीं बना सकते, लेकिन आप अपने मौजूदा एप्लिकेशन को हमेशा के लिए विकसित करना जारी रख सकते हैं।",
    "WhatHappensWhenLicenseEndsExplanation3": "आप अपने लघु संस्करण (आरसी या पूर्वावलोकन संस्करणों को छोड़कर) के भीतर मॉड्यूल और थीम के लिए अपडेट प्राप्त करने में सक्षम होंगे। उदाहरण के लिए: यदि आप किसी मॉड्यूल के v3.2.0 का उपयोग कर रहे हैं, तब भी आप उस मॉड्यूल के v3.2.x (v3.2.1, v3.2.5... आदि) के लिए अपडेट प्राप्त कर सकते हैं। लेकिन आप अगले प्रमुख या लघु संस्करण (जैसे v3.3.0, v3.3.3, 4.x.x.. आदि) के लिए अपडेट प्राप्त नहीं कर सकते। उदाहरण के लिए, जब आपका लाइसेंस समाप्त हो गया था, तो नवीनतम रिलीज़ v4.4.3 थी, और बाद में, इसने 4.4.4 संस्करण और 4.5.0 संस्करण दोनों को प्रकाशित किया, आप v4.4.X का उपयोग करने में सक्षम होंगे, लेकिन आप नहीं होंगे v4.5.X तक पहुंचें।",
    "WhatHappensWhenLicenseEndsExplanation4": "आपका लाइसेंस समाप्त होने के बाद आप ABP कमर्शियल प्लेटफॉर्म में जोड़े गए नए मॉड्यूल और थीम इंस्टॉल नहीं कर सकते।",
    "WhatHappensWhenLicenseEndsExplanation5": "आप एबीपी सूट का उपयोग नहीं कर सकते।",
    "WhatHappensWhenLicenseEndsExplanation6": "अब आप <a href=\"{0}\">प्रीमियम समर्थन</a> प्राप्त नहीं कर सकते।",
    "WhatHappensWhenLicenseEndsExplanation7": "यदि आप इन लाभों को प्राप्त करना जारी रखना चाहते हैं तो आप अपने लाइसेंस का विस्तार (नवीनीकरण) कर सकते हैं। यदि आप अपना लाइसेंस समाप्त होने के बाद <strong>{3} दिन</strong> के भीतर अपना लाइसेंस बढ़ाते हैं, तो निम्नलिखित छूट लागू होंगी: टीम लाइसेंस {0}; व्यवसाय लाइसेंस {1}; उद्यम लाइसेंस {2}।",
    "discountForYears": "{1}वर्ष(वर्षों) के लिए {0}% छूट",
    "WhatHappensWhenLicenseEndsExplanation8": "आपके द्वारा जेनरेट किए गए एबीपी प्रोजेक्ट हमारे सर्वर पर संग्रहीत नहीं हैं। इसलिए, आपके द्वारा डाउनलोड किए गए स्रोत कोड को रखना आपकी ज़िम्मेदारी है। जब आपका लाइसेंस समाप्त हो जाता है, तो आपके जेनरेट किए गए एबीपी प्रोजेक्ट स्रोत कोड को प्राप्त करने का कोई तरीका नहीं है।",
    "WhenShouldIRenewMyLicense": "मुझे अपना लाइसेंस कब नवीनीकृत करना चाहिए?",
    "WhenShouldIRenewMyLicenseExplanation": "यदि आप अपने लाइसेंस की समय सीमा समाप्त होने के बाद <strong>{3} दिन</strong> के भीतर अपना लाइसेंस नवीनीकृत करते हैं, तो निम्नलिखित छूटें लागू होंगी: टीम लाइसेंस {0} ; व्यवसाय लाइसेंस {1} ; एंटरप्राइज़ लाइसेंस {2} . यदि आप अपने लाइसेंस की समाप्ति तिथि के बाद <strong>{3} दिन</strong> अपने लाइसेंस का नवीनीकरण करते हैं, तो नवीनीकरण मूल्य लाइसेंस खरीद मूल्य के समान होगा और आपके नवीनीकरण पर कोई छूट नहीं होगी।",
    "TrialPlan": "क्या आपके पास एक परीक्षण योजना है?",
    "TrialPlanExplanation": "हां, अपना निःशुल्क परीक्षण शुरू करने के लिए, <a href=\"mailto:marketing@volosoft.com?subject=ABP Commercial — Trial License Request\">Marketing@volosoft.com</a> से संपर्क करें। हम टीम लाइसेंस के लिए 30 दिन की मनी-बैक गारंटी भी देते हैं, कोई प्रश्न नहीं पूछा जाएगा! आप लाइसेंस खरीद के पहले 30 दिनों के भीतर पूर्ण धन-वापसी का अनुरोध कर सकते हैं। हम बिजनेस और एंटरप्राइज लाइसेंस के लिए 30 दिनों के भीतर 60% रिफंड प्रदान करते हैं। ऐसा इसलिए है क्योंकि बिजनेस और एंटरप्राइज लाइसेंस में सभी मॉड्यूल और थीम का पूरा स्रोत-कोड होता है।",
    "DoYouAcceptBankWireTransfer": "क्या आप बैंक वायर ट्रांसफर स्वीकार करते हैं?",
    "DoYouAcceptBankWireTransferExplanation": "हां, हम बैंक वायर ट्रांसफर स्वीकार करते हैं।<br />बैंक हस्तांतरण के माध्यम से लाइसेंस शुल्क भेजने के बाद, हमें अपनी रसीद और अनुरोधित लाइसेंस के प्रकार accounting@abp.io पर ईमेल करें। हमारे अंतरराष्ट्रीय बैंक खाते की जानकारी:",
    "HowToUpgrade": "नया संस्करण उपलब्ध होने पर मौजूदा एप्लिकेशन को कैसे अपग्रेड किया जाए?",
    "HowToUpgradeExplanation1": "जब आप ABP कमर्शियल का उपयोग करके एक नया एप्लिकेशन बनाते हैं, तो सभी मॉड्यूल और थीम को NuGet और NPM पैकेज के रूप में उपयोग किया जाता है। इसलिए, नया संस्करण उपलब्ध होने पर आप आसानी से संकुल को अपग्रेड कर सकते हैं।",
    "HowToUpgradeExplanation2": "मानक NuGet/NPM अपग्रेड के अलावा, <a href=\"{0}\">ABP CLI</a> एक अपडेट कमांड प्रदान करता है जो आपके समाधान में सभी ABP संबंधित पैकेजों को स्वचालित रूप से ढूंढता और अपग्रेड करता है।",
    "DatabaseSupport": "कौन से डेटाबेस सिस्टम समर्थित हैं?",
    "DatabaseSupportExplanation": "एबीपी फ्रेमवर्क अपने आप में डेटाबेस अज्ञेयवादी है और अपनी प्रकृति से किसी भी डेटाबेस प्रदाता के साथ काम कर सकता है। वर्तमान में कार्यान्वित प्रदाताओं की सूची के लिए <a href=\"{0}\" target=\"_blank\">डेटा एक्सेस दस्तावेज़</a> देखें।",
    "UISupport": "कौन से UI फ्रेमवर्क समर्थित हैं?",
    "Supported": "समर्थित",
    "UISupportExplanation": "एबीपी फ्रेमवर्क अपने आप में यूआई फ्रेमवर्क अज्ञेयवादी है और किसी भी यूआई फ्रेमवर्क के साथ काम कर सकता है। हालांकि, स्टार्टअप टेम्प्लेट, मॉड्यूल UI और थीम सभी UI फ्रेमवर्क के लिए लागू नहीं किए गए थे। UI विकल्पों की अप-टू-डेट सूची के लिए <a href=\"{0}\">आरंभ करने वाला दस्तावेज़</a> देखें।",
    "MicroserviceSupport": "क्या यह सूक्ष्म सेवा वास्तुकला का समर्थन करता है?",
    "MicroserviceSupportExplanation1": "एबीपी ढांचे के प्रमुख लक्ष्यों में से एक सूक्ष्म सेवा समाधान बनाने के लिए एक सुविधाजनक बुनियादी ढांचा प्रदान करना है। यह समझने के लिए कि यह माइक्रो-सर्विस सिस्टम बनाने में कैसे मदद करता है, <a href=\"{0}\">माइक्रो-सर्विस आर्किटेक्चर</a> दस्तावेज़ देखें।",
    "MicroserviceSupportExplanation2": "सभी एबीपी वाणिज्यिक मॉड्यूल <a href=\"{0}\">मॉड्यूल विकास सर्वोत्तम प्रथाओं</a> दस्तावेज़ का पालन करके माइक्रो-सेवा परिनियोजन परिदृश्यों (अपने स्वयं के एपीआई और डेटाबेस के साथ) का समर्थन करने के लिए डिज़ाइन किए गए हैं।",
    "MicroserviceSupportExplanation3": "हम एक नमूना <a href=\"{0}\">माइक्रो-सर्विस डेमो सॉल्यूशन</a> प्रदान करते हैं जो आपको अपना समाधान बनाने में मदद करने के लिए एक माइक्रो-सर्विस आर्किटेक्चर कार्यान्वयन दर्शाता है।",
    "MicroserviceSupportExplanation4": "तो, संक्षिप्त उत्तर \"<strong> हां है, यह सूक्ष्म सेवा वास्तुकला का समर्थन करता है </ strong>\"।",
    "MicroserviceSupportExplanation5": "हालाँकि, एक माइक्रो-सर्विस सिस्टम एक समाधान है और हर समाधान में अलग-अलग आवश्यकताएं, नेटवर्क टोपोलॉजी, संचार परिदृश्य, प्रमाणीकरण संभावनाएं, डेटाबेस पृथक्करण/साझा करने के निर्णय, रनटाइम कॉन्फ़िगरेशन, 3 पार्टी सिस्टम एकीकरण और कई और अधिक होंगे।",
    "MicroserviceSupportExplanation6": "ABP फ्रेमवर्क और ABP कमर्शियल आपको अपने स्वयं के समाधान का निर्माण करने में मदद करने के लिए सूक्ष्म सेवा परिदृश्य, सूक्ष्म सेवा संगत मॉड्यूल, नमूने और प्रलेखन के लिए बुनियादी ढाँचा प्रदान करता है। लेकिन अपने सपनों के समाधान को सीधे आपके लिए पहले से डाउनलोड करने की उम्मीद न करें। आपको इसे समझने और अपनी आवश्यकताओं के आधार पर कुछ हिस्सों को एक साथ लाने की आवश्यकता होगी।",
    "WhereCanIDownloadSourceCode": "मैं स्रोत-कोड कहां से डाउनलोड कर सकता हूं?",
    "WhereCanIDownloadSourceCodeExplanation": "आप एबीपी सूट या एबीपी सीएलआई के माध्यम से सभी एबीपी मॉड्यूल, एंगुलर पैकेज और थीम का सोर्स कोड डाउनलोड कर सकते हैं। देखें <a href=\"{0}\">स्रोत-कोड कैसे डाउनलोड करें?</a>",
    "ComputerLimitation": "एबीपी विकसित करते समय एक डेवलपर कितने कंप्यूटरों पर लॉगिन कर सकता है?",
    "ComputerLimitationExplanation": "हम विशेष रूप से प्रति व्यक्ति/लाइसेंस प्राप्त डेवलपर के लिए <strong> {0} कंप्यूटर </ strong> की अनुमति देते हैं। जब भी किसी तीसरे मशीन पर एबीपी कमर्शियल उत्पादों को विकसित करने के लिए डेवलपर की आवश्यकता होती है, तो स्थिति को समझाते हुए लाइसेंस@abp.io को एक ई-मेल भेजा जाना चाहिए और फिर हम अपने सिस्टम में उचित आवंटन करेंगे।",
    "RefundPolicy": "क्या आपके पास धनवापसी नीति है?",
    "RefundPolicyExplanation": "आप अपनी लाइसेंस खरीद के <strong> 30 दिन </ strong> के भीतर धनवापसी का अनुरोध कर सकते हैं। व्यवसाय और उद्यम लाइसेंस प्रकार में स्रोत-कोड डाउनलोड विकल्प होता है, इसलिए व्यापार और उद्यम के लिए धनवापसी उपलब्ध नहीं होती है (और कोई भी लाइसेंस जिसमें स्रोत-कोड प्राप्त करने का अधिकार शामिल होता है)। इसके अलावा, नवीनीकरण और दूसरे लाइसेंस खरीद के लिए कोई भी रिफंड नहीं किया जाता है।",
    "HowCanIRefundVat": "मैं VAT कैसे वापस कर सकता हूँ?",
    "HowCanIRefundVatExplanation1": "यदि आपने 2 चेकआउट का उपयोग करके भुगतान किया है, तो आप अपने 2 चेकआउट खाते के माध्यम से वैट वापस कर सकते हैं:",
    "HowCanIRefundVatExplanation2": "अपने <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\"> 2 चेकआउट </a> खाते में लॉग इन करें",
    "HowCanIRefundVatExplanation3": "उपयुक्त आदेश खोजें और \"रिफंड बेल्ड वैट\" दबाएं (अपनी वैट आईडी दर्ज करें)",
    "HowCanIGetMyInvoice": "मैं अपना चालान कैसे प्राप्त कर सकता हूं?",
    "HowCanIGetMyInvoiceExplanation": "लाइसेंस खरीदने के लिए 2 भुगतान गेटवे हैं: PayU और 2 चेकआउट। यदि आप 2Checkout गेटवे के माध्यम से अपना लाइसेंस खरीदते हैं, तो यह आपके ईमेल पते पर पीडीएफ चालान भेजता है, देखें <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How-do-invoices-work\"> 2 चेकआउट चालान। </a> यदि आप पेयू गेटवे या बैंक वायर ट्रांसफर के माध्यम से खरीदते हैं, तो हम आपका चालान तैयार करेंगे और भेजेंगे। आप अपने चालान का अनुरोध <a href=\"{0}\"> संगठन प्रबंधन पृष्ठ </a> से कर सकते हैं",
    "Forum": "मंच",
    "SupportExplanation": "ABP कमर्शियल लाइसेंस एक टीम द्वारा प्रीमियम फ़ोरम सपोर्ट प्रदान करता है जिसमें ABP फ्रेमवर्क विशेषज्ञ होते हैं।",
    "PrivateTicket": "निजी टिकट",
    "PrivateTicketExplanation": "एंटरप्राइज लाइसेंस में ई-मेल और टिकट प्रणाली के साथ एक निजी सहायता भी शामिल है।",
    "AbpSuiteExplanation1": "ABP सुइट आपको कुछ ही मिनटों में वेब पेज बनाने की अनुमति देता है। यह .NET कोर ग्लोबल टूल है जिसे कमांड लाइन से इंस्टॉल किया जा सकता है।",
    "AbpSuiteExplanation2": "यह एक नया ABP समाधान बना सकता है, डेटाबेस से फ्रंट-एंड तक CRUD पेज बना सकता है। तकनीकी ओवरव्यू के लिए <a href=\"{0}\"> दस्तावेज़ </a> देखें",
    "FastEasy": "तेज और आसान",
    "AbpSuiteExplanation3": "ABP सुइट आपको आसानी से CRUD पेज बनाने की अनुमति देता है। आपको बस अपनी इकाई और उसके गुणों को परिभाषित करने की आवश्यकता है, बाकी को आप के लिए एबीपी सूट करने दें! एबीपी सूट कुछ ही सेकंड में आपके सीआरयूडी पृष्ठ के लिए सभी आवश्यक कोड उत्पन्न करता है। यह Angular, MVC और Blazor यूजर इंटरफेस को सपोर्ट करता है।",
    "RichOptions": "अमीर विकल्प",
    "AbpSuiteExplanation4": "ABP Suite supports multiple UI options like <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\">Razor Pages</a> and <a href=\"https://angular.io\">Angular</a>.It also supports multiple databases like <a href=\"https://www.mongodb.com\">MongoDB</a> and all databases supported by <strong>EntityFramework Core</strong> (MS SQL Server, Oracle, MySql, PostgreSQL and <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\">more</a>).",
    "AbpSuiteExplanation5": "अच्छी बात यह है कि, आपको उन विकल्पों के बारे में चिंता करने की ज़रूरत नहीं है। एबीपी सूट आपके प्रोजेक्ट के प्रकार को समझता है और आपकी परियोजना के लिए कोड बनाता है और उत्पन्न कोड को आपके प्रोजेक्ट में सही जगह पर रखता है।",
    "SourceCode": "सोर्स कोड",
    "AbpSuiteExplanation6": "ABP स्वीट आपके लिए सोर्स कोड जेनरेट करता है! यह वेब पेज जनरेट करने के लिए मैजिक फाइल्स जेनरेट नहीं करता है। एबीपी सूट <strong> इकाई, रिपोजिटरी, एप्लीकेशन सर्विस, कोड फर्स्ट माइग्रेशन, जावास्क्रिप्ट/टाइपस्क्रिप्ट और सीएसएचटीएमएल/एचटीएमएल </ strong> और आवश्यक इंटरफेस के लिए भी स्रोत कोड उत्पन्न करता है। ABP Suite सॉफ्टवेयर डेवलपमेंट के <strong> बेस्ट प्रैक्टिसेस </ strong> के अनुसार कोड भी तैयार करता है, इसलिए आपको जनरेट किए गए कोड की गुणवत्ता के बारे में चिंता करने की आवश्यकता नहीं है।",
    "AbpSuiteExplanation7": "चूँकि आपके पास सही एप्लिकेशन लेयर्स में जेनरेट किए गए CRUD पेज के बिल्डिंग ब्लॉक्स का सोर्स कोड है, आप आसानी से सोर्स कोड को संशोधित कर सकते हैं और अपने कस्टम/bussiness लॉजिक को जेनरेट कोड में इंजेक्ट कर सकते हैं।",
    "CrossPlatform": "क्रास प्लेटफार्म",
    "AbpSuiteExplanation8": "ABP सुइट .NET .NET के साथ बनाया गया है और यह क्रॉस प्लेटफॉर्म है। यह आपके स्थानीय कंप्यूटर पर एक वेब एप्लिकेशन के रूप में चलता है। आप इसे <strong> Windows </ strong>, <strong> Mac </ strong> और <strong> Linux </ strong> पर चला सकते हैं",
    "OtherFeatures": "अन्य सुविधाओं",
    "OtherFeatures1": "अपडेट्स <strong> NuGet </ strong> और <strong> NPM </ strong> पैकेज आपके समाधान पर आसानी से।",
    "OtherFeatures2": "खरोंच से पहले से ही उत्पन्न पृष्ठों को पुन: उत्पन्न करता है।",
    "OtherFeatures3": "नए समाधान बनाता है",
    "ThanksForCreatingProject": "अपना प्रोजेक्ट बनाने के लिए धन्यवाद!",
    "HotToRunSolution": "अपना हल कैसे चलाएं?",
    "HotToRunSolutionExplanation": "अपने समाधान को कॉन्फ़िगर करने और चलाने का तरीका जानने के लिए आरंभ किया गया दस्तावेज़ देखें।",
    "GettingStarted": "शुरू करना",
    "WebAppDevTutorial": "वेब ऐप देव ट्यूटोरियल",
    "WebAppDevTutorialExplanation": "कदम विकास नमूना द्वारा एक कदम के लिए वेब अनुप्रयोग विकास ट्यूटोरियल दस्तावेज़ देखें।",
    "Document": "डाक्यूमेंट",
    "UsingABPSuiteToCURD": "CRUD पेज जनरेशन और टूलिंग के लिए ABP सूट का उपयोग करना",
    "SeeABPSuiteDocument": "ABP सुइट का उपयोग जानने के लिए ABP सुइट दस्तावेज़ देखें।",
    "AskQuestionsOnSupport": "आप एबीपी कमर्शियल सपोर्ट पर सवाल पूछ सकते हैं।",
    "Documentation": "प्रलेखन",
    "SeeModulesDocument": "सभी वाणिज्यिक (समर्थक) मॉड्यूल और उनके दस्तावेजों की सूची के लिए मॉड्यूल दस्तावेज़ देखें।",
    "Pricing": "मूल्य निर्धारण",
    "PricingExplanation": "आज अपनी व्यावसायिक आवश्यकताओं के लिए सुविधाओं और कार्यक्षमता का चयन करें। जैसे ही आपका व्यवसाय बढ़ता है, आसानी से अपग्रेड करें।",
    "Team": "टीम",
    "Business": "व्यापार",
    "Enterprise": "उद्यम",
    "Custom": "रिवाज",
    "IncludedDeveloperLicenses": "डेवलपर लाइसेंस शामिल हैं",
    "CustomLicenceOrAdditionalServices": "कस्टम लाइसेंस या अतिरिक्त सेवाओं की आवश्यकता है?",
    "CustomOrVolumeLicense": "कस्टम या वॉल्यूम लाइसेंस",
    "LiveTrainingSupport": "लाइव प्रशिक्षण और समर्थन",
    "AndMore": "और अधिक",
    "AdditionalDeveloperLicense": "अतिरिक्त डेवलपर लाइसेंस",
    "ProjectCount": "प्रोजेक्ट की गिनती",
    "AllProModules": "सभी प्रो मॉड्यूल",
    "AllProThemes": "सभी प्रो थीम",
    "AllProStartupTemplates": "सभी प्रो स्टार्टअप टेम्प्लेट",
    "SourceCodeOfAllModules": "सभी मॉड्यूल का स्रोत कोड",
    "SourceCodeOfAllThemes": "सभी विषयों का स्रोत कोड",
    "PerpetualLicense": "हमेशा के लिए लाइसेंस",
    "UnlimitedServerDeployment": "असीमित सर्वर की तैनाती",
    "YearUpgrade": "1 साल का उन्नयन",
    "YearPremiumForumSupport": "1 साल का प्रीमियम फोरम सपोर्ट",
    "ForumSupportIncidentCountYear": "फोरम समर्थन घटना गिनती/वर्ष",
    "PrivateTicketEmailSupport": "निजी टिकट और ईमेल समर्थन",
    "BuyNow": "अभी खरीदें",
    "PayViaAmexCard": "मैं अपने AMEX कार्ड के माध्यम से कैसे भुगतान कर सकता हूं?",
    "PayViaAmexCardDescription": "डिफ़ॉल्ट भुगतान गेटवे 'Iyzico' सुरक्षा उपायों के कारण कुछ AMEX क्रेडिट कार्डों को अस्वीकार कर सकता है। इस मामले में, आप वैकल्पिक भुगतान गेटवे '2 चेकआउट' के माध्यम से भुगतान कर सकते हैं।",
    "ThankYou": "धन्यवाद",
    "InvalidReCaptchaErrorMessage": "ReCAPTCHA को सत्यापित करने में एक त्रुटि हुई थी। कृपया पुन: प्रयास करें।",
    "CompanyName": "कंपनी का नाम",
    "YourCompanyName": "आपके संगठन का नाम",
    "FirstName": "पहला नाम",
    "LastName": "उपनाम",
    "Optional": "ऐच्छिक",
    "YourFirstName": "आपका पहला नाम",
    "YourLastName": "आपका अंतिम नाम",
    "SpecialOffer": "विशेष पेशकश",
    "SpecialOfferMessage": "जल्दी करो! कीमतें सीमित समय के लिए वैध हैं।",
    "DiscountRequest": "छूट अनुरोध",
    "DiscountRequestDescribeCustomerQuestion": "निम्नलिखित में से कौन आपका वर्णन करता है?",
    "DiscountRequestStudentEmailMessage": "ईमेल पते में 'edu' होना चाहिए।",
    "DiscountRequestDeveloperCount": "आप कितने डेवलपर हैं?",
    "DiscountRequestDeveloperCountExceedMessage": "हम उन कंपनियों के लिए रियायती लाइसेंस प्रदान नहीं करते जिनके पास {0} से अधिक डेवलपर हैं।",
    "DiscountRequestOrganizationName": "कंपनी/संगठन/स्कूल का नाम",
    "Website": "वेबसाइट",
    "GithubUsername": "GitHub उपयोगकर्ता नाम",
    "PhoneNumber": "फ़ोन नंबर",
    "Country": "देश",
    "DescribeABPCommercialUsage": "उस परियोजना का वर्णन करें जिसे आप एपीबी कमर्शियल के आधार पर विकसित करने की योजना बना रहे हैं",
    "DiscountRequestCertifyInformationMessage": "मैं प्रमाणित करता हूं कि सभी जानकारी सत्य और सही है।",
    "DiscountRequestReceived": "हमें आपका छूट अनुरोध प्राप्त हुआ है।",
    "DiscountRequestStatusMessage": "आपके द्वारा प्रदान की गई जानकारी की जांच करने के बाद हम आपको जवाब देंगे।",
    "MVCOrRazorPages": "एमवीसी (रेजर पेज)",
    "Angular": "कोणीय",
    "Blazor": "ब्लेज़ोर",
    "New": "नया",
    "MongoDB": "मोंगोडीबी",
    "EBookDDD": "ई-बुक डोमेन संचालित डिजाइन",
    "PracticalGuideForImplementingDDD": "यह पुस्तक एबीपी फ्रेमवर्क के साथ डोमेन संचालित डिजाइन को लागू करने के लिए एक व्यावहारिक मार्गदर्शिका है।",
    "IntroducingDDD": "पेश है डोमेन ड्रिवेन डिज़ाइन",
    "DDDLayersAndCleanArchitecture": "डीडीडी परतें और स्वच्छ वास्तुकला",
    "LayeringOfADotnetSolution": "एक .NET समाधान की लेयरिंग",
    "ImplementingDDDBuildingBlocks": "डीडीडी बिल्डिंग ब्लॉक्स को लागू करना",
    "DomainVsApplicationLogic": "डोमेन लॉजिक बनाम एप्लिकेशन लॉजिक",
    "SamplesAndDiscussions": "नमूने और चर्चा",
    "Free": "नि: शुल्क",
    "Download": "डाउनलोड",
    "DDDEBook": "डीडीडी ई-बुक",
    "ImplementingDDD": "डोमेन संचालित डिजाइन को लागू करना",
    "DDDBookExplanation": "एबीपी फ्रेमवर्क के साथ डोमेन संचालित डिजाइन को लागू करने के लिए एक व्यावहारिक गाइड।",
    "Overview": "अवलोकन",
    "DDDBookPracticalGuide": "यह डोमेन संचालित डिजाइन (डीडीडी) को लागू करने के लिए एक व्यावहारिक मार्गदर्शिका है। जबकि कार्यान्वयन विवरण एबीपी फ्रेमवर्क बुनियादी ढांचे पर निर्भर करता है, मूल अवधारणाएं, सिद्धांत और पैटर्न किसी भी प्रकार के समाधान में लागू होते हैं, भले ही वह .NET समाधान न हो।",
    "TableOfContents": "विषयसूची",
    "IntroductionToImplementingDDD": "डोमेन संचालित डिजाइन को लागू करने का परिचय",
    "WhatIsDDD": "डोमेन संचालित डिजाइन क्या है?",
    "Implementation": "कार्यान्वयन",
    "TheBigPicture": "बड़ी तस्वीर",
    "TheBuildingBlock": "बिल्डिंग ब्लॉक",
    "ExampleUseCase": "उदाहरण उपयोग केस",
    "DomainAndApplicationLogic": "डोमेन तर्क और अनुप्रयोग तर्क",
    "Author": "लेखक",
    "PublishedOn": "पर प्रकाशित",
    "Page": "पृष्ठ",
    "FreeEBook": "मुफ्त ई-बुक",
    "EBookSignInForDownload": "ई-बुक साइन इन डाउनलोड करने के लिए",
    "SignIn": "साइन इन करें",
    "Or": "या",
    "TellUsAboutYourself": "हमें अपने बारे में थोड़ा बताएं",
    "Surname": "उपनाम",
    "DoYouAgreePrivacyPolicy": "मैं <a href=\"/TermsConditions\">नियम और शर्तें<a/> और <a href=\"/Privacy\">गोपनीयता नीति</a> से सहमत हूं।",
    "VolosoftMarketingInformationMessage": "मुझे व्यवसायों और संगठनों और अन्य Volosoft उत्पादों और सेवाओं के समाधान के बारे में जानकारी, सुझाव और ऑफ़र चाहिए।",
    "VolosoftSharingInformationMessage": "मैं चाहता हूं कि वोलोसॉफ्ट मेरी जानकारी चुनिंदा भागीदारों के साथ साझा करे ताकि मैं उनके उत्पादों और सेवाओं के बारे में प्रासंगिक जानकारी प्राप्त कर सकूं।",
    "WeWillSendYouADownloadLink": "ई-बुक डाउनलोड करने के लिए एक लिंक {0} पर भेज दिया गया है।<br/> अपना इनबॉक्स/जंक/स्पैम बॉक्स चेक करें!",
    "InvalidFormInputs": "कृपया, फॉर्म पर निर्दिष्ट मान्य जानकारी टाइप करें।",
    "DDDBookEmailBody": "धन्यवाद। <br /> अपनी पुस्तक डाउनलोड करने के लिए, <a href=\"{0}\">यहां क्लिक करें</a>।",
    "StartFree": "मुफ्त शुरू करें",
    "FreeTrial": "मुफ्त परीक्षण",
    "AcceptsMarketingCommunications": " हां, मैं एबीपी वाणिज्यिक विपणन संचार प्राप्त करना चाहता/चाहती हूं।",
    "PurposeOfUsage": "उपयोग का उद्देश्य",
    "Choose": "- चुनना -",
    "CompanyOrganizationName": "कंपनी/संगठन का नाम",
    "CompanySize": "कंपनी का आकार",
    "Next": "अगला",
    "StartTrial": "मेरा नि:शुल्क परीक्षण प्रारंभ करें",
    "ContactUsQuestions": "अगर तुम्हारे पास कोई सवाल है तो हमसे संपर्क करें",
    "TrialActivatedWarning": "एक उपयोगकर्ता केवल 1 निःशुल्क परीक्षण अवधि का हकदार है। आपने पहले ही अपनी परीक्षण अवधि का उपयोग कर लिया है।",
    "ActivationRequirement": "आप अपना परीक्षण शुरू करने से अंतिम एक कदम दूर हैं।<br> आपकी जानकारी की जांच करने के बाद, हम आपका लाइसेंस सक्रिय कर देंगे। एक बार आपका लाइसेंस सक्रिय हो जाने पर, हम <b>{0}</b> पर एक ईमेल भेजेंगे। चिंता न करें, इस प्रक्रिया में अधिक समय नहीं लगेगा!",
    "SaveAndDownload": "सहेजें और डाउनलोड करें",
    "CompanyNameValidationMessage": "कंपनी का नाम बहुत लंबा है!",
    "AddressValidationMessage": "पता बहुत लंबा है!",
    "TaxNoValidationMessage": "टैक्स/वैट संख्या बहुत लंबी है!",
    "NotesValidationMessage": "नोट्स फ़ील्ड बहुत लंबा है!",
    "CheckYourBillingInfo": "आप अपना चालान केवल एक बार बना सकते हैं! अपना चालान बनाने से पहले अपनी बिलिंग जानकारी की जांच करें।",
    "StartYourFreeTrial": "अपना नि: शुल्क परीक्षण शुरू करो",
    "TrialLicenseModelInvalidErrorMessage": "निम्न में से एक फ़ील्ड अमान्य है: देश का नाम, कंपनी का आकार, उद्योग या उपयोग का उद्देश्य।",
    "Trial": "परीक्षण",
    "Purchased": "खरीदी",
    "PurchaseNow": "अब खरीदें",
    "PurchaseTrialLicenseMessage": "आपके लाइसेंस की समाप्ति तिथि {0} है। <br> यदि आप अपनी नि:शुल्क परीक्षण अवधि के दौरान बनाए गए प्रोजेक्ट का उपयोग जारी रखना चाहते हैं, तो आपको अपनी <code>appsettings.secrets.json</code> फ़ाइलों में लाइसेंस कुंजियों को बदलना होगा। यहां आपकी लाइसेंस कुंजी है:",
    "TrialLicenseExpireMessage": "आप परीक्षण लाइसेंस का उपयोग कर रहे हैं और आपका परीक्षण लाइसेंस {0} को समाप्त हो जाएगा।",
    "TryForFree": "मुफ्त में आजमाइये",
    "TrialLicenseExpiredInfo": "आपके परीक्षण लाइसेंस की अवधि समाप्त हो गई है!",
    "DowngradeLicensePlan": "क्या मैं भविष्य में कम लाइसेंस योजना में डाउनग्रेड कर सकता हूँ?",
    "DowngradeLicensePlanExplanation": "आप अपनी मौजूदा लाइसेंस योजना को डाउनग्रेड नहीं कर सकते। लेकिन आप नया लोअर लाइसेंस प्लान खरीद सकते हैं और नए लाइसेंस पर अपना विकास जारी रख सकते हैं। आपके द्वारा कम लाइसेंस खरीदने के बाद, आपको एबीपी सीएलआई कमांड के माध्यम से अपनी नई लाइसेंस योजना में प्रवेश करने की आवश्यकता है: `एबीपी लॉगिन <उपयोगकर्ता नाम> -ओ <संगठन>`।",
    "LicenseTransfer": "क्या लाइसेंस एक डेवलपर से दूसरे डेवलपर को ट्रांसफर किया जा सकता है?",
    "LicenseTransferExplanation": "हाँ! जब आप लाइसेंस खरीदते हैं, तो आप लाइसेंस धारक बन जाते हैं, इसलिए आपके पास संगठन प्रबंधन पृष्ठ तक पहुंच होगी। एक संगठन में मालिक और डेवलपर की भूमिकाएँ होती हैं। मालिक डेवलपर सीटों का प्रबंधन कर सकते हैं और डेवलपर्स को असाइन कर सकते हैं। प्रत्येक असाइन किया गया डेवलपर सिस्टम में ABP CLI कमांड के माध्यम से लॉगिन करेगा और उसके पास विकास और समर्थन अनुमतियाँ होंगी।",
    "UserOwnerDescription": "संगठन का &#39;मालिक&#39; इस खाते का व्यवस्थापक है. वह लाइसेंस खरीदकर और डेवलपर्स आवंटित करके संगठन का प्रबंधन करता है। एक &#39;मालिक&#39; एबीपी वाणिज्यिक परियोजनाओं में कोड नहीं लिख सकता है, एबीपी नमूना परियोजनाओं को डाउनलोड नहीं कर सकता है, और समर्थन वेबसाइट पर प्रश्न नहीं पूछ सकता है। अगर आप ये सब करना चाहते हैं तो आपको खुद को एक डेवलपर के तौर पर भी जोड़ना होगा.",
    "UserDeveloperDescription": "&#39;डेवलपर्स&#39; एबीपी वाणिज्यिक परियोजनाओं में कोड लिख सकते हैं, एबीपी नमूना परियोजनाएं डाउनलोड कर सकते हैं और समर्थन वेबसाइट पर प्रश्न पूछ सकते हैं। दूसरी ओर, &#39;डेवलपर्स&#39; इस संगठन का प्रबंधन नहीं कर सकते।",
    "RemoveCurrentUserFromOrganizationWarningMessage": "आप स्वयं को अपने ही संगठन से दूर कर रहे हैं। अब आप इस संगठन का प्रबंधन नहीं कर पाएंगे, क्या आप पुष्टि करते हैं?",
    "RenewExistingOrganizationOrCreateNewOneMessage": "आप नीचे दिए गए &quot;अभी विस्तार करें&quot; बटन पर क्लिक करके अपने संगठन के लाइसेंस को नवीनीकृत कर सकते हैं और इस प्रकार आप लाइसेंस की समाप्ति तिथि को 1 वर्ष तक बढ़ा सकते हैं। यदि आप चेकआउट करना जारी रखते हैं, तो आपके पास एक नया संगठन होगा। क्या आप एक नये संगठन को जारी रखना चाहते हैं?",
    "PurchaseTrialOrganizationOrCreateNewOneMessage": "आपके पास ट्रायल लाइसेंस है. अपना ट्रायल लाइसेंस खरीदने के लिए अभी खरीदें बटन पर क्लिक करें। यदि आप चेकआउट करना जारी रखते हैं, तो आपके पास एक नया संगठन होगा। क्या आप एक नये संगठन को जारी रखना चाहते हैं?",
    "ExtendNow": "अभी बढ़ाएँ",
    "CreateNewOrganization": "एक नया संगठन बनाएं",
    "RenewLicenseEarly": "अगर मैं अपना लाइसेंस जल्दी रिन्यू करता हूं, तो क्या मुझे पूरा साल मिलेगा?",
    "RenewLicenseEarylExplanation": "जब आप अपनी लाइसेंस समाप्ति तिथि से पहले अपने लाइसेंस का नवीनीकरण करते हैं, तो आपकी लाइसेंस समाप्ति तिथि में 1 वर्ष जोड़ दिया जाएगा। उदाहरण के लिए, यदि आपका लाइसेंस {0}-06-06 को समाप्त हो रहा है और आप इसे {0}-01-01 को नवीनीकृत करते हैं, तो आपकी नई लाइसेंस समाप्ति तिथि {1}-06-06 होगी।",
    "OpenSourceWebApplication": "ओपन सोर्स वेब एप्लिकेशन",
    "CompleteWebDevelopment": "एक संपूर्ण वेब विकास",
    "ABPFrameworkDescription": "एबीपी फ्रेमवर्क सॉफ्टवेयर विकास और सम्मेलनों की सर्वोत्तम प्रथाओं का पालन करके आधुनिक वेब एप्लिकेशन बनाने के लिए एक संपूर्ण बुनियादी ढांचा है।",
    "CommunityDescription": "एबीपी फ्रेमवर्क के साथ अपने अनुभव साझा करें!",
    "GetStarted": "शुरू हो जाओ",
    "Views": "दृश्य",
    "LatestPosts": "नवीनतम पोस्ट",
    "PreBuiltApplication": "पूर्व-निर्मित अनुप्रयोग",
    "DatabaseProviders": "डेटाबेस प्रदाता",
    "UIFrameworks": "यूआई फ्रेमवर्क",
    "UsefulLinks": "उपयोगी कड़ियां",
    "Platform": "प्लैटफ़ॉर्म",
    "CoolestCompaniesUseABPCommercial": "सबसे अच्छी कंपनियाँ पहले से ही <span class=\"fw-bold\">एबीपी कमर्शियल का उपयोग करती हैं।</span>",
    "UserInterface": "प्रयोक्ता इंटरफ़ेस",
    "APIGateway": "एपीआई गेटवे",
    "Microservice": "माइक्रोसर्विस",
    "Database": "डेटाबेस",
    "Architecture": "वास्तुकला",
    "MicroserviceArchitectureExplanation": "यह एक संपूर्ण समाधान आर्किटेक्चर है जिसमें नवीनतम तकनीकों के साथ स्केलेबल माइक्रोसर्विस समाधान बनाने के लिए कई एप्लिकेशन, एपीआई गेटवे, माइक्रोसर्विसेज और डेटाबेस शामिल हैं।",
    "BusinessLogic": "व्यापार का तर्क",
    "DataAccessLayer": "डेटा एक्सेस परत",
    "Monolith": "एकाश्म",
    "ModularArchitectureExplanation": "यह स्टार्टअप टेम्पलेट एक स्वच्छ और रखरखाव योग्य कोडबेस बनाने के लिए एक स्तरित, मॉड्यूलर और डीडीडी-आधारित समाधान आर्किटेक्चर प्रदान करता है।",
    "SeeDetails": "विस्तृत जानकारी देखें",
    "SeeDocumentation": "दस्तावेज़ीकरण की जाँच करें",
    "Bs5Compatible": "बूटस्ट्रैप 5 संगत पेशेवर थीम, आपकी व्यवस्थापक वेबसाइट के लिए बिल्कुल सही।",
    "LeptonXTheme": "लेप्टनएक्स थीम",
    "LeptonXDark": "लेप्टनएक्स डार्क",
    "LeptonXLight": "लेप्टनएक्स लाइट",
    "LeptonXSemiDark": "लेप्टनएक्स सेमी-डार्क",
    "BuiltOnBs5Library": "बूटस्ट्रैप 5 लाइब्रेरी पर निर्मित",
    "FullyCompatibleWithBs5": "बूटस्ट्रैप 5 HTML संरचना और सीएसएस कक्षाओं के साथ 100% संगत",
    "ResponsiveAndMobileCompatible": "उत्तरदायी, मोबाइल-संगत, आरटीएल समर्थन",
    "ProvidesStylesForDatatables": "डेटाटेबल्स के लिए शैलियाँ प्रदान करता है",
    "MultipleLayoutOptions": "एकाधिक लेआउट विकल्प",
    "EasilyInstallAndUpgrade": "आसानी से इंस्टॉल और अपग्रेड करें",
    "SupportForum": "सहयता मंच",
    "TrustedBy": "द्वारा विश्वसनीय",
    "OurPricing": "हमारी <span class=\"gradient-commercial\">कीमत</span>",
    "Plans": "योजनाओं",
    "NameSurname": "नाम सरनेम",
    "Unspecified": "अनिर्दिष्ट",
    "LicenceType": "लाइसेंस प्रकार",
    "LicenseDiscountWarning": "यह डिस्काउंट पेज वोलोसॉफ्ट डेवलपर्स के लिए डिफ़ॉल्ट डिस्काउंट कोड का उपयोग करता है। नीचे दिए गए खरीदारी लिंक काम नहीं करते।",
    "DiscountedLicenseExplanation": "ये लाइसेंस कीमतें छोटे स्टार्टअप, व्यक्तिगत डेवलपर्स, छात्रों, गैर-लाभकारी संगठनों और परियोजनाओं के लिए हैं!",
    "General": "सामान्य",
    "License": "लाइसेंस",
    "Development": "विकास",
    "Payment": "भुगतान",
    "WatchExplainerVideo": "चलो मिलते हैं! व्याख्याकार वीडियो देखें",
    "LightDarkAndSemiDarkThemes": "प्रकाश, अंधेरा और अर्ध-अंधेरा",
    "LeptonXThemeExplanation": "लेप्टन थीम आपके सिस्टम सेटिंग्स के अनुसार आपकी थीम बदल सकती है।",
    "PRO": "समर्थक",
    "WelcomeToABPCommercial": "<span class=\"gradient-commercial\">एबीपी कमर्शियल में आपका स्वागत है!</span>",
    "YourAccountDetails": "आपके खाते का विवरण",
    "OrganizationName": "संगठन का नाम",
    "AddDevelopers": "डेवलपर्स जोड़ें",
    "StartDevelopment": "विकास प्रारंभ करें",
    "CreateAndRunApplicationUsingStartupTemplate": "एबीपी कमर्शियल स्टार्टअप टेम्पलेट का उपयोग करके एक नया वेब एप्लिकेशन बनाना और चलाना सीखें।",
    "CommunityDescription2": "<span class=\"fw-6\">समुदाय.एबीपी.आईओ</span> एक ऐसी जगह है जहां लोग एबीपी से संबंधित लेख साझा कर सकते हैं। लेख, ट्यूटोरियल, कोड नमूने, केस अध्ययन खोजें और अपने जैसे ही लोगों से मिलें।",
    "UseABPSuiteExplanation": "मॉड्यूल और थीम के स्रोत-कोड को डाउनलोड करने के लिए एबीपी सुइट का उपयोग करें।",
    "ManageModulesWithSuite": "आप सुइट के साथ अपने एबीपी मॉड्यूल को भी प्रबंधित कर सकते हैं।",
    "LearnHowToInstallSuite": "जानें कि एबीपी सुइट को कैसे इंस्टॉल और उपयोग करें।",
    "SeeMore": "और देखें",
    "SeeLess": "कम देखें",
    "LayeredSolutionStructure": "स्तरित समाधान संरचना",
    "LayeredSolutionStructureExplanation": "समाधान को आपके व्यावसायिक तर्क को बुनियादी ढांचे और एकीकरण से अलग करने और कोड रखरखाव और पुन: प्रयोज्य को अधिकतम करने के लिए डोमेन संचालित डिज़ाइन सिद्धांतों और पैटर्न के आधार पर स्तरित किया गया है। एबीपी फ्रेमवर्क पहले से ही आपके एप्लिकेशन के लिए डीडीडी को सही मायने में लागू करने के लिए एब्स्ट्रैक्शन, बेस क्लास और गाइड प्रदान करता है।",
    "MultipleUIOptions": "एकाधिक यूआई विकल्प",
    "MultipleUIOptionsExplanation": "हमें यूजर इंटरफ़ेस बनाने के विभिन्न तरीके पसंद हैं। यह स्टार्टअप समाधान आपके व्यावसायिक एप्लिकेशन के लिए तीन अलग-अलग यूआई फ्रेमवर्क विकल्प प्रदान करता है।",
    "MultipleDatabaseOptions": "एकाधिक डेटाबेस विकल्प",
    "MultipleDatabaseOptionsExplanation": "आपके पास दो डेटाबेस प्रदाता विकल्प हैं (एक ही एप्लिकेशन में दोनों का उपयोग करने के अलावा)। किसी भी रिलेशनल डेटाबेस के साथ काम करने के लिए एंटिटी फ्रेमवर्क कोर का उपयोग करें और जब आपको बेहतर प्रदर्शन के लिए निम्न-स्तरीय क्वेरी लिखने की आवश्यकता हो तो वैकल्पिक रूप से डैपर का उपयोग करें। यदि आपको दस्तावेज़-आधारित NoSQL डेटाबेस का उपयोग करने की आवश्यकता है तो MongoDB एक अन्य विकल्प है। हालाँकि ये प्रदाता अच्छी तरह से एकीकृत, अमूर्त और पूर्व-कॉन्फ़िगर हैं, आप वास्तव में किसी भी डेटाबेस सिस्टम के साथ इंटरैक्ट कर सकते हैं जिसे आप .NET के साथ उपयोग कर सकते हैं।",
    "ModularArchitectureExplanation2": "ABP.IO प्लेटफॉर्म में मॉड्यूलैरिटी प्रथम श्रेणी का नागरिक है। सभी एप्लिकेशन कार्यात्मकताओं को अच्छी तरह से पृथक वैकल्पिक मॉड्यूल में विभाजित किया गया है। स्टार्टअप समाधान पहले से ही मूलभूत <a href=\"/modules\" class=\"text-primary\">एबीपी कमर्शियल मॉड्यूल</a> के साथ आता है। आप अपने स्वयं के एप्लिकेशन के लिए मॉड्यूलर सिस्टम बनाने के लिए अपने स्वयं के मॉड्यूल भी बना सकते हैं।",
    "MultiTenancyForSaasBusiness": "आपके SaaS व्यवसाय के लिए बहु-किरायेदारी",
    "MultiTenancyForSaasBusinessExplanation": "एबीपी कमर्शियल आपके SaaS (सॉफ्टवेयर-ए-ए-सर्विस) सिस्टम बनाने के लिए एक संपूर्ण, एंड-टू-एंड मल्टी-टेनेंसी सिस्टम प्रदान करता है। यह किरायेदारों को ऑन-द-फ्लाई डेटाबेस निर्माण और माइग्रेशन सिस्टम के साथ अपने स्वयं के डेटाबेस साझा करने या रखने की अनुमति देता है।",
    "MicroserviceStartupSolution": "माइक्रोसर्विस स्टार्टअप समाधान",
    "MicroserviceArchitectureExplanation2": "पूर्व-निर्मित आधार समाधान और आसुत अनुभव का लाभ उठाने के लिए आप इसे अपने अगले माइक्रोसर्विस सिस्टम के लिए प्राप्त कर सकते हैं।",
    "PreIntegratedTools": "लोकप्रिय उपकरणों के साथ पूर्व-एकीकृत",
    "PreIntegratedToolsExplanation": "समाधान पहले से ही उद्योग-मानक टूल और प्रौद्योगिकियों में एकीकृत है, जबकि आप उन्हें हमेशा बदल सकते हैं और अपने पसंदीदा टूल में एकीकृत कर सकते हैं।",
    "SingleSignOnAuthenticationServer": "एकल साइन-ऑन प्रमाणीकरण सर्वर",
    "SingleSignOnAuthenticationServerExplanation": "समाधान में एक प्रमाणीकरण सर्वर एप्लिकेशन है जिसका उपयोग अन्य एप्लिकेशन द्वारा एपीआई एक्सेस प्रबंधन सुविधाओं के साथ एकल साइन-ऑन सर्वर के रूप में किया जाता है। यह IdentityServer पर आधारित है।",
    "WebAppsWithGateways": "2 एपीआई गेटवे के साथ 2 वेब ऐप",
    "WebAppsWithGatewaysExplanation": "समाधान में दो वेब एप्लिकेशन शामिल हैं, प्रत्येक में एक समर्पित एपीआई गेटवे (बीएफएफ - बैकएंड फॉर फ्रंटएंड पैटर्न) है।",
    "BackOfficeApplication": "बैक ऑफिस आवेदन",
    "BackOfficeApplicationExplanation": "आपके सिस्टम का वास्तविक वेब एप्लिकेशन, कई यूआई फ्रेमवर्क विकल्पों के साथ। आप किसी भी प्रकार का बिजनेस एप्लिकेशन बना सकते हैं।",
    "LandingWebsite": "लैंडिंग वेबसाइट",
    "LandingWebsiteExplanation": "एक सामान्य लैंडिंग/सार्वजनिक वेबसाइट जिसका उपयोग कई उद्देश्यों के लिए किया जा सकता है, जैसे आपकी कंपनी का परिचय देना, आपके उत्पाद बेचना आदि।",
    "ABPFrameworkEBook": "एबीपी फ्रेमवर्क ई-बुक में महारत हासिल करना",
    "MasteringAbpFrameworkEBookDescription": "आपके एबीपी वाणिज्यिक लाइसेंस में शामिल है",
    "FullName": "पूरा नाम",
    "LicenseTypeNotCorrect": "लाइसेंस प्रकार सही नहीं है!",
    "Trainings": "प्रशिक्षण",
    "ChooseTrainingPlaceholder": "प्रशिक्षण चुनें...",
    "DoYouNeedTrainings": "क्या आपको इनमें से किसी एक प्रशिक्षण की आवश्यकता है?",
    "DoYouNeedTraining": "क्या आपको {0} प्रशिक्षण की आवश्यकता है?",
    "GetInTouchUs": "हमारे साथ जुड़े",
    "ForMoreInformationClickHere": "अधिक जानकारी के लिए <a href='{0}'>यहां क्लिक करें।</a>",
    "ForMoreInformationClickHereByClass": "<span class=\"{1}\">अधिक जानकारी के लिए</span> <a href='{0}'>यहां क्लिक करें।</a>",
    "IsGetOnboardingTraining": "क्या आप ऑनबोर्डिंग और वेब एप्लिकेशन डेवलपमेंट प्रशिक्षण प्राप्त करना चाहेंगे?",
    "OnboardingWebApplicationDevelopmentTrainingMessage": "अपना प्रशिक्षण कैलेंडर शेड्यूल करने के लिए, संगठन बनाने के बाद कृपया {0} से संपर्क करें",
    "CustomPurchaseMessage": "अगले चरण के लिए, हमसे संपर्क करने के लिए {0} पर क्लिक करें।",
    "Note": "टिप्पणी",
    "AdditionalNote": "अतिरिक्त नोट",
    "OnboardingTrainingFaqTitle": "क्या आपके पास एबीपी ऑनबोर्डिंग प्रशिक्षण है?",
    "OnboardingTrainingFaqExplanation": "हां, आपके एबीपी प्रोजेक्ट को तेजी से शुरू करने में आपकी मदद करने के लिए हमारे पास एबीपी प्रशिक्षण सेवाएं हैं। आप ABP कोर टीम के सदस्य से ABP के बारे में जानेंगे और आपको अपना ABP प्रोजेक्ट शुरू करने का कौशल प्राप्त होगा। ऑनबोर्डिंग प्रशिक्षण में, हम समझाएंगे कि अपने विकास के माहौल को कैसे स्थापित करें, आवश्यक उपकरण कैसे स्थापित करें, पूरी तरह कार्यात्मक CRUD पेज कैसे बनाएं। प्रशिक्षण लाइव होगा और जूम एप्लिकेशन का उपयोग किया जाएगा, और हम अन्य ऑनलाइन मीटिंग प्लेटफॉर्म का उपयोग करने के लिए तैयार हैं। प्रशिक्षण की भाषा अंग्रेजी होगी। आप सत्रों के दौरान ABP के बारे में अपने प्रश्न भी पूछ सकते हैं। दोनों पक्षों के लिए एक सुविधाजनक समय और तारीख की योजना बनाई जाएगी। अधिक जानकारी प्राप्त करने के लिए, <a href=\"mailto:info@abp.io\">info@abp.io</a> पर हमसे संपर्क करें।",
    "AddBasket": "टोकरी में जोड़ें",
    "SendTrainingRequest": "प्रशिक्षण अनुरोध भेजें",
    "OnlyEnglishVersionOfThisDocumentIsTheRecentAndValid": "* इस दस्तावेज़ का अंग्रेजी संस्करण सबसे अद्यतित है, और किसी भी विवाद में अंग्रेजी संस्करण ही मान्य होगा।",
    "Pricing_Page_Title": "मूल्य निर्धारण और योजनाएँ",
    "Pricing_Page_Description": "वे सुविधाएँ और कार्यक्षमता चुनें जिनकी आज आपके व्यवसाय को आवश्यकता है। एबीपी कमर्शियल लाइसेंस खरीदें और असीमित प्रोजेक्ट बनाएं।",
    "Pricing_Page_HurryUp": "जल्दी करो!",
    "Pricing_Page_BuyLicense": "16 जनवरी तक <strong>2021 की कीमतों</strong> पर लाइसेंस खरीदें!",
    "Pricing_Page_ValidForExistingCustomers": "मौजूदा ग्राहकों और लाइसेंस नवीनीकरण के लिए भी मान्य है।",
    "Pricing_Page_Hint1": "लाइसेंस मूल्य में एक निश्चित संख्या में डेवलपर सीटें शामिल हैं। यदि आपके पास अधिक डेवलपर हैं, तो आप हमेशा अतिरिक्त सीटें खरीद सकते हैं।",
    "Pricing_Page_Hint2": "आप अभी या भविष्य में और अधिक डेवलपर लाइसेंस खरीद सकते हैं। लाइसेंस सीट-आधारित होते हैं, इसलिए आप एक सीट को एक डेवलपर से दूसरे डेवलपर को स्थानांतरित कर सकते हैं।",
    "Pricing_Page_Hint3": "आप अपने लाइसेंस के साथ विभिन्न उत्पादों की असीमित संख्या विकसित कर सकते हैं।",
    "Pricing_Page_Hint4": "एबीपी सुइट आपकी उत्पादकता में सुधार के लिए आपके विकास में सहायता करने वाला एक उपकरण है। यह CRUD पेज बनाने और नए प्रोजेक्ट बनाने का समर्थन करता है।",
    "Pricing_Page_Hint5": "आप अपने एप्लिकेशन में सभी पूर्व-निर्मित मॉड्यूल का उपयोग कर सकते हैं।",
    "Pricing_Page_Hint6": "आप अपने एप्लिकेशन में सभी पूर्व-निर्मित थीम का उपयोग कर सकते हैं।",
    "Pricing_Page_Hint7": "स्टार्टअप टेम्प्लेट आपके प्रोजेक्ट को तुरंत शुरू करने के लिए एक विज़ुअल स्टूडियो समाधान है। सभी मूलभूत मॉड्यूल आपके लिए जोड़े और पूर्व-कॉन्फ़िगर किए गए हैं।",
    "Pricing_Page_Hint8": "मास्टरिंग एबीपी फ्रेमवर्क ई-बुक बताती है कि सर्वोत्तम प्रथाओं के साथ .NET समाधान कैसे लागू करें। यह Amazon.com पर बेचा जाता है, और आप अपने लाइसेंस के साथ पुस्तक को निःशुल्क डाउनलोड कर सकते हैं।",
    "Pricing_Page_Hint9": "आप किसी भी मॉड्यूल का सोर्स-कोड डाउनलोड कर सकते हैं। हो सकता है कि आप आमूलचूल परिवर्तन करने के लिए अपने समाधान में स्रोत कोड जोड़ना चाहें या सुरक्षा कारणों से इसे केवल अपने पास रखना चाहें।",
    "Pricing_Page_Hint10": "लाइसेंस जीवन भर के लिए होते हैं। इसका मतलब है कि आप अपने एप्लिकेशन को हमेशा के लिए विकसित करना जारी रख सकते हैं। नवीनतम संस्करण तक पहुंच और समर्थन प्राप्त करना लाइसेंस अवधि (1 वर्ष जब तक आप इसे नवीनीकृत नहीं करते) के भीतर प्रदान किया जाता है।",
    "Pricing_Page_Hint11": "तैनाती पर कोई प्रतिबंध नहीं! आप क्लाउड सेवाओं या ऑन-प्रिमाइसेस सहित, जितने चाहें उतने सर्वर पर तैनात कर सकते हैं।",
    "Pricing_Page_Hint12": "आप अपनी सक्रिय लाइसेंस अवधि के भीतर मॉड्यूल, थीम और टूल को नवीनतम संस्करण में अपडेट कर सकते हैं। आपका लाइसेंस समाप्त होने के बाद, आपको बग फिक्स, नई सुविधाओं और संवर्द्धन के लिए अपडेट प्राप्त करना जारी रखने के लिए इसे नवीनीकृत करना होगा।",
    "Pricing_Page_Hint13": "आप एक वर्ष के लिए प्रीमियम सहायता प्राप्त कर सकते हैं (इसे बढ़ाने के लिए आप अपने लाइसेंस को नवीनीकृत कर सकते हैं)।",
    "Pricing_Page_Hint14": "टीम और व्यवसाय लाइसेंस में घटना/प्रश्न संख्या की सीमा होती है। यदि आप अतिरिक्त डेवलपर लाइसेंस खरीदते हैं, तो आपकी घटना सीमा प्रति डेवलपर {0} (टीम लाइसेंस के लिए) या {1} (बिजनेस लाइसेंस के लिए) बढ़ जाती है।",
    "Pricing_Page_Hint15": "केवल एंटरप्राइज़ लाइसेंस में निजी समर्थन शामिल है। आप सीधे एबीपी टीम को एक ई-मेल भेज सकते हैं या निजी टिकट विकल्प के साथ support.abp.io पर प्रश्न पूछ सकते हैं। निजी टिकट जनता को दिखाई नहीं देते हैं।",
    "Pricing_Page_Hint16": "आप सभी एबीपी थीम का सोर्स-कोड डाउनलोड कर सकते हैं। हो सकता है कि आप आमूलचूल परिवर्तन करने के लिए अपने समाधान में स्रोत कोड जोड़ना चाहें या सुरक्षा कारणों से इसे केवल अपने पास रखना चाहें।",
    "Pricing_Page_Testimonial_1": "एबीपी कमर्शियल ने एससी वेंचर्स को कई एकीकृत एंकरों से महत्वपूर्ण मूल्य चालानों के प्राप्य खातों / देय खातों की आपूर्ति श्रृंखला वित्तपोषण का समर्थन करने के लिए 9 महीनों में एक बैंक-ग्रेड मल्टी-टेनेंट साइलो-डेटाबेस SaaS प्लेटफ़ॉर्म देने की अनुमति दी। एबीपी की मॉड्यूलरिटी ने टीम के लिए रिकॉर्ड समय में डिलीवरी करना, सभी वीएपीटी को पास करना और पूर्ण सीआई/सीडी और पाइपलाइनों के माध्यम से कंटेनरीकृत माइक्रोसर्विसेज स्टैक को उत्पादन में तैनात करना संभव बना दिया।",
    "Pricing_Page_Testimonial_2": "हम कस्टम विकास परियोजनाओं के ओवरहेड को कम करने के लिए एबीपी कमर्शियल का उपयोग करने का महत्व देखते हैं। टीम विभिन्न प्रोजेक्ट स्ट्रीम में कोड पैटर्न को एकीकृत करने में सक्षम है। हम पहले की तुलना में नई सुविधाओं को तेजी से बनाने के लिए ढांचे में अधिक संभावनाएं देखते हैं। हमें विश्वास है कि हम एबीपी कमर्शियल का लाभ उठाने के मूल्य को लगातार देखते रहेंगे।",
    "Pricing_Page_Testimonial_3": "हम एबीपी से प्यार करते हैं। हमें सब कुछ शुरू से लिखने की ज़रूरत नहीं है। हम आउट-ऑफ़-द-बॉक्स सुविधाओं से शुरुआत करते हैं और केवल उस पर ध्यान केंद्रित करते हैं जो हमें वास्तव में लिखने की ज़रूरत है। इसके अलावा, एबीपी अच्छी तरह से व्यवस्थित है और कोड कम बग के साथ उच्च गुणवत्ता वाला है। अगर हमें अपनी ज़रूरत की हर चीज़ खुद ही लिखनी पड़े, तो हमें कई साल लग सकते हैं। एक और चीज़ जो हमें पसंद है वह यह है कि नया संस्करण, समस्या समाधान या सुधार हर दूसरे सप्ताह बहुत जल्द सामने आता है। हम बहुत लंबा इंतजार नहीं करते.",
    "Pricing_Page_Testimonial_4": "एबीपी कमर्शियल एक शानदार उत्पाद है जिसकी अनुशंसा की जाएगी। हमारे ग्राहकों के लिए एक ही विन्यास योग्य मंच पर विपणन हेतु वाणिज्यिक उत्पाद। छलांग इस बात से शुरू होती है कि किसी भी टीम को जो ढाँचा और टूलींग प्रदान की जाती है वह एक-एक प्रतिशत के लायक है। एबीपी कमर्शियल हमारी जरूरतों के लिए सबसे उपयुक्त था।",
    "Pricing_Page_Testimonial_5": "एबीपी फ्रेमवर्क न केवल एक ढांचा है, बल्कि यह परियोजना विकास/प्रबंधन के लिए एक मार्गदर्शिका भी है, क्योंकि यह डीडीडी, जेनेरिक रिपोजिटरी, डीआई, माइक्रोसर्विस और मॉड्यूलरिटी प्रशिक्षण प्रदान करता है। यहां तक कि अगर आप स्वयं फ्रेमवर्क का उपयोग नहीं करने जा रहे हैं, तो आप docs.abp.io के साथ खुद को विकसित कर सकते हैं जो अच्छी तरह से और पेशेवर रूप से तैयार है (OpenIddict, Redis, Quartz आदि)। क्योंकि कई चीजें पहले से निर्मित होती हैं, यह परियोजना के विकास के समय को काफी कम कर देता है (जैसे लॉगिन पेज, अपवाद हैंडलिंग, डेटा फ़िल्टरिंग, सीडिंग, ऑडिट लॉगिंग, स्थानीयकरण, ऑटो एपीआई नियंत्रक आदि)। हमारे एप्लिकेशन के एक उदाहरण के रूप में, मैंने स्टॉक नियंत्रण के लिए लोकल इवेंट बस का उपयोग किया है। इसलिए, मैं स्टॉक हैंडलर लिखकर ऑर्डर मूवमेंट को प्रबंधित करने में सक्षम हूं। क्रिएशनटाइम, क्रिएटरआईडी के लिए समय न गंवाना अद्भुत है। वे स्वचालित रूप से भरे जा रहे हैं।",
    "Pricing_Page_Testimonial_6": "एबीपी फ्रेमवर्क एक अच्छा फ्रेमवर्क है लेकिन इसे उपयोग की जाने वाली विभिन्न परतों, कक्षाओं और पुस्तकालयों (विशेषकर एबीपी) को समझने के लिए समय की आवश्यकता होती है। मैंने कोड बेस को पढ़ने में बहुत समय बिताया, लेकिन एबीपी कमर्शियल ने प्रोजेक्ट स्पेशलिटी एंटिटीज (एआर) और उनमें से प्रत्येक से जुड़ी रिपॉजिटरी बनाने में हमारा समय बचाया। मुझे यह भी पसंद आया कि एबीपी में इस्तेमाल किया जाने वाला दृष्टिकोण बहुत परिपक्व है; हम जानते हैं कि यह DDD और मोनोलिथ पर आधारित है।",
    "Pricing_Page_Testimonial_7": "एक स्टार्टअप के रूप में, हमें तेजी से पुनरावृत्ति करने और बॉयलरप्लेट और गैर-मुख्य सुविधाओं पर न्यूनतम समय खर्च करने की आवश्यकता है। \n हमारे इंजीनियरों में अत्यधिक अनुभवी से लेकर जूनियर इंजीनियर तक शामिल हैं, और हमें तकनीकी और डोमेन ज्ञान साझा करने के लिए एक सामान्य समझ और एक तरीके की आवश्यकता थी, एबीपी ने हमें उनके महान मार्गदर्शकों और दस्तावेज़ीकरण के कारण ऐसा करने की अनुमति दी। \n ऐसी कुछ चीज़ें हैं जिनके बारे में हमें चिंता करने की ज़रूरत नहीं है क्योंकि वे एबीपी के साथ लीक से हटकर काम करती हैं। \n ABP ने फीचर की शुरुआत से लेकर उत्पादन तक 4 सप्ताह से भी कम समय में हमें तेजी से प्रोटोटाइप और विकास को सुव्यवस्थित करने में मदद की। लाइसेंस में शामिल अपनी सभी प्रीमियम सुविधाओं के साथ, एबीपी ने हमें सॉफ्टवेयर इंजीनियरिंग पक्ष पर &quot;स्टार्टअप इन ए बॉक्स&quot; दिया है।",
    "Pricing_Page_Testimonial_8": "मैं उन सभी को एबीपी विज्ञापन की अनुशंसा करूंगा जो अपने ग्राहकों के लिए उपलब्ध उत्पादों की श्रृंखला का विस्तार करना चाहते हैं। वितरित एंटरप्राइज़ वातावरण (एंगुलर, डब्ल्यूपीएफ, विन और लिनक्स) का उपयोग करने की आवश्यकता होने पर यह शानदार है। उनके उत्पादों के अलावा, हमें उनका समर्थन पसंद है, जो हमारे काम को तेज़ और आसान बनाता है। हम पहले से ही जानते हैं कि हमें भविष्य के लिए एक बेहतरीन साझेदार मिल गया है जो हमारे व्यवसाय को बढ़ाने में हमारा समर्थन करेगा।",
    "Pricing_Page_Testimonial_9": "हम 2 कर्मचारियों की एक कंपनी हैं जो 20 वर्षों से अधिक समय से व्यवसाय में है। \n एबीपी कमर्शियल के साथ हमारे अनुभव के संदर्भ में, हमसे एक ग्राहक ने संपर्क किया था जिसने अनुरोध किया था कि हम उनके 25-वर्षीय एक्सेस एप्लिकेशन को बदलने के लिए आधुनिक वातावरण में एक नया मानव संसाधन एप्लिकेशन विकसित करें। हमने डेस्कटॉप समाधान से वेब-आधारित समाधान में परिवर्तन करने का निर्णय लिया। \n \n उस समय, हमें वेब एप्लिकेशन और .NET के बारे में बहुत कम जानकारी थी, लेकिन हमारी नजर एबीपी कमर्शियल पर पड़ी और एबीपी फ्रेमवर्क, तकनीकी दस्तावेज़ीकरण और एबीपी सुइट की मदद से हम न केवल एप्लिकेशन विकसित करने में सक्षम हुए। क्लाइंट की विशिष्टताएँ लेकिन एक वर्ष के भीतर .NET वातावरण में भी सफलतापूर्वक काम करती हैं।",
    "AbpBookDownloadArea_ClaimYourEBook": "अपनी <span class='gradient-framework'>मास्टरिंग एबीपी फ्रेमवर्क</span> ई-बुक का दावा करें",
    "AddMemberModal_Warning_1": "यदि आप जिस <strong>उपयोगकर्ता नाम को</strong> जोड़ने का प्रयास कर रहे हैं वह सिस्टम में मौजूद नहीं है, तो कृपया अपने टीम के सदस्य को <a href='{0}/Account/Register'>{0}</a> पर पंजीकरण करने और अपने खाते का उपयोगकर्ता नाम आपके साथ साझा करने के लिए कहें।",
    "MyOrganizations_Detail_WelcomeMessage": "आपके संगठन में आपका स्वागत है, {0}",
    "MyOrganizations_Detail_OrganizationManagement": "संगठन का <span class=\"gradient-commercial\">प्रबंधन</span>",
    "OrganizationDisplayName": "संगठन का प्रदर्शन नाम",
    "MyOrganizations_Detail_EditDisplayName": "प्रदर्शन नाम संपादित करें",
    "MyOrganizations_Detail_UpgradeYourLicense": "अपना लाइसेंस अपग्रेड करें",
    "MyOrganizations_Detail_LicenseStartAndExpiryDate": "लाइसेंस प्रारंभ तिथि - समाप्ति तिथि",
    "MyOrganizations_Detail_OwnerRightInfo": "आप अपने {1} स्वामियों के अधिकारों में से {0} का उपयोग कर रहे हैं।",
    "MyOrganizations_Detail_CopyApiKey": "कुंजी की प्रतिलिपि बनाएँ",
    "MyOrganizations_Detail_ApiKeyDescription": "एपीआई कुंजी <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{1} पर होस्ट किए गए PRO पैकेज का टोकन है।</a>",
    "MyOrganizations_Detail_YourPrivateNugetSource": "आपका निजी NuGet स्रोत <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{0}</a> है",
    "MyOrganizations_Detail_PrivateNugetSourceWarning": "यह स्वचालित रूप से आपके ABP समाधान में आपके NuGet.Config में फ़ीड के रूप में जोड़ा जाता है। अपनी निजी कुंजी अनधिकृत उपयोगकर्ताओं के साथ साझा न करें!",
    "MyOrganizations_Detail_DeveloperSeatInfo": "आप अपनी {1} डेवलपर सीटों में से {0} का उपयोग कर रहे हैं।",
    "NeedMoreSeatsForYourTeam": "क्या आपको अपनी टीम के लिए अधिक सीटों की आवश्यकता है?",
    "MyOrganizations_Detail_PricePerYear": "{0} / प्रति वर्ष",
    "MyOrganizations_Detail_PurchaseDeveloperSeats": "डेवलपर सीटें खरीदें",
    "Invoices": "चालान",
    "RequestInvoice": "इनवॉयस के लिए अनुरोध करो",
    "OrderNumber": "क्रम संख्या",
    "Date": "तारीख",
    "Products": "उत्पादों",
    "TotalPrice": "कुल कीमत",
    "ThereIsNoInvoice": "कोई चालान नहीं है",
    "MyOrganizations_Detail_PaymentProviderInfo": "यदि आपने अपना लाइसेंस <i>{0}</i> गेटवे के माध्यम से खरीदा है, तो यह आपके ईमेल पते पर पीडीएफ चालान भेजता है, <a href=\"{1}\" target=\"_blank\">{0} चालान देखें।</a>",
    "MyOrganizations_Detail_PayUInfo": "यदि आपने <i>इज़िको</i> गेटवे के माध्यम से खरीदारी की है, तो &quot;अनुरोध चालान&quot; बटन पर क्लिक करें और बिलिंग जानकारी भरें।",
    "MyOrganizations_Detail_ConclusionInfo": "आपका चालान अनुरोध {0} व्यावसायिक दिनों के भीतर पूरा हो जाएगा।",
    "ExtendYourLicense": "अपना <span class=\"text-primary\">{0}</span> लाइसेंस बढ़ाएं",
    "Continue": "जारी रखना",
    "PurchaseLicense": "खरीदें {0} लाइसेंस",
    "DownloadInvoiceModal_DownloadInvoice": "इनवाइस को डाउनलोड करो",
    "DownloadInvoiceModal_SaveInformationOnlyOnce": "आप अपनी बिलिंग जानकारी केवल एक बार सहेज सकते हैं।",
    "InvoiceModal_EnterCompanyName": "अपनी कानूनी कंपनी का नाम दर्ज करें...",
    "InvoiceModal_EnterCompanyAddress": "अपनी कानूनी कंपनी का पता दर्ज करें...",
    "InvoiceModal_EnterTaxNumber": "यदि उपलब्ध हो तो अपना टैक्स/वैट नंबर दर्ज करें...",
    "RequestInvoiceModal_EnterNotes": "अपने चालान के बारे में अपना अतिरिक्त संदेश दर्ज करें...",
    "PrePayment_PayWithIyzico": "आप इज़िको से भुगतान करेंगे",
    "ContinueToCheckout": "चेकआउट करना जारी रखें",
    "PrePayment_IyzicoRedirectionInfo": "अपनी खरीदारी सुरक्षित रूप से पूरी करने के लिए आपको इज़िको पेमेंट गेटवे पर पुनः निर्देशित किया जाएगा।",
    "PrePayment_IyzicoAcceptVisaAndMasterCard": "इज़िको वीज़ा और मास्टरकार्ड स्वीकार करता है।",
    "Purchase": "खरीदना",
    "AcceptTermsAndConditions": "मैंने <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">गोपनीयता नीति</a> , <a href=\"{1}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">नियम एवं शर्तें</a> और <a href=\"{2}\" target=\"_blank\" class=\"text-primary\">EULA को पढ़, समझ लिया है और स्वीकार कर लिया है।</a>",
    "AcceptTermsAndConditionsWarningMessage": "कृपया गोपनीयता नीति और नियम एवं शर्तें स्वीकार करें",
    "SelectGatewayToContinue": "जारी रखने के लिए कृपया एक गेटवे चुनें!",
    "GatewaySelection_SelectGateway": "एक भुगतान गेटवे चुनें",
    "GatewaySelection_RedirectionMessage": "इसके बाद, आपको लेनदेन के लिए चयनित भुगतान गेटवे की वेबसाइट पर पुनः निर्देशित किया जाएगा।",
    "PaymentSucceed_PaymentSuccessMessage": "भुगतान सफल",
    "PaymentSucceed_ThanksForPurchase": "आपकी खरीद के लिए आपको धन्यवाद!",
    "PaymentSucceed_CreateYourOrganization": "अपना संगठन बनाएं",
    "PaymentSucceed_AddMeAsDeveloper": "मैं भी एक डेवलपर हूं, मुझे अपने संगठन में डेवलपर के रूप में जोड़ें।",
    "PaymentSucceed_CreateOrganization": "संगठन बनाएं",
    "PaymentSucceed_OrganizationDescription": "एक संगठन में डेवलपर्स और मालिक शामिल होते हैं। डेवलपर वे उपयोगकर्ता हैं जो एबीपी प्रोजेक्ट पर कोड लिखते हैं और उन्हें <a href=\"{0}\" target=\"_blank\">{1}</a> वेबसाइट से लाभ होगा। मालिक वे उपयोगकर्ता होते हैं जो डेवलपर सीटें आवंटित करते हैं और लाइसेंसिंग का प्रबंधन करते हैं।",
    "PaymentSucceed_ViewOrganization": "संगठन देखने के लिए यहां क्लिक करें",
    "Purchase_TotalAnnualPrice": "कुल <small class=\"opacity-50\">(वार्षिक शुल्क)</small>",
    "Purchase_TrainingPrice": "प्रशिक्षण मूल्य",
    "Purchase_OnboardingTraining": "ऑनबोर्डिंग और वेब एप्लिकेशन डेवलपमेंट लाइव प्रशिक्षण",
    "TotalDeveloperPrice": "कुल डेवलपर मूल्य",
    "Purchase_PricePerDeveloper": "<span>{0} {1}</span> प्रति डेवलपर",
    "Purchase_IncludedDeveloperInfo": "{0} {1} शामिल।",
    "Purchase_LicenseExtraDeveloperPurchaseMessage": "<span class=\"fw-bold\">{0} लाइसेंस</span> में {1} डेवलपर्स शामिल हैं। आप अतिरिक्त डेवलपर्स जोड़ सकते हैं.",
    "StartupTemplates_Page_Title": "एबीपी स्टार्टअप टेम्पलेट्स",
    "StartupTemplates_Page_Description": "एबीपी कमर्शियल आपको किसी भी स्तर की जटिलता के साथ समाधान बनाने की अनुमति देता है। यह दो मुख्य पूर्व-निर्मित स्टार्टअप समाधान प्रदान करता है। आप अपनी आवश्यकताओं के अनुरूप समाधान चुन सकते हैं और उसके ऊपर अपना स्वयं का कस्टम समाधान बना सकते हैं।",
    "MicroserviceStartupSolutionForDotnet": ".NET के लिए माइक्रोसर्विस स्टार्टअप समाधान",
    "MonolithSolutionForDotnet": ".NET के लिए मोनोलिथ (मॉड्यूलर) समाधान",
    "TrainingDetailsHeaderInfo_TrainingHour": "{0} घंटा",
    "Trainings_Content": "प्रशिक्षण की सामग्री",
    "Trial_Page_StartYourFreeTrial": "अपना <span class=\"gradient-commercial\">नि: शुल्क परीक्षण</span> शुरू करो",
    "TrialLicenseFeatures": "आप सभी एबीपी वाणिज्यिक सुविधाओं से लाभ उठा सकेंगे",
    "TrialPeriodDays": "आपके पास {0} दिन का टीम लाइसेंस होगा",
    "TrialForumSupportIncident": "आपके पास {0} फ़ोरम समर्थन घटनाएं होंगी",
    "Contact_Page_Title": "एबीपी डेवलपमेंट टीम से संपर्क करें",
    "Contact_Page_Description": "यदि आपको किसी सहायता की आवश्यकता हो या अपने विचार और राय साझा करने के लिए एबीपी डेवलपमेंट टीम से संपर्क करें! एबीपी सपोर्ट टीम मदद के लिए तैयार है.",
    "Demo_Page_Title": "एक डेमो बनाएं",
    "Demo_Page_Description": "एबीपी कमर्शियल स्टार्टअप टेम्पलेट का उपयोग करके बनाए गए नमूना एप्लिकेशन को देखने के लिए एक निःशुल्क डेमो बनाएं। सामान्य अनुप्रयोग आवश्यकताओं के लिए स्वयं को न दोहराएँ।",
    "Discounted_Page_Title": "रियायती मूल्य निर्धारण",
    "Discounted_Page_Description": "वे सुविधाएँ और कार्यक्षमता चुनें जिनकी आज आपके व्यवसाय को आवश्यकता है। एबीपी कमर्शियल लाइसेंस खरीदें और असीमित प्रोजेक्ट बनाएं",
    "Faq_Page_Title": "अक्सर पूछे जाने वाले प्रश्न (FAQ)",
    "Faq_Page_Description": "क्या आपका कोई प्रश्न है? अक्सर पूछे जाने वाले प्रश्न खोजें या संपर्क फ़ॉर्म का उपयोग करके हमसे प्रश्न पूछें।",
    "Faq_Page_SwiftCode": "स्विफ्ट कोड",
    "Faq_Page_BankName": "बैंक का नाम",
    "Faq_Page_AccountName": "खाता नाम",
    "Faq_Page_AccountNumber": "खाता संख्या",
    "Faq_Page_Currency": "मुद्रा",
    "Faq_Page_VatNumber": "वैट संख्या",
    "Faq_Page_OtherCurrenciesInfo": "अन्य मुद्राओं के लिए, <a href='{0}'>सभी खाते</a> देखें",
    "ProjectCreatedSuccess_Page_Title": "आपका प्रोजेक्ट बनाया गया",
    "ProjectCreatedSuccess_Page_Description": "आपका ABP प्रोजेक्ट सफलतापूर्वक बन गया!",
    "Suite_Page_Title": "एबीपी सुइट",
    "Suite_Page_Description": "एबीपी कमर्शियल डेवलपर उत्पादकता बढ़ाने के लिए तीव्र एप्लिकेशन डेवलपमेंट टूलिंग प्रदान करता है। एबीपी सुइट आपको आसानी से सीआरयूडी पेज बनाने की अनुमति देता है।",
    "Themes_Page_Title": "एबीपी थीम्स",
    "Themes_Page_Description": "एबीपी कमर्शियल कई पेशेवर, आधुनिक यूआई थीम प्रदान करता है। यूआई कैसा दिखता है इसका त्वरित अवलोकन करने के लिए एक निःशुल्क डेमो बनाएं।",
    "Tools_Page_Title": "तीव्र अनुप्रयोग विकास उपकरण",
    "Tools_Page_Description": "एबीपी कमर्शियल डेवलपर उत्पादकता बढ़ाने के लिए तीव्र एप्लिकेशन डेवलपमेंट टूलिंग प्रदान करता है। एबीपी सुइट आपको आसानी से सीआरयूडी पेज बनाने की अनुमति देता है।",
    "DeveloperPrice": "डेवलपर कीमत",
    "AdditionalDeveloperPaymentInfoSection_AdditionalDevelopers": "{0} <small>डेवलपर्स</small>",
    "LicenseRemainingDays": "<span>{0}</span> दिनों के लिए",
    "ExtendPaymentInfoSection_Description": "आपके लाइसेंस का विस्तार/नवीनीकरण करने पर आपको <a href=\"{0}\" target=\"_blank\">प्रीमियम सहायता</a> मिलती रहेगी। आप मॉड्यूल और थीम के लिए बड़े या छोटे अपडेट भी प्राप्त कर सकेंगे। आप नये प्रोजेक्ट बनाना जारी रख सकेंगे। और आप अभी भी <a href=\"{1}\" target=\"_blank\">एबीपी सुइट का</a> उपयोग कर पाएंगे जो आपके विकास को गति देता है।",
    "LicenseRenewalPrice": "लाइसेंस नवीनीकरण मूल्य",
    "LicensePrice": "लाइसेंस मूल्य",
    "TrialLicensePaymentInfoSection_Description": "<strong>लाइसेंस खरीदें:</strong> लाइसेंस खरीदने पर आपको <a href=\"{0}\" target=\"_blank\" rel=\"noopener\">प्रीमियम सहायता</a> मिलती रहेगी। आप मॉड्यूल और थीम के लिए बड़े या छोटे अपडेट भी प्राप्त कर सकेंगे। आप नये प्रोजेक्ट बनाना जारी रख सकेंगे। और आप अभी भी <a href=\"{1}\" target=\"_blank\" rel=\"noopener\">एबीपी सुइट का</a> उपयोग कर पाएंगे जो आपके विकास को गति देता है।<br> लाइसेंस प्रकारों के बीच अंतर जांचने के लिए <a href=\"{2}\" target=\"_blank\" rel=\"noopener\">लाइसेंस तुलना तालिका</a> देखें।",
    "SelectTargetLicense": "लक्ष्य लाइसेंस चुनें",
    "UpgradePaymentInfoSection_ExtendMyLicenseForOneYear": "हां, मेरे लाइसेंस की समाप्ति तिथि 1 वर्ष के लिए बढ़ा दें।",
    "UpgradePaymentInfoSection_WantToExtendLicense": "क्या आप अपना लाइसेंस 1 वर्ष के लिए और बढ़ाना चाहते हैं?",
    "UpgradePaymentInfoSection_UpgradingWillNotExtendLicense": "अपग्रेड करने से आपके लाइसेंस की समाप्ति तिथि नहीं बढ़ेगी!",
    "UpgradePaymentInfoSection_LicenseUpgradeDescription": "आपके लाइसेंस को अपग्रेड करके, आपको एक उच्च लाइसेंस प्रकार में पदोन्नत किया जाएगा, जिससे आपको अतिरिक्त लाभ प्राप्त हो सकेंगे। लाइसेंस प्रकारों के बीच अंतर जांचने के लिए <a href=\"/Pricing\" target=\"_blank\">लाइसेंस तुलना तालिका</a> देखें।",
    "Landing_Page_CustomerStories": "ग्राहक कहानियाँ",
    "Landing_Page_OurGreatCustomers": "हमारे महान ग्राहक",
    "Landing_Page_WebApplicationFramework": "वेब एप्लीकेशन फ्रेमवर्क",
    "Landing_Page_WebDevelopmentPlatform": "वेब विकास मंच",
    "Landing_Page_CompleteWebDevelopmentPlatform": "संपूर्ण वेब विकास प्लेटफ़ॉर्म",
    "Landing_Page_TryFreeDemo": "निःशुल्क डेमो आज़माएँ",
    "Landing_Page_StartingPointForWebApplications": "ASP.NET कोर आधारित वेब अनुप्रयोगों के लिए प्रारंभिक बिंदु! यह सर्वोत्तम वेब विकास के लिए एबीपी फ्रेमवर्क पर आधारित है।",
    "Landing_Page_AbpProvidesSoftwareInfrastructure": "एबीपी फ्रेमवर्क सर्वोत्तम प्रथाओं के साथ उत्कृष्ट वेब एप्लिकेशन विकसित करने के लिए एक सॉफ्टवेयर बुनियादी ढांचा प्रदान करता है।",
    "Landing_Page_MicroserviceCompatibleArchitecture": "माइक्रोसर्विस संगत आर्किटेक्चर",
    "Landing_Page_PreBuiltApplicationModulesAndThemes": "पूर्व-निर्मित एप्लिकेशन मॉड्यूल और थीम",
    "Landing_Page_MultiTenantArchitecture": "बहु-किरायेदार वास्तुकला",
    "Landing_Page_MultiTenancyDescription": "SaaS एप्लिकेशन आसान हो गए! डेटाबेस से यूआई तक एकीकृत बहु-किरायेदारी।",
    "Landing_Page_DDDIntroduction": "डीडीडी पैटर्न और सिद्धांतों के आधार पर डिजाइन और विकसित किया गया। आपके एप्लिकेशन के लिए एक स्तरित मॉडल प्रदान करता है।",
    "Landing_Page_CrossCuttingConcernsInfo": "प्राधिकरण, सत्यापन, अपवाद प्रबंधन, कैशिंग, ऑडिट लॉगिंग, लेनदेन प्रबंधन और अधिक के लिए संपूर्ण बुनियादी ढांचा।",
    "Landing_Page_PreBuiltApplicationModules": "पूर्व-निर्मित एप्लिकेशन मॉड्यूल जिसमें अधिकांश सामान्य वेब एप्लिकेशन आवश्यकताएं शामिल हैं।",
    "Landing_Page_ChatModule": "बात करना",
    "Landing_Page_DocsModule": "डॉक्स",
    "Landing_Page_FileManagementModule": "फ़ाइल प्रबंधन",
    "Landing_Page_CustomerStory_1": "एबीपी कमर्शियल ने एससी वेंचर्स को कई एकीकृत एंकरों से महत्वपूर्ण मूल्य चालानों के प्राप्य खातों / देय खातों की आपूर्ति श्रृंखला वित्तपोषण का समर्थन करने के लिए 9 महीनों में एक बैंक-ग्रेड मल्टी-टेनेंट साइलो-डेटाबेस SaaS प्लेटफ़ॉर्म देने की अनुमति दी। एबीपी की मॉड्यूलरिटी ने टीम के लिए रिकॉर्ड समय में डिलीवरी करना, सभी वीएपीटी को पास करना और पूर्ण सीआई/सीडी और पाइपलाइनों के माध्यम से कंटेनरीकृत माइक्रोसर्विसेज स्टैक को उत्पादन में तैनात करना संभव बना दिया।",
    "Landing_Page_CustomerStory_2": "हम कस्टम विकास परियोजनाओं के ओवरहेड को कम करने के लिए एबीपी कमर्शियल का उपयोग करने का महत्व देखते हैं। टीम विभिन्न प्रोजेक्ट स्ट्रीम में कोड पैटर्न को एकीकृत कर सकती है। हम पहले की तुलना में नई सुविधाओं को तेजी से बनाने के लिए ढांचे में अधिक संभावनाएं देखते हैं। हमें विश्वास है कि हम एबीपी कमर्शियल का लाभ उठाने के मूल्य को लगातार देखते रहेंगे।",
    "Landing_Page_CustomerStory_3": "हम एबीपी से प्यार करते हैं। हमें सब कुछ शुरू से लिखने की ज़रूरत नहीं है। हम आउट-ऑफ़-द-बॉक्स सुविधाओं से शुरुआत करते हैं और केवल उस पर ध्यान केंद्रित करते हैं जो हमें वास्तव में लिखने की ज़रूरत है। इसके अलावा, एबीपी अच्छी तरह से व्यवस्थित है और कोड कम बग के साथ उच्च गुणवत्ता वाला है। अगर हमें अपनी ज़रूरत की हर चीज़ खुद ही लिखनी पड़े, तो हमें कई साल लग सकते हैं। एक और चीज़ जो हमें पसंद है वह यह है कि नया संस्करण, या समस्या निवारण, या सुधार हर दूसरे सप्ताह \n बहुत जल्द सामने आता है। हम बहुत लंबा इंतजार नहीं करते.",
    "Landing_Page_CustomerStory_4": "एबीपी कमर्शियल एक शानदार उत्पाद है जिसकी अनुशंसा की जाएगी। हमारे ग्राहकों के लिए एक ही विन्यास योग्य मंच पर विपणन हेतु वाणिज्यिक उत्पाद। छलांग इस बात से शुरू होती है कि किसी भी टीम को जो ढाँचा और टूलींग प्रदान की जाती है वह एक-एक प्रतिशत के लायक है। एबीपी कमर्शियल हमारी जरूरतों के लिए सबसे उपयुक्त था।",
    "Landing_Page_AdditionalServices": "कस्टम या वॉल्यूम लाइसेंस, ऑनबोर्डिंग, लाइव ट्रेनिंग और सपोर्ट, कस्टम प्रोजेक्ट डेवलपमेंट, मौजूदा प्रोजेक्ट्स को पोर्ट करना और भी बहुत कुछ...",
    "Landing_Page_IncludedDeveloperLicenses": "<strong>{0}</strong> डेवलपर लाइसेंस शामिल हैं",
    "Landing_Page_SeeOnDemo": "डेमो पर देखें",
    "Landing_Page_LeptonThemes": "लेप्टनथीम्स",
    "Landing_Page_AccountModuleDescription_1": "यह मॉड्यूल किसी एप्लिकेशन के लिए प्रमाणीकरण प्रणाली लागू करता है;",
    "Landing_Page_AccountModuleDescription_2": "उपयोगकर्ता नाम और पासवर्ड के साथ एक <strong>लॉगिन</strong> पृष्ठ प्रदान करता है",
    "Landing_Page_AccountModuleDescription_3": "नया खाता बनाने के लिए एक <strong>रजिस्टर</strong> पेज प्रदान करता है।",
    "Landing_Page_AccountModuleDescription_4": "ई-मेल के रूप में <strong>पासवर्ड रीसेट</strong> लिंक भेजने के लिए एक <strong>भूल गए पासवर्ड</strong> पृष्ठ प्रदान करता है।",
    "Landing_Page_AccountModuleDescription_5": "यूआई के साथ <strong>ईमेल पुष्टिकरण</strong> कार्यक्षमता प्रदान करता है।",
    "Landing_Page_AccountModuleDescription_6": "<strong>दो कारक</strong> प्रमाणीकरण (एसएमएस और ई-मेल) लागू करता है।",
    "Landing_Page_AccountModuleDescription_7": "<strong>उपयोगकर्ता लॉकआउट</strong> लागू करता है (जब एक निश्चित समय अंतराल के भीतर अमान्य क्रेडेंशियल के कारण एक निश्चित संख्या में विफल लॉगिन होते हैं, तो निर्धारित समय के लिए खाते को लॉक कर देता है)।",
    "Landing_Page_AccountModuleDescription_8": "<strong>पहचान सर्वर</strong> प्रमाणीकरण सर्वर यूआई और कार्यक्षमता लागू करता है।",
    "Landing_Page_AccountModuleDescription_9": "बहु-किरायेदार वातावरण में <strong>किरायेदारों के बीच स्विच करने</strong> की अनुमति देता है।",
    "Landing_Page_AccountModuleDescription_10": "एप्लिकेशन की <strong>यूआई भाषा को</strong> बदलने की अनुमति देता है।",
    "Landing_Page_AuditLoggingModuleDescription_1": "यह मॉड्यूल ऑडिटिंग बुनियादी ढांचे के लिए ऑडिट लॉग रिपोर्टिंग यूआई प्रदान करता है। ऑडिट लॉग प्रविष्टियों और इकाई परिवर्तन लॉग को खोजने, फ़िल्टर करने और दिखाने की अनुमति देता है।",
    "Landing_Page_AuditLoggingModuleDescription_2": "ऑडिट लॉग प्रविष्टि में प्रत्येक ग्राहक अनुरोध के बारे में महत्वपूर्ण डेटा होता है:",
    "Landing_Page_AuditLoggingModuleDescription_3": "यूआरएल, ब्राउज़र, आईपी पता, ग्राहक का नाम",
    "Landing_Page_AuditLoggingModuleDescription_4": "प्रयोगकर्ता",
    "Landing_Page_AuditLoggingModuleDescription_5": "HTTP विधि, HTTP रिटर्न स्थिति कोड",
    "Landing_Page_AuditLoggingModuleDescription_6": "सफलता/विफलता, अपवाद विवरण यदि उपलब्ध हो",
    "Landing_Page_AuditLoggingModuleDescription_7": "निष्पादन अवधि का अनुरोध करें",
    "Landing_Page_AuditLoggingModuleDescription_8": "इस अनुरोध में (परिवर्तित गुणों के साथ) इकाइयाँ बनाई, हटाई या अद्यतन की गई हैं।",
    "Landing_Page_BloggingModuleDescription_1": "यह मॉड्यूल आपके एबीपी एप्लिकेशन में एक सरल ब्लॉग जोड़ता है;",
    "Landing_Page_BloggingModuleDescription_2": "एक ही एप्लिकेशन में एकाधिक ब्लॉग बनाने की अनुमति देता है।",
    "Landing_Page_BloggingModuleDescription_3": "मार्कडाउन प्रारूप का समर्थन करता है।",
    "Landing_Page_BloggingModuleDescription_4": "किसी पोस्ट के लिए टिप्पणी लिखने की अनुमति देता है.",
    "Landing_Page_BloggingModuleDescription_5": "ब्लॉग पोस्ट को टैग असाइन करने की अनुमति देता है।",
    "Landing_Page_BloggingModuleDescription_6": "ब्लॉगिंग मॉड्यूल के जीवंत उदाहरण के रूप में <a href=\"blog.abp.io\">blog.abp.io</a> वेबसाइट देखें।",
    "Landing_Page_ChatModuleDescription_1": "इस मॉड्यूल का उपयोग एप्लिकेशन में उपयोगकर्ताओं के बीच वास्तविक समय में संदेश भेजने के लिए किया जाता है।",
    "Landing_Page_ChatModuleDescription_2": "चैट पेज पर रीयल-टाइम मैसेजिंग।",
    "Landing_Page_ChatModuleDescription_3": "नई बातचीत के लिए एप्लिकेशन में उपयोगकर्ताओं को खोजें।",
    "Landing_Page_ChatModuleDescription_4": "हाल की बातचीत के लिए संपर्क सूची.",
    "Landing_Page_ChatModuleDescription_5": "जब उपयोगकर्ता किसी अन्य पृष्ठ को देख रहा हो तो नई संदेश सूचनाएँ।",
    "Landing_Page_ChatModuleDescription_6": "मेनू आइकन पर कुल अपठित संदेश गिनती बैज।",
    "Landing_Page_ChatModuleDescription_7": "प्रत्येक वार्तालाप के लिए अपठित संदेशों की संख्या।",
    "Landing_Page_ChatModuleDescription_8": "आलसी भरी बातचीत.",
    "Landing_Page_DocsModuleDescription_1": "इस मॉड्यूल का उपयोग तकनीकी दस्तावेज़ीकरण वेबसाइट बनाने के लिए किया जाता है;",
    "Landing_Page_DocsModuleDescription_2": "अंतर्निहित <strong>GitHub एकीकरण</strong> : GitHub पर सीधे दस्तावेज़ लिखें और प्रबंधित करें।",
    "Landing_Page_DocsModuleDescription_3": "<strong>संस्करण</strong> समर्थन सीधे GitHub रिलीज़ में एकीकृत है।",
    "Landing_Page_DocsModuleDescription_4": "<strong>बहु-भाषा का</strong> समर्थन करता है (डिफ़ॉल्ट भाषा के फ़ॉलबैक समर्थन के साथ)।",
    "Landing_Page_DocsModuleDescription_5": "<strong>मार्कडाउन</strong> और HTML प्रारूपों का समर्थन करता है।",
    "Landing_Page_DocsModuleDescription_6": "एक <strong>नेविगेशन</strong> और एक <strong>रूपरेखा</strong> अनुभाग प्रदान करता है।",
    "Landing_Page_DocsModuleDescription_7": "एक ही एप्लिकेशन में <strong>एकाधिक प्रोजेक्ट</strong> दस्तावेज़ों को होस्ट करने की अनुमति देता है।",
    "Landing_Page_DocsModuleDescription_8": "GitHub पर फ़ाइल के लिंक, ताकि कोई भी <strong>संपादन लिंक</strong> पर क्लिक करके आसानी से योगदान कर सके।",
    "Landing_Page_DocsModuleDescription_9": "GitHub स्रोत के अलावा, दस्तावेज़ीकरण स्रोत के रूप में केवल एक फ़ोल्डर का उपयोग करने की अनुमति देता है।",
    "Landing_Page_FileManagementModuleDescription_1": "फ़ाइलों को एक पदानुक्रमित फ़ोल्डर संरचना में अपलोड, डाउनलोड और व्यवस्थित करें।",
    "Landing_Page_FileManagementModuleDescription_2": "इस मॉड्यूल का उपयोग पदानुक्रमित फ़ोल्डर संरचना में फ़ाइलों को अपलोड, डाउनलोड और व्यवस्थित करने के लिए किया जाता है। यह बहु-किरायेदारी के साथ भी संगत है और आप अपने किरायेदारों के लिए कुल आकार सीमा निर्धारित कर सकते हैं।",
    "Landing_Page_FileManagementModuleDescription_3": "यह मॉड्यूल <a href=\"https://docs.abp.io/en/abp/latest/Blob-Storing\">बीएलओबी स्टोरेज</a> सिस्टम पर आधारित है, इसलिए यह फ़ाइल सामग्री को स्टोर करने के लिए विभिन्न स्टोरेज प्रदाताओं का उपयोग कर सकता है।",
    "Landing_Page_IdentityModuleDescription_1": "यह मॉड्यूल किसी एप्लिकेशन के उपयोगकर्ता और भूमिका प्रणाली को लागू करता है;",
    "Landing_Page_IdentityModuleDescription_2": "<a href=\"https://docs.microsoft.com/en-us/aspnet/core/security/authentication/identity\">Microsoft की ASP.NET कोर आइडेंटिटी</a> लाइब्रेरी पर निर्मित।",
    "Landing_Page_IdentityModuleDescription_3": "सिस्टम में <strong>भूमिकाएँ</strong> और <strong>उपयोगकर्ता</strong> प्रबंधित करें. एक उपयोगकर्ता को <strong>कई भूमिकाएँ</strong> निभाने की अनुमति है।",
    "Landing_Page_IdentityModuleDescription_4": "भूमिका और उपयोगकर्ता स्तरों में <strong>अनुमतियाँ</strong> सेट करें।",
    "Landing_Page_IdentityModuleDescription_5": "प्रति उपयोगकर्ता <strong>दो कारक प्रमाणीकरण</strong> और उपयोगकर्ता <strong>लॉकआउट</strong> सक्षम/अक्षम करें।",
    "Landing_Page_IdentityModuleDescription_6": "मूल <strong>उपयोगकर्ता प्रोफ़ाइल</strong> और <strong>पासवर्ड</strong> प्रबंधित करें।",
    "Landing_Page_IdentityModuleDescription_7": "सिस्टम में <strong>दावे के प्रकार</strong> प्रबंधित करें, भूमिकाओं और उपयोगकर्ताओं के लिए दावे निर्धारित करें।",
    "Landing_Page_IdentityModuleDescription_8": "<strong>पासवर्ड जटिलता</strong> , उपयोगकर्ता साइन-इन, खाता और लॉकआउट प्रबंधित करने के लिए पेज सेट करना।",
    "Landing_Page_IdentityModuleDescription_9": "<strong>एलडीएपी</strong> प्रमाणीकरण का समर्थन करता है।",
    "Landing_Page_IdentityModuleDescription_10": "<strong>ईमेल और फ़ोन नंबर</strong> सत्यापन प्रदान करता है।",
    "Landing_Page_IdentityModuleDescription_11": "सामाजिक लॉगिन एकीकरण (ट्विटर, फेसबुक, गिटहब आदि...) का समर्थन करता है।",
    "Landing_Page_IdentityModuleDescription_12": "सिस्टम में <strong>संगठन इकाइयों का</strong> प्रबंधन करें.",
    "Landing_Page_PaymentModuleDescription_1": "विभिन्न भुगतान गेटवे के लिए एकीकरण प्रदान करता है।",
    "Landing_Page_PaymentModuleDescription_2": "यह मॉड्यूल भुगतान गेटवे के लिए एकीकरण प्रदान करता है, जिससे आप आसानी से अपने ग्राहकों से भुगतान प्राप्त कर सकते हैं।",
    "Landing_Page_PaymentModuleDescription_3": "यह मॉड्यूल निम्नलिखित भुगतान गेटवे का समर्थन करता है",
    "Welcome_Page_UseSameCredentialForCommercialWebsites": "<a href=\"https://commercial.abp.io\" class=\"text-primary\">वाणिज्यिक.एबीपी.आईओ</a> और <a href=\"https://support.abp.io\" class=\"text-primary\">सपोर्ट.एबीपी.आईओ</a> दोनों के लिए समान क्रेडेंशियल का उपयोग करें।",
    "WatchCrudPagesVideo": "&quot;एबीपी सुइट के साथ सीआरयूडी पेज बनाना&quot; वीडियो देखें!",
    "WatchGeneratingFromDatabaseVideo": "&quot;एबीपी सुइट: मौजूदा डेटाबेस टेबल्स से सीआरयूडी पेज बनाना&quot; वीडियो देखें!",
    "WatchTakeCloserLookVideo": "&quot;कोड जनरेशन पर करीब से नज़र डालें: एबीपी सुइट&quot; वीडियो देखें!",
    "ConfirmedEmailAddressRequiredToStartTrial": "ट्रायल लाइसेंस शुरू करने के लिए आपके पास एक पुष्टिकृत ईमेल पता होना चाहिए।",
    "EmailVerificationMailNotSent": "ईमेल सत्यापन मेल नहीं भेजा जा सका.",
    "GetConfirmationEmail": "यदि आपको <a href=\"javascript:void(0);\" id=\"{0}\" class=\"text-decoration-underline\">सत्यापन ईमेल पहले नहीं मिला है तो प्राप्त करने के लिए यहां क्लिक करें</a> ।",
    "WhichLicenseTypeYouAreInterestedIn": "आप किस लाइसेंस प्रकार में रुचि रखते हैं?",
    "DontTakeOurWordForIt": "इसके लिए हमारी बात न मानें...",
    "ReadAbpCommercialUsersWantYouToKnow": "पढ़ें कि एबीपी कमर्शियल उपयोगकर्ता आपसे क्या जानना चाहते हैं",
    "Testimonial_ShortDescription_1": "एबीपी की मॉड्यूलैरिटी ने टीम के लिए समय पर डिलीवरी करना संभव बना दिया।",
    "Testimonial_ShortDescription_2": "पहले की तुलना में तेजी से नई सुविधाएँ बनाएँ।",
    "Testimonial_ShortDescription_3": "हम आउट-ऑफ़-द-बॉक्स सुविधाओं से शुरुआत करते हैं और केवल उस पर ध्यान केंद्रित करते हैं जो हमें वास्तव में लिखने की ज़रूरत है।",
    "Testimonial_ShortDescription_4": "एबीपी कमर्शियल हमारी जरूरतों के लिए सबसे उपयुक्त था।",
    "OnlineReviewersOnAbpCommercial": "एबीपी कमर्शियल पर ऑनलाइन समीक्षाएं",
    "SeeWhatToldAboutAbpCommercial": "देखिए एबीपी कमर्शियल के बारे में क्या बताया गया है और यदि आप चाहें तो अपने विचार लिखें।",
    "BlazoriseLicense": "क्या हमें ब्लेज़ोराइज़ लाइसेंस खरीदने की ज़रूरत है?",
    "BlazoriseLicenseExplanation": "हमारे पास Volosoft और Megabit के बीच एक समझौता है, इस समझौते के साथ Blazorise लाइसेंस को ABP वाणिज्यिक उत्पादों के साथ बंडल किया गया है, इसलिए हमारे ग्राहकों को एक अतिरिक्त Blazorise लाइसेंस खरीदने की आवश्यकता नहीं है।",
    "ExtendPaymentInfoSection_DeveloperPrice": "{0}x अतिरिक्त डेवलपर",
    "ExtendPaymentInfoSection_DiscountRate": "छूट {0}%",
    "TotalNetPrice": "कुल शुद्ध मूल्य",
    "EFCore": "एंटिटी फ्रेमवर्क कोर",
    "All": "सभी",
    "Mvc": "एमवीसी",
    "DataBaseProvider": "डेटा प्रदाता",
    "UIFramework": "यूआई फ्रेमवर्क",
    "LeptonXThemeForDashboard": "आपके एडमिन डैशबोर्ड के लिए लेप्टनएक्स थीम",
    "AbpPlatform": "एबीपी प्लेटफार्म",
    "YouDeserveGoodUXUI": "आप एक अच्छे यूआई और बेहतर यूएक्स के हकदार हैं। एबीपी द्वारा लेप्टनएक्स थीम इसकी सेवा के लिए यहां है।",
    "ViewLiveDemo": "लाइव थीम डेमो देखें",
    "GetLeptonX": "अभी लेप्टनएक्स प्राप्त करें",
    "SeeLeptonXDocumentation": "लेप्टनएक्स दस्तावेज़ीकरण देखें",
    "SeeLeptonDocumentation": "लेप्टन दस्तावेज़ीकरण देखें",
    "SimplifiedMenu": "सरलीकृत मेनू",
    "SimplifiedMenuDescription": "आप मेनू को फ़िल्टर करके आसानी से वह पेज पा सकते हैं जिसे आप ढूंढ रहे हैं",
    "YourFavoritePages": "आपके पसंदीदा पृष्ठ आपकी पहुंच पर",
    "YourFavoritePagesDescription": "पृष्ठ के ऊपरी दाएं कोने में स्टार आइकन पर क्लिक करके आसानी से पृष्ठ को पसंदीदा में जोड़ें या हटाएं।",
    "BreadCrumbs": "निर्बाध स्विचिंग के लिए ब्रेडक्रंब",
    "BreadCrumbsDescription": "ब्रेडक्रंब का उपयोग करके, आप एक क्लिक से समान स्तर के पृष्ठों पर स्विच कर सकते हैं, तब भी जब बायां मेनू बंद हो, और यह टैबलेट और मोबाइल पर काम करता है!",
    "YourMenu": "आपका मेनू जैसा आप चाहें",
    "YourMenuDescription": "उपयोगकर्ता मेनू पर सीधे क्लिक करने योग्य आइकन और ड्रॉपडाउन बॉक्स को अपनी इच्छानुसार अनुकूलित करें। उपयोगकर्ता मेनू आपकी आवश्यकताओं के लिए पूरी तरह से अनुकूलन योग्य है",
    "RtlSupport": "आपकी भाषा के लिए आरटीएल समर्थन",
    "RtlSupportDescription": "लेप्टनएक्स थीम आपकी भाषा के लिए आरटीएल का समर्थन करती है। भाषा बदलने के लिए भाषा विकल्प सेटिंग मेनू में हैं।",
    "YourColors": "आपके व्यवस्थापक डैशबोर्ड यूआई पर आपके रंग",
    "YourColorsDescription": "लेप्टनएक्स थीम आपकी सिस्टम प्राथमिकताओं के अनुसार काम करती है और इसमें डैशबोर्ड लाइट थीम, डैशबोर्ड डार्क थीम और डैशबोर्ड सेमी-डार्क थीम विकल्प हैं।",
    "ArrangeContentWidth": "अपनी सामग्री की चौड़ाई को आसानी से व्यवस्थित करें",
    "ArrangeContentWidthDescription": "अपने सामग्री क्षेत्र की चौड़ाई आसानी से बदलें।",
    "LeptonXCompatibleWith": "लेप्टनएक्स थीम के साथ संगत है",
    "MobileResponsiveTemplate": "मोबाइल रिस्पॉन्सिव टेम्पलेट",
    "MobileResponsiveTemplateDescription1": "अपनी पसंद के किसी भी डिवाइस से अपने LeptonX एडमिन डैशबोर्ड तक पहुंचें।",
    "MobileResponsiveTemplateDescription2": "इसे आपके प्रत्येक डिवाइस में आसानी से उपयोग करने के लिए डिज़ाइन किया गया है। यह मोबाइल उपकरणों और टैबलेट आकारों पर प्रतिक्रियाशील है।",
    "TopMenuLayoutOption": "शीर्ष मेनू लेआउट विकल्प",
    "TopMenuLayoutOptionDescription1": "यदि आप अपनी वेबसाइट को उसी व्यवस्थापक डैशबोर्ड के साथ स्थापित करना चाहते हैं, तो लेप्टनएक्स थीम के साथ ऐसा करना संभव है!",
    "TopMenuLayoutOptionDescription2": "ऐसा करने के लिए बस LeptonX शीर्ष मेनू लेआउट आज़माएँ!",
    "EasilyCustomizable": "आपके ब्रांड के रंगों के लिए आसानी से अनुकूलन योग्य",
    "EasilyCustomizableDescription1": "आप केवल कुछ SCSS वेरिएबल्स का उपयोग करके LeptonX थीम को कस्टमाइज़ कर सकते हैं। कोई ओवरराइडिंग नहीं, कोई अतिरिक्त सीएसएस लोड नहीं!",
    "EasilyCustomizableDescription2": "LeptonX के साथ, आप अपने एडमिन डैशबोर्ड को अपनी इच्छानुसार व्यवस्थित कर सकते हैं।",
    "IndependentLayout": "स्वतंत्र लेआउट और सामग्री क्षेत्र",
    "IndependentLayoutDescription1": "लेप्टनएक्स का लेआउट इंफ्रास्ट्रक्चर सामग्री से पूरी तरह से अलग डिजाइन किया गया था।",
    "IndependentLayoutDescription2": "इसका मतलब यह है कि यदि आप चाहें तो आप अपने प्रोजेक्ट को बूटस्ट्रैप के अलावा किसी अन्य सामग्री संरचना के साथ स्वतंत्र रूप से डिज़ाइन कर सकते हैं।",
    "MostUsedLibraries": "अधिकांश उपयोग की जाने वाली लाइब्रेरी लेप्टनएक्स के साथ एकीकृत हैं",
    "MostUsedLibrariesDescription1": "LeptonX में आपकी सबसे अधिक उपयोग की जाने वाली लाइब्रेरी शामिल हैं। यह आपको एपेक्सचार्ट्स, डेटाटेबल्स, ड्रॉपज़ोन, फुलकैलेंडर, जेएसट्री, सिलेक्ट2 और टोस्टर जैसी लाइब्रेरीज़ का आसानी से उपयोग करने की अनुमति देता है।",
    "MostUsedLibrariesDescription2": "लेप्टनएक्स एमवीसी एंगुलर और ब्लेज़र-विशिष्ट पुस्तकालयों का भी समर्थन करता है।",
    "CreateAndCustomize": "LeptonX कस्टम पेजों के साथ सेकंडों में अपनी ज़रूरत के पेज बनाएं और कस्टमाइज़ करें",
    "CreateAndCustomizeDescription": "लेप्टनएक्स थीम का उपयोग करके आपके पास कई पूर्व-निर्मित HTML पृष्ठों तक भी पहुंच है। इनमें लॉगिन पेज, ब्लॉग, FAQ, सदस्यता सूची, चालान, मूल्य निर्धारण और फ़ाइल प्रबंधन जैसे कई पेज शामिल हैं।",
    "LeptonThemeForAdmin": "आपके व्यवस्थापक डैशबोर्ड के लिए लेप्टन थीम",
    "LeptonThemeForAdminDescription": "लेप्टन थीम अभी भी उपलब्ध है और इसे बनाए रखा जाएगा। यदि आप लेप्टन थीम उपयोगकर्ता के रूप में लेप्टनएक्स थीम पर स्विच करना चाहते हैं, तो आप कैसे करना है यह जानने के लिए दस्तावेज़ देख सकते हैं।",
    "LeptonCompatibleWith": "लेप्टन थीम के साथ संगत है",
    "BlackFridayDiscount": "ब्लैक फ्राइडे छूट",
    "UpgradePaymentInfoSection_DeveloperPrice": "{1} अतिरिक्त डेवलपर के लिए {0}",
    "Upgrade": "उन्नत करना",
    "Renewal": "नवीनीकरण",
    "UpgradePaymentInfoSection_LicensePrice": "{0} लाइसेंस",
    "UpgradePaymentInfoSection_LicenseRenewalPrice": "लाइसेंस नवीनीकरण",
    "Total": "कुल",
    "SupportPolicyFaqTitle": "आपकी समर्थन नीति क्या है?",
    "SupportPolicyFaqExplanation": "हम केवल सक्रिय और पिछले प्रमुख संस्करण का समर्थन करते हैं। हम तीसरे और पुराने प्रमुख संस्करणों के लिए पैच रिलीज़ की गारंटी नहीं देते हैं। उदाहरण के लिए, यदि सक्रिय संस्करण 7.0.0 है, तो हम 6.x.x और 7.x.x दोनों के लिए पैच रिलीज़ जारी करेंगे। इसके अलावा, हम केवल ABP फ्रेमवर्क और ABP कमर्शियल संबंधित मुद्दों के लिए समर्थन प्रदान करते हैं। इसका मतलब है कि तीसरे पक्ष के अनुप्रयोगों, क्लाउड सेवाओं और एबीपी उत्पादों द्वारा उपयोग किए जाने वाले अन्य परिधीय पुस्तकालयों के लिए कोई समर्थन नहीं दिया गया है। हम अपने ग्राहकों को \"Volosoft Bilisim A.S\" के आधिकारिक व्यावसायिक घंटों के दौरान तकनीकी सहायता प्रदान करने के लिए व्यावसायिक रूप से उचित प्रयासों का उपयोग करेंगे। दूसरी ओर, हम सर्विस-लेवल एग्रीमेंट (SLA) प्रतिक्रिया समय के लिए प्रतिबद्ध नहीं हैं, लेकिन हम अपने आधिकारिक कामकाजी घंटों के भीतर जितनी जल्दी हो सके तकनीकी मुद्दों पर प्रतिक्रिया देने का प्रयास करेंगे। जब तक ग्राहक के साथ कोई विशेष समझौता नहीं किया जाता है, हम केवल https://support.abp.io पर सहायता प्रदान करते हैं। हमारे पास निजी ईमेल समर्थन भी है, जो केवल एंटरप्राइज़ लाइसेंस धारकों के लिए उपलब्ध है।",
    "TotalDevelopers": "कुल {0} डेवलपर",
    "CustomPurchaseExplanation": "आपकी विशिष्ट आवश्यकताओं के अनुरूप",
    "WhereDidYouHearAboutUs": "आपने हमारे बारे में कहां सुना?",
    "Twitter": "ट्विटर",
    "Facebook": "फेसबुक",
    "Youtube": "यूट्यूब",
    "Google": "गूगल",
    "Github": "GitHub",
    "Friend": "एक दोस्त से",
    "Other": "अन्य",
    "WhereDidYouHearAboutUs_explain": "उल्लिखित करना ...",
    "DeletingMemberWarningMessage": "&quot;{0}&quot; को डेवलपर सूची से हटा दिया जाएगा. आप चाहें तो बाद में इस खाली सीट को किसी अन्य डेवलपर को सौंप सकते हैं।",
    "AdditionalInfo": "यदि डेवलपर सीटें आपकी आवश्यकताओं से ऊपर हैं, तो आप उन्हें कम कर सकते हैं। आप अपनी कुछ डेवलपर सीटें हटाने के लिए <a href=\"mailto:info@abp.io\">info@abp.io</a> पर ईमेल कर सकते हैं। अप्रयुक्त डेवलपर सीटों को साफ़ करने से लाइसेंस नवीनीकरण लागत कम हो जाएगी। यदि आप चाहें, तो आप अपनी सक्रिय लाइसेंस अवधि के भीतर अतिरिक्त डेवलपर सीटें फिर से खरीद सकते हैं। ध्यान दें, चूँकि इस लाइसेंस पैकेज में {0} डेवलपर हैं, इसलिए आप इस संख्या को कम नहीं कर सकते।",
    "LinkExpiredErrorMessage": "आप जिस लिंक तक पहुँचने का प्रयास कर रहे हैं उसकी समय सीमा समाप्त हो गई है।",
    "ExpirationDate": "समाप्ति तिथि",
    "SpringCampaignDiscount": "वसंत अभियान छूट",
    "WhyUseAbpIoPlatform": "मुझे शुरुआत से नया समाधान बनाने के बजाय ABP.IO प्लेटफ़ॉर्म का उपयोग क्यों करना चाहिए?",
    "WhyUseAbpIoPlatformFaqExplanation": "इस बात की विस्तृत व्याख्या के लिए <a href=\"/why-abp-io \">वह पृष्ठ</a> देखें कि ABP.IO प्लेटफ़ॉर्म का उपयोग स्वयं सब कुछ करने की तुलना में महत्वपूर्ण लाभ क्यों है।",
    "EulaPageTitle": "अंतिम उपयोगकर्ता लाइसेंस अनुबंध (ईयूएलए)",
    "PrivacyPolicyPageTitle": "गोपनीयता नीति - कुकी नीति",
    "TermsConditionsPageTitle": "नियम और शर्तें",
    "TrainingsPageTitle": "एबीपी प्रशिक्षण पैकेज",
    "ModulesPageTitle": "एबीपी पूर्व-निर्मित एप्लिकेशन मॉड्यूल",
    "Volo.AbpIo.Commercial:040001": "एपीआई एक्सेस कुंजी गलत है.",
    "GetLepton": "अभी लेप्टन प्राप्त करें",
    "MyOrganizations_Detail_LicenseStartDate": "लाइसेंस आरंभ तिथि",
    "MyOrganizations_Detail_LicenseExpiryDate": "समाप्ति तिथि",
    "BlazoriseSupport": "मैं ब्लेज़ोराइज़ लाइसेंस कुंजी और ब्लेज़ोराइज़ टीम से समर्थन कैसे प्राप्त कर सकता हूँ?",
    "BlazoriseSupportExplanation": "ब्लेज़ोराइज़ टीम से समर्थन प्राप्त करने और अपनी ब्लेज़ोराइज़ लाइसेंस कुंजी प्राप्त करने के लिए नीचे दिए गए चरणों का पालन करें:",
    "BlazoriseSupportExplanation1": "अपने abp.io खाते के समान ईमेल पते के साथ <a href=\"https://blazorise.com/support/register\">blazorise.com/support/register</a> पर एक नए खाते के लिए साइन अप करें। &quot;लाइसेंस कुंजी&quot; प्रविष्टि को खाली छोड़ दें। <strong>यह वही ईमेल पता होना चाहिए जो abp.io पर आपके ईमेल खाते का है</strong> ।",
    "BlazoriseSupportExplanation2": "अपना ईमेल बॉक्स चेक करके अपना ईमेल पता सत्यापित करें। यदि आपको अपने इनबॉक्स में कोई ईमेल नहीं दिखाई देता है तो अपना स्पैम बॉक्स जांचें!",
    "BlazoriseSupportExplanation3": "ब्लेज़ोराइज़ सपोर्ट वेबसाइट <a href=\"https://blazorise.com/support/login\">blazorise.com/support/login</a> पर लॉग इन करें।",
    "BlazoriseSupportExplanation4": "यदि आपके पास सक्रिय एबीपी कमर्शियल लाइसेंस है, तो आपके पास ब्लेज़ोराइज प्रो लाइसेंस भी होगा। आप अपनी ब्लेज़ोराइज़ लाइसेंस कुंजी <a href=\"https://blazorise.com/support/user/manage/license\">blazorise.com/support/user/manage/license</a> पर प्राप्त कर सकते हैं।",
    "BlazoriseSupportExplanation5": "आप अपने प्रश्न सहायता वेबसाइट पर पोस्ट कर सकते हैं और अपने आवेदन के लिए एक उत्पाद टोकन उत्पन्न कर सकते हैं।",
    "AbpLiveTrainingPackages": "एबीपी लाइव ट्रेनिंग पैकेज",
    "Releases": "विज्ञप्ति",
    "ReleasesDescription": "एबीपी कमर्शियल के रिलीज़ लॉग।",
    "ReleaseDate": "रिलीज़ की तारीख",
    "Labels": "लेबल",
    "PreRelease": "पूर्व-रिलीज़",
    "AllTypes": "सभी प्रकार के",
    "Enhancement": "वृद्धि",
    "Bug": "कीड़ा",
    "Feature": "विशेषता",
    "AllUIs": "सभी यूआई",
    "MVC": "एमवीसी",
    "BlazorServer": "ब्लेज़र सर्वर",
    "MAUI": "माउ",
    "HowItWorks_Page_Title": "यह काम किस प्रकार करता है?",
    "HowItWorks_Page_Description": "एबीपी फ्रेमवर्क .NET प्लेटफॉर्म का विस्तार करता है। तो, आप सादे .NET समाधान के साथ जो कुछ भी कर सकते हैं वह एबीपी फ्रेमवर्क के साथ पहले से ही संभव है। इससे कम सीखने की अवस्था के साथ शुरुआत करना आसान हो जाता है।",
    "HowItWorks_Description1": "एबीपी फ्रेमवर्क .NET प्लेटफॉर्म का विस्तार करता है। तो, आप सादे .NET समाधान के साथ जो कुछ भी कर सकते हैं वह एबीपी फ्रेमवर्क के साथ पहले से ही संभव है। इससे कम सीखने की अवस्था के साथ शुरुआत करना आसान हो जाता है।",
    "HowItWorks_Description2": "एक बार जब आप एबीपी फ्रेमवर्क सुविधाओं को सीखना और उपयोग करना शुरू कर देंगे, तो अपना सॉफ़्टवेयर विकसित करना पहले से कहीं अधिक आनंददायक हो जाएगा।",
    "HowItWorks_Description3": "यह पृष्ठ मूल रूप से बताता है कि आप .NET डेवलपर के रूप में ABP.IO प्लेटफ़ॉर्म का उपयोग कैसे करते हैं।",
    "CreateANewSolution": "एक नया .NET समाधान बनाएँ",
    "CreateANewSolution_Description1": "सब कुछ एक नया ABP एकीकृत .NET समाधान बनाने से शुरू होता है।",
    "StartWithStartupTemplates": "पूर्व-निर्मित <a href=\"/startup-templates\">स्टार्टअप समाधान टेम्पलेट्स</a> में से एक प्रारंभ करें",
    "SimpleMonolithApplicationTemplate": "सरल मोनोलिथ अनुप्रयोग टेम्पलेट",
    "LayeredApplicationTemplate": "स्तरित अनुप्रयोग टेम्पलेट",
    "MicroserviceSolutionTemplate": "माइक्रोसर्विस समाधान टेम्पलेट",
    "CreateEmptySolutionAndUseAbp": "या एक नया खाली .NET समाधान बनाएं और ABP NuGet और NPM <a href=\"https://abp.io/packages\" target=\"_blank\">पैकेज</a> स्वयं स्थापित करें।",
    "CreatingSolutionWithMultipleOptions": "नया समाधान बनाते समय कई उपयोगकर्ता इंटरफ़ेस और डेटाबेस विकल्प होते हैं।",
    "UIFrameworkOptions": "यूआई फ्रेमवर्क विकल्प",
    "DotnetSolutionWithoutDependency": "अब, आपके स्थानीय कंप्यूटर में एक नियमित .NET समाधान है जिसकी क्लाउड प्लेटफ़ॉर्म या बाहरी सेवा पर कोई निर्भरता नहीं है।",
    "CheckTheDocumentForDetails": "आप विवरण के लिए <a href=\"{0}\" target=\"_blank\">{1}</a> दस्तावेज़ की जांच कर सकते हैं।",
    "UIAndDatabaseIndependent": "एबीपी किसी भी यूआई और .NET द्वारा समर्थित किसी भी डेटाबेस प्रदाता के साथ काम कर सकता है। \n हालाँकि, ये यूआई और डेटाबेस प्रदाता पूर्व-एकीकृत और अच्छी तरह से प्रलेखित हैं।",
    "InstallAbpModules": "एबीपी मॉड्यूल स्थापित करें",
    "DevelopYourSolution": "अपना समाधान विकसित करें",
    "DeployAnywhere": "कहीं भी तैनात करें",
    "InstallAbpModule_Description1": "एबीपी एक मॉड्यूलर एप्लिकेशन डेवलपमेंट फ्रेमवर्क है। स्टार्टअप समाधान टेम्पलेट पहले से ही स्थापित आवश्यक मॉड्यूल के साथ आते हैं। \n लेकिन ऐसे और भी एप्लिकेशन मॉड्यूल हैं जिनका उपयोग आप अपने समाधान में करना चाहेंगे।",
    "InstallAbpModule_Description2": "प्रत्येक मॉड्यूल में कुछ NuGet और NPM पैकेज होते हैं और एक इंस्टॉलेशन दस्तावेज़ होता है। <a href=\"/tools/suite\">एबीपी सुइट</a> अधिकांश काम स्वचालित रूप से करता है, फिर आप मॉड्यूल को उसके दस्तावेज़ीकरण के आधार पर मैन्युअल रूप से कॉन्फ़िगर या फाइन-ट्यून करते हैं।",
    "DevelopYourSolution_Description1": "एबीपी का बुनियादी ढांचा आपको दोहराए जाने वाले काम को स्वचालित करके और पूर्व-निर्मित बुनियादी ढांचे और एप्लिकेशन <a href=\"https://abp.io/features\" target=\"_blank\">सुविधाएं</a> प्रदान करके <b class=\"text-white\">अपने स्वयं के व्यवसाय कोड पर ध्यान केंद्रित करने</b> में सक्षम बनाता है।",
    "DevelopYourSolution_Description2": "निम्नलिखित कोड ब्लॉक में, आप देख सकते हैं कि कैसे एबीपी फ्रेमवर्क आपके कोड में सहजता से एकीकृत होता है और आपके लिए दोहराए जाने वाले कार्यों को स्वचालित करता है।",
    "DevelopYourSolution_Description3": "इस शॉर्टकोड ब्लॉक में भी एबीपी आपके लिए बहुत कुछ करता है।",
    "DevelopYourSolution_Description4": "यह \n <a href=\"https://docs.abp.io/en/abp/latest/Dependency-Injection\" target=\"_blank\">निर्भरता इंजेक्शन</a> जैसे सम्मेलनों को लागू करने के लिए बेस क्लास प्रदान करता है। जेनेरिक \n <a href=\"https://docs.abp.io/en/abp/latest/Repositories\" target=\"_blank\">रिपॉजिटरी</a> सेवाएँ डेटाबेस के साथ इंटरैक्ट करने का एक सुविधाजनक \n तरीका प्रदान करती हैं। घोषणात्मक \n <a href=\"https://docs.abp.io/en/abp/latest/Authorization\" target=\"_blank\">प्राधिकरण</a> एक सुव्यवस्थित अनुमति प्रणाली के साथ काम करता है।",
    "DevelopYourSolution_Description5": "ABP <a href=\"https://docs.abp.io/en/abp/latest/Unit-Of-Work\" target=\"_blank\">काम की</a> \n इकाई (डेटाबेस कनेक्शन और लेनदेन प्रबंधन के लिए), \n <a href=\"https://docs.abp.io/en/abp/latest/Exception-Handling\" target=\"_blank\">अपवाद हैंडलिंग</a> , \n <a href=\"https://docs.abp.io/en/abp/latest/Validation\" target=\"_blank\">सत्यापन</a> \n और <a href=\"https://docs.abp.io/en/abp/latest/Audit-Logging\" target=\"_blank\">ऑडिट लॉगिंग को</a> पूरी तरह से स्वचालित करता है। यह आपके दैनिक विकास कार्यों को सरल बनाने और उत्पादन के लिए तैयार \n एप्लिकेशन बनाते समय आपके अपने कोड पर ध्यान केंद्रित करने के लिए कई और बिल्डिंग ब्लॉक प्रदान करता है।",
    "DevelopYourSolution_Description6": "आप कल्पना कर सकते हैं कि यदि आप यह सब मैन्युअल रूप से करेंगे तो वह कोड ब्लॉक कितना लंबा और जटिल हो सकता है।",
    "SuiteCrudGenerationInFewSeconds": "अपने समाधान को हाथ से कोडिंग करने के अलावा, आप एबीपी सुइट टूलिंग का उपयोग करके कुछ ही मिनटों में पूरी तरह से काम करने वाले उन्नत सीआरयूडी पेज बना सकते हैं। यह आपके समाधान में कोड उत्पन्न करता है, ताकि आप अपनी कस्टम आवश्यकताओं के आधार पर इसे ठीक कर सकें।",
    "DeployAnywhere_Description1": "दिन के अंत में, आपके पास एक शुद्ध .NET समाधान है। आप अपने समाधान को अपने सर्वर पर, क्लाउड प्लेटफ़ॉर्म पर, कुबेरनेट्स पर या जहां चाहें वहां तैनात कर सकते हैं। आप जितने चाहें उतने सर्वर पर तैनात कर सकते हैं। एबीपी एक परिनियोजन पर्यावरण अज्ञेयवादी उपकरण है।",
    "ExpertiseAbpFramework": "एबीपी फ्रेमवर्क का विशेषज्ञ बनें",
    "ExpertiseAbpFramework_Description1": "क्या आप बुनियादी बातों से आगे जाकर ABP.IO प्लेटफॉर्म पर विशेषज्ञता हासिल करना चाहते हैं?",
    "FreeDownload": "मुफ्त डाउनलोड",
    "Read": "पढ़ना",
    "HavingTrouble": "परेशानी हो रही है?",
    "HavingTrouble_Description1": "क्या आपको अपना समाधान विकसित करने में कोई समस्या है? हम यहाँ हैं! कोर एबीपी फ्रेमवर्क टीम के सदस्यों से सीधे सहायता प्राप्त करने के लिए एबीपी सपोर्ट प्लेटफॉर्म \n उपयोग करें या एक ईमेल भेजें।",
    "WeAreHereToHelp_Description1": "आप हमारे सहायता विषयों को ब्राउज़ कर सकते हैं या अक्सर पूछे जाने वाले प्रश्नों, \n में खोज सकते हैं या आप संपर्क फ़ॉर्म का उपयोग करके हमसे एक प्रश्न पूछ सकते हैं।",
    "OtherModules": "अन्य मॉड्यूल",
    "OtherModules_Description1": "खाता, ऑडिट लॉगिंग, चैट, सीएमएस किट, फ़ाइल प्रबंधन, फॉर्म, जीडीपीआर, पहचान, भाषा प्रबंधन, भुगतान, सास और बहुत कुछ...",
    "HowItWorks_DatabaseProviderOptions": "डेटाबेस प्रदाता विकल्प",
    "SeeFAQ": "अक्सर पूछे जाने वाले प्रश्न देखें",
    "ReleaseLogs": "लॉग जारी करें",
    "ReleaseLogs_Tag": "{0} रिलीज़ लॉग",
    "ReleaseLogs_Pr": "पुल अनुरोध #{0} - {1}",
    "NoLabels": "कोई लेबल नहीं",
    "DoesTheSubscriptionRenewAutomatically": "क्या सदस्यता स्वतः नवीनीकृत हो जाती है?",
    "DoesTheSubscriptionRenewAutomaticallyExplanation": "एबीपी कमर्शियल के पास ऑटो-नवीनीकरण बिलिंग मॉडल नहीं है। इसलिए आपकी लाइसेंस अवधि के अंत में <strong>आपकी सदस्यता स्वचालित रूप से नवीनीकृत नहीं की जाएगी</strong> । यदि आप एबीपी कमर्शियल के लाभों को जारी रखना चाहते हैं, तो आपको <a href=\"/my-organizations\">संगठन प्रबंधन पृष्ठ</a> पर इसे मैन्युअल रूप से नवीनीकृत करना होगा। यदि आपके पास कई संगठन हैं, तो अपने समाप्त हो रहे संगठन में &quot;प्रबंधित करें&quot; बटन पर क्लिक करें और फिर अपने लाइसेंस को नवीनीकृत करने के लिए &quot;अभी विस्तार करें&quot; बटन पर क्लिक करें। आप यह भी देखना चाह सकते हैं <a href=\"/faq#what-happens-when-license-ends\">कि मेरा लाइसेंस समाप्त होने पर क्या होता है?</a> अनुभाग।",
    "ExtraQuestionCreditsFaqTitle": "क्या मैं अतिरिक्त सहायता प्रश्न क्रेडिट खरीद सकता हूँ?",
    "ExtraQuestionCreditsFaqExplanation": "हाँ तुम कर सकते हो। अतिरिक्त प्रश्न क्रेडिट खरीदने के लिए, अपने संगठन के नाम के साथ <a href=\"mailto:info@abp.io\">info@abp.io</a> पर एक ई-मेल भेजें। अतिरिक्त प्रश्न क्रेडिट के लिए मूल्य सूची यहां दी गई है:<ul><li> 50 प्रश्नों का पैक $999</li><li> 25 प्रश्नों का पैक $625</li><li> 15 प्रश्नों का पैक $450</li></ul>",
    "AlreadyBetaTester": "आप पहले ही बीटा टेस्टर प्रोग्राम में शामिल हो चुके हैं।",
    "AbpStudio": "एबीपी स्टूडियो",
    "AbpStudio_Description": "एबीपी स्टूडियो अभी भी विकासाधीन है। आप पहले उपयोगकर्ताओं में से एक बनने के लिए नीचे दिया गया फॉर्म भर सकते हैं।",
    "AbpStudio_Description1": "एबीपी स्टूडियो एबीपी डेवलपर्स के लिए एक <span class=\"text-highlight-white\">क्रॉस-प्लेटफ़ॉर्म डेस्कटॉप एप्लिकेशन</span> है।",
    "AbpStudio_Description2": "यह एबीपी फ्रेमवर्क में <span class=\"text-highlight-white\">अच्छी तरह से एकीकृत है</span> और इसका उद्देश्य <span class=\"text-highlight-white\">चीजों को स्वचालित करके, आपके समाधान के बारे में अंतर्दृष्टि प्रदान करके</span> , आपके समाधानों को <span class=\"text-highlight-white\">विकसित करना, चलाना</span> और <span class=\"text-highlight-white\">तैनात करना</span> बहुत आसान बनाकर आपके लिए एक आरामदायक विकास वातावरण प्रदान करना है।",
    "AbpStudio_ComingSoon": "जल्द आ रही है <span class=\"opacity-50 ms-0 ms-md-3 d-block d-md-inline-block \">नियोजित बीटा रिलीज़ तिथि: 2023 की चौथी तिमाही।</span>",
    "AbpStudio_PlannedPreviewDate": "नियोजित पूर्वावलोकन रिलीज़ दिनांक: 2023 की चौथी तिमाही।",
    "BetaRequest": "बीटा अनुरोध",
    "CreateNewSolutions": "नए समाधान बनाएं",
    "CreateNewSolutions_Description1": "आप बहुत सारे विकल्पों के साथ सरल एप्लिकेशन से लेकर मॉड्यूलर मोनोलिथ या माइक्रोसर्विस समाधान तक आसानी से बना सकते हैं। आपको अपने व्यवसाय के लिए पूर्ण उत्पादन-तैयार आधार सॉफ़्टवेयर समाधान मिलता है।",
    "ArchitectYourSolutions": "अपने समाधानों को आर्किटेक्ट करें",
    "ArchitectYourSolutions_Description1": "मॉड्यूल या सेवाएँ बनाकर और उनके बीच संबंध स्थापित करके मोनोलिथ-मॉड्यूलर और माइक्रोसर्विस समाधान संरचनाओं का निर्माण करना आसान है। आप पूर्व-निर्मित एप्लिकेशन मॉड्यूल को इंस्टॉल या अनइंस्टॉल भी कर सकते हैं।",
    "ExploreYourSolution": "अपना समाधान खोजें",
    "ExploreYourSolution_Description1": "एबीपी स्टूडियो आपके समाधान में घटकों और आपके समाधान पर निर्भर मॉड्यूल का एक उच्च-स्तरीय दृश्य दिखाता है। आप अपना कोडबेस खोले बिना संस्थाओं, सेवाओं, HTTP एपीआई और बहुत कुछ का पता लगा सकते हैं।",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze": "ब्रीज़ में मल्टी-एप्लिकेशन या माइक्रोसर्विस सॉल्यूशंस चलाएं",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description1": "एक क्लिक से एक, <span class=\"text-highlight-white\">एकाधिक</span> या <span class=\"text-highlight-white\">सभी सेवाएँ</span> चलाएँ। इस तरह, किसी सेवा को रोकना, <span class=\"text-highlight-white\">परीक्षण</span> या <span class=\"text-highlight-white\">डीबग करने</span> के लिए इसे विजुअल स्टूडियो में चलाना बहुत आसान है।",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description2": "सेवाओं की सूची देखें, प्रत्येक सेवा के लिए <span class=\"text-highlight-white\">वास्तविक समय HTTP अनुरोध</span> और <span class=\"text-highlight-white\">अपवाद संख्या</span> देखें।",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description3": "किसी भी सेवा पर आने वाले सभी <span class=\"text-highlight-white\">HTTP अनुरोधों</span> का पूरा विवरण देखें।",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description4": "किसी भी सेवा में वास्तविक समय में <span class=\"text-highlight-white\">अपवाद विवरण</span> देखें, आसानी से फ़िल्टर करें और खोजें।",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description5": "<span class=\"text-highlight-white\">एप्लिकेशन लॉग</span> दिखाएं, लॉग स्तर के आधार पर फ़िल्टर करें या टेक्स्ट द्वारा खोजें..",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description6": "समाधान रनर को छोड़े बिना अपने एप्लिकेशन का यूआई <span class=\"text-highlight-white\">ब्राउज़ करें</span> ।",
    "IntegrateToYourKubernetesCluster": "अपने कुबेरनेट्स क्लस्टर में एकीकृत करें",
    "IntegrateToYourKubernetesCluster_Description1": "<span class=\"text-highlight-white\">अपने स्थानीय विकास परिवेश को स्थानीय या दूरस्थ कुबेरनेट्स क्लस्टर से कनेक्ट करें</span> , जहां वह क्लस्टर पहले से ही आपका माइक्रोसर्विस समाधान चलाता है।",
    "IntegrateToYourKubernetesCluster_Description2": "कुबेरनेट्स में किसी भी सेवा को उनके सेवा नाम DNS के साथ एक्सेस करें, जैसे वे आपके स्थानीय कंप्यूटर में चल रही हैं।",
    "IntegrateToYourKubernetesCluster_Description3": "उस क्लस्टर में <span class=\"text-highlight-white\">किसी भी सेवा को इंटरसेप्ट करें</span> , ताकि <span class=\"text-highlight-white\">इंटरसेप्टेड सेवा का सारा ट्रैफ़िक स्वचालित रूप से आपकी स्थानीय मशीन में चल रही आपकी सेवा पर रीडायरेक्ट हो जाए।</span> जब आपकी सेवा को कुबेरनेट्स में किसी सेवा का उपयोग करने की आवश्यकता होती है, तो ट्रैफ़िक को क्लस्टर पर वापस भेज दिया जाता है, जैसे आपकी स्थानीय सेवा कुबेरनेट्स के अंदर चल रही है।",
    "GetInformed": "सूचना मिली",
    "Studio_GetInformed_Description1": "<span class=\"text-highlight-white\">सूचित होने</span> के लिए अपनी संपर्क जानकारी छोड़ें और जब एबीपी स्टूडियो लॉन्च हो जाए तो <span class=\"text-highlight-white\">सबसे पहले इसे आज़माएं</span> ।",
    "Studio_GetInformed_Description2": "नियोजित पूर्वावलोकन रिलीज़ दिनांक: 2023 की तीसरी तिमाही।",
    "ThankYou!": "धन्यवाद!",
    "SendBetaRequest": "बीटा अनुरोध भेजें",
    "YouJoinedTheBetaTesterProgram": "आप एबीपी स्टूडियो बीटा टेस्टर प्रोग्राम में शामिल हुए।",
    "PricingExplanation2": "30 दिन की मनी बैक गारंटी — <a href=\"/faq#refund-policy\">और जानें</a>",
    "MoneyBackGuaranteeText": "* सभी लाइसेंस पर 30 दिन की मनी-बैक गारंटी! टीम पर 100% रिफंड, 30 दिनों के भीतर बिजनेस और एंटरप्राइज लाइसेंस पर 60% रिफंड।",
    "MobileApplicationStartupTemplates": "मोबाइल एप्लिकेशन स्टार्टअप टेम्पलेट्स",
    "MobileApplicationStartupTemplates_Description1": "आपके एबीपी कमर्शियल समाधानों के लिए एकीकृत मोबाइल एप्लिकेशन स्टार्टअप टेम्पलेट।",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates": "एबीपी मोबाइल स्टार्टअप टेम्प्लेट का उपयोग करके शक्तिशाली लाइन-ऑफ-बिजनेस एप्लिकेशन बनाएं",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description1": "एबीपी कमर्शियल <span class=\"text-highlight\">रिएक्ट नेटिव</span> और <span class=\"text-highlight\">.NET MAUI के साथ कार्यान्वित दो मोबाइल एप्लिकेशन स्टार्टअप टेम्पलेट प्रदान करता है।</span> जब आप अपना नया एबीपी-आधारित समाधान बनाते हैं, तो आपके बैकएंड एपीआई से जुड़े बुनियादी स्टार्टअप एप्लिकेशन भी होंगे।",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description2": "एप्लिकेशन में एक पूर्व-निर्मित प्रमाणीकरण टोकन चक्र, <span class=\"text-highlight\">बहु-भाषा समर्थन, बहु-किरायेदारी समर्थन, लॉगिन, पासवर्ड भूल गए, प्रोफ़ाइल प्रबंधन और एक उपयोगकर्ता प्रबंधन पृष्ठ है।</span> आप अपना स्वयं का व्यावसायिक तर्क जोड़ सकते हैं और अपनी आवश्यकताओं के आधार पर इसे अनुकूलित कर सकते हैं।",
    "TwoFrameworkOptions": "दो फ़्रेमवर्क विकल्प",
    "TwoFrameworkOptions_Description": "एबीपी <span class=\"text-highlight\">रिएक्ट नेटिव</span> और <span class=\"text-highlight\">.NET MAUI</span> मोबाइल स्टार्टअप टेम्पलेट दोनों प्रदान करता है। इस तरह, आप वह चुन सकते हैं जो आपकी आवश्यकताओं के लिए सबसे उपयुक्त हो। दोनों ऐप्स iOS और Android प्लेटफ़ॉर्म के बीच उच्चतम दर पर कोड का पुन: उपयोग करते हैं।",
    "PreIntegratedToYourBackend": "आपके बैकएंड पर पूर्व-एकीकृत",
    "PreIntegratedToYourBackend_Description": "एबीपी मोबाइल एप्लिकेशन आपके बैकएंड एपीआई में पूर्व-एकीकृत हैं। यह सर्वर से एक वैध प्रमाणीकरण टोकन प्राप्त करता है और प्रमाणित अनुरोध करता है।",
    "MultiLanguage": "बहु-भाषा",
    "MultiLanguage_Description": "यह पहले से ही 10 से अधिक भाषाओं का समर्थन करता है। आप अगली भाषाएँ भी जोड़ सकते हैं.",
    "Arabic": "अरबी",
    "Czech": "चेक",
    "English": "अंग्रेज़ी",
    "Hungarian": "हंगेरी",
    "Finnish": "फिनिश",
    "French": "फ़्रेंच",
    "Hindi": "हिंदी",
    "Portuguese": "पुर्तगाली",
    "Italian": "इतालवी",
    "Russian": "रूसी",
    "Slovak": "स्लोवाक",
    "Turkish": "तुर्की",
    "EngageAndRetainYourCustomersWithABPMobileApps": "एबीपी मोबाइल ऐप्स के साथ अपने ग्राहकों को जोड़े रखें और बनाए रखें",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description1": "आपके ग्राहक अपने उत्पादों और सदस्यताओं को कहीं से भी, कभी भी प्रबंधित करना चाहते हैं। इसके लिए संगठनों को ऐसे मोबाइल ऐप्स बनाने की आवश्यकता है जो ग्राहकों को उनके अनुरोधों को शीघ्रता और निर्बाध रूप से पूरा करने में सक्षम बनाएं।",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description2": "एबीपी मोबाइल ऐप्स के साथ, आप एंड्रॉइड और आईओएस के लिए उच्च गुणवत्ता वाले देशी मोबाइल ऐप बना सकते हैं... एकल कोडबेस का उपयोग करके और सुरक्षा, गुणवत्ता या स्केलेबिलिटी से समझौता किए बिना।",
    "OneCodeBaseMultipleDevices": "एक कोड-बेस एकाधिक डिवाइस",
    "OneCodeBaseMultipleDevices_Description": "एबीपी मोबाइल एप्लिकेशन क्रॉस-प्लेटफ़ॉर्म हैं। वे आईओएस और एंड्रॉइड उपकरणों पर स्थापित और चलाने के लिए तैयार हैं, और वे एक ही कोड आधार का उपयोग करके विभिन्न फॉर्म कारकों के अनुकूल होते हैं। डेवलपर्स को केवल एक बार यूआई और फ्रंट-एंड कोड बनाने की आवश्यकता है, प्रत्येक डिवाइस के लिए कोड को अनुकूलित करने की कोई आवश्यकता नहीं है जिसे आप समर्थन देना चाहते हैं।",
    "ComesWithTheSourceCode": "सोर्स-कोड के साथ आता है",
    "ComesWithTheSourceCode_Description": "मोबाइल ऐप्स को सोर्स-कोड प्रदान किया जाता है। ब्रांडिंग दिशानिर्देशों को पूरा करने के लिए अपने ऐप्स के UX/UI को आसानी से अनुकूलित करें।",
    "Purchase_OneYearPrice": "1 वर्ष की कीमत",
    "Purchase_DeveloperSeatCount": "डेवलपर सीट गणना",
    "Purchase_DevelopersAlreadyIncluded": "{0} डेवलपर्स पहले से ही शामिल हैं",
    "1Year": "1 वर्ष",
    "{0}Years": "{0} वर्ष",
    "1YearLicense": "1 वर्ष का लाइसेंस",
    "{0}YearsLicense": "{0} वर्ष लाइसेंस",
    "1AdditionalDeveloper": "1 अतिरिक्त डेवलपर",
    "{0}AdditionalDevelopers": "{0} अतिरिक्त डेवलपर्स",
    "Discount": "छूट ({0}%)",
    "Summary": "सारांश",
    "TrainingPack": "प्रशिक्षण पैक",
    "TrainingPackDiscount": "प्रशिक्षण पैक छूट",
    "Purchase_OnboardingTraining_Description": "यह लाइव प्रशिक्षण पैकेज 8 छात्रों की कक्षा के लिए मान्य है और यह छूट केवल नए लाइसेंस के साथ खरीदने पर ही मान्य है। <a href=\"{0}\" class=\"text-white\">और अधिक जानें<i class=\"fa fa-external-link ms-1\"></i></a>",
    "Purchase_Save": "{0}% <span class=\"save ms-1\">बचाएं {1} {2}</span>",
    "RemoveBasket": "टोकरी से निकालें",
    "WhyABPIOPlatform?": "<span class=\"gradient-commercial\">ABP.IO प्लेटफार्म</span> क्यों?",
    "DocumentAim": "इस दस्तावेज़ का लक्ष्य बड़े प्रश्न का उत्तर देना है:",
    "DocumentAim_Description": "&quot;आपको नए सिरे से नया समाधान बनाने के बजाय ABP.IO प्लेटफ़ॉर्म का उपयोग क्यों करना चाहिए?&quot;",
    "DocumentAim_Description2": "दस्तावेज़ एक आधुनिक सॉफ़्टवेयर समाधान के निर्माण की चुनौतियों का परिचय देता है और बताता है कि एबीपी इन चुनौतियों का समाधान कैसे करता है।",
    "CreatingANewSolution": "एक नया समाधान बनाना",
    "CreatingANewSolution_Description": "जब आपको एक नया समाधान शुरू करने की आवश्यकता होती है, तो आपको खुद से बहुत सारे प्रश्न पूछने की ज़रूरत होती है, और आपको अपना पहला व्यवसाय कोड लिखना शुरू करने से पहले बहुत समय बिताना चाहिए।",
    "CreatingAnEmptySolution": "एक खाली समाधान बनाना",
    "THEPROBLEM": "समस्या",
    "CreatingAnEmptySolution_THEPROBLEM_Description": "यहां तक कि लगभग-खाली समाधान बनाना भी चुनौतीपूर्ण है;",
    "CreatingAnEmptySolution_THEPROBLEM_Description2": "आप विभिन्न परियोजनाओं में अपना कोडबेस कैसे व्यवस्थित करते हैं?",
    "CreatingAnEmptySolution_THEPROBLEM_Description3": "परतें क्या हैं और वे कैसे परस्पर क्रिया करती हैं?",
    "CreatingAnEmptySolution_THEPROBLEM_Description4": "आप तृतीय-पक्ष लाइब्रेरी और सिस्टम से कैसे एकीकृत होते हैं?",
    "CreatingAnEmptySolution_THEPROBLEM_Description5": "स्वचालित परीक्षण कैसे सेट करें?",
    "ABPSOLUTION": "एबीपी समाधान",
    "CreatingAnEmptySolution_ABPSOLUTION_Description": "एबीपी <a href=\"https://docs.abp.io/en/abp/latest/Domain-Driven-Design\" target=\"_blank\">डोमेन संचालित डिज़ाइन</a> सिद्धांतों के आधार पर एक अच्छी तरह से सुसज्जित, स्तरित और उत्पादन-तैयार <a href=\"https://docs.abp.io/en/abp/latest/Startup-Templates/Application\" target=\"_blank\">स्टार्टअप समाधान</a> प्रदान करता है। समाधान में प्रत्येक परत के लिए एक पूर्व-कॉन्फ़िगर इकाई और एकीकरण <a href=\"https://docs.abp.io/en/abp/latest/Testing\" target=\"_blank\">परीक्षण</a> परियोजनाएं भी शामिल हैं।",
    "CommonLibraries": "सामान्य पुस्तकालय",
    "CommonLibraries_THEPROBLEM_Description": "सामान्य आवश्यकताओं को लागू करने के लिए आपको किन पुस्तकालयों का उपयोग करना चाहिए? सॉफ़्टवेयर विकास पारिस्थितिकी तंत्र अत्यधिक गतिशील है, जिससे नवीनतम टूल, लाइब्रेरी, रुझान और दृष्टिकोण के साथ बने रहना चुनौतीपूर्ण हो जाता है।",
    "CommonLibraries_ABPSOLUTION_Description": "एबीपी लोकप्रिय, परिपक्व और अद्यतित पुस्तकालयों को समाधान में पूर्व-एकीकृत करता है। आपको उन्हें एकीकृत करने या उन्हें एक-दूसरे के साथ संवाद करने में समय बर्बाद करने की आवश्यकता नहीं है। वे लीक से हटकर ठीक से काम करते हैं।",
    "UITheme&Layout": "यूआई थीम और लेआउट",
    "UITheme&Layout_THEPROBLEM_Description": "यूआई चिंताओं को संबोधित करते समय, कई प्रकार की चुनौतियाँ सामने आती हैं। इनमें एक सुसंगत उपस्थिति और नेविगेशन मेनू, हेडर, टूलबार, फ़ुटर, विजेट और बहुत कुछ जैसी कई सुविधाओं के साथ एक उत्तरदायी, समकालीन और अनुकूलनीय यूआई किट के लिए आधारभूत कार्य स्थापित करना शामिल है।",
    "UITheme&Layout_THEPROBLEM_Description2": "भले ही आप पूर्व-डिज़ाइन की गई थीम चुनते हैं, इसे अपने प्रोजेक्ट में सहजता से एकीकृत करने के लिए विकास के दिनों की आवश्यकता हो सकती है। एक अतिरिक्त बाधा ऐसे विषयों को अपग्रेड करने में है। अक्सर, थीम की HTML/CSS संरचना आपके यूआई कोड के साथ जुड़ जाती है, जिससे भविष्य में थीम में बदलाव होते हैं या जटिल कार्यों को अपग्रेड किया जाता है। कोड और डिज़ाइन का यह अंतर्संबंध लाइन में समायोजन करने के लचीलेपन को जटिल बनाता है।",
    "UITheme&Layout_ABPSOLUTION_Description": "एबीपी फ्रेमवर्क एक विशिष्ट थीम प्रणाली प्रदान करता है जो आपके यूआई कोड को थीम बाधाओं से मुक्त करता है। थीम्स अलगाव में मौजूद हैं, NuGet या NPM पैकेज के रूप में पैक किए गए हैं, जिससे थीम इंस्टालेशन या अपग्रेड कुछ ही मिनटों में हो जाता है। जबकि आप अपने कस्टम थीम को विकसित करने या किसी मौजूदा को एकीकृत करने का विकल्प बरकरार रखते हैं, एबीपी कमर्शियल पॉलिश और समकालीन थीम का एक संग्रह प्रस्तुत करता है।",
    "UITheme&Layout_ABPSOLUTION_Description2": "इसके अतिरिक्त, टेलरिक और डेवएक्सप्रेस जैसे यूआई घटक प्रदाता भी हैं। हालाँकि, ये प्रदाता मुख्य रूप से व्यक्तिगत घटकों को प्रस्तुत करते हैं, जिससे आपके लेआउट सिस्टम को स्थापित करने की जिम्मेदारी आप पर आ जाती है। एबीपी-आधारित परियोजनाओं के भीतर काम करते समय, आप इन पुस्तकालयों को सहजता से शामिल कर सकते हैं, जैसे आप किसी अन्य परियोजना में करेंगे।",
    "TestInfrastructure": "परीक्षण अवसंरचना",
    "TestInfrastructure_THEPROBLEM_Description": "एक मजबूत परीक्षण वातावरण स्थापित करना एक समय लेने वाला प्रयास है। इसमें आपके समाधान के भीतर समर्पित परीक्षण परियोजनाएं स्थापित करना, आवश्यक उपकरणों का सावधानीपूर्वक चयन करना, सेवा और डेटाबेस मॉक बनाना, परीक्षणों में अनावश्यक कोड को कम करने के लिए आवश्यक आधार कक्षाएं और उपयोगिता सेवाएं तैयार करना और विभिन्न संबंधित कार्यों को संबोधित करना शामिल है।",
    "TestInfrastructure_ABPSOLUTION_Description": "एबीपी स्टार्टअप टेम्प्लेट आपके लिए प्रक्रिया को सुव्यवस्थित करते हुए, कॉन्फ़िगर किए गए परीक्षण प्रोजेक्टों से पहले से सुसज्जित होते हैं। इसका मतलब यह है कि पहले दिन से, आप बिना किसी देरी के आसानी से अपना प्रारंभिक इकाई या एकीकरण परीक्षण कोड लिखना शुरू कर सकते हैं।",
    "CodingStandards&Training": "कोडिंग मानक एवं प्रशिक्षण",
    "CodingStandards&Training_THEPROBLEM_Description": "विकास के लिए समाधान स्थापित करने के बाद, आपको आमतौर पर डेवलपर्स को यह सिखाना होगा कि सिस्टम कैसे काम करता है और समान सहमत तरीकों का उपयोग करके इसे कैसे बनाया जाए। भले ही आप उन्हें प्रशिक्षण दें, दस्तावेज़ीकरण को अद्यतन रखना कठिन हो सकता है। जैसे-जैसे समय बीतता है, प्रत्येक डेवलपर अपने तरीके से कोड लिख सकता है, जिससे कोड लिखने के नियम एक-दूसरे से भिन्न हो जाते हैं।",
    "CodingStandards&Training_ABPSOLUTION_Description": "एबीपी समाधान पहले से ही सुव्यवस्थित है और इसमें स्पष्ट स्पष्टीकरण हैं। चरण-दर-चरण ट्यूटोरियल और मार्गदर्शिकाएँ आपको दिखाती हैं कि एबीपी प्रोजेक्ट पर कैसे काम करना है।",
    "KeepingYourSolutionUpToDate": "अपने समाधान को अद्यतन रखना",
    "KeepingYourSolutionUpToDate_THEPROBLEM_Description": "अपना विकास शुरू करने के बाद, आपको अपग्रेड और पैच के लिए उपयोग की जाने वाली लाइब्रेरी के नए संस्करणों पर नज़र रखनी होगी।",
    "KeepingYourSolutionUpToDate_ABPSOLUTION_Description": "हम नियमित रूप से सभी पैकेजों को नवीनतम संस्करणों में अपडेट करते हैं और स्थिर रिलीज़ से पहले उनका परीक्षण करते हैं। जब आप एबीपी फ्रेमवर्क को अपडेट करते हैं, तो इसकी सभी निर्भरताएं एज टेक्नोलॉजी में अपग्रेड हो जाती हैं।",
    "DRY": "अपने आप को मत दोहराओ!",
    "DRY_Description": "आधार समाधान बनाने में काफी समय लगता है और अच्छे वास्तुशिल्प अनुभव की आवश्यकता होती है। हालाँकि, यह तो बस शुरुआत है! जैसे-जैसे आप विकास करना शुरू करेंगे, आपको संभवतः बहुत सारे दोहराव वाले कोड लिखने पड़ेंगे; यह बहुत अच्छा होगा यदि यह सब स्वचालित रूप से संभाला जा सके।",
    "DRY_Description2": "एबीपी कॉन्फ़िगरेशन सिद्धांत पर कन्वेंशन का पालन करके दोहराए जाने वाले कोड को यथासंभव स्वचालित और सरल बनाता है। हालाँकि, जब आपको मैन्युअल गियर पर स्विच करने की आवश्यकता होती है तो यह आपको प्रतिबंधित नहीं करता है। नियंत्रण सदैव आपके हाथ में है.",
    "Authentication": "प्रमाणीकरण",
    "Authentication_THEPROBLEM_Description": "एकल साइन ऑन, सक्रिय निर्देशिका/एलडीएपी एकीकरण, ओपनइडिक्ट एकीकरण, सामाजिक लॉगिन, दो-कारक प्रमाणीकरण, पासवर्ड भूल गए/रीसेट, ईमेल सक्रियण, नया उपयोगकर्ता पंजीकरण, पासवर्ड जटिलता नियंत्रण, असफल प्रयासों पर खाता लॉक करना, असफल लॉगिन प्रयास दिखाना... आदि। हम जानते हैं कि इन सभी सामान्य आवश्यकताओं से आप परिचित हैं। आप अकेले नहीं हैं!",
    "Authentication_ABPSOLUTION_Description": "एबीपी फ्रेमवर्क और व्यावसायिक संस्करण आपके लिए पुन: प्रयोज्य खाता मॉड्यूल के रूप में पूर्व-क्रियान्वित ये सभी मानक सामग्री प्रदान करते हैं। आप बस वही सक्षम और कॉन्फ़िगर करें जिसकी आपको आवश्यकता है।",
    "CrossCuttingConcerns": "फिल्म आदि में दृश्यों के संपादन संबंधी चिंताएं",
    "CrossCuttingConcerns_THEPROBLEM_Description": "क्रॉस-कटिंग चिंताएं मौलिक दोहराव तर्क हैं जिन्हें प्रत्येक उपयोग के मामले में लागू किया जाना चाहिए। कुछ उदाहरण;",
    "CrossCuttingConcerns_THEPROBLEM_Description2": "लेन-देन शुरू करना, सफलता पर प्रतिबद्ध होना और त्रुटियों पर वापस लौटना।",
    "CrossCuttingConcerns_THEPROBLEM_Description3": "अपवादों को संभालना और रिपोर्ट करना, ग्राहकों को उचित त्रुटि प्रतिक्रिया लौटाना और ग्राहक पक्ष पर त्रुटि मामलों को संभालना।",
    "CrossCuttingConcerns_THEPROBLEM_Description4": "प्राधिकरण और सत्यापन को कार्यान्वित करना, उचित प्रतिक्रियाएँ लौटाना और ग्राहक पक्ष पर इन्हें संभालना।",
    "CrossCuttingConcerns_ABPSOLUTION_Description": "एबीपी फ्रेमवर्क सभी सामान्य क्रॉस-कटिंग चिंताओं को स्वचालित या सरल बनाता है। आप केवल वही कोड लिखते हैं जो आपके व्यवसाय के लिए मायने रखता है, और एबीपी परंपराओं के अनुसार बाकी काम संभालता है।",
    "ArchitecturalInfrastructure": "वास्तु संरचना",
    "ArchitecturalInfrastructure_THEPROBLEM_Description": "आपको आमतौर पर अपने आर्किटेक्चर को ठीक से लागू करने के लिए बुनियादी ढांचे का निर्माण करने की आवश्यकता होती है। उदाहरण के लिए, आप आम तौर पर रिपॉजिटरी पैटर्न लागू करते हैं। आप संस्थाओं, सेवाओं, नियंत्रकों और अन्य वस्तुओं को बनाने के लिए सरलीकरण और मानकीकरण के लिए कुछ आधार वर्गों को परिभाषित करते हैं।",
    "ArchitecturalInfrastructure_ABPSOLUTION_Description": "एबीपी फ्रेमवर्क ये सब और बहुत कुछ आउट ऑफ द बॉक्स प्रदान करता है। यह परिपक्व और अच्छी तरह से प्रलेखित है।",
    "EnterpriseApplicationRequirements": "एंटरप्राइज़ एप्लिकेशन आवश्यकताएँ",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description": "ऐसी बहुत सी आवश्यकताएँ हैं जिन्हें आप प्रत्येक व्यावसायिक अनुप्रयोग में बार-बार लागू करते हैं;",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description2": "भूमिकाओं और उपयोगकर्ताओं के आधार पर यूआई पर विस्तृत अनुमति प्रणाली और अनुमतियाँ प्रबंधित करना।",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description3": "जब कोई उपयोगकर्ता डेटाबेस रिकॉर्ड को संशोधित करता है तो उसे ट्रैक करने के लिए ऑडिट लॉग और इकाई इतिहास लिखना।",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description4": "अपनी इकाइयों को सॉफ्ट डिलीट बनाएं, ताकि उन्हें डेटाबेस से भौतिक रूप से हटाने के बजाय हटाए गए के रूप में चिह्नित किया जा सके और स्वचालित रूप से आपके प्रश्नों पर हटाई गई इकाइयों को फ़िल्टर किया जा सके।",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description5": "फ्रंटएंड कोड से अपने बैकएंड एपीआई का उपभोग करने के लिए एब्स्ट्रैक्शन और रैपर बनाना।",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description6": "पृष्ठभूमि कार्यों को कतारबद्ध करना और निष्पादित करना।",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description7": "एक वैश्विक प्रणाली में अनेक समय क्षेत्रों को संभालना।",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description8": "सर्वर और क्लाइंट के बीच सत्यापन, स्थानीयकरण, प्राधिकरण तर्क साझा करना।",
    "EnterpriseApplicationRequirements_ABPSOLUTION_Description": "एबीपी ऐसी आवश्यकताओं को आसानी से लागू करने के लिए एक बुनियादी ढांचा प्रदान करता है। फिर, आप इन सभी को बार-बार लागू करने के लिए अपना बहुमूल्य समय बर्बाद नहीं करते हैं।",
    "GeneratingInitialCode&Tooling": "प्रारंभिक कोड और टूलींग उत्पन्न करना",
    "GeneratingInitialCode&Tooling_THEPROBLEM_Description": "आप एक सामान्य वेब एप्लिकेशन में कई समान पेज बनाएंगे। उनमें से अधिकांश समान सीआरयूडी ऑपरेशन करेंगे। बार-बार ऐसे पेज बनाना बहुत कठिन और त्रुटि-प्रवण भी है।",
    "GeneratingInitialCode&Tooling_ABPSOLUTION_Description": "<a href=\"/tools/suite\">एबीपी सुइट</a> आपकी संस्थाओं के लिए कुछ ही सेकंड में एक पूर्ण-स्टैक सीआरयूडी पेज तैयार कर सकता है। उत्पन्न कोड स्तरित और साफ है। सभी मानक सत्यापन और प्राधिकरण आवश्यकताएँ लागू की गई हैं। साथ ही, यूनिट परीक्षण कक्षाएं उत्पन्न होती हैं। एक बार जब आपको पूरी तरह से चलने वाला पृष्ठ मिल जाए, तो आप इसे अपनी व्यावसायिक आवश्यकताओं के अनुसार संशोधित कर सकते हैं।",
    "IntegratingTo3rdPartyLibrariesAndSystems": "तृतीय-पक्ष पुस्तकालयों और प्रणालियों से एकीकरण",
    "IntegratingTo3rdPartyLibrariesAndSystems_THEPROBLEM_Description": "अधिकांश पुस्तकालयों को निम्न स्तर के रूप में डिज़ाइन किया गया है, और आप आमतौर पर अपने समाधान में हर जगह समान एकीकरण और कॉन्फ़िगरेशन कोड को दोहराए बिना उन्हें ठीक से एकीकृत करने के लिए कुछ काम करते हैं। उदाहरण के लिए, मान लें कि आपको अपनी वितरित ईवेंट बस को लागू करने के लिए RabbitMQ का उपयोग करना होगा। आप बस इतना करना चाहते हैं; एक संदेश को कतार में भेजें और आने वाले संदेशों को संभालें। लेकिन आपको मैसेजिंग पैटर्न, कतार और विनिमय विवरण को समझने की आवश्यकता है। कुशल कोड लिखने के लिए, आपको कनेक्शन, क्लाइंट और चैनल प्रबंधित करने के लिए एक पूल बनाना होगा। आपको अपवादों, ACK संदेशों, विफलताओं पर RabbitMQ से पुनः कनेक्ट करने आदि से भी निपटना होगा।",
    "IntegratingTo3rdPartyLibrariesAndSystems_ABPSOLUTION_Description": "उदाहरण के लिए, एबीपी का रैबिटएमक्यू डिस्ट्रीब्यूटेड इवेंट बस एकीकरण इन सभी विवरणों को सारगर्भित करता है। आप बिना किसी हलचल के संदेश भेजते और प्राप्त करते हैं। क्या आपको निम्न-स्तरीय कोड लिखने की आवश्यकता है? कोई बात नहीं, आप ऐसा हमेशा कर सकते हैं। जब आपको आपके द्वारा उपयोग की जा रही लाइब्रेरी की निम्न-स्तरीय सुविधाओं का उपयोग करने की आवश्यकता होती है तो एबीपी आपको प्रतिबंधित नहीं करता है।",
    "WhyNotBuildYourOwnFramework?": "अपना स्वयं का ढाँचा क्यों नहीं बनाते?",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description": "सभी बुनियादी ढांचे को, यहां तक कि सबसे सरल तरीके से भी, निर्माण, रखरखाव और दस्तावेजीकरण में बहुत समय लगता है। यह समय के साथ बड़ा हो जाता है, और इसे आपके समाधान में बनाए रखना कठिन हो जाता है। इन्हें पुन: प्रयोज्य परियोजना में अलग करना आपके स्वयं के आंतरिक ढांचे के निर्माण के लिए प्रारंभिक बिंदु है।",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description2": "आंतरिक ढांचे का निर्माण, दस्तावेजीकरण, प्रशिक्षण और रखरखाव वास्तव में कठिन है। यदि आपके पास एक अनुभवी, समर्पित फ्रेमवर्क टीम नहीं है, तो आपका आंतरिक ढांचा तेजी से एक अप्रलेखित विरासत कोड बन जाता है जिसे अब कोई भी समझ और बनाए नहीं रख सकता है। दूसरी ओर, ये ढाँचे आम तौर पर टीम में एक या दो डेवलपर्स द्वारा विकसित किए जाते हैं। और ये साथी ज्ञान भंडार बनते जा रहे हैं। यह उनके लिए अच्छा है लेकिन कंपनी के लिए बुरा है क्योंकि वे परियोजना की विफलता का एकमात्र बिंदु <a href=\"https://en.wikipedia.org/wiki/Single_point_of_failure\">-SPOF-</a> हैं। एक बार जब वे कंपनी छोड़ देते हैं, तो प्रोजेक्ट नाटकीय रूप से बंद हो जाता है।",
    "WhyNotBuildYourOwnFramework_ABPSOLUTION_Description": "एबीपी फ्रेमवर्क एक समुदाय-संचालित, अच्छी तरह से प्रलेखित, परिपक्व और सामान्य एप्लिकेशन फ्रेमवर्क है। अत्यधिक अनुभवी डेवलपर्स की एक टीम इसे अद्यतन, समझने में आसान और उपयोग में आरामदायक बनाए रखने के लिए कड़ी मेहनत कर रही है। इस तरह के स्थिर ढांचे का उपयोग करने से आप अपने स्वयं के व्यवसाय कोड पर ध्यान केंद्रित कर सकते हैं और जब भी आपको आवश्यकता हो तो विशेषज्ञों से ढांचे के बारे में सहायता प्राप्त कर सकते हैं।",
    "ArchitecturalInfrastructure_Description": "SaaS एप्लिकेशन, मॉड्यूलर या माइक्रोसर्विस सिस्टम सबसे अधिक उपयोग किए जाने वाले एंटरप्राइज़ सॉफ़्टवेयर मॉडल हैं। ऐसी प्रणालियों के निर्माण के लिए न केवल अच्छी समझ और अनुभव की आवश्यकता होती है बल्कि एक मजबूत सॉफ्टवेयर बुनियादी ढांचे की भी आवश्यकता होती है। अन्यथा, आप अपने कोडबेस में इन वास्तुशिल्प विवरणों का समर्थन करने के लिए स्वयं को एक बड़ा प्रयास करते हुए पाएंगे।",
    "Modularity": "प्रतिरूपकता",
    "Modularity_THEPROBLEM_Description": "वास्तव में मॉड्यूलर सिस्टम बनाना आसान नहीं है! सिस्टम के सभी पहलुओं (डेटाबेस, इकाइयां, एपीआई, यूआई पेज/घटक) को मॉड्यूल में विभाजित किया जा सकता है, और प्रत्येक मॉड्यूल को अन्य के बिना पुन: उपयोग किया जा सकता है। सादा ASP.NET कोर ऐसी मॉड्यूलर वास्तुकला प्रदान नहीं करता है। यदि आपको इसकी आवश्यकता है, तो आपको इसके बारे में नए सिरे से सोचना चाहिए।",
    "Modularity_ABPSOLUTION_Description": "एबीपी फ्रेमवर्क का जन्म एक मॉड्यूलर एप्लिकेशन डेवलपमेंट संरचना के रूप में हुआ है। फ्रेमवर्क में प्रत्येक सुविधा को मॉड्यूलरिटी के अनुकूल बनाने के लिए विकसित किया गया है। दस्तावेज़ीकरण और मार्गदर्शिकाएँ बताती हैं कि मानक तरीके से पुन: प्रयोज्य मॉड्यूल कैसे विकसित करें।",
    "SaaSMultiTenancy": "सास/बहु-किरायेदारी",
    "SaaSMultiTenancy_THEPROBLEM_Description": "<a href=\"https://docs.abp.io/en/abp/latest/Multi-Tenancy\">मल्टी-टेनेंसी</a> SaaS सिस्टम को लागू करने का एक सामान्य तरीका है। हालाँकि, एक सतत बहु-किरायेदार बुनियादी ढांचे को लागू करना जटिल हो सकता है।",
    "SaaSMultiTenancy_ABPSOLUTION_Description": "एबीपी फ्रेमवर्क आपके बिजनेस कोड से संपूर्ण बहु-किरायेदार बुनियादी ढांचा और अमूर्त जटिलता प्रदान करता है। आपका एप्लिकेशन कोड अधिकतर बहु-किरायेदारी से अवगत होगा, जबकि एबीपी फ्रेमवर्क स्वचालित रूप से किरायेदारों के डेटाबेस, कैश और अन्य विवरणों को एक दूसरे से अलग करता है। यह एकल डेटाबेस, प्रति किरायेदार डेटाबेस और हाइब्रिड दृष्टिकोण का समर्थन करता है। यह Microsoft Identity और OpenIddict जैसे पुस्तकालयों को ठीक से कॉन्फ़िगर करता है, जो सामान्य रूप से बहु-किरायेदारी संगत नहीं हैं।",
    "Microservices": "माइक्रोसर्विसेज",
    "Microservices_THEPROBLEM_Description": "माइक्रोसर्विस सिस्टम के निर्माण के लिए कई बुनियादी ढांचे के विवरणों की आवश्यकता होती है: अनुप्रयोगों और माइक्रोसर्विसेज को प्रमाणित और अधिकृत करना और माइक्रोसर्विसेज के बीच एसिंक्रोनस मैसेजिंग और सिंक्रोनस (रेस्ट/जीआरपीसी) संचार पैटर्न को लागू करना सबसे बुनियादी मुद्दे हैं।",
    "Microservices_ABPSOLUTION_Description": "एबीपी फ्रेमवर्क उद्योग मानक टूल का उपयोग करके आपके माइक्रोसर्विस समाधान को लागू करने में मदद करने के लिए सेवाएं, <a href=\"https://docs.abp.io/en/abp/latest/Microservice-Architecture\" target=\"_blank\">गाइड</a> और नमूने प्रदान करता है।",
    "Microservices_ABPSOLUTION_Description2": "एबीपी कमर्शियल एक कदम आगे बढ़कर आपके माइक्रोसर्विस समाधान को किक-स्टार्ट करने के लिए एक संपूर्ण <a href=\"https://docs.abp.io/en/commercial/latest/startup-templates/microservice/index\" target=\"_blank\">स्टार्टअप टेम्पलेट</a> प्रदान करता है।",
    "PreBuiltModules": "पूर्व-निर्मित मॉड्यूल",
    "PreBuiltModules_THEPROBLEM_Description": "हम सभी की व्यावसायिक आवश्यकताएँ समान लेकिन थोड़ी भिन्न होती हैं। हालाँकि, हम सभी को पहिए का फिर से आविष्कार करना चाहिए क्योंकि किसी का कोड सीधे हमारे समाधान में काम नहीं कर सकता है। वे सभी एक बड़े समाधान के अंतर्निहित भाग हैं।",
    "PreBuiltModules_ABPSOLUTION_Description": "एबीपी कमर्शियल <a href=\"/modules\">मॉड्यूल</a> भुगतान, चैट, फ़ाइल प्रबंधन, ऑडिट लॉग रिपोर्टिंग... आदि जैसे कई पुन: प्रयोज्य एप्लिकेशन मॉड्यूल प्रदान करता है। ये सभी मॉड्यूल आसानी से आपके समाधान में स्थापित होते हैं और सीधे काम करते हैं। हम लगातार अधिक मॉड्यूल जोड़ रहे हैं।",
    "PreBuiltModules_ABPSOLUTION_Description2": "सभी मॉड्यूल आपकी व्यावसायिक आवश्यकताओं के अनुरूप डिज़ाइन किए गए हैं। यदि आपको पूर्ण नियंत्रण की आवश्यकता है, तो आप किसी भी मॉड्यूल का पूर्ण स्रोत कोड डाउनलोड कर सकते हैं और अपनी विशिष्ट व्यावसायिक आवश्यकताओं के आधार पर पूरी तरह से अनुकूलित कर सकते हैं।",
    "ABPCommunity": "एबीपी समुदाय",
    "ABPCommunity_Description": "अंत में, एक बड़े समुदाय में होने से जहां हर कोई समान कोडिंग शैलियों और सिद्धांतों का पालन करता है और एक सामान्य बुनियादी ढांचे को साझा करता है, जब आपको परेशानी होती है या डिज़ाइन निर्णयों में मदद की ज़रूरत होती है तो शक्ति मिलती है। चूँकि हम समान रूप से कोड लिखते हैं, हम एक-दूसरे की बेहतर मदद कर सकते हैं। एबीपी एक समुदाय-समर्थित परियोजना है जिसमें GitHub पर 10K से अधिक सितारे हैं।",
    "ABPCommunity_Description2": "एबीपी डेवलपर्स के बीच कोड या पुन: प्रयोज्य लाइब्रेरी साझा करना आसान है। एक कोड स्निपेट जो आपके लिए काम करता है वह दूसरों के लिए भी काम करेगा। ऐसे बहुत सारे नमूने और ट्यूटोरियल हैं जिन्हें आप सीधे अपने एप्लिकेशन के लिए लागू कर सकते हैं।",
    "ABPCommunity_Description3": "जब आप किसी ऐसे डेवलपर को नियुक्त करते हैं जिसने पहले एबीपी आर्किटेक्चर के साथ काम किया है तो वह तुरंत आपके समाधान को समझ जाएगा और बहुत कम समय में विकास शुरू कर देगा।",
    "WhyAbpIo_Page_Title": "ABP.IO प्लेटफार्म क्यों?",
    "AbpStudio_Page_Title": "एबीपी स्टूडियो",
    "CampaignInfo": "नया लाइसेंस खरीदें या अपने मौजूदा लाइसेंस को नवीनीकृत करें और बिना किसी अतिरिक्त लागत के <span class=\"text-white\">अतिरिक्त 2 महीने प्राप्त करें</span> ! यह ऑफर सभी लाइसेंस योजनाओं के लिए मान्य है। सुनिश्चित करें कि आप प्रीमियम सुविधाओं और अपग्रेड तक अपनी पहुंच बढ़ाने के लिए इस सीमित समय के प्रमोशन का लाभ उठाएं।",
    "HurryUpLastDay": "जल्दी करो! अंतिम दिन: {0}",
    "CreatingCRUDPagesWithABPSuite": "एबीपी सुइट के साथ सीआरयूडी पेज बनाना",
    "Testimonials": "प्रशंसापत्र",
    "MultipleYearDiscount": "एकाधिक वर्ष की छूट",
    "CampaignDiscountText": "ब्लैक फ्राइडे डिस्काउंट",
    "CampaignDiscountName": "ब्लैक फ्राइडे",
    "CampaignName:BlackFriday": "ब्लैक फ्राइडे"
  }
}