{
  "culture": "hi",
  "texts": {
    "OrganizationManagement": "संगठन का प्रबंधन",
    "OrganizationList": "संगठन सूची",
    "Volo.AbpIo.Commercial:010003": "आप इस संगठन के मालिक नहीं हैं!",
    "OrganizationNotFoundMessage": "कोई संगठन नहीं मिला!",
    "DeveloperCount": "आवंटित / कुल डेवलपर्स",
    "QuestionCount": "शेष / कुल प्रश्न",
    "Unlimited": "असीमित",
    "Owners": "मालिकों",
    "AddMember": "सदस्य जोड़ें",
    "AddOwner": "मालिक जोड़ें",
    "AddDeveloper": "डेवलपर जोड़ें",
    "UserName": "उपयोगकर्ता नाम",
    "Name": "नाम",
    "EmailAddress": "ईमेल पता",
    "Developers": "डेवलपर्स",
    "LicenseType": "लाइसेंस के प्रकार",
    "Manage": "प्रबंधित",
    "StartDate": "आरंभ करने की तिथि",
    "EndDate": "समाप्ति तिथि",
    "Modules": "मॉड्यूल",
    "LicenseExtendMessage": "आपकी लाइसेंस समाप्ति तिथि {0} तक बढ़ा दी गई है",
    "LicenseUpgradeMessage": "आपका लाइसेंस {0} में अपग्रेड किया गया है",
    "LicenseAddDeveloperMessage": "{0} डेवलपर्स ने आपके लाइसेंस में जोड़ा",
    "Volo.AbpIo.Commercial:010004": "निर्दिष्ट उपयोगकर्ता नहीं मिल सकता है! उपयोगकर्ता को पहले से ही पंजीकृत होना चाहिए।",
    "MyOrganizations": "मेरे संगठन",
    "ApiKey": "एपीआई कुंजी",
    "UserNameNotFound": "उपयोगकर्ता नाम {0} का कोई उपयोगकर्ता नहीं है",
    "SuccessfullyAddedToNewsletter": "हमारे न्यूज़लेटर की सदस्यता के लिए धन्यवाद!",
    "MyProfile": "मेरी प्रोफाइल",
    "EmailNotValid": "कृपया एक वैध ई - मेल एड्रेस डालें।",
    "JoinOurMarketingNewsletter": "हमारे विपणन समाचार पत्र में शामिल हों",
    "WouldLikeToReceiveMarketingMaterials": "मैं उत्पाद सौदों और विशेष प्रस्तावों जैसे विपणन सामग्री प्राप्त करना चाहता हूं।",
    "StartUsingYourLicenseNow": "अब अपने लाइसेंस का उपयोग शुरू करें!",
    "WelcomePage": "स्वागत पृष्ठ",
    "UnsubscriptionExpireEmail": "लाइसेंस समाप्ति तिथि अनुस्मारक ईमेल से सदस्यता समाप्त करें",
    "UnsubscribeLicenseExpireEmailReminderMessage": "इस ईमेल सदस्यता में केवल आपकी लाइसेंस समाप्ति तिथि याद दिलाने की होती है।",
    "UnsubscribeFromLicenseExpireEmails": "यदि आप अपने लाइसेंस की समाप्ति तिथि के बारे में ईमेल प्राप्त नहीं करना चाहते हैं, तो आप किसी भी समय अपनी सदस्यता समाप्त कर सकते हैं।",
    "Unsubscribe": "सदस्यता रद्द",
    "NotOrganizationMember": "आप किसी संगठन के सदस्य नहीं हैं।",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "सफलतापूर्वक सदस्यता समाप्त कर दी गई",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "अब आपको लाइसेंस समाप्ति तिथि अनुस्मारक ईमेल प्राप्त नहीं होंगे।",
    "IndexPageHeroSection": "<span class=\"first-line\">एक पूर्ण</span><span class=\"second-line\"> वेब डेवलपमेंट प्लेटफॉर्म</span><span class=\"third-line\">बिल्ट-ऑन <img src=\"{0}\" width=\"110\" class=\"ml-1\" /> Framework</span>",
    "AbpCommercialShortDescription": "एबीपी कमर्शियल प्री-बिल्ट एप्लिकेशन मॉड्यूल, रैपिड एप्लिकेशन डेवलपमेंट टूलिंग, पेशेवर यूआई थीम, प्रीमियम सपोर्ट आदि प्रदान करता है।",
    "LiveDemo": "लाइव डेमो",
    "GetLicence": "एक लाइसेंस प्राप्त करें",
    "Application": "आवेदन",
    "StartupTemplates": "स्टार्टअप टेम्पलेट",
    "Startup": "चालू होना",
    "Templates": "टेम्पलेट्स",
    "Developer": "डेवलपर",
    "Tools": "उपकरण",
    "Premium": "प्रीमियम",
    "PremiumSupport": "प्रीमियम सहायता",
    "PremiumForumSupport": "प्रीमियम फोरम समर्थन",
    "UI": "यूआई",
    "Themes": "विषयों",
    "JoinOurNewsletter": "हमारे समाचार पत्र शामिल हों",
    "Send": "संदेश",
    "Learn": "सीखना",
    "AdditionalServices": "अतिरिक्त सेवाएं",
    "WhatIsABPFramework": "ABP फ्रेमवर्क क्या है?",
    "OpenSourceBaseFramework": "ओपन सोर्स बेस फ्रेमवर्क",
    "ABPFrameworkExplanation": "<p class=\"lead\"> ABP कमर्शियल ASP.NET Core पर एक खुला स्रोत और समुदाय संचालित वेब एप्लीकेशन फ्रेमवर्क है। और सर्वोत्तम प्रथाओं के साथ परीक्षण योग्य कोड। </p><p> आप पहले से ही जानते हैं कि लोकप्रिय उपकरणों पर निर्मित और एकीकृत। कम सीखने की अवस्था, आसान अनुकूलन, आरामदायक विकास। </p>",
    "Modular": "मॉड्यूलर",
    "MicroserviceCompatible": "माइक्रोसिस्ट सेवा संगत",
    "DomainDrivenDesignInfrastructure": "डोमेन संचालित डिज़ाइन इन्फ्रास्ट्रक्चर",
    "MultiTenancy": "बहु किरायेदारी",
    "DistributedMessaging": "वितरित संदेश",
    "DynamicProxying": "गतिशील प्रॉक्सी",
    "BackgroundJobs": "बैकग्राउंड जॉब्स",
    "AuditLogging": "ऑडिट लॉगिंग",
    "BLOBStoring": "ब्लॉब भंडारण",
    "BundlingMinification": "बंडलिंग और न्यूनतमकरण",
    "AdvancedLocalization": "उन्नत स्थानीयकरण",
    "ManyMore": "बहुत सारी",
    "ExploreTheABPFramework": "ABP फ्रेमवर्क का अन्वेषण करें",
    "WhyUseTheABPCommercial": "एबीपी कमर्शियल का उपयोग क्यों करें?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\"> बिल्डिंग एंटरप्राइज-ग्रेड वेब एप्लिकेशन जटिल और समय लेने वाली हो सकती हैं। </p><p> ABP कमर्शियल सभी आधुनिक एंटरप्राइज-ग्रेड ASP.NET Core के लिए आवश्यक सही आधारभूत संरचना प्रदान करता है। आधारित समाधान। डिज़ाइन से परिनियोजन तक, संपूर्ण विकास चक्र ABP की अंतर्निहित विशेषताओं और मॉड्यूल द्वारा सशक्त है। </p>",
    "StartupTemplatesShortDescription": "स्टार्टअप टेम्प्लेट आपको कुछ ही सेकंड में अपने प्रोजेक्ट के लिए जंप-स्टार्ट करते हैं।",
    "UIFrameworksOptions": "यूआई चौखटे विकल्प;",
    "DatabaseProviderOptions": "डेटाबेस प्रदाता विकल्प;",
    "PreBuiltApplicationModules": "पूर्व निर्मित अनुप्रयोग मॉड्यूल",
    "PreBuiltApplicationModulesShortDescription": "अधिकांश सामान्य अनुप्रयोग आवश्यकताएं आपके लिए पुन: प्रयोज्य मॉड्यूल के रूप में पहले से ही विकसित हैं।",
    "Account": "लेखा",
    "Blogging": "ब्लॉगिंग",
    "Identity": "पहचान",
    "IdentityServer": "पहचान सर्वर",
    "Saas": "सास",
    "LanguageManagement": "भाषा प्रबंधन",
    "TextTemplateManagement": "पाठ टेम्पलेट प्रबंधन",
    "See All Modules": "SeeAllModules",
    "ABPSuite": "एबीपी सूट",
    "AbpSuiteShortDescription": "ABP सुइट ABP वाणिज्यिक का एक पूरक उपकरण है।",
    "AbpSuiteExplanation": "यह आपको कुछ ही मिनटों में वेब पेज बनाने की अनुमति देता है। यह .NET कोर ग्लोबल टूल है जिसे कमांड लाइन से इंस्टॉल किया जा सकता है। यह एक नया ABP समाधान बना सकता है, डेटाबेस से फ्रंट-एंड तक CRUD पेज बना सकता है।",
    "Details": "विवरण",
    "LeptonTheme": "लिप्टन थीम",
    "ProfessionalModernUIThemes": "पेशेवर, आधुनिक यूआई थीम",
    "LeptonThemeExplanation": "लेप्टान बूटस्ट्रैप व्यवस्थापक थीम का एक सरगम प्रदान करता है जो किसी भी परियोजना के लिए एक ठोस नींव के रूप में कार्य करता है जिसमें व्यवस्थापक डैशबोर्ड की आवश्यकता होती है।",
    "DefaultTheme": "पूर्व निर्धारित विषय",
    "MaterialTheme": "सामग्री थीम",
    "Default2Theme": "डिफ़ॉल्ट 2 थीम",
    "DarkTheme": "डार्क थीम",
    "DarkBlueTheme": "डार्क ब्लू थीम",
    "LightTheme": "प्रकाश थीम",
    "ProudToWorkWith": "गर्व के साथ काम करने के लिए",
    "OurConsumers": "दुनिया भर में 50 से अधिक देशों के सैकड़ों उद्यम और डेवलपर्स एबीपी कमर्शियल पर निर्भर हैं।",
    "JoinOurConsumers": "उनके साथ जुड़ें और तेजी से अद्भुत उत्पादों का निर्माण करें।",
    "AdditionalServicesExplanation": "क्या आपको अतिरिक्त या कस्टम सेवाओं की आवश्यकता है? <strong> हम और हमारे साथी प्रदान कर सकते हैं; </strong>",
    "CustomProjectDevelopment": "कस्टम परियोजना विकास",
    "CustomProjectDevelopmentExplanation": "अपने कस्टम प्रोजेक्ट्स के लिए समर्पित डेवलपर्स।",
    "PortingExistingProjects": "मौजूदा परियोजनाओं को पोर्ट करना",
    "PortingExistingProjectsExplanation": "एबीपी प्लेटफॉर्म पर अपनी विरासत परियोजनाओं को माइग्रेट करना।",
    "LiveSupport": "लाइव सहायता",
    "LiveSupportExplanation": "जरूरत पड़ने पर लाइव रिमोट सपोर्ट का विकल्प।",
    "Training": "प्रशिक्षण",
    "TrainingExplanation": "अपने डेवलपर्स के लिए समर्पित प्रशिक्षण।",
    "OnBoarding": "ज्ञानप्राप्ति",
    "OnBoardingExplanation": "अपने विकास, CI और सीडी वातावरण को सेटअप करने में मदद करें।",
    "PrioritizedTechnicalSupport": "प्राथमिक तकनीकी सहायता",
    "PremiumSupportExplanation": "एबीपी ढांचे के महान सामुदायिक समर्थन के अलावा, हमारी सहायता टीम उच्च प्राथमिकता वाले वाणिज्यिक उपयोगकर्ताओं की तकनीकी सवालों और समस्याओं का जवाब देती है।",
    "SeeTheSupportOptions": "समर्थन विकल्प देखें",
    "Contact": "संपर्क करें",
    "TellUsWhatYouNeed": "अपनी ज़रूरत के बारे में हमें बताएं।",
    "YourMessage": "आपका संदेश",
    "YourFullName": "आपका पूरा नाम",
    "EmailField": "ईमेल पता",
    "YourEmailAddress": "आपका ईमेल पता",
    "HowMayWeHelpYou": "हम कैसे आपकी सहायता कर सकते हैं?",
    "SendMessage": "मेसेज भेजें",
    "Success": "सफलता",
    "WeWillReplyYou": "हमें आपका संदेश प्राप्त हुआ और शीघ्र ही संपर्क में आएगा।",
    "GoHome": "घर जाओ",
    "CreateLiveDemo": "लाइव डेमो बनाएँ",
    "RegisterToTheNewsletter": "ABP.IO के बारे में जानकारी प्राप्त करने के लिए न्यूज़लेटर के लिए रजिस्टर करें, जिसमें नई रिलीज़ आदि शामिल हैं।",
    "EnterYourEmailOrLogin": "अपना डेमो बनाने के लिए अपना ई-मेल पता दर्ज करें या अपने मौजूदा खाते का उपयोग करके <a href=\"{0}\">लॉगिन करें</a>।",
    "ApplicationTemplate": "एप्लिकेशन टेम्पलेट",
    "ApplicationTemplateExplanation": "एप्लिकेशन स्टार्टअप टेम्पलेट का उपयोग एक नया वेब एप्लिकेशन बनाने के लिए किया जाता है।",
    "EfCoreProvider": "इकाई ढाँचा (SQL सर्वर, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\"> और अन्य </a> का समर्थन करता है)",
    "AlreadyIncludedInTemplateModules": "निम्नलिखित मॉड्यूल पहले से ही इस टेम्पलेट में शामिल और कॉन्फ़िगर किए गए हैं:",
    "ApplicationTemplateArchitecture": "यह एप्लिकेशन टेम्पलेट tiered आर्किटेक्चर का भी समर्थन करता है जहां UI लेयर, API लेयर और ऑथेंटिकेशन सर्विस को शारीरिक रूप से अलग किया जाता है।",
    "SeeTheGuideOrGoToTheLiveDemo": "इस टेम्पलेट के बारे में तकनीकी जानकारी के लिए डेवलपर गाइड देखें या लाइव डेमो पर जाएं।",
    "DeveloperGuide": "डेवलपर गाइड",
    "ModuleTemplate": "मॉड्यूल टेम्पलेट",
    "ModuleTemplateExplanation1": "आप एक मॉड्यूल बनाना और विभिन्न अनुप्रयोगों में पुन: उपयोग करना चाहते हैं? यह स्टार्टअप टेम्पलेट एक पुन: प्रयोज्य <strong> अनुप्रयोग मॉड्यूल </strong> या <strong> microservice </strong> बनाने के लिए शुरू करने के लिए सब कुछ तैयार करता है।",
    "ModuleTemplateExplanation2": "<p> आप एकल मॉड्यूल के लिए एकल या एकाधिक UI फ्रेमवर्क, एकल या एकाधिक डेटाबेस प्रदाता का समर्थन कर सकते हैं। स्टार्टअप टेम्प्लेट को चलाने के लिए कॉन्फ़िगर किया गया है और <strong> अपने मॉड्यूल का परीक्षण करें </strong> यूनिट और एकीकरण परीक्षण के बुनियादी ढांचे के अलावा न्यूनतम आवेदन में। </p><p> इस टेम्पलेट के बारे में तकनीकी जानकारी के लिए डेवलपर गाइड देखें। </p>",
    "WithAllStyleOptions": "सभी शैली विकल्पों के साथ",
    "Demo": "डेमो",
    "SeeAllModules": "सभी मॉड्यूल देखें",
    "ABPCLIExplanation": "ABP CLI (कमांड लाइन इंटरफेस) ABP आधारित समाधानों के लिए कुछ सामान्य ऑपरेशन करने के लिए एक कमांड लाइन टूल है।",
    "ABPSuiteEasilyCURD": "एबीपी सूट एक उपकरण है जो आपको आसानी से CRUD पेज बनाने की अनुमति देता है",
    "WeAreHereToHelp": "हम यहाँ हैं <span class=\"zero-text\"> मदद </span>",
    "BrowseOrAskQuestion": "आप हमारे सहायता विषयों को ब्राउज़ कर सकते हैं या अक्सर पूछे जाने वाले प्रश्नों में खोज कर सकते हैं, या आप <a href=\"{0}\" class=\"text-success\">संपर्क फ़ॉर्म</a> का उपयोग करके हमसे एक प्रश्न पूछ सकते हैं।",
    "SearchQuestionPlaceholder": "अक्सर पूछे जाने वाले प्रश्नों में खोजें",
    "WhatIsTheABPCommercial": "ABP कमर्शियल क्या है?",
    "WhatAreDifferencesThanAbpFramework": "ओपन सोर्स ABP फ्रेमवर्क और ABP कमर्शियल के बीच क्या अंतर हैं?",
    "ABPCommercialExplanation": "एबीपी कमर्शियल ओपन सोर्स <a target=\"_blank\" href=\"{0}\">ABP फ्रेमवर्क</a> के शीर्ष पर निर्मित प्रीमियम मॉड्यूल, टूल, थीम और सेवाओं का एक सेट है। एबीपी कमर्शियल को एबीपी ढांचे के पीछे उसी टीम द्वारा विकसित और समर्थित किया जा रहा है।",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p><a target=\"_blank\" href=\"{0}\">ABP फ्रेमवर्क</a> ASP.NET कोर के लिए एक मॉड्यूलर, थीम योग्य, माइक्रो-सर्विस संगत एप्लिकेशन डेवलपमेंट फ्रेमवर्क है। यह आपको हर नई परियोजना के लिए खुद को दोहराने के बजाय अपने स्वयं के व्यवसाय कोड पर ध्यान केंद्रित करने के लिए एक पूर्ण वास्तुकला और एक मजबूत बुनियादी ढांचा प्रदान करता है। यह सॉफ्टवेयर विकास सर्वोत्तम प्रथाओं और लोकप्रिय टूल पर आधारित है जिन्हें आप पहले से जानते हैं। </p><p> एबीपी ढांचा पूरी तरह से मुक्त, खुला स्रोत और समुदाय संचालित है। यह एक मुफ्त थीम और कुछ पूर्व-निर्मित मॉड्यूल (जैसे पहचान प्रबंधन और किरायेदार प्रबंधन) भी प्रदान करता है।</p>",
    "VisitTheFrameworkVSCommercialDocument": "अधिक जानकारी के लिए, निम्न लिंक पर जाएँ <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "एबीपी वाणिज्यिक एबीपी ढांचे के शीर्ष पर निम्नलिखित लाभ जोड़ता है;",
    "Professional": "पेशेवर",
    "UIThemes": "यूआई थीम",
    "EnterpriseModules": "एंटरप्राइज़ तैयार, सुविधा संपन्न, पूर्व-निर्मित <a href=\"{0}\">एप्लिकेशन मॉड्यूल</a> (उदा. पहचान सर्वर प्रबंधन, SaaS प्रबंधन, भाषा प्रबंधन)",
    "ToolingToSupport": "आपकी विकास उत्पादकता का समर्थन करने के लिए टूलिंग (उदा.<a href=\"{0}\">ABP Suite</a>)",
    "PremiumSupportLink": "प्रीमियम <a href=\"{0}\" target=\"_blank\">समर्थन</a>",
    "WhatDoIDownloadABPCommercial": "जब मैं एबीपी कमर्शियल खरीदता हूं तो क्या डाउनलोड करता हूं?",
    "CreateUnlimitedSolutions": "एक बार जब आप एबीपी वाणिज्यिक लाइसेंस खरीद लेते हैं, तो आप असीमित समाधान बनाने में सक्षम होंगे जैसा कि <a href=\"{0}\">आरंभ करना</a> दस्तावेज़ में वर्णित है।",
    "ABPCommercialSolutionExplanation": "जब आप एक नया एप्लिकेशन बनाते हैं, तो आपको अपनी प्राथमिकताओं के आधार पर एक विज़ुअल स्टूडियो समाधान (एक स्टार्टअप टेम्प्लेट) मिलता है। डाउनलोड किए गए समाधान में आपके लिए पहले से इंस्टॉल और कॉन्फ़िगर किए गए वाणिज्यिक मॉड्यूल और थीम हैं। यदि आप चाहें तो आप पहले से स्थापित मॉड्यूल को हटा सकते हैं या किसी अन्य मॉड्यूल को जोड़ सकते हैं। सभी मॉड्यूल और थीम डिफ़ॉल्ट रूप से एक NuGet / NPM पैकेज का उपयोग किया जाता है।",
    "StartDevelopWithTutorials": "डाउनलोड किया गया समाधान अच्छी तरह से संरचित और प्रलेखित है। आप <a href=\"{0}\">ट्यूटोरियल</a> . का अनुसरण करके इसके आधार पर अपना खुद का व्यवसाय कोड विकसित करना शुरू कर सकते हैं",
    "TryTheCommercialDemo": "ABP कमर्शियल स्टार्टअप टेम्प्लेट का उपयोग करके बनाए गए एक नमूना एप्लिकेशन को देखने के लिए आप <a href=\"{0}\">डेमो</a> आज़मा सकते हैं।",
    "HowManyProducts": "ABP वाणिज्यिक का उपयोग करके मैं कितने विभिन्न उत्पाद / समाधान बना सकता हूं?",
    "HowManyProductsExplanation": "ABP प्रोजेक्ट बनाने की कोई सीमा नहीं है। आप जितने चाहें उतने प्रोजेक्ट बना सकते हैं, उन्हें विकसित कर सकते हैं और उन्हें विभिन्न सर्वरों पर अपलोड कर सकते हैं।",
    "HowManyDevelopers": "एबीपी कमर्शियल पर कितने डेवलपर काम कर सकते हैं?",
    "HowManyDevelopersExplanation": "एबीपी वाणिज्यिक लाइसेंस प्रति डेवलपर हैं। विभिन्न लाइसेंस प्रकारों की अलग-अलग डेवलपर सीमाएँ होती हैं। हालांकि, जब भी आपको आवश्यकता हो, आप किसी भी प्रकार के लाइसेंस में अधिक डेवलपर जोड़ सकते हैं। लाइसेंस प्रकारों, डेवलपर सीमाओं और अतिरिक्त डेवलपर लागतों के लिए <a href=\"{0}\">कीमतें</a> पृष्ठ देखें।",
    "ChangingLicenseType": "क्या मैं भविष्य में अपना लाइसेंस प्रकार बदल सकता हूं?",
    "ChangingLicenseTypeExplanation": "आप अपने समान लाइसेंस प्रकार में हमेशा नए डेवलपर्स को जोड़ सकते हैं। यह भी देखें \"एबीपी कमर्शियल पर कितने डेवलपर काम कर सकते हैं?\"। आप गणना मूल्य अंतर का भुगतान करके एक उच्च लाइसेंस के लिए भी अपग्रेड कर सकते हैं। जब आप उच्च लाइसेंस योजना में अपग्रेड करते हैं, तो आपको नई योजना का लाभ मिलता है, लेकिन लाइसेंस अपग्रेड लाइसेंस की समाप्ति की तारीख को नहीं बदलता है।",
    "LicenseExtendUpgradeDiff": "लाइसेंस विस्तार और उन्नयन के बीच क्या अंतर है?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Extending:</strong> By extending/renewing your license, you will continue to get premium support and get major updates for the modules and themes. Besides, you will be able to continue creating new projects. And you will still be able to use ABP Suite which speeds up your development.<hr/><strong>Upgrading:</strong> By upgrading your license, you will promote to a higher license plan which will allow you to get additional benefits. See the <a href=\"/pricing\">license comparison table</a> to check the differences between the license plans.<strong>On the other hand, when you upgrade, your license expiry date will not change!</strong>To extend your license end date, you need to extend your license.",
    "LicenseRenewalCost": "1 वर्ष के बाद लाइसेंस नवीनीकरण लागत क्या है?",
    "LicenseRenewalCostExplanation": "सभी एबीपी वाणिज्यिक स्थायी लाइसेंसों की नवीनीकरण (विस्तार) दर लाइसेंस सूची मूल्य का {0} है। मानक टीम लाइसेंस का नवीनीकरण मूल्य ${1} है, मानक व्यवसाय लाइसेंस ${2} है और मानक एंटरप्राइज़ लाइसेंस ${3} है। यदि आप पहले से ही ग्राहक हैं, तो उपलब्ध नवीनीकरण मूल्य-निर्धारण की समीक्षा के लिए <a href='{4}' target='_blank'>अपने खाते में लॉग इन करें</a>।",
    "HowDoIRenewMyLicense": "मैं अपने लाइसेंस का नवीनीकरण कैसे करूँ?",
    "HowDoIRenewMyLicenseExplanation": "आप <a href='{0}' target='_blank'>संगठन प्रबंधन पृष्ठ</a> पर नेविगेट करके अपने लाइसेंस का नवीनीकरण कर सकते हैं। हमारी रियायती प्रारंभिक नवीनीकरण दरों का लाभ उठाने के लिए, अपने लाइसेंस की समय सीमा समाप्त होने से पहले नवीनीकरण करना सुनिश्चित करें। हालाँकि, यह जानने की चिंता न करें कि आपका प्रारंभिक नवीनीकरण अवसर कब बंद होगा। आपकी सदस्यता समाप्त होने से पहले आपको 2 अनुस्मारक ई-मेल प्राप्त होंगे। हम उन्हें समाप्ति से ७ दिन पहले, ३० दिनों में भेजेंगे।",
    "IsSourceCodeIncluded": "क्या मेरे लाइसेंस में वाणिज्यिक मॉड्यूल और थीम का स्रोत कोड शामिल है?",
    "IsSourceCodeIncludedExplanation1": "आपके द्वारा खरीदे गए लाइसेंस प्रकार पर निर्भर करता है:",
    "IsSourceCodeIncludedExplanation2": "<strong> टीम </ strong>: आपका समाधान मॉड्यूल और थीम को NuGet और NPM पैकेज के रूप में उपयोग करता है। इसमें उनका स्रोत कोड शामिल नहीं है। इस तरह, जब भी कोई नया संस्करण उपलब्ध हो, आप इन मॉड्यूल और थीम को आसानी से अपग्रेड कर सकते हैं। हालाँकि, आप मॉड्यूल और थीम के स्रोत कोड प्राप्त नहीं कर सकते।",
    "IsSourceCodeIncludedExplanation3": "<strong> व्यवसाय / उद्यम </ strong>: टीम लाइसेंस के अतिरिक्त, आप किसी भी मॉड्यूल या थीम की आवश्यकता के स्रोत कोड को डाउनलोड करने में सक्षम हैं। तुम भी एक विशेष मॉड्यूल के लिए NuGet / NPM पैकेज संदर्भ निकाल सकते हैं और इसे पूरी तरह से बदलने के लिए अपने समाधान के लिए अपने स्रोत कोड को सीधे जोड़ सकते हैं।",
    "IsSourceCodeIncludedExplanation4": "<p>अपने समाधान में मॉड्यूल के स्रोत कोड को शामिल करने से आपको उस मॉड्यूल को अनुकूलित करने की अधिकतम स्वतंत्रता मिलती है। हालांकि, नया संस्करण जारी होने पर मॉड्यूल को स्वचालित रूप से अपग्रेड करना संभव नहीं होगा।</p><p>किसी भी लाइसेंस में एबीपी सूट स्रोत कोड शामिल नहीं है, जो एक बाहरी उपकरण है जो आपके लिए कोड उत्पन्न करता है और सहायता करता है। आपके विकास के लिए।</p><p>लाइसेंस प्रकारों के बीच अन्य अंतरों के लिए <a href=\"{0}\">मूल्य निर्धारण</a> पृष्ठ देखें।</p>",
    "ChangingDevelopers": "क्या मैं भविष्य में अपने संगठन के पंजीकृत डेवलपर्स को बदल सकता हूं?",
    "ChangingDevelopersExplanation": "अपने लाइसेंस में नए डेवलपर्स को जोड़ने के अलावा, आप मौजूदा डेवलपर्स को भी बदल सकते हैं (आप एक डेवलपर को हटा सकते हैं और एक ही सीट पर एक नया जोड़ सकते हैं) बिना किसी अतिरिक्त लागत के।",
    "WhatHappensWhenLicenseEnds": "मेरे लाइसेंस की अवधि समाप्त होने पर क्या होता है?",
    "WhatHappensWhenLicenseEndsExplanation1": "ABP वाणिज्यिक लाइसेंस प्रकार <a href=\"{0}\" target=\"_blank\">स्थायी लाइसेंस</a> है। आपके लाइसेंस की समय सीमा समाप्त होने के बाद, आप अपने प्रोजेक्ट को विकसित करना जारी रख सकते हैं। और आप अपने लाइसेंस को नवीनीकृत करने के लिए बाध्य नहीं हैं। आपका लाइसेंस बॉक्स से बाहर एक साल के अपडेट और समर्थन योजना के साथ आता है। नई सुविधाओं, प्रदर्शन में सुधार, बग फिक्स, समर्थन प्राप्त करना जारी रखने और एबीपी सूट का उपयोग जारी रखने के लिए, हर साल अपनी योजना को नवीनीकृत करना सुनिश्चित करें। जब आपका लाइसेंस समाप्त हो जाता है, तो आप निम्नलिखित में से अधिक लाभ प्राप्त नहीं कर पाएंगे;",
    "WhatHappensWhenLicenseEndsExplanation2": "आप एबीपी कमर्शियल का उपयोग करके नए समाधान नहीं बना सकते हैं, लेकिन आप अपने मौजूदा अनुप्रयोगों को हमेशा के लिए विकसित कर सकते हैं।",
    "WhatHappensWhenLicenseEndsExplanation3": "आप अपने मुख्य संस्करण के भीतर मॉड्यूल और विषयों के लिए अद्यतन प्राप्त करने में सक्षम होंगे। उदाहरण के लिए; यदि आप किसी मॉड्यूल के v3.2.0 का उपयोग कर रहे हैं, तो आप उस मॉड्यूल के v3.x.x (v3.3.0, v3.5.2... आदि) के लिए अपडेट प्राप्त कर सकते हैं। लेकिन आपको अगले प्रमुख संस्करण के लिए अपडेट नहीं मिल सकता है (जैसे v4.x, v5.x)",
    "WhatHappensWhenLicenseEndsExplanation4": "आप अपने लाइसेंस समाप्त होने के बाद एबीपी वाणिज्यिक मंच में जोड़े गए नए मॉड्यूल और थीम स्थापित नहीं कर सकते।",
    "WhatHappensWhenLicenseEndsExplanation5": "आप एबीपी सूट का उपयोग नहीं कर सकते।",
    "WhatHappensWhenLicenseEndsExplanation6": "अब आपको <a href=\"{0}\">प्रीमियम सहायता</a> नहीं मिल सकती है।",
    "WhatHappensWhenLicenseEndsExplanation7": "यदि आप इन लाभों को प्राप्त करना जारी रखना चाहते हैं तो आप अपनी सदस्यता को नवीनीकृत कर सकते हैं। जब आप अपनी सदस्यता को नवीनीकृत करते हैं तो 20% छूट मिलती है।",
    "WhenShouldIRenewMyLicense": "मुझे अपना लाइसेंस कब नवीनीकृत करना चाहिए?",
    "WhenShouldIRenewMyLicenseExplanation1": "यदि आप अपना लाइसेंस समाप्त होने के बाद अपने लाइसेंस का नवीनीकरण <strong> 1 महीने </ strong> के भीतर करते हैं, तो कुल लाइसेंस मूल्य पर% 20 छूट लागू होगी।",
    "WhenShouldIRenewMyLicenseExplanation2": "यदि आप अपनी लाइसेंस की समाप्ति तिथि से 1 महीने के बाद अपना लाइसेंस नवीनीकृत करते हैं, तो नवीनीकरण मूल्य लाइसेंस खरीद मूल्य के समान होगा और आपके नवीकरण के लिए कोई छूट नहीं होगी।",
    "TrialPlan": "क्या आपके पास एक परीक्षण योजना है?",
    "TrialPlanExplanation": "अभी के लिए, एबीपी कमर्शियल में ट्रायल प्लान नहीं है। टीम लाइसेंस के लिए हम 30 दिन की मनी बैक गारंटी प्रदान करते हैं। आप पहले 30 दिनों में धनवापसी का अनुरोध कर सकते हैं। बिजनेस और एंटरप्राइज लाइसेंस के लिए, हम 30 दिनों में 60% रिफंड प्रदान करते हैं। ऐसा इसलिए है क्योंकि व्यवसाय और एंटरप्राइज़ लाइसेंस में सभी मॉड्यूल और थीम का पूर्ण स्रोत कोड शामिल है।",
    "DoYouAcceptBankWireTransfer": "क्या आप बैंक वायर ट्रांसफर स्वीकार करते हैं?",
    "DoYouAcceptBankWireTransferExplanation": "हां, हम बैंक वायर ट्रांसफर स्वीकार करते हैं। <br/> बैंक वायर ट्रांसफर के माध्यम से लाइसेंस राशि भेजने के बाद, हमें अपनी रसीद और अनुरोधित लाइसेंस प्रकार ई-मेल के माध्यम से भेजें। <br/> हमारे अंतरराष्ट्रीय बैंक खाते की जानकारी:",
    "HowToUpgrade": "नया संस्करण उपलब्ध होने पर मौजूदा एप्लिकेशन को कैसे अपग्रेड किया जाए?",
    "HowToUpgradeExplanation1": "जब आप ABP कमर्शियल का उपयोग करके एक नया एप्लिकेशन बनाते हैं, तो सभी मॉड्यूल और थीम को NuGet और NPM पैकेज के रूप में उपयोग किया जाता है। इसलिए, नया संस्करण उपलब्ध होने पर आप आसानी से संकुल को अपग्रेड कर सकते हैं।",
    "HowToUpgradeExplanation2": "मानक NuGet/NPM अपग्रेड के अलावा, <a href=\"{0}\">ABP CLI</a> एक अपडेट कमांड प्रदान करता है जो आपके समाधान में सभी ABP संबंधित पैकेजों को स्वचालित रूप से ढूंढता और अपग्रेड करता है।",
    "DatabaseSupport": "कौन से डेटाबेस सिस्टम समर्थित हैं?",
    "DatabaseSupportExplanation": "एबीपी फ्रेमवर्क अपने आप में डेटाबेस अज्ञेयवादी है और अपनी प्रकृति से किसी भी डेटाबेस प्रदाता के साथ काम कर सकता है। वर्तमान में कार्यान्वित प्रदाताओं की सूची के लिए <a href=\"{0}\" target=\"_blank\">डेटा एक्सेस दस्तावेज़</a> देखें।",
    "UISupport": "कौन से UI फ्रेमवर्क समर्थित हैं?",
    "Supported": "समर्थित",
    "UISupportExplanation": "एबीपी फ्रेमवर्क अपने आप में यूआई फ्रेमवर्क अज्ञेयवादी है और किसी भी यूआई फ्रेमवर्क के साथ काम कर सकता है। हालांकि, स्टार्टअप टेम्प्लेट, मॉड्यूल UI और थीम सभी UI फ्रेमवर्क के लिए लागू नहीं किए गए थे। UI विकल्पों की अप-टू-डेट सूची के लिए <a href=\"{0}\">आरंभ करने वाला दस्तावेज़</a> देखें।",
    "MicroserviceSupport": "क्या यह सूक्ष्म सेवा वास्तुकला का समर्थन करता है?",
    "MicroserviceSupportExplanation1": "एबीपी ढांचे के प्रमुख लक्ष्यों में से एक सूक्ष्म सेवा समाधान बनाने के लिए एक सुविधाजनक बुनियादी ढांचा प्रदान करना है। यह समझने के लिए कि यह माइक्रो-सर्विस सिस्टम बनाने में कैसे मदद करता है, <a href=\"{0}\">माइक्रो-सर्विस आर्किटेक्चर</a> दस्तावेज़ देखें।",
    "MicroserviceSupportExplanation2": "सभी एबीपी वाणिज्यिक मॉड्यूल <a href=\"{0}\">मॉड्यूल विकास सर्वोत्तम प्रथाओं</a> दस्तावेज़ का पालन करके माइक्रो-सेवा परिनियोजन परिदृश्यों (अपने स्वयं के एपीआई और डेटाबेस के साथ) का समर्थन करने के लिए डिज़ाइन किए गए हैं।",
    "MicroserviceSupportExplanation3": "हम एक नमूना <a href=\"{0}\">माइक्रो-सर्विस डेमो सॉल्यूशन</a> प्रदान करते हैं जो आपको अपना समाधान बनाने में मदद करने के लिए एक माइक्रो-सर्विस आर्किटेक्चर कार्यान्वयन दर्शाता है।",
    "MicroserviceSupportExplanation4": "तो, संक्षिप्त उत्तर \"<strong> हां है, यह सूक्ष्म सेवा वास्तुकला का समर्थन करता है </ strong>\"।",
    "MicroserviceSupportExplanation5": "हालाँकि, एक माइक्रो-सर्विस सिस्टम एक समाधान है और हर समाधान में अलग-अलग आवश्यकताएं, नेटवर्क टोपोलॉजी, संचार परिदृश्य, प्रमाणीकरण संभावनाएं, डेटाबेस पृथक्करण / साझा करने के निर्णय, रनटाइम कॉन्फ़िगरेशन, 3 पार्टी सिस्टम एकीकरण और कई और अधिक होंगे।",
    "MicroserviceSupportExplanation6": "ABP फ्रेमवर्क और ABP कमर्शियल आपको अपने स्वयं के समाधान का निर्माण करने में मदद करने के लिए सूक्ष्म सेवा परिदृश्य, सूक्ष्म सेवा संगत मॉड्यूल, नमूने और प्रलेखन के लिए बुनियादी ढाँचा प्रदान करता है। लेकिन अपने सपनों के समाधान को सीधे आपके लिए पहले से डाउनलोड करने की उम्मीद न करें। आपको इसे समझने और अपनी आवश्यकताओं के आधार पर कुछ हिस्सों को एक साथ लाने की आवश्यकता होगी।",
    "WhereCanIDownloadSourceCode": "मैं स्रोत-कोड कहां से डाउनलोड कर सकता हूं?",
    "WhereCanIDownloadSourceCodeExplanation": "आप एबीपी सूट या एबीपी सीएलआई के माध्यम से सभी एबीपी मॉड्यूल, एंगुलर पैकेज और थीम का सोर्स कोड डाउनलोड कर सकते हैं। देखें <a href=\"{0}\">स्रोत-कोड कैसे डाउनलोड करें?</a>",
    "ComputerLimitation": "एबीपी विकसित करते समय एक डेवलपर कितने कंप्यूटरों पर लॉगिन कर सकता है?",
    "ComputerLimitationExplanation": "हम विशेष रूप से प्रति व्यक्ति / लाइसेंस प्राप्त डेवलपर के लिए <strong> {0} कंप्यूटर </ strong> की अनुमति देते हैं। जब भी किसी तीसरे मशीन पर एबीपी कमर्शियल उत्पादों को विकसित करने के लिए डेवलपर की आवश्यकता होती है, तो स्थिति को समझाते हुए लाइसेंस@abp.io को एक ई-मेल भेजा जाना चाहिए और फिर हम अपने सिस्टम में उचित आवंटन करेंगे।",
    "RefundPolicy": "क्या आपके पास धनवापसी नीति है?",
    "RefundPolicyExplanation": "आप अपनी लाइसेंस खरीद के <strong> 30 दिन </ strong> के भीतर धनवापसी का अनुरोध कर सकते हैं। व्यवसाय और उद्यम लाइसेंस प्रकार में स्रोत-कोड डाउनलोड विकल्प होता है, इसलिए व्यापार और उद्यम के लिए धनवापसी उपलब्ध नहीं होती है (और कोई भी लाइसेंस जिसमें स्रोत-कोड प्राप्त करने का अधिकार शामिल होता है)। इसके अलावा, नवीनीकरण और दूसरे लाइसेंस खरीद के लिए कोई भी रिफंड नहीं किया जाता है।",
    "HowCanIRefundVat": "मैं VAT कैसे वापस कर सकता हूँ?",
    "HowCanIRefundVatExplanation1": "यदि आपने 2 चेकआउट का उपयोग करके भुगतान किया है, तो आप अपने 2 चेकआउट खाते के माध्यम से वैट वापस कर सकते हैं:",
    "HowCanIRefundVatExplanation2": "अपने <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\"> 2 चेकआउट </a> खाते में लॉग इन करें",
    "HowCanIRefundVatExplanation3": "उपयुक्त आदेश खोजें और \"रिफंड बेल्ड वैट\" दबाएं (अपनी वैट आईडी दर्ज करें)",
    "HowCanIGetMyInvoice": "मैं अपना चालान कैसे प्राप्त कर सकता हूं?",
    "HowCanIGetMyInvoiceExplanation": "लाइसेंस खरीदने के लिए 2 भुगतान गेटवे हैं: PayU और 2 चेकआउट। यदि आप 2Checkout गेटवे के माध्यम से अपना लाइसेंस खरीदते हैं, तो यह आपके ईमेल पते पर पीडीएफ चालान भेजता है, देखें <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How-do-invoices-work\"> 2 चेकआउट चालान। </a> यदि आप पेयू गेटवे या बैंक वायर ट्रांसफर के माध्यम से खरीदते हैं, तो हम आपका चालान तैयार करेंगे और भेजेंगे। आप अपने चालान का अनुरोध <a href=\"{0}\"> संगठन प्रबंधन पृष्ठ </a> से कर सकते हैं",
    "Forum": "मंच",
    "SupportExplanation": "ABP कमर्शियल लाइसेंस एक टीम द्वारा प्रीमियम फ़ोरम सपोर्ट प्रदान करता है जिसमें ABP फ्रेमवर्क विशेषज्ञ होते हैं।",
    "PrivateTicket": "निजी टिकट",
    "PrivateTicketExplanation": "एंटरप्राइज लाइसेंस में ई-मेल और टिकट प्रणाली के साथ एक निजी सहायता भी शामिल है।",
    "AbpSuiteExplanation1": "ABP सुइट आपको कुछ ही मिनटों में वेब पेज बनाने की अनुमति देता है। यह .NET कोर ग्लोबल टूल है जिसे कमांड लाइन से इंस्टॉल किया जा सकता है।",
    "AbpSuiteExplanation2": "यह एक नया ABP समाधान बना सकता है, डेटाबेस से फ्रंट-एंड तक CRUD पेज बना सकता है। तकनीकी ओवरव्यू के लिए <a href=\"{0}\"> दस्तावेज़ </a> देखें",
    "FastEasy": "तेज और आसान",
    "AbpSuiteExplanation3": "ABP सुइट आपको आसानी से CRUD पेज बनाने की अनुमति देता है। आपको बस अपनी इकाई और उसके गुणों को परिभाषित करने की आवश्यकता है, बाकी को आप के लिए एबीपी सूट करने दें! एबीपी सूट कुछ ही सेकंड में आपके सीआरयूडी पृष्ठ के लिए सभी आवश्यक कोड उत्पन्न करता है। यह Angular, MVC और Blazor यूजर इंटरफेस को सपोर्ट करता है।",
    "RichOptions": "अमीर विकल्प",
    "AbpSuiteExplanation4": "ABP Suite supports multiple UI options like <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\">Razor Pages</a> and <a href=\"https://angular.io\">Angular</a>.It also supports multiple databases like <a href=\"https://www.mongodb.com\">MongoDB</a> and all databases supported by <strong>EntityFramework Core</strong> (MS SQL Server, Oracle, MySql, PostgreSQL and <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\">more</a>).",
    "AbpSuiteExplanation5": "अच्छी बात यह है कि, आपको उन विकल्पों के बारे में चिंता करने की ज़रूरत नहीं है। एबीपी सूट आपके प्रोजेक्ट के प्रकार को समझता है और आपकी परियोजना के लिए कोड बनाता है और उत्पन्न कोड को आपके प्रोजेक्ट में सही जगह पर रखता है।",
    "SourceCode": "सोर्स कोड",
    "AbpSuiteExplanation6": "ABP स्वीट आपके लिए सोर्स कोड जेनरेट करता है! यह वेब पेज जनरेट करने के लिए मैजिक फाइल्स जेनरेट नहीं करता है। एबीपी सूट <strong> इकाई, रिपोजिटरी, एप्लीकेशन सर्विस, कोड फर्स्ट माइग्रेशन, जावास्क्रिप्ट / टाइपस्क्रिप्ट और सीएसएचटीएमएल / एचटीएमएल </ strong> और आवश्यक इंटरफेस के लिए भी स्रोत कोड उत्पन्न करता है। ABP Suite सॉफ्टवेयर डेवलपमेंट के <strong> बेस्ट प्रैक्टिसेस </ strong> के अनुसार कोड भी तैयार करता है, इसलिए आपको जनरेट किए गए कोड की गुणवत्ता के बारे में चिंता करने की आवश्यकता नहीं है।",
    "AbpSuiteExplanation7": "चूँकि आपके पास सही एप्लिकेशन लेयर्स में जेनरेट किए गए CRUD पेज के बिल्डिंग ब्लॉक्स का सोर्स कोड है, आप आसानी से सोर्स कोड को संशोधित कर सकते हैं और अपने कस्टम / bussiness लॉजिक को जेनरेट कोड में इंजेक्ट कर सकते हैं।",
    "CrossPlatform": "क्रास प्लेटफार्म",
    "AbpSuiteExplanation8": "ABP सुइट .NET .NET के साथ बनाया गया है और यह क्रॉस प्लेटफॉर्म है। यह आपके स्थानीय कंप्यूटर पर एक वेब एप्लिकेशन के रूप में चलता है। आप इसे <strong> Windows </ strong>, <strong> Mac </ strong> और <strong> Linux </ strong> पर चला सकते हैं",
    "OtherFeatures": "अन्य सुविधाओं",
    "OtherFeatures1": "अपडेट्स <strong> NuGet </ strong> और <strong> NPM </ strong> पैकेज आपके समाधान पर आसानी से।",
    "OtherFeatures2": "खरोंच से पहले से ही उत्पन्न पृष्ठों को पुन: उत्पन्न करता है।",
    "OtherFeatures3": "नए समाधान बनाता है",
    "ThanksForCreatingProject": "अपना प्रोजेक्ट बनाने के लिए धन्यवाद!",
    "HotToRunSolution": "अपना हल कैसे चलाएं?",
    "HotToRunSolutionExplanation": "अपने समाधान को कॉन्फ़िगर करने और चलाने का तरीका जानने के लिए आरंभ किया गया दस्तावेज़ देखें।",
    "GettingStarted": "शुरू करना",
    "WebAppDevTutorial": "वेब ऐप देव ट्यूटोरियल",
    "WebAppDevTutorialExplanation": "कदम विकास नमूना द्वारा एक कदम के लिए वेब अनुप्रयोग विकास ट्यूटोरियल दस्तावेज़ देखें।",
    "Document": "डाक्यूमेंट",
    "UsingABPSuiteToCURD": "CRUD पेज जनरेशन और टूलिंग के लिए ABP सूट का उपयोग करना",
    "SeeABPSuiteDocument": "ABP सुइट का उपयोग जानने के लिए ABP सुइट दस्तावेज़ देखें।",
    "AskQuestionsOnSupport": "आप एबीपी कमर्शियल सपोर्ट पर सवाल पूछ सकते हैं।",
    "Documentation": "प्रलेखन",
    "SeeModulesDocument": "सभी वाणिज्यिक (समर्थक) मॉड्यूल और उनके दस्तावेजों की सूची के लिए मॉड्यूल दस्तावेज़ देखें।",
    "Pricing": "मूल्य निर्धारण",
    "PricingExplanation": "आज अपनी व्यावसायिक आवश्यकताओं के लिए सुविधाओं और कार्यक्षमता का चयन करें। जैसे ही आपका व्यवसाय बढ़ता है, आसानी से अपग्रेड करें।",
    "Team": "टीम",
    "Business": "व्यापार",
    "Enterprise": "उद्यम",
    "Custom": "रिवाज",
    "IncludedDeveloperLicenses": "डेवलपर लाइसेंस शामिल हैं",
    "CustomLicenceOrAdditionalServices": "कस्टम लाइसेंस या अतिरिक्त सेवाओं की आवश्यकता है?",
    "CustomOrVolumeLicense": "कस्टम या वॉल्यूम लाइसेंस",
    "LiveTrainingSupport": "लाइव प्रशिक्षण और समर्थन",
    "AndMore": "और अधिक",
    "AdditionalDeveloperLicense": "अतिरिक्त डेवलपर लाइसेंस",
    "ProjectCount": "प्रोजेक्ट की गिनती",
    "AllProModules": "सभी प्रो मॉड्यूल",
    "AllProThemes": "सभी प्रो थीम",
    "AllProStartupTemplates": "सभी प्रो स्टार्टअप टेम्प्लेट",
    "SourceCodeOfAllModules": "सभी मॉड्यूल का स्रोत कोड",
    "SourceCodeOfAllThemes": "सभी विषयों का स्रोत कोड",
    "PerpetualLicense": "हमेशा के लिए लाइसेंस",
    "UnlimitedServerDeployment": "असीमित सर्वर की तैनाती",
    "YearUpgrade": "1 साल का उन्नयन",
    "YearPremiumForumSupport": "1 साल का प्रीमियम फोरम सपोर्ट",
    "ForumSupportIncidentCountYear": "फोरम समर्थन घटना गिनती / वर्ष",
    "PrivateTicketEmailSupport": "निजी टिकट और ईमेल समर्थन",
    "BuyNow": "अभी खरीदें",
    "PayViaAmexCard": "मैं अपने AMEX कार्ड के माध्यम से कैसे भुगतान कर सकता हूं?",
    "PayViaAmexCardDescription": "डिफ़ॉल्ट भुगतान गेटवे 'Iyzico' सुरक्षा उपायों के कारण कुछ AMEX क्रेडिट कार्डों को अस्वीकार कर सकता है। इस मामले में, आप वैकल्पिक भुगतान गेटवे '2 चेकआउट' के माध्यम से भुगतान कर सकते हैं।",
    "ThankYou": "धन्यवाद",
    "InvalidReCaptchaErrorMessage": "ReCAPTCHA को सत्यापित करने में एक त्रुटि हुई थी। कृपया पुन: प्रयास करें।"
  }
}