{
  "culture": "hr",
  "texts": {
    "OrganizationManagement": "Upravljanje organizacijom",
    "OrganizationList": "Popis organizacija",
    "Volo.AbpIo.Commercial:010003": "Vi niste vlasnik ove organizacije!",
    "OrganizationNotFoundMessage": "Organizacija nije pronađena!",
    "DeveloperCount": "Dodijeljeni / ukupni programeri",
    "QuestionCount": "Preostala / ukupno pitanja",
    "Unlimited": "Neograničen",
    "Owners": "Vlasnici",
    "Owner": "Vlasnik",
    "AddMember": "Dodaj člana",
    "AddNewOwner": "Dodaj novog vlasnika",
    "AddNewDeveloper": "Dodaj novog programera",
    "UserName": "Korisničko ime",
    "Name": "Ime",
    "EmailAddress": "Email adresa",
    "Developers": "Programeri",
    "LicenseType": "Vrsta licence",
    "Manage": "Upravljati",
    "SetDefault": "Postavi kao zadano",
    "DefaultOrganization": "Zadano",
    "StartDate": "Početni datum",
    "EndDate": "Datum završetka",
    "Modules": "Moduli",
    "LicenseExtendMessage": "Vaš datum završetka licence produljuje se do {0}",
    "LicenseUpgradeMessage": "Vaša je licenca nadograđena na {0}",
    "LicenseExtendAdnUpgradeMessage": "Vaša je licenca produžena do {0}, a vaš licencni plan nadograđen je na {1}.",
    "LicenseAddDeveloperMessage": "{0} programera dodano vašoj licenci",
    "Volo.AbpIo.Commercial:010004": "Ne mogu pronaći navedenog korisnika! Korisnik mora biti već registriran.",
    "MyOrganizations": "Moje organizacije",
    "ApiKey": "API ključ",
    "UserNameNotFound": "Ne postoji korisnik s korisničkim imenom {0}",
    "SuccessfullyAddedToNewsletter": "Hvala što ste se pretplatili na naš newsletter!",
    "MyProfile": "Moj profil",
    "EmailNotValid": "Unesite važeću adresu e-pošte.",
    "JoinOurMarketingNewsletter": "Pridružite se našem marketinškom biltenu",
    "WouldLikeToReceiveMarketingMaterials": "Želio bih primati marketinške vijesti poput ponuda proizvoda i posebnih ponuda.",
    "StartUsingYourLicenseNow": "Počnite koristiti svoju licencu sada!",
    "WelcomePage": "Stranica dobrodošlice",
    "UnsubscriptionExpireEmail": "Otkažite pretplatu na e-poruke s podsjetnicima o datumu isteka licence",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Ova pretplata e-poštom sadrži samo podsjetnike o datumu isteka vaše licence.",
    "UnsubscribeFromLicenseExpireEmails": "Ako ne želite primati e-poruke o datumu isteka licence, možete se odjaviti u bilo kojem trenutku.",
    "Unsubscribe": "Odjavi pretplatu",
    "NotOrganizationMember": "Niste član niti jedne organizacije.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Uspješno otkazana pretplata",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Više nećete primati e-poruke s podsjetnicima o datumu isteka licence.",
    "IndexPageHeroSection": "<span class=\"first-line\">Kompletna</span> <span class=\"third-line\">ugrađena</span> <span class=\"second-line\">platforma za web razvoj</span> <span class=\"third-line\"><img src=\"{0}\" width=\"110\" class=\"ml-1\" />okvir</span>",
    "AbpCommercialShortDescription": "ABP Commercial nudi unaprijed izgrađene aplikacijske module, alate za brzi razvoj aplikacija, profesionalne UI teme, vrhunsku podršku i više.",
    "LiveDemo": "Demo uživo",
    "LiveDemoLead": "<a href=\"{0}\">{1}</a> koristeći svoj ABP račun, <a href=\"{2}\">{3}</a> na abp.io. Ili ispunite obrazac u nastavku da sada napravite demo uživo",
    "ThereIsAlreadyAnAccountWithTheGivenEmailAddress": "Već postoji račun s navedenom adresom e-pošte: <b>{0}</b><br/> Za nastavak se možete prijaviti svojim računom.",
    "GetLicence": "Nabavite licencu",
    "Application": "Primjena",
    "StartupTemplates": "Predlošci za pokretanje",
    "Startup": "Pokretanje",
    "Templates": "Predlošci",
    "Developer": "Developer",
    "Tools": "Alati",
    "Premium": "Premija",
    "PremiumSupport": "Premium podrška",
    "PremiumForumSupport": "Vrhunska podrška za forum",
    "UI": "korisničko sučelje",
    "Themes": "Teme",
    "JoinOurNewsletter": "Pridružite se našem biltenu",
    "Send": "Poslati",
    "WhatIsABPFramework": "ŠTO JE OKVIR ABP-a?",
    "OpenSourceBaseFramework": "Open Source Base Framework",
    "ABPFrameworkExplanation": "<p class=\"lead\">ABP Commercial temelji se na ABP Frameworku, okviru web aplikacije otvorenog koda i zajednici za ASP.NET Core.</p><p> ABP Framework pruža izvrsnu infrastrukturu za pisanje koda koji se može održavati, proširiti i testirati s najboljim praksama.</p><p> Izgrađen na popularnim alatima koje već poznajete i integriran u njih. Niska krivulja učenja, laka prilagodba, ugodan razvoj.</p>",
    "Modular": "Modularni",
    "MicroserviceCompatible": "Kompatibilan s mikroservisom",
    "DomainDrivenDesignInfrastructure": "Infrastruktura dizajna vođena domenom",
    "MultiTenancy": "Multi-Tenancy",
    "DistributedMessaging": "Distribuirano slanje poruka",
    "DynamicProxying": "Dinamički proxy",
    "BackgroundJobs": "Pozadinski poslovi",
    "AuditLogging": "Zapisivanje revizije",
    "BLOBStoring": "BLOB pohranjivanje",
    "BundlingMinification": "Grupiranje i smanjivanje",
    "AdvancedLocalization": "Napredna lokalizacija",
    "ManyMore": "Mnogo više",
    "ExploreTheABPFramework": "Istražite ABP Framework",
    "WhyUseTheABPCommercial": "Zašto koristiti ABP reklamu?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\">Izrada web aplikacija poslovne razine može biti složena i dugotrajna.</p><p> ABP Commercial nudi savršenu osnovnu infrastrukturu potrebnu za sva moderna rješenja koja se temelje na ASP.NET Core-u. Od dizajna do implementacije, cijeli razvojni ciklus osnažen je ABP-ovim ugrađenim značajkama i modulima.</p>",
    "StartupTemplatesShortDescription": "Predlošci za pokretanje omogućuju vam brzi početak vašeg projekta u nekoliko sekundi.",
    "UIFrameworksOptions": "mogućnosti okvira korisničkog sučelja;",
    "DatabaseProviderOptions": "Mogućnosti pružatelja baze podataka;",
    "PreBuiltApplicationModules": "Unaprijed izgrađeni aplikacijski moduli",
    "PreBuiltApplicationModulesShortDescription": "Najčešći zahtjevi za aplikacije već su razvijeni za vas kao moduli za višekratnu upotrebu.",
    "Account": "Račun",
    "Blogging": "Bloganje",
    "Identity": "Identitet",
    "IdentityServer": "Poslužitelj identiteta",
    "Saas": "Saas",
    "LanguageManagement": "Upravljanje jezikom",
    "TextTemplateManagement": "Upravljanje tekstualnim predlošcima",
    "See All Modules": "VidiSveModule",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "ABP Suite je komplementaran alat za ABP Commercial.",
    "AbpSuiteExplanation": "Omogućuje vam izradu web stranica u nekoliko minuta. To je .NET Core Global alat koji se može instalirati iz naredbenog retka. Može stvoriti novo ABP rješenje i generirati CRUD stranice iz baze podataka prema front-endu.",
    "Details": "pojedinosti",
    "LeptonTheme": "Tema Lepton",
    "ProfessionalModernUIThemes": "Profesionalne, moderne teme korisničkog sučelja",
    "LeptonThemeExplanation": "Lepton nudi niz Bootstrap administratorskih tema koje služe kao čvrsti temelj za svaki projekt koji zahtijeva administratorsku nadzornu ploču.",
    "DefaultTheme": "Zadana tema",
    "MaterialTheme": "Materijalna tema",
    "Default2Theme": "Zadana tema 2",
    "DarkTheme": "Tamna tema",
    "DarkBlueTheme": "Tamnoplava tema",
    "LightTheme": "Lagana tema",
    "ProudToWorkWith": "Ponosan na suradnju",
    "OurConsumers": "Tisuće poduzeća i programera u više od 70 zemalja diljem svijeta oslanjaju se na ABP Commercial.",
    "JoinOurConsumers": "Pridružite im se i brzo napravite nevjerojatne proizvode.",
    "AdditionalServicesExplanation": "Trebate dodatne ili prilagođene usluge? <strong>Mi i naši partneri možemo pružiti;</strong>",
    "CustomProjectDevelopment": "Razvoj projekta po narudžbi",
    "CustomProjectDevelopmentExplanation": "Posvećeni programeri za vaše prilagođene projekte.",
    "PortingExistingProjects": "Prijenos postojećih projekata",
    "PortingExistingProjectsExplanation": "Migracija vaših naslijeđenih projekata na ABP platformu.",
    "LiveSupport": "Podrška uživo",
    "LiveSupportExplanation": "Opcija daljinske podrške uživo kada vam je potrebna.",
    "Training": "Trening",
    "TrainingExplanation": "Namjenska obuka za vaše programere.",
    "OnBoarding": "Ukrcavanje",
    "OnBoardingExplanation": "Pomoć pri postavljanju vašeg razvojnog, CI i CD okruženja.",
    "PrioritizedTechnicalSupport": "Prioritetna tehnička podrška",
    "PremiumSupportExplanation": "Osim velike podrške zajednice ABP okvira, naš tim za podršku odgovara na tehnička pitanja i probleme komercijalnih korisnika s visokim prioritetom.",
    "SeeTheSupportOptions": "Provjerite opcije podrške",
    "Contact": "Kontakt",
    "TellUsWhatYouNeed": "Recite nam što trebate.",
    "YourMessage": "Tvoja poruka",
    "YourFullName": "Tvoje puno ime",
    "FirstNameField": "Ime",
    "LastNameField": "Prezime",
    "EmailField": "Email adresa",
    "YourEmailAddress": "Vaša email adresa",
    "ValidEmailAddressIsRequired": "Potrebna je valjana adresa e-pošte.",
    "HowMayWeHelpYou": "Kako vam možemo pomoći?",
    "SendMessage": "Pošalji poruku",
    "Success": "Uspjeh",
    "WeWillReplyYou": "Primili smo vašu poruku i uskoro ćemo vas kontaktirati.",
    "GoHome": "Idi kući",
    "CreateLiveDemo": "Stvorite demo uživo",
    "CreateLiveDemoDescription": "Nakon što pošaljete ovaj obrazac, primit ćete e-poruku koja će sadržavati vašu demo vezu.",
    "RegisterToTheNewsletter": "Registrirajte se za bilten kako biste primali informacije o ABP.IO, uključujući nova izdanja itd.",
    "EnterYourEmailOrLogin": "Unesite svoju e-mail adresu kako biste kreirali demo ili <a href=\"{0}\">se prijavite</a> pomoću postojećeg računa.",
    "ApplicationTemplate": "Predložak aplikacije",
    "ApplicationTemplateExplanation": "Predložak za pokretanje aplikacije koristi se za izradu nove web aplikacije.",
    "EfCoreProvider": "Entity Framework (podržava SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\">i druge</a> )",
    "AlreadyIncludedInTemplateModules": "Sljedeći moduli već su uključeni i konfigurirani u ovom predlošku:",
    "ApplicationTemplateArchitecture": "Ovaj predložak aplikacije također podržava višeslojnu arhitekturu gdje su sloj korisničkog sučelja, sloj API-ja i usluga autentifikacije fizički odvojeni.",
    "SeeTheGuideOrGoToTheLiveDemo": "Tehničke informacije o ovom predlošku potražite u vodiču za razvojne programere ili idite na demo verziju uživo.",
    "DeveloperGuide": "Vodič za razvojne programere",
    "ModuleTemplate": "Predložak modula",
    "ModuleTemplateExplanation1": "Želite li izraditi modul i ponovno ga koristiti u različitim aplikacijama? Ovaj predložak za pokretanje priprema sve za početak stvaranja višekratnog <strong>aplikacijskog modula</strong> ili <strong>mikroservisa</strong> .",
    "ModuleTemplateExplanation2": "<p>Možete podržati jedan ili više UI okvira, jednog ili više pružatelja baza podataka za jedan modul. Predložak za pokretanje konfiguriran je za pokretanje i <strong>testiranje vašeg modula</strong> u minimalnoj aplikaciji uz infrastrukturu testiranja jedinice i integracije.</p><p> Tehničke informacije o ovom predlošku potražite u vodiču za razvojne programere.</p>",
    "WithAllStyleOptions": "sa svim stilskim opcijama",
    "Demo": "Demo",
    "SeeAllModules": "Pogledajte sve module",
    "ABPCLIExplanation": "ABP CLI (sučelje naredbenog retka) alat je naredbenog retka za izvođenje nekih uobičajenih operacija za rješenja temeljena na ABP-u.",
    "ABPSuiteEasilyCURD": "ABP Suite je alat koji vam omogućuje jednostavno stvaranje CRUD stranica",
    "WeAreHereToHelp": "Ovdje smo da <span class=\"zero-text\">pomognemo</span>",
    "BrowseOrAskQuestion": "Možete pregledavati naše teme pomoći ili pretraživati u često postavljanim pitanjima ili nam možete postaviti pitanje koristeći <a href=\"{0}\">obrazac za kontakt</a> .",
    "SearchQuestionPlaceholder": "Pretražite u često postavljanim pitanjima",
    "WhatIsTheABPCommercial": "Što je ABP Commercial?",
    "WhatAreDifferencesThanAbpFramework": "Koje su razlike između open source ABP Framework i ABP Commercial?",
    "AbpCommercialMetaTitle": "{0} | ABP reklama",
    "AbpCommercialMetaDescription": "Sveobuhvatna platforma za web razvoj na ABP Frameworku s unaprijed izgrađenim modulima, predlošcima za pokretanje, alatima za brzi razvoj, temama za profesionalno korisničko sučelje i vrhunskom podrškom.",
    "ABPCommercialExplanation": "ABP Commercial skup je vrhunskih modula, alata, tema i usluga koji su izgrađeni na <a target=\"_blank\" href=\"{0}\">ABP okviru</a> otvorenog koda. ABP Commercial razvija i podržava isti tim koji stoji iza ABP okvira.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p><a target=\"_blank\" href=\"{0}\">ABP framework</a> modularni je okvir za razvoj aplikacija kompatibilan s temama i kompatibilan s mikroservisima za ASP.NET Core. Pruža kompletnu arhitekturu i snažnu infrastrukturu koja vam omogućuje da se usredotočite na vlastiti poslovni kod umjesto da se ponavljate za svaki novi projekt. Temelji se na najboljoj praksi razvoja softvera i popularnim alatima koje već poznajete.</p><p> ABP okvir je potpuno besplatan, otvorenog koda i vođen zajednicom. Također nudi besplatnu temu i neke unaprijed izgrađene module (npr. upravljanje identitetom i upravljanje stanarima).</p>",
    "VisitTheFrameworkVSCommercialDocument": "Posjetite sljedeću vezu za više informacija <a href=\"{0}\" target=\"_blank\">{1}</a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial dodaje sljedeće pogodnosti povrh ABP okvira:",
    "Professional": "Profesionalni",
    "UIThemes": "Teme korisničkog sučelja",
    "EnterpriseModules": "Spremni za poduzeća, bogati značajkama, unaprijed izgrađeni <a href=\"{0}\">aplikacijski moduli</a> (npr. upravljanje poslužiteljem identiteta, upravljanje SaaS-om, upravljanje jezikom)",
    "ToolingToSupport": "Alati za podršku vašoj razvojnoj produktivnosti (npr. <a href=\"{0}\">ABP Suite</a> )",
    "PremiumSupportLink": "Premium <a href=\"{0}\" target=\"_blank\">podrška</a>",
    "WhatDoIDownloadABPCommercial": "Što preuzimam kada kupim ABP Commercial?",
    "CreateUnlimitedSolutions": "Nakon što kupite ABP Commercial licencu, moći ćete stvarati neograničena rješenja kao što je opisano u dokumentu <a href=\"{0}\">Početak rada</a> .",
    "ABPCommercialSolutionExplanation": "Kada izradite novu aplikaciju, dobivate rješenje Visual Studio (predložak za pokretanje) na temelju vaših preferencija. Preuzeto rješenje ima već instalirane i konfigurirane komercijalne module i teme. Možete ukloniti unaprijed instalirani modul ili dodati drugi modul ako želite. Svi moduli i teme prema zadanim postavkama koriste NuGet/NPM pakete.",
    "StartDevelopWithTutorials": "Preuzeto rješenje je dobro projektirano i dokumentirano. Možete početi razvijati vlastiti poslovni kod temeljen na njemu prateći <a href=\"{0}\">upute</a> .",
    "TryTheCommercialDemo": "Možete isprobati <a href=\"{0}\">demo uživo</a> kako biste vidjeli primjer aplikacije kreirane pomoću predloška za pokretanje ABP Commercial.",
    "HowManyProducts": "Koliko različitih proizvoda/rješenja mogu izraditi koristeći ABP Commercial?",
    "HowManyProductsExplanation": "Možete izraditi onoliko projekata koliko želite tijekom razdoblja svoje aktivne licence; nema ograničenja! Nakon što vaša licenca istekne, ne možete stvarati nove projekte, ali možete nastaviti razvijati projekte koje ste preuzeli i implementirati ih na neograničeni broj poslužitelja.",
    "HowManyDevelopers": "Koliko programera može raditi na ABP reklami?",
    "HowManyDevelopersExplanation": "ABP Komercijalne licence vrijede po programeru. Različite vrste licenci imaju različita ograničenja za programere. Međutim, možete dodati više programera bilo kojoj vrsti licence kad god vam zatreba. Provjerite stranicu <a href=\"{0}\">Planovi i cijene</a> za vrste licenci, ograničenja za razvojne programere i dodatne troškove za razvojne programere.",
    "ChangingLicenseType": "Mogu li kasnije nadograditi svoju vrstu licence?",
    "ChangingLicenseTypeExplanation": "Možete nadograditi na višu licencu plaćanjem razlike unutar razdoblja aktivne licence. Kada nadogradite na viši plan licence, dobivate prednosti novog plana, ali nadogradnja licence ne mijenja datum isteka licence. Osim toga, svojoj postojećoj licenci možete dodati nova mjesta za programere, pogledajte &quot;Koliko programera može raditi na ABP reklami?&quot; PITANJA.",
    "LicenseExtendUpgradeDiff": "Koja je razlika između produljenja licence i nadogradnje?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Proširenje:</strong> produljenjem/obnavljanjem licence i dalje ćete dobivati vrhunsku podršku i dobivati veća ili manja ažuriranja za module i teme. Osim toga, moći ćete nastaviti stvarati nove projekte. I dalje ćete moći koristiti ABP Suite, koji ubrzava vaš razvoj. Kada produžite licencu, datumu isteka licence dodaje se 1 godina.<hr/> <strong>Nadogradnja:</strong> nadogradnjom licence bit ćete unaprijeđeni u viši plan licence, što će vam omogućiti dodatne pogodnosti. Pogledajte <a href=\"/pricing\">tablicu za usporedbu licenci</a> da vidite razlike između licencnih planova. <strong>S druge strane, kada nadogradite, datum isteka vaše licence se neće promijeniti!</strong> Da biste produljili datum isteka licence, morate produljiti svoju licencu.",
    "LicenseRenewalCost": "Koliki je trošak obnove licence nakon 1 godine?",
    "LicenseRenewalCostExplanation": "Cijena obnove (produljenja) standardne timske licence je {0} $, standardne poslovne licence je {1} $, a standardne licence za poduzeća je {2} $. Ako ste već korisnik, <a href='{3}' target='_blank'>prijavite se na svoj račun</a> kako biste pregledali trenutnu cijenu obnove.",
    "HowDoIRenewMyLicense": "Kako mogu obnoviti licencu?",
    "HowDoIRenewMyLicenseExplanation": "Licencu možete obnoviti tako da odete na <a href='{0}' target='_blank'>stranicu za upravljanje organizacijom</a> . Kako biste iskoristili naše snižene stope rane obnove, pobrinite se da obnovite prije isteka licence. Ne brinite o tome da ne znate kada se zatvara vaša prilika za ranu obnovu; primit ćete 3 e-poruke s podsjetnikom prije isteka pretplate. Poslat ćemo ih 30 dana, 7 dana i 1 dan prije isteka.",
    "IsSourceCodeIncluded": "Uključuje li moja licenca izvorni kod komercijalnih modula i tema?",
    "IsSourceCodeIncludedExplanation1": "Ovisi o vrsti licence koju ste kupili:",
    "IsSourceCodeIncludedExplanation2": "<strong>Tim</strong> : Vaše rješenje koristi module i teme kao NuGet i NPM pakete. Ne uključuje njihov izvorni kod. Na taj način možete jednostavno nadograditi ove module i teme kad god nova verzija bude dostupna. Međutim, ne možete dobiti izvorni kod ovih modula i tema.",
    "IsSourceCodeIncludedExplanation3": "<strong>Business/Enterprise</strong> : Osim Team licence, možete preuzeti izvorni kod bilo kojeg modula ili teme koja vam je potrebna. Možete čak ukloniti reference paketa NuGet/NPM za određeni modul i dodati njegov izvorni kod izravno u svoje rješenje kako biste ga u potpunosti promijenili.",
    "IsSourceCodeIncludedExplanation4": "<p>Uključivanje izvornog koda modula u vaše rješenje daje vam maksimalnu slobodu prilagodbe tog modula. Međutim, tada neće biti moguće automatski nadograditi modul kada se objavi nova verzija.</p><p> Nijedna od licenci ne uključuje izvorni kod ABP Suitea, koji je vanjski alat koji generira kod za vas i pomaže vašem razvoju.</p><p> Ostale razlike između vrsta licenci potražite na stranici <a href=\"{0}\">Planovi i cijene</a> .</p>",
    "ChangingDevelopers": "Mogu li promijeniti registrirane programere svoje organizacije u budućnosti?",
    "ChangingDevelopersExplanation": "Osim dodavanja novih programera u svoju licencu, također možete promijeniti postojeće programere (možete ukloniti programera i dodati novog na isto mjesto) bez ikakvih dodatnih troškova.",
    "WhatHappensWhenLicenseEnds": "Što se događa kada moje licencno razdoblje završi?",
    "WhatHappensWhenLicenseEndsExplanation1": "ABP Commercial licenca je <a href=\"{0}\" target=\"_blank\">stalna licenca</a> . Nakon isteka licence možete nastaviti razvijati svoj projekt. I niste dužni obnoviti svoju licencu. Vaša licenca dolazi s jednogodišnjim ažuriranjem i planom podrške. Kako biste nastavili dobivati nove značajke, poboljšanja performansi, ispravke grešaka, podršku i nastavili koristiti ABP Suite, trebate obnoviti svoju licencu. Kada vam istekne licenca;",
    "WhatHappensWhenLicenseEndsExplanation2": "Ne možete stvarati nova rješenja koristeći ABP Commercial, ali možete zauvijek nastaviti razvijati svoje postojeće aplikacije.",
    "WhatHappensWhenLicenseEndsExplanation3": "Moći ćete dobiti ažuriranja za module i teme unutar vaše MINOR verzije (osim RC ili Preview verzija). Na primjer, ako koristite v3.2.0 modula, još uvijek možete dobiti ažuriranja za v3.2.x (v3.2.1, v3.2.5... itd.) tog modula. Ali ne možete dobiti ažuriranja za sljedeću glavnu ili sporednu verziju (kao što je v3.3.0, v3.3.3, 4.xx itd.). Na primjer, kada je vaša licenca istekla, najnovije izdanje bilo je v4.4.3, a kasnije, objavilo je i verziju 4.4.4 i verziju 4.5.0, mogli biste pristupiti verziji v4.4.X, ali ne biste pristupite v4.5.X.",
    "WhatHappensWhenLicenseEndsExplanation4": "Ne možete instalirati nove module i teme dodane ABP Commercial platformi nakon isteka licence.",
    "WhatHappensWhenLicenseEndsExplanation5": "Ne možete koristiti ABP Suite.",
    "WhatHappensWhenLicenseEndsExplanation6": "Više ne možete dobiti <a href=\"{0}\">premium podršku</a> .",
    "WhatHappensWhenLicenseEndsExplanation7": "Možete produžiti (obnoviti) svoju licencu ako želite i dalje primati ove pogodnosti. Ako produžite svoju licencu u roku od <strong>{3} dana</strong> nakon isteka licence, primijenit će se sljedeći popusti: timska licenca {0}; Poslovna licenca {1}; Enterprise Licenca {2}.",
    "discountForYears": "{0}% popusta za {1} godinu(e)",
    "WhatHappensWhenLicenseEndsExplanation8": "ABP projekti koje ste generirali nisu pohranjeni na našim poslužiteljima. Stoga je vaša odgovornost zadržati izvorni kod koji preuzmete. Kada vaša licenca istekne, ne postoji način da dobijete generirani izvorni kod ABP projekta.",
    "WhenShouldIRenewMyLicense": "Kada trebam obnoviti licencu?",
    "WhenShouldIRenewMyLicenseExplanation": "Ako obnovite svoju licencu u roku od <strong>{3} dana</strong> nakon isteka licence, primijenit će se sljedeći popusti: timska licenca {0}; Poslovna licenca {1}; Enterprise Licenca {2}. Međutim, ako obnovite licencu nakon <strong>{3} dana</strong> od datuma isteka licence, cijena obnove bit će ista kao kupovna cijena licence i neće biti popusta na vašu obnovu.",
    "TrialPlan": "Imate li probni plan?",
    "TrialPlanExplanation": "Da, za početak besplatnog probnog razdoblja kontaktirajte <a href=\"mailto:marketing@volosoft.com?subject=ABP Commercial — Trial License Request\">marketing@volosoft.com</a> . Također nudimo 30-dnevno jamstvo povrata novca za Team licencu, bez pitanja! Možete zatražiti puni povrat novca unutar prvih 30 dana od kupnje licence. Osiguravamo povrat od 60% u roku od 30 dana za poslovne i poslovne licence. To je zato što licence Business i Enterprise sadrže puni izvorni kod svih modula i tema.",
    "DoYouAcceptBankWireTransfer": "Prihvaćate li bankovne doznake?",
    "DoYouAcceptBankWireTransferExplanation": "Da, prihvaćamo bankovne doznake.<br/> Nakon slanja naknade za licencu putem bankovnog prijenosa, pošaljite svoju potvrdu i traženu vrstu licence na accounting@volosoft.com.<br/> Informacije o našem međunarodnom bankovnom računu:",
    "HowToUpgrade": "Kako nadograditi postojeće aplikacije kada je dostupna nova verzija?",
    "HowToUpgradeExplanation1": "Kada izradite novu aplikaciju koristeći ABP Commercial, svi moduli i teme koriste se kao NuGet i NPM paketi. Dakle, možete jednostavno nadograditi pakete kada nova verzija bude dostupna.",
    "HowToUpgradeExplanation2": "Uz standardne NuGet/NPM nadogradnje, <a href=\"{0}\">ABP CLI</a> pruža naredbu ažuriranja koja automatski pronalazi i nadograđuje sve pakete povezane s ABP-om u vašem rješenju.",
    "DatabaseSupport": "Koji su sustavi baza podataka podržani?",
    "DatabaseSupportExplanation": "Sam ABP Framework ne ovisi o bazi podataka i po svojoj prirodi može raditi s bilo kojim pružateljem baze podataka. Provjerite <a href=\"{0}\" target=\"_blank\">dokument o pristupu podacima</a> za popis trenutno implementiranih pružatelja usluga.",
    "UISupport": "Koji su UI okviri podržani?",
    "Supported": "Podržano",
    "UISupportExplanation": "Sam ABP okvir ne ovisi o okviru korisničkog sučelja i može raditi s bilo kojim okvirom korisničkog sučelja. Međutim, predlošci za pokretanje, korisničko sučelje modula i teme nisu implementirani za sve okvire korisničkog sučelja. Provjerite <a href=\"{0}\">dokument Početak rada</a> za ažurirani popis opcija korisničkog sučelja.",
    "MicroserviceSupport": "Podržava li mikroservisnu arhitekturu?",
    "MicroserviceSupportExplanation1": "Jedan od glavnih ciljeva okvira ABP je pružiti prikladnu infrastrukturu za stvaranje mikroservisnih rješenja. Provjerite <a href=\"{0}\">dokument o arhitekturi mikroservisa</a> da biste razumjeli kako pomaže u stvaranju sustava mikroservisa.",
    "MicroserviceSupportExplanation2": "Svi ABP Commercial moduli dizajnirani su za podršku scenarijima postavljanja mikroservisa (s vlastitim API-jem i bazom podataka) prateći <a href=\"{0}\">dokument s najboljim praksama razvoja modula</a> .",
    "MicroserviceSupportExplanation3": "Pružamo ogledno <a href=\"{0}\">demonstracijsko rješenje mikroservisa</a> koje pokazuje implementaciju arhitekture mikroservisa kako bismo vam pomogli da stvorite vlastito rješenje.",
    "MicroserviceSupportExplanation4": "Dakle, kratak odgovor je: &quot; <strong>Da, podržava mikroservisnu arhitekturu</strong> &quot;.",
    "MicroserviceSupportExplanation5": "Međutim, sustav mikroservisa je rješenje, a svako rješenje će imati različite zahtjeve, mrežnu topologiju, komunikacijske scenarije, mogućnosti autentifikacije, odluke o dijeljenju/particioniranju baze podataka, konfiguracije vremena izvođenja, integracije sustava treće strane i još mnogo toga.",
    "MicroserviceSupportExplanation6": "ABP Framework i ABP Commercial pružaju infrastrukturu za scenarije mikroservisa, module kompatibilne s mikroservisima, uzorke i dokumentaciju koja će vam pomoći da izgradite vlastito rješenje. Ali nemojte očekivati da ćete izravno preuzeti rješenje iz snova koje je unaprijed napravljeno za vas. Morat ćete to razumjeti i spojiti određene dijelove na temelju svojih zahtjeva.",
    "WhereCanIDownloadSourceCode": "Gdje mogu preuzeti izvorni kod?",
    "WhereCanIDownloadSourceCodeExplanation": "Možete preuzeti izvorni kod svih ABP modula, Angular paketa i tema putem ABP Suite ili ABP CLI. Pogledajte <a href=\"{0}\">Kako preuzeti izvorni kod?</a>",
    "ComputerLimitation": "Na koliko računala se programer može prijaviti kada razvija ABP?",
    "ComputerLimitationExplanation": "Izričito dopuštamo <strong>{0} računala</strong> po pojedincu/licenciranom programeru. Kad god postoji potreba da razvojni programer razvije ABP komercijalne proizvode na trećem računalu, potrebno je poslati e-poruku na licencu@abp.io s objašnjenjem situacije, a mi ćemo tada izvršiti odgovarajuću dodjelu u našem sustavu.",
    "RefundPolicy": "Imate li politiku povrata novca?",
    "RefundPolicyExplanation": "Povrat novca možete zatražiti u roku od <strong>30 dana</strong> od kupnje licence. Vrste licenci Business i Enterprise imaju opcije preuzimanja izvornog koda; stoga nudimo 60% povrata u roku od 30 dana za poslovne i poslovne licence. Osim toga, nema povrata novca za obnove i kupnju druge licence.",
    "HowCanIRefundVat": "Kako mogu izvršiti povrat PDV-a?",
    "HowCanIRefundVatExplanation1": "Ako ste uplatu izvršili putem 2Checkouta, povrat PDV-a možete izvršiti putem svog 2Checkout računa:",
    "HowCanIRefundVatExplanation2": "Prijavite se na svoj <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\">2Checkout</a> račun",
    "HowCanIRefundVatExplanation3": "Pronađite odgovarajuću narudžbu i pritisnite &quot;Povrat zakašnjelog PDV-a&quot; (unesite svoj PDV ID)",
    "HowCanIGetMyInvoice": "Kako mogu dobiti svoju fakturu?",
    "HowCanIGetMyInvoiceExplanation": "Postoje 2 pristupnika za plaćanje za kupnju licence: Iyzico i 2Checkout. Ako svoju licencu kupite putem 2Checkout gatewaya, on šalje PDF fakturu na vašu adresu e-pošte; pogledajte <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How-do-invoices-work\">2Checkout fakturiranje.</a> Ako kupujete putem Iyzico gatewaya, s prilagođenom vezom za kupnju ili putem bankovne doznake, pripremit ćemo i poslati vaš račun. Svoju fakturu možete zatražiti ili preuzeti sa <a href=\"{0}\">stranice za upravljanje organizacijom</a> . Prije nego što nas kontaktirate za fakturu, provjerite svoju stranicu za upravljanje organizacijom!",
    "Forum": "Forum",
    "SupportExplanation": "ABP Commercial licenca pruža premium forumsku podršku od strane tima koji se sastoji od stručnjaka za ABP Framework.",
    "PrivateTicket": "Privatna ulaznica",
    "PrivateTicketExplanation": "Enterprise License također uključuje privatnu podršku s e-poštom i sustavom ulaznica.",
    "AbpSuiteExplanation1": "ABP Suite vam omogućuje izradu web stranica u nekoliko minuta. To je .NET Core Global alat koji se može instalirati iz naredbenog retka.",
    "AbpSuiteExplanation2": "Može stvoriti novo ABP rješenje i generirati CRUD stranice iz baze podataka prema front-endu. Za tehnički pregled pogledajte <a href=\"{0}\">dokument</a>",
    "FastEasy": "Brzo i jednostavno",
    "AbpSuiteExplanation3": "ABP Suite vam omogućuje jednostavno stvaranje CRUD stranica. Vi samo trebate definirati svoj entitet i njegova svojstva, a ostalo prepustite ABP Suite-u umjesto vas! ABP Suite generira sav potreban kod za vašu CRUD stranicu u nekoliko sekundi. Podržava Angular, MVC i Blazor korisnička sučelja.",
    "RichOptions": "Bogate opcije",
    "AbpSuiteExplanation4": "ABP Suite podržava više opcija korisničkog sučelja kao što su <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\">Razor Pages</a> i <a href=\"https://angular.io\">Angular</a> . Također podržava više baza podataka kao što je <a href=\"https://www.mongodb.com\">MongoDB</a> i sve baze podataka koje podržava <strong>EntityFramework Core</strong> (MS SQL Server, Oracle, MySql, PostgreSQL i <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\">drugi pružatelji...</a> ).",
    "AbpSuiteExplanation5": "Dobra stvar je što ne morate brinuti o tim opcijama. ABP Suite razumije vašu vrstu projekta i generira kod za vaš projekt te postavlja generirani kod na pravo mjesto u vašem projektu.",
    "SourceCode": "Izvorni kod",
    "AbpSuiteExplanation6": "ABP Suite generira izvorni kod za vas! Ne stvara čarobne datoteke za generiranje web stranice. ABP Suite generira izvorni kod za <strong>Entitet, Repozitorij, Application Service, Code First Migration, JavaScript/TypeScript i CSHTML/HTML</strong> kao i potrebna sučelja. ABP Suite također generira kod u skladu s <strong>najboljim praksama</strong> razvoja softvera, tako da ne morate brinuti o kvaliteti generiranog koda.",
    "AbpSuiteExplanation7": "Budući da imate izvorni kod sastavnih dijelova generirane CRUD stranice u ispravnim aplikacijskim slojevima, možete jednostavno modificirati izvorni kod i ubaciti svoju prilagođenu/poslovnu logiku u generirani kod.",
    "CrossPlatform": "Križna platforma",
    "AbpSuiteExplanation8": "ABP Suite izgrađen je s .NET Coreom i više je platformi. Pokreće se kao web aplikacija na vašem lokalnom računalu. Možete ga pokrenuti na <strong>Windowsima</strong> , <strong>Macu</strong> i <strong>Linuxu</strong>",
    "OtherFeatures": "Druge značajke",
    "OtherFeatures1": "Jednostavno ažurira <strong>NuGet</strong> i <strong>NPM</strong> pakete na vašem rješenju.",
    "OtherFeatures2": "Regenerira već generirane stranice od nule.",
    "OtherFeatures3": "Stvara nova rješenja",
    "ThanksForCreatingProject": "Vaš projekt je uspješno kreiran!",
    "HotToRunSolution": "Kako pokrenuti svoje rješenje?",
    "HotToRunSolutionExplanation": "Pogledajte dokument o početku rada da biste saznali kako konfigurirati i pokrenuti svoje rješenje.",
    "GettingStarted": "Početak rada",
    "WebAppDevTutorial": "Vodič za razvoj web aplikacija",
    "WebAppDevTutorialExplanation": "Pogledajte dokument s vodičem za razvoj web aplikacija za uzorak razvoja korak po korak.",
    "Document": "Dokument",
    "UsingABPSuiteToCURD": "Korištenje ABP Suite za CRUD generiranje stranica i alate",
    "SeeABPSuiteDocument": "Provjerite dokument ABP Suite da biste saznali kako se koristi ABP Suite.",
    "AskQuestionsOnSupport": "Pitanja možete postavljati na ABP Commercial Support.",
    "Documentation": "Dokumentacija",
    "SeeModulesDocument": "Pogledajte stranicu modula za popis svih PRO modula.",
    "Pricing": "Cijene",
    "PricingExplanation": "Odaberite značajke i funkcionalnost koje vaše poslovanje treba danas. Jednostavno nadogradite kako vaše poslovanje raste.",
    "Team": "Tim",
    "Business": "Poslovanje",
    "Enterprise": "Poduzeće",
    "Custom": "Prilagođen",
    "IncludedDeveloperLicenses": "Uključene licence za programere",
    "CustomLicenceOrAdditionalServices": "Trebate prilagođenu licencu ili dodatne usluge?",
    "CustomOrVolumeLicense": "Prilagođena ili količinska licenca",
    "LiveTrainingSupport": "Trening uživo i podrška",
    "AndMore": "i više",
    "AdditionalDeveloperLicense": "Dodatna licenca programera",
    "ProjectCount": "Broj projekata",
    "AllProModules": "Svi profesionalni moduli",
    "AllProThemes": "Sve profesionalne teme",
    "AllProStartupTemplates": "Svi profesionalni predlošci za pokretanje",
    "SourceCodeOfAllModules": "Izvorni kod svih modula",
    "SourceCodeOfAllThemes": "Izvorni kod svih tema",
    "PerpetualLicense": "Trajna licenca",
    "UnlimitedServerDeployment": "Neograničena implementacija poslužitelja",
    "YearUpgrade": "1 godina nadogradnje",
    "YearPremiumForumSupport": "1-godišnja premium forumska podrška",
    "ForumSupportIncidentCountYear": "Broj incidenata podrške foruma/godina",
    "PrivateTicketEmailSupport": "Privatna ulaznica i podrška e-poštom",
    "BuyNow": "Kupi sada",
    "PayViaAmexCard": "Kako mogu platiti putem moje AMEX kartice?",
    "PayViaAmexCardDescription": "Zadani pristupnik plaćanja &#39;Iyzico&#39; može odbiti neke AMEX kreditne kartice zbog sigurnosnih mjera. U tom slučaju možete platiti putem alternativnog pristupnika plaćanja &#39;2Checkout&#39;.",
    "ThankYou": "Hvala vam",
    "InvalidReCaptchaErrorMessage": "Došlo je do pogreške prilikom provjere reCAPTCHA. Molim te pokušaj ponovno.",
    "CompanyName": "Naziv tvrtke",
    "YourCompanyName": "Naziv vaše tvrtke",
    "FirstName": "Ime",
    "LastName": "Prezime",
    "Optional": "Neobavezno",
    "YourFirstName": "Vaše ime",
    "YourLastName": "Tvoje prezime",
    "SpecialOffer": "Posebna ponuda",
    "SpecialOfferMessage": "Požuri! Cijene vrijede ograničeno vrijeme.",
    "DiscountRequest": "Zahtjev za popust",
    "DiscountRequestDescribeCustomerQuestion": "Što vas od sljedećeg opisuje?",
    "DiscountRequestStudentEmailMessage": "E-mail adresa mora sadržavati &#39;edu&#39;.",
    "DiscountRequestDeveloperCount": "Koliko ste programeri?",
    "DiscountRequestDeveloperCountExceedMessage": "Ne dajemo licence s popustom za tvrtke koje imaju više od {0} programera.",
    "DiscountRequestOrganizationName": "Naziv tvrtke/organizacije/škole",
    "Website": "Web stranica",
    "GithubUsername": "GitHub korisničko ime",
    "PhoneNumber": "Broj telefona",
    "Country": "Zemlja",
    "DescribeABPCommercialUsage": "Opišite projekt koji planirate razviti na temelju APB Commerciala",
    "DiscountRequestCertifyInformationMessage": "Potvrđujem da su sve informacije istinite i točne.",
    "DiscountRequestReceived": "Primili smo vaš zahtjev za popust.",
    "DiscountRequestStatusMessage": "Odgovorit ćemo vam nakon provjere podataka koje ste dostavili.",
    "MVCOrRazorPages": "MVC (stranice Razor)",
    "Angular": "Kutni",
    "Blazor": "Blazor",
    "New": "Novi",
    "MongoDB": "MongoDB",
    "EBookDDD": "Dizajn usmjeren na domenu e-knjiga",
    "PracticalGuideForImplementingDDD": "Ova je knjiga praktični vodič za implementaciju dizajna vođenog domenom s ABP okvirom.",
    "IntroducingDDD": "Predstavljamo dizajn vođen domenom",
    "DDDLayersAndCleanArchitecture": "DDD slojevi i čista arhitektura",
    "LayeringOfADotnetSolution": "Raslojavanje .NET rješenja",
    "ImplementingDDDBuildingBlocks": "Implementacija DDD gradivnih blokova",
    "DomainVsApplicationLogic": "Logika domene nasuprot logici aplikacije",
    "SamplesAndDiscussions": "Uzorci i rasprave",
    "Free": "Besplatno",
    "Download": "preuzimanje datoteka",
    "DDDEBook": "DDD E-knjiga",
    "ImplementingDDD": "Implementacija dizajna vođenog domenom",
    "DDDBookExplanation": "Praktični vodič za implementaciju dizajna vođenog domenom s ABP okvirom.",
    "Overview": "Pregled",
    "DDDBookPracticalGuide": "Ovo je praktični vodič za implementaciju Domain Driven Design (DDD). Dok se detalji implementacije oslanjaju na infrastrukturu ABP Framework, temeljne koncepte, principe i obrasce koji su primjenjivi u bilo kojoj vrsti rješenja, čak i ako to nije .NET rješenje.",
    "TableOfContents": "Sadržaj",
    "IntroductionToImplementingDDD": "Uvod u implementaciju dizajna vođenog domenom",
    "WhatIsDDD": "Što je dizajn vođen domenom?",
    "Implementation": "Provedba",
    "TheBigPicture": "Velika slika",
    "TheBuildingBlock": "Building Block",
    "ExampleUseCase": "Primjer upotrebe",
    "DomainAndApplicationLogic": "Logika domene i logika aplikacije",
    "Author": "Autor",
    "PublishedOn": "Objavljeno na",
    "Page": "Stranica",
    "FreeEBook": "Besplatna e-knjiga",
    "EBookSignInForDownload": "Za preuzimanje e-knjige prijavite se",
    "SignIn": "Prijaviti se",
    "Or": "Ili",
    "TellUsAboutYourself": "Recite nam nešto o sebi",
    "Surname": "Prezime",
    "DoYouAgreePrivacyPolicy": "Slažem se s <a href=\"/TermsConditions\">Uvjetima i odredbama</a> <a/>i</a> <a href=\"/Privacy\">Politikom privatnosti</a> .",
    "VolosoftMarketingInformationMessage": "Želio bih informacije, savjete i ponude o rješenjima za tvrtke i organizacije te drugim Volosoft proizvodima i uslugama.",
    "VolosoftSharingInformationMessage": "Želio bih da Volosoft podijeli moje podatke s odabranim partnerima kako bih mogao dobiti relevantne informacije o njihovim proizvodima i uslugama.",
    "WeWillSendYouADownloadLink": "Veza za preuzimanje e-knjige poslana je na {0}. Provjerite svoju pristiglu poštu, pretince za smeće i neželjenu poštu!",
    "InvalidFormInputs": "Molimo unesite valjane podatke navedene na obrascu.",
    "DDDBookEmailBody": "Hvala vam.<br /> Za preuzimanje svoje knjige <a href=\"{0}\">kliknite ovdje</a> .",
    "StartFree": "Počni besplatno",
    "FreeTrial": "Besplatna proba",
    "AcceptsMarketingCommunications": "Da, želio bih primati ABP komercijalne marketinške komunikacije.",
    "PurposeOfUsage": "Svrha korištenja",
    "Choose": "- Odaberite -",
    "CompanyOrganizationName": "Naziv tvrtke/organizacije",
    "CompanySize": "Veličina tvrtke",
    "Next": "Sljedeći",
    "StartTrial": "Pokreni Moje besplatno probno razdoblje",
    "ContactUsQuestions": "Kontaktirajte nas ako imate pitanja",
    "TrialActivatedWarning": "Korisnik ima pravo na samo 1 besplatno probno razdoblje. Već ste iskoristili svoje probno razdoblje.",
    "ActivationRequirement": "Zadnji ste korak do početka probe.<br> Nakon provjere vaših podataka, aktivirat ćemo vašu licencu. Nakon što se vaša licenca aktivira, poslat ćemo e-poštu na <b>{0}</b> . Ne brinite, ovaj proces neće dugo trajati!",
    "SaveAndDownload": "Spremi i preuzmi",
    "CompanyNameValidationMessage": "Ime tvrtke je predugačko!",
    "AddressValidationMessage": "Adresa je preduga!",
    "TaxNoValidationMessage": "TAX/VAT No je predug!",
    "NotesValidationMessage": "Polje za bilješke je predugačko!",
    "CheckYourBillingInfo": "Svoju fakturu možete izraditi samo jednom! Provjerite podatke o naplati prije izrade fakture.",
    "StartYourFreeTrial": "Započnite besplatno probno razdoblje",
    "TrialLicenseModelInvalidErrorMessage": "Jedno od sljedećih polja je nevažeće: Naziv zemlje, Veličina tvrtke, Industrija ili Svrha upotrebe.",
    "Trial": "suđenje",
    "Purchased": "Kupljeno",
    "PurchaseNow": "Kupite sada",
    "PurchaseTrialLicenseMessage": "Vaš datum isteka licence je {0}.<br> Ako želite nastaviti koristiti projekte koje ste izradili tijekom besplatnog probnog razdoblja, trebate promijeniti licencne ključeve u datotekama <code>appsettings.secrets.json</code> . Ovdje je vaš licencni ključ:",
    "TrialLicenseExpireMessage": "Koristite probnu licencu i vaša će probna licenca isteći {0}.",
    "TryForFree": "Isprobaj besplatno",
    "TrialLicenseExpiredInfo": "Vaše probno licencno razdoblje je isteklo!",
    "DowngradeLicensePlan": "Mogu li se u budućnosti vratiti na niži licencni plan?",
    "DowngradeLicensePlanExplanation": "Ne možete vratiti svoj postojeći licencni plan na stariju verziju. Ali možete kupiti novi niži licencni plan i nastaviti svoj razvoj na novoj licenci. Nakon što kupite nižu licencu, samo se trebate prijaviti na svoj novi licencni plan putem ABP CLI naredbe: ` abp login<username> -o<organization> `.",
    "LicenseTransfer": "Može li se licenca prenijeti s jednog programera na drugog?",
    "LicenseTransferExplanation": "Da! Kada kupite licencu, postajete vlasnik licence, stoga ćete imati pristup stranici za upravljanje organizacijom. Organizacija ima uloge vlasnika i programera. Vlasnici mogu upravljati mjestima za programere i dodjeljivati programere. Svaki dodijeljeni programer prijavit će se putem ABP CLI naredbe u sustav i imat će dozvole za razvoj i podršku.",
    "UserOwnerDescription": "&#39;Vlasnik&#39; organizacije je administrator ovog računa. On/ona upravlja organizacijom kupnjom licenci i dodjeljivanjem programera. &#39;Vlasnik&#39; ne može pisati kod u ABP komercijalnim projektima, ne može preuzimati uzorke ABP projekata i ne može postavljati pitanja na web stranici za podršku. Ako želite učiniti sve ovo, morate dodati i sebe kao programera.",
    "UserDeveloperDescription": "&#39;Programeri&#39; mogu pisati kod u ABP komercijalnim projektima, preuzimati uzorke ABP projekata i postavljati pitanja na web stranici podrške. S druge strane, &#39;Programeri&#39; ne mogu upravljati ovom organizacijom.",
    "RemoveCurrentUserFromOrganizationWarningMessage": "Uklanjate se iz vlastite organizacije. Više nećete moći upravljati ovom organizacijom, potvrđujete li?",
    "RenewExistingOrganizationOrCreateNewOneMessage": "Možete obnoviti licencu svoje organizacije(a) klikom na donji gumb(e) &quot;Produži sada&quot; i na taj način možete produžiti datum isteka licence za 1 godinu. Ako nastavite s odjavom, imat ćete novu organizaciju. Želite li nastaviti s novom organizacijom?",
    "PurchaseTrialOrganizationOrCreateNewOneMessage": "Imate probnu licencu. Za kupnju probne licence kliknite gumb Kupi odmah. Ako nastavite s odjavom, imat ćete novu organizaciju. Želite li nastaviti s novom organizacijom?",
    "ExtendNow": "Produžite sada",
    "CreateNewOrganization": "Napravite novu organizaciju",
    "RenewLicenseEarly": "Ako prijevremeno produžim licencu, hoću li dobiti cijelu godinu?",
    "RenewLicenseEarylExplanation": "Kada obnovite licencu prije datuma isteka licence, datumu isteka licence bit će dodana 1 godina. Na primjer, ako vam licenca istječe {0}-06-06, a vi je obnovite {0}-01-01, datum isteka vaše nove licence bit će {1}-06-06.",
    "OpenSourceWebApplication": "Web aplikacija otvorenog koda",
    "CompleteWebDevelopment": "Kompletan web razvoj",
    "ABPFrameworkDescription": "ABP Framework je cjelovita infrastruktura za stvaranje modernih web aplikacija slijedeći najbolje prakse razvoja softvera i konvencije.",
    "CommunityDescription": "Podijelite svoja iskustva s ABP okvirom!",
    "GetStarted": "Započnite",
    "Views": "pogleda",
    "LatestPosts": "Najnovije objave",
    "PreBuiltApplication": "Unaprijed izrađena aplikacija",
    "DatabaseProviders": "Pružatelji baza podataka",
    "UIFrameworks": "UI okviri",
    "UsefulLinks": "korisni linkovi",
    "Platform": "Platforma",
    "CoolestCompaniesUseABPCommercial": "Najbolje tvrtke već koriste <span class=\"fw-bold\">ABP Commercial.</span>",
    "UserInterface": "Korisničko sučelje",
    "APIGateway": "API Gateway",
    "Microservice": "Mikroservis",
    "Database": "Baza podataka",
    "Architecture": "Arhitektura",
    "MicroserviceArchitectureExplanation": "Ovo je cjelovita arhitektura rješenja koja se sastoji od više aplikacija, API pristupnika, mikroservisa i baza podataka za izgradnju skalabilnog mikroservisnog rješenja s najnovijim tehnologijama.",
    "BusinessLogic": "Poslovna logika",
    "DataAccessLayer": "Sloj pristupa podacima",
    "Monolith": "Monolit",
    "ModularArchitectureExplanation": "Ovaj predložak za pokretanje pruža slojevitu, modularnu arhitekturu rješenja temeljenu na DDD-u za izgradnju čiste baze koda koju je moguće održavati.",
    "SeeDetails": "Pogledaj detalje",
    "SeeDocumentation": "Provjerite Dokumentaciju",
    "Bs5Compatible": "Profesionalna tema kompatibilna s Bootstrap 5, savršena za vašu administratorsku web stranicu.",
    "LeptonXTheme": "Tema LeptonX",
    "LeptonXDark": "LeptonX Dark",
    "LeptonXLight": "LeptonX svjetlo",
    "LeptonXSemiDark": "LeptonX polutamni",
    "BuiltOnBs5Library": "Izgrađen na biblioteci Bootstrap 5",
    "FullyCompatibleWithBs5": "100% kompatibilan s Bootstrap 5 HTML strukturom i CSS klasama",
    "ResponsiveAndMobileCompatible": "Responzivan, kompatibilan s mobilnim uređajima, RTL podrška",
    "ProvidesStylesForDatatables": "Pruža stilove za Datatables",
    "MultipleLayoutOptions": "Više opcija izgleda",
    "EasilyInstallAndUpgrade": "Jednostavna instalacija i nadogradnja",
    "SupportForum": "Forum podrške",
    "TrustedBy": "Povjerio",
    "OurPricing": "Naše <span class=\"gradient-commercial\">cijene</span>",
    "Plans": "Planovi",
    "NameSurname": "Ime prezime",
    "Unspecified": "Neodređeno",
    "LicenceType": "Vrsta licence",
    "LicenseDiscountWarning": "OVA STRANICA ZA POPUST KORISTI ZADANI KOD ZA POPUST I ZA VOLOSOFT PROGRAMERE. LINKOVI ZA KUPOVINU DOLJE NE RADE.",
    "DiscountedLicenseExplanation": "Ove cijene licenci odnose se na male startupe, individualne programere, studente, neprofitne organizacije i projekte!",
    "General": "Općenito",
    "License": "Licenca",
    "Development": "Razvoj",
    "Payment": "Plaćanje",
    "WatchExplainerVideo": "Nađimo se! Pogledajte video s objašnjenjem",
    "LightDarkAndSemiDarkThemes": "Svijetlo, tamno i polutamno",
    "LeptonXThemeExplanation": "Tema Lepton može promijeniti vašu temu prema postavkama vašeg sustava.",
    "PRO": "PRO",
    "WelcomeToABPCommercial": "Dobrodošli u <span class=\"gradient-commercial\">ABP Commercial!</span>",
    "YourAccountDetails": "Podaci o vašem računu",
    "OrganizationName": "Naziv organizacije",
    "AddDevelopers": "Dodajte programere",
    "StartDevelopment": "Započni razvoj",
    "CreateAndRunApplicationUsingStartupTemplate": "Naučite kako izraditi i pokrenuti novu web aplikaciju pomoću predloška za pokretanje ABP Commercial.",
    "CommunityDescription2": "<span class=\"fw-6\">community.abp.io</span> je mjesto gdje ljudi mogu dijeliti članke vezane uz ABP. Potražite članke, upute, uzorke koda, studije slučaja i upoznajte ljude u istoj stazi kao i vi.",
    "UseABPSuiteExplanation": "Koristite ABP Suite za preuzimanje izvornog koda modula i tema.",
    "ManageModulesWithSuite": "Također možete upravljati svojim ABP modulima pomoću Suitea.",
    "LearnHowToInstallSuite": "Naučite kako instalirati i koristiti ABP Suite.",
    "SeeMore": "Vidi više",
    "SeeLess": "Vidi Manje",
    "LayeredSolutionStructure": "Slojevita struktura rješenja",
    "LayeredSolutionStructureExplanation": "Rješenje je slojevito temeljeno na načelima i obrascima dizajna vođenog domenom kako bi se vaša poslovna logika izolirala od infrastrukture i integracija te kako bi se povećala mogućnost održavanja i ponovne upotrebe koda. ABP Framework već nudi apstrakcije, osnovne klase i vodiče za istinsku implementaciju DDD-a za vašu aplikaciju.",
    "MultipleUIOptions": "Više opcija korisničkog sučelja",
    "MultipleUIOptionsExplanation": "Volimo različite načine za stvaranje korisničkog sučelja. Ovo rješenje za pokretanje pruža tri različite opcije okvira korisničkog sučelja za vašu poslovnu aplikaciju.",
    "MultipleDatabaseOptions": "Više opcija baze podataka",
    "MultipleDatabaseOptionsExplanation": "Imate dvije opcije pružatelja baze podataka (uz korištenje obje u jednoj aplikaciji). Koristite Entity Framework Core za rad s bilo kojom relacijskom bazom podataka i opcionalno koristite Dapper kada trebate pisati upite niske razine za bolju izvedbu. MongoDB je još jedna opcija ako trebate koristiti NoSQL bazu podataka temeljenu na dokumentima. Dok su ovi pružatelji dobro integrirani, apstrahirani i unaprijed konfigurirani, zapravo možete komunicirati s bilo kojim sustavom baze podataka koji možete koristiti s .NET-om.",
    "ModularArchitectureExplanation2": "Modularnost je prvorazredni građanin u platformi ABP.IO. Sve funkcionalnosti aplikacije podijeljene su u dobro izolirane dodatne module. Rješenje za pokretanje već dolazi s unaprijed instaliranim osnovnim <a href=\"/modules\" class=\"text-primary\">ABP Commercial modulima</a> . Također možete izraditi vlastite module za izgradnju modularnog sustava za vlastitu aplikaciju.",
    "MultiTenancyForSaasBusiness": "Multi-Tenancy za vaš SaaS posao",
    "MultiTenancyForSaasBusinessExplanation": "ABP Commercial pruža kompletan, end-to-end multi-tenancy sustav za stvaranje vaših SaaS (Software-as-a-Service) sustava. Omogućuje stanarima dijeljenje ili posjedovanje vlastitih baza podataka s on-the-fly sustavom za kreiranje baze podataka i migraciju.",
    "MicroserviceStartupSolution": "Rješenje za pokretanje mikroservisa",
    "MicroserviceArchitectureExplanation2": "Možete ga nabaviti za svoj sljedeći sustav mikroservisa kako biste iskoristili prednosti unaprijed izgrađenog osnovnog rješenja i destiliranog iskustva.",
    "PreIntegratedTools": "Unaprijed integriran u popularne alate",
    "PreIntegratedToolsExplanation": "Rješenje je već integrirano u industrijske standardne alate i tehnologije, dok ih uvijek možete promijeniti i integrirati u svoje omiljene alate.",
    "SingleSignOnAuthenticationServer": "Single Sign-on Authentication Server",
    "SingleSignOnAuthenticationServerExplanation": "Rješenje ima aplikaciju poslužitelja za provjeru autentičnosti koju druge aplikacije koriste kao poslužitelj za jedinstvenu prijavu sa značajkama upravljanja pristupom API-ja. Temelji se na IdentityServeru.",
    "WebAppsWithGateways": "2 web aplikacije s 2 API pristupnika",
    "WebAppsWithGatewaysExplanation": "Rješenje sadrži dvije web aplikacije, svaka ima namjenski API pristupnik (BFF - Backend For Frontend pattern).",
    "BackOfficeApplication": "Back Office aplikacija",
    "BackOfficeApplicationExplanation": "Stvarna web aplikacija vašeg sustava, s više opcija okvira korisničkog sučelja. Možete izraditi bilo koju vrstu poslovne aplikacije.",
    "LandingWebsite": "Odredišna web stranica",
    "LandingWebsiteExplanation": "Generička odredišna/javna web stranica koja se može koristiti u nekoliko svrha, kao što je predstavljanje vaše tvrtke, prodaja vaših proizvoda itd.",
    "ABPFrameworkEBook": "E-knjiga Mastering ABP Framework",
    "MasteringAbpFrameworkEBookDescription": "Uključeno u vašu ABP komercijalnu licencu",
    "FullName": "Puno ime",
    "LicenseTypeNotCorrect": "Vrsta licence nije ispravna!",
    "Trainings": "Treninzi",
    "ChooseTrainingPlaceholder": "Odaberite trening...",
    "DoYouNeedTrainings": "Trebate li jedan od ovih treninga?",
    "DoYouNeedTraining": "Trebate li {0} obuku?",
    "GetInTouchUs": "Kontaktirajte nas",
    "ForMoreInformationClickHere": "Za više informacija kliknite <a href='{0}'>ovdje.</a>",
    "ForMoreInformationClickHereByClass": "<span class=\"{1}\">Za više informacija kliknite</span> <a href='{0}'>ovdje.</a>",
    "IsGetOnboardingTraining": "Želite li dobiti obuku za uvođenje i razvoj web aplikacija?",
    "OnboardingWebApplicationDevelopmentTrainingMessage": "Da biste zakazali svoj kalendar obuke, kontaktirajte {0} nakon stvaranja organizacije",
    "CustomPurchaseMessage": "Za sljedeći korak kliknite {0} da nas kontaktirate.",
    "Note": "Bilješka",
    "AdditionalNote": "Dodatna napomena",
    "OnboardingTrainingFaqTitle": "Imate li ABP uvodnu obuku?",
    "OnboardingTrainingFaqExplanation": "Da, imamo ABP usluge obuke koje vam pomažu da brzo započnete svoj ABP projekt. O ABP-u ćete naučiti od člana glavnog tima ABP-a i steći ćete vještine za početak svog ABP projekta. U uvodnoj obuci objasnit ćemo kako postaviti svoje razvojno okruženje, instalirati potrebne alate i stvoriti potpuno funkcionalnu CRUD stranicu. Trening će se odvijati uživo, a koristit će se Zoom aplikacija, otvoreni smo i za korištenje drugih online platformi za sastanke. Jezik obuke će biti engleski. Također možete postaviti svoja pitanja o ABP-u tijekom sesija. Prikladno vrijeme i datum bit će planirani za obje strane. Za više informacija kontaktirajte nas na <a href=\"mailto:info@abp.io\">info@abp.io</a> .",
    "AddBasket": "Dodaj u košaricu",
    "SendTrainingRequest": "Pošaljite zahtjev za obuku",
    "OnlyEnglishVersionOfThisDocumentIsTheRecentAndValid": "* Engleska verzija ovog dokumenta je najažurnija i engleska verzija će prevladati u svim sporovima.",
    "Pricing_Page_Title": "Cijene i planovi",
    "Pricing_Page_Description": "Odaberite značajke i funkcionalnost koje vaše poslovanje treba danas. Kupite ABP Commercial licencu i stvarajte neograničene projekte.",
    "Pricing_Page_HurryUp": "Požuri!",
    "Pricing_Page_BuyLicense": "Kupite licencu po <strong>cijenama 2021</strong> do 16. siječnja!",
    "Pricing_Page_ValidForExistingCustomers": "Također vrijedi za postojeće kupce i obnove licenci.",
    "Pricing_Page_Hint1": "Cijena licence uključuje određeni broj razvojnih mjesta. Ako imate više programera, uvijek možete kupiti dodatna mjesta.",
    "Pricing_Page_Hint2": "Možete kupiti više licenci za programere sada ili u budućnosti. Licence se temelje na sjedištu, tako da možete prenijeti mjesto s jednog programera na drugog.",
    "Pricing_Page_Hint3": "Uz svoju licencu možete razviti neograničen broj različitih proizvoda.",
    "Pricing_Page_Hint4": "ABP Suite je alat koji pomaže vašem razvoju kako biste poboljšali svoju produktivnost. Podržava generiranje CRUD stranica i stvaranje novih projekata.",
    "Pricing_Page_Hint5": "Možete koristiti sve unaprijed izgrađene module u svojim aplikacijama.",
    "Pricing_Page_Hint6": "Možete koristiti sve unaprijed izgrađene teme u svojim aplikacijama.",
    "Pricing_Page_Hint7": "Predložak za pokretanje je rješenje Visual Studio koje vam omogućuje brzi početak vašeg projekta. Svi osnovni moduli dodani su i unaprijed konfigurirani za vas.",
    "Pricing_Page_Hint8": "E-knjiga Mastering ABP Framework objašnjava kako implementirati .NET rješenja s najboljim primjerima iz prakse. Prodaje se na Amazon.com, a knjigu možete besplatno preuzeti s licencom.",
    "Pricing_Page_Hint9": "Možete preuzeti izvorni kod bilo kojeg modula. Možda ćete htjeti dodati izvorni kod svom rješenju kako biste izvršili radikalne promjene ili ga samo zadržite za sebe iz sigurnosnih razloga.",
    "Pricing_Page_Hint10": "Licence su doživotne. To znači da možete zauvijek nastaviti razvijati svoju aplikaciju. Pristup najnovijoj verziji i dobivanje podrške odobreni su unutar razdoblja licence (1 godina osim ako je ne obnovite).",
    "Pricing_Page_Hint11": "Nema ograničenja u postavljanju! Možete implementirati na onoliko poslužitelja koliko želite, uključujući usluge u oblaku ili lokalne usluge.",
    "Pricing_Page_Hint12": "Možete ažurirati module, teme i alate na najnoviju verziju unutar razdoblja svoje aktivne licence. Nakon što vaša licenca istekne, trebate je obnoviti kako biste nastavili dobivati ažuriranja za ispravke programskih pogrešaka, nove značajke i poboljšanja.",
    "Pricing_Page_Hint13": "Premium podršku možete dobiti na godinu dana (možete obnoviti svoju licencu da je produžite).",
    "Pricing_Page_Hint14": "Timske i poslovne licence imaju ograničenje broja incidenata/pitanja. Ako kupite dodatne licence razvojnog programera, vaše ograničenje incidenata povećava se za {0} (za timsku licencu) ili {1} (za poslovnu licencu) po programeru.",
    "Pricing_Page_Hint15": "Samo Enterprise licenca uključuje privatnu podršku. Možete poslati e-poštu izravno ABP timu ili postaviti pitanja na support.abp.io s opcijom privatne karte. Privatne ulaznice nisu vidljive javnosti.",
    "Pricing_Page_Hint16": "Možete preuzeti izvorni kod svih ABP tema. Možda ćete htjeti dodati izvorni kod svom rješenju kako biste izvršili radikalne promjene ili ga samo zadržite za sebe iz sigurnosnih razloga.",
    "Pricing_Page_Testimonial_1": "ABP Commercial dopustio je SC Ventures da u 9 mjeseci isporuči SaaS platformu silo-baze podataka bankovne razine za više zakupaca kako bi podržao financiranje opskrbnog lanca potraživanja / obveza za fakture značajne vrijednosti iz više integriranih sidara. Modularnost ABP-a omogućila je timu isporuku u rekordnom vremenu, prolazak svih VAPT-a i implementaciju kontejnerskog skupa mikroservisa putem punog CI/CD-a i cjevovoda u proizvodnju.",
    "Pricing_Page_Testimonial_2": "Vidimo vrijednost korištenja ABP Commerciala za smanjenje režijskih troškova prilagođenih razvojnih projekata. Tim je u mogućnosti objediniti uzorak koda u različitim tokovima projekta. Vidimo više potencijala u okviru za izgradnju novih značajki brže nego prije. Vjerujemo da ćemo stalno uviđati vrijednost iskorištavanja ABP Commerciala.",
    "Pricing_Page_Testimonial_3": "Volimo ABP. Ne moramo sve pisati ispočetka. Počinjemo od značajki izvan okvira i fokusiramo se samo na ono što stvarno trebamo napisati. Također, ABP je dobro projektiran i kod je visoke kvalitete s manje grešaka. Kad bismo morali sami napisati sve što nam treba, možda bismo morali potrošiti godine. Još jedna stvar koja nam se sviđa je što nova verzija, popravak problema ili poboljšanje izlazi vrlo brzo svaki drugi tjedan. Ne čekamo predugo.",
    "Pricing_Page_Testimonial_4": "ABP Commercial je fantastičan proizvod koji bih preporučio. Komercijalni proizvodi za tržište za naše kupce na jednoj platformi koja se može konfigurirati. Skok počinje da okvir i alati pružaju bilo koji tim vrijedan svakog centa. ABP Commercial najbolje je odgovarao našim potrebama.",
    "Pricing_Page_Testimonial_5": "ABP Framework nije samo okvir, već je i vodič za razvoj/upravljanje projektom jer pruža DDD, GenericRepository, DI, Microservice i obuku o modularnosti. Čak i ako nećete koristiti sam framework, možete se razvijati s abp.io koji je dobro i profesionalno pripremljen (OpenIddict, Redis, Quartz itd.). Budući da su mnoge stvari unaprijed izgrađene, značajno skraćuje vrijeme razvoja projekta (kao što je stranica za prijavu, rukovanje iznimkama, filtriranje podataka, sijanje, revizijsko bilježenje, lokalizacija, automatski API kontroler itd.). Kao primjer iz naše aplikacije, koristio sam Local Event Bus za kontrolu zaliha. Dakle, mogu upravljati kretanjem narudžbi pisanjem rukovatelja zalihama. Divno je ne gubiti vrijeme za CreationTime, CreatorId. Pune se automatski.",
    "Pricing_Page_Testimonial_6": "ABP Framework je dobar okvir, ali mu treba vremena da razumije različite slojeve, klase i biblioteke koje koristi (osobito ABP). Proveo sam puno vremena čitajući bazu koda, ali ABP Commercial uštedio nam je vrijeme u stvaranju posebnih entiteta projekta (AR) i repozitorija povezanog sa svakim od njih. Svidio mi se i pristup korišten u ABP-u koji je vrlo zreo; znamo da se temelji na DDD i monolitu.",
    "Pricing_Page_Testimonial_7": "Kao startup, moramo brzo ponavljati i potrošiti minimalno vremena na standardne i sporedne značajke. \n Naši inženjeri variraju od vrlo iskusnih do mlađih inženjera, a bilo nam je potrebno zajedničko razumijevanje i način dijeljenja tehničkog i domenskog znanja, ABP nam je to omogućio zahvaljujući njihovim sjajnim vodičima i dokumentaciji. \n Postoje stvari o kojima se ne moramo brinuti budući da rade izvan kutije s ABP-om. \n ABP pomogao nam je pojednostaviti brzu izradu prototipova i razvoj, manje od 4 tjedna od početka značajke do proizvodnje. Sa svim svojim premium značajkama uključenim u licencu, ABP nam je dao &quot;Startup in a Box&quot; na strani softverskog inženjeringa.",
    "Pricing_Page_Testimonial_8": "ABP komercijalu bih preporučio svima onima koji žele proširiti ponudu proizvoda dostupnih svojim kupcima. Fantastično je kada je potrebno koristiti distribuirano poslovno okruženje (Angular, WPF, Win&amp;Linux). Osim njihovih proizvoda, volimo i njihovu podršku, koja nam posao čini bržim i lakšim. Već znamo da smo pronašli odličnog partnera za budućnost koji će nas podržati u širenju poslovanja.",
    "Pricing_Page_Testimonial_9": "Mi smo tvrtka od 2 zaposlena koja posluje preko 20 godina. \n Što se tiče našeg iskustva s ABP Commercialom, obratio nam se klijent koji je zatražio da razvijemo novu aplikaciju za ljudske resurse u modernom okruženju kako bismo zamijenili njihovu 25 godina staru aplikaciju Access. Odlučili smo prijeći s stolnog rješenja na web-bazirano. \n \n U to smo vrijeme imali vrlo malo znanja o web aplikacijama i .NET-u, ali slučajno smo naletjeli na ABP Commercial i uz pomoć ABP Frameworka, tehničke dokumentacije i ABP Suitea uspjeli smo ne samo razviti aplikaciju za specifikacijama klijenta ali i uspješno raditi unutar .NET okruženja u roku od godinu dana.",
    "AbpBookDownloadArea_ClaimYourEBook": "Zatražite svoju e-knjigu <span class='gradient-framework'>Mastering ABP Framework</span>",
    "AddMemberModal_Warning_1": "Ako <strong>korisničko ime</strong> koje pokušavate dodati ne postoji u sustavu, zamolite člana svog tima da se registrira na <a href='{0}/Account/Register'>{0}</a> i podijeli korisničko ime svog računa s vama.",
    "MyOrganizations_Detail_WelcomeMessage": "Dobro došli u svoju organizaciju, {0}",
    "MyOrganizations_Detail_OrganizationManagement": "<span class=\"gradient-commercial\">Upravljanje</span> organizacijom",
    "OrganizationDisplayName": "Naziv organizacije za prikaz",
    "MyOrganizations_Detail_EditDisplayName": "Uredi ime za prikaz",
    "MyOrganizations_Detail_UpgradeYourLicense": "Nadogradite svoju licencu",
    "MyOrganizations_Detail_LicenseStartAndExpiryDate": "Datum početka licence - Datum isteka",
    "MyOrganizations_Detail_OwnerRightInfo": "Koristite {0} od svojih {1} vlasničkih prava.",
    "MyOrganizations_Detail_CopyApiKey": "Kopirajte ključ",
    "MyOrganizations_Detail_ApiKeyDescription": "API ključ je token PRO paketa hostiranih na <a href=\"{0}\" target=\"_blank\" rel=\"noopener\">{1}.</a>",
    "MyOrganizations_Detail_YourPrivateNugetSource": "Vaš privatni NuGet izvor je <a href=\"{0}\" target=\"_blank\" rel=\"noopener\">{0}</a>",
    "MyOrganizations_Detail_PrivateNugetSourceWarning": "Ovo se automatski dodaje kao feed u vaš NuGet.Config u vašem ABP rješenju. Ne dijelite svoj privatni ključ s neovlaštenim korisnicima!",
    "MyOrganizations_Detail_DeveloperSeatInfo": "Koristite {0} od svojih {1} razvojnih mjesta.",
    "NeedMoreSeatsForYourTeam": "Trebate više mjesta za svoj tim?",
    "MyOrganizations_Detail_PricePerYear": "{0} / godišnje",
    "MyOrganizations_Detail_PurchaseDeveloperSeats": "Kupite mjesta za programere",
    "Invoices": "Fakture",
    "RequestInvoice": "Zatražite fakturu",
    "OrderNumber": "Broj narudžbe",
    "Date": "Datum",
    "Products": "Proizvodi",
    "TotalPrice": "Ukupna cijena",
    "ThereIsNoInvoice": "Nema fakture",
    "MyOrganizations_Detail_PaymentProviderInfo": "Ako ste licencu kupili preko <i>{0}</i> pristupnika, on šalje PDF fakturu na vašu adresu e-pošte, pogledajte <a href=\"{1}\" target=\"_blank\">{0} fakturiranje.</a>",
    "MyOrganizations_Detail_PayUInfo": "Ako ste kupili putem <i>Iyzico</i> gatewaya, kliknite gumb &quot;Zatraži račun&quot; i ispunite podatke za naplatu.",
    "MyOrganizations_Detail_ConclusionInfo": "Vaš zahtjev za fakturu bit će zaključen u roku od {0} radnih dana.",
    "ExtendYourLicense": "Produžite svoju <span class=\"text-primary\">{0}</span> licencu",
    "Continue": "Nastaviti",
    "PurchaseLicense": "Kupite {0} licencu",
    "DownloadInvoiceModal_DownloadInvoice": "Preuzmite fakturu",
    "DownloadInvoiceModal_SaveInformationOnlyOnce": "Podatke o naplati možete spremiti samo jednom.",
    "InvoiceModal_EnterCompanyName": "Unesite službeni naziv tvrtke...",
    "InvoiceModal_EnterCompanyAddress": "Unesite službenu adresu tvrtke...",
    "InvoiceModal_EnterTaxNumber": "Unesite svoj porezni/PDV broj ako je dostupan...",
    "RequestInvoiceModal_EnterNotes": "Unesite dodatnu poruku o fakturi...",
    "PrePayment_PayWithIyzico": "Platit ćeš Iyzicom",
    "ContinueToCheckout": "Nastavi na blagajnu",
    "PrePayment_IyzicoRedirectionInfo": "Bit ćete preusmjereni na Iyzico Payment Gateway kako biste sigurno dovršili svoju kupnju.",
    "PrePayment_IyzicoAcceptVisaAndMasterCard": "Iyzico prihvaća Visa i MasterCard.",
    "Purchase": "Kupiti",
    "AcceptTermsAndConditions": "Pročitao sam, razumijem i prihvaćam <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">politiku privatnosti</a> , <a href=\"{1}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">odredbe i uvjete</a> i <a href=\"{2}\" target=\"_blank\" class=\"text-primary\">EULA.</a>",
    "AcceptTermsAndConditionsWarningMessage": "Prihvatite politiku privatnosti i uvjete korištenja",
    "SelectGatewayToContinue": "Odaberite Gateway za nastavak!",
    "GatewaySelection_SelectGateway": "Odaberite Payment Gateway",
    "GatewaySelection_RedirectionMessage": "Zatim ćete biti preusmjereni na web mjesto odabranog pristupnika plaćanja za transakciju.",
    "PaymentSucceed_PaymentSuccessMessage": "Plaćanje uspješno",
    "PaymentSucceed_ThanksForPurchase": "Hvala vam na kupnji!",
    "PaymentSucceed_CreateYourOrganization": "Stvorite svoju organizaciju",
    "PaymentSucceed_AddMeAsDeveloper": "I ja sam programer, dodajte me kao programera u moju organizaciju.",
    "PaymentSucceed_CreateOrganization": "Stvorite organizaciju",
    "PaymentSucceed_OrganizationDescription": "Organizacija se sastoji od programera i vlasnika. Programeri su korisnici koji pišu kod na ABP projektu i imat će koristi od <a href=\"{0}\" target=\"_blank\">{1}</a> web stranice. Vlasnici su korisnici koji dodjeljuju razvojna mjesta i upravljaju licenciranjem.",
    "PaymentSucceed_ViewOrganization": "Kliknite ovdje za pregled organizacije",
    "Purchase_TotalAnnualPrice": "UKUPNO <small class=\"opacity-50\">(godišnja naknada)</small>",
    "Purchase_TrainingPrice": "Cijena obuke",
    "Purchase_OnboardingTraining": "Uvođenje i razvoj web aplikacija Trening uživo",
    "TotalDeveloperPrice": "Ukupna cijena programera",
    "Purchase_PricePerDeveloper": "<span>{0} {1}</span> po programeru",
    "Purchase_IncludedDeveloperInfo": "{0} {1} uključeno.",
    "Purchase_LicenseExtraDeveloperPurchaseMessage": "<span class=\"fw-bold\">Licenca {0}</span> uključuje {1} programera. Možete dodati dodatne programere.",
    "StartupTemplates_Page_Title": "ABP predlošci za pokretanje",
    "StartupTemplates_Page_Description": "ABP Commercial omogućuje vam izradu rješenja bilo koje razine složenosti. Pruža dva glavna unaprijed izgrađena rješenja za pokretanje. Možete odabrati onaj koji je bliži vašim zahtjevima i na njemu izgraditi vlastito prilagođeno rješenje.",
    "MicroserviceStartupSolutionForDotnet": "Rješenje za pokretanje mikroservisa za .NET",
    "MonolithSolutionForDotnet": "Monolitno (modularno) rješenje za .NET",
    "TrainingDetailsHeaderInfo_TrainingHour": "{0} sati",
    "Trainings_Content": "Sadržaj obuke",
    "Trial_Page_StartYourFreeTrial": "Započnite <span class=\"gradient-commercial\">besplatno probno razdoblje</span>",
    "TrialLicenseFeatures": "Moći ćete imati koristi od svih ABP komercijalnih značajki",
    "TrialPeriodDays": "Imat ćete timsku licencu od {0} dana",
    "TrialForumSupportIncident": "Imat ćete {0} incidenata podrške na forumu",
    "Contact_Page_Title": "Kontaktirajte ABP razvojni tim",
    "Contact_Page_Description": "Obratite se ABP razvojnom timu, ako trebate bilo kakvu pomoć ili podijelite svoja razmišljanja i mišljenja! ABP tim za podršku spreman je pomoći.",
    "Demo_Page_Title": "Izradi demo",
    "Demo_Page_Description": "Izradite besplatnu demo verziju da biste vidjeli primjer aplikacije stvorene korištenjem predloška za pokretanje ABP Commercial. Nemojte se ponavljati zbog uobičajenih zahtjeva za prijavu.",
    "Discounted_Page_Title": "Snižene cijene",
    "Discounted_Page_Description": "Odaberite značajke i funkcionalnost koje vaše poslovanje treba danas. Kupite ABP Commercial licencu i stvarajte neograničene projekte",
    "Faq_Page_Title": "Često postavljana pitanja (FAQ)",
    "Faq_Page_Description": "Imate li kakvih pitanja? Pretražite često postavljana pitanja ili nam postavite pitanje putem obrasca za kontakt.",
    "Faq_Page_SwiftCode": "SWIFT kod",
    "Faq_Page_BankName": "Ime banke",
    "Faq_Page_AccountName": "Korisničko ime",
    "Faq_Page_AccountNumber": "Broj računa",
    "Faq_Page_Currency": "Valuta",
    "Faq_Page_VatNumber": "PDV broj",
    "Faq_Page_OtherCurrenciesInfo": "Za ostale valute pogledajte <a href='{0}'>sve račune</a>",
    "ProjectCreatedSuccess_Page_Title": "Vaš projekt stvoren",
    "ProjectCreatedSuccess_Page_Description": "Vaš ABP projekt uspješno je kreiran!",
    "Suite_Page_Title": "ABP Suite",
    "Suite_Page_Description": "ABP Commercial pruža alate za brzi razvoj aplikacija za povećanje produktivnosti programera. ABP Suite vam omogućuje jednostavno stvaranje CRUD stranica.",
    "Themes_Page_Title": "ABP teme",
    "Themes_Page_Description": "ABP Commercial nudi više profesionalnih, modernih tema korisničkog sučelja. Izradite besplatnu demo verziju kako biste brzo vidjeli kako korisničko sučelje izgleda.",
    "Tools_Page_Title": "Alati za brzi razvoj aplikacija",
    "Tools_Page_Description": "ABP Commercial pruža alate za brzi razvoj aplikacija za povećanje produktivnosti programera. ABP Suite vam omogućuje jednostavno stvaranje CRUD stranica.",
    "DeveloperPrice": "Cijena programera",
    "AdditionalDeveloperPaymentInfoSection_AdditionalDevelopers": "{0} <small>programeri</small>",
    "LicenseRemainingDays": "za <span class=\"text-white\">{0}</span> dana",
    "ExtendPaymentInfoSection_Description": "Produljenjem/obnavljanjem licence i dalje ćete dobivati <a href=\"{0}\" target=\"_blank\">premium podršku</a> . Također ćete moći dobiti veća ili manja ažuriranja za module i teme. Moći ćete nastaviti stvarati nove projekte. I dalje ćete moći koristiti <a href=\"{1}\" target=\"_blank\">ABP Suite</a> koji ubrzava vaš razvoj.",
    "LicenseRenewalPrice": "Cijena obnove licence",
    "LicensePrice": "Cijena licence",
    "TrialLicensePaymentInfoSection_Description": "<strong>Kupnja licence:</strong> Kupnjom licence i dalje ćete dobivati <a href=\"{0}\" target=\"_blank\" rel=\"noopener\">premium podršku</a> . Također ćete moći dobiti veća ili manja ažuriranja za module i teme. Moći ćete nastaviti stvarati nove projekte. I dalje ćete moći koristiti <a href=\"{1}\" target=\"_blank\" rel=\"noopener\">ABP Suite</a> koji ubrzava vaš razvoj.<br> Pogledajte <a href=\"{2}\" target=\"_blank\" rel=\"noopener\">tablicu za usporedbu licenci</a> kako biste provjerili razlike između vrsta licenci.",
    "SelectTargetLicense": "Odaberite Ciljna licenca",
    "UpgradePaymentInfoSection_ExtendMyLicenseForOneYear": "Da, produži mi datum isteka licence za 1 godinu.",
    "UpgradePaymentInfoSection_WantToExtendLicense": "Želite li produžiti licencu za još 1 godinu?",
    "UpgradePaymentInfoSection_UpgradingWillNotExtendLicense": "Nadogradnja neće produljiti datum isteka licence!",
    "UpgradePaymentInfoSection_LicenseUpgradeDescription": "Nadogradnjom licence bit ćete promaknuti u višu vrstu licence, što će vam omogućiti dodatne pogodnosti. Pogledajte <a href=\"/Pricing\" target=\"_blank\">tablicu za usporedbu licenci</a> kako biste provjerili razlike između vrsta licenci.",
    "Landing_Page_CustomerStories": "Priče kupaca",
    "Landing_Page_OurGreatCustomers": "Naši veliki kupci",
    "Landing_Page_WebApplicationFramework": "Okvir web aplikacije",
    "Landing_Page_WebDevelopmentPlatform": "Platforma za web razvoj",
    "Landing_Page_CompleteWebDevelopmentPlatform": "Potpuna platforma za web razvoj",
    "Landing_Page_TryFreeDemo": "Isprobajte besplatni demo",
    "Landing_Page_StartingPointForWebApplications": "Polazna točka za web aplikacije temeljene na ASP.NET Core! Temelji se na ABP okviru za najbolji web razvoj.",
    "Landing_Page_AbpProvidesSoftwareInfrastructure": "ABP Framework pruža softversku infrastrukturu za razvoj izvrsnih web aplikacija s najboljom praksom.",
    "Landing_Page_MicroserviceCompatibleArchitecture": "Arhitektura kompatibilna s mikroservisom",
    "Landing_Page_PreBuiltApplicationModulesAndThemes": "Unaprijed izgrađeni aplikacijski moduli i teme",
    "Landing_Page_MultiTenantArchitecture": "Arhitektura s više stanara",
    "Landing_Page_MultiTenancyDescription": "SaaS aplikacije su postale jednostavne! Integrirano višenamjensko korištenje od baze podataka do korisničkog sučelja.",
    "Landing_Page_DDDIntroduction": "Dizajniran i razvijen na temelju DDD obrazaca i načela. Pruža slojeviti model za vašu aplikaciju.",
    "Landing_Page_CrossCuttingConcernsInfo": "Kompletna infrastruktura za autorizaciju, provjeru valjanosti, rukovanje iznimkama, predmemoriju, revizijsko bilježenje, upravljanje transakcijama i više.",
    "Landing_Page_PreBuiltApplicationModules": "Unaprijed izgrađeni aplikacijski moduli koji uključuju najčešće zahtjeve za web aplikacije.",
    "Landing_Page_ChatModule": "razgovor",
    "Landing_Page_DocsModule": "dokumenti",
    "Landing_Page_FileManagementModule": "Upravljanje datotekama",
    "Landing_Page_CustomerStory_1": "ABP Commercial dopustio je SC Ventures da u 9 mjeseci isporuči SaaS platformu silo-baze podataka bankovne razine za više zakupaca za podršku financiranju opskrbnog lanca potraživanja / obveza po računima značajnih faktura s više integriranih sidara. Modularnost ABP-a omogućila je timu isporuku u rekordnom vremenu, prolazak svih VAPT-a i implementaciju kontejnerskog skupa mikroservisa putem punog CI/CD-a i cjevovoda u proizvodnju.",
    "Landing_Page_CustomerStory_2": "Vidimo vrijednost korištenja ABP Commerciala za smanjenje režijskih troškova prilagođenih razvojnih projekata. Tim može objediniti uzorak koda u različitim tokovima projekta. Vidimo više potencijala u okviru za izgradnju novih značajki brže nego prije. Vjerujemo da ćemo stalno uviđati vrijednost iskorištavanja ABP Commerciala.",
    "Landing_Page_CustomerStory_3": "Volimo ABP. Ne moramo sve pisati ispočetka. Počinjemo od značajki izvan okvira i fokusiramo se samo na ono što stvarno trebamo napisati. Također, ABP je dobro projektiran i kod je visoke kvalitete s manje grešaka. Kad bismo morali sami napisati sve što nam treba, možda bismo morali potrošiti godine. Još jedna stvar koja nam se sviđa je da nova verzija, ili popravak problema, ili poboljšanje izlazi vrlo brzo \n svaki drugi tjedan. Ne čekamo predugo.",
    "Landing_Page_CustomerStory_4": "ABP Commercial je fantastičan proizvod koji bih preporučio. Komercijalni proizvodi za tržište za naše kupce na jednoj platformi koja se može konfigurirati. Skok počinje da okvir i alati pružaju bilo koji tim vrijedan svakog centa. ABP Commercial najbolje je odgovarao našim potrebama.",
    "Landing_Page_AdditionalServices": "Prilagođena ili količinska licenca, uvođenje, obuka i podrška uživo, prilagođeni razvoj projekata, prijenos postojećih projekata i više...",
    "Landing_Page_IncludedDeveloperLicenses": "Uključeno <strong>{0}</strong> licenci razvojnog programera",
    "Landing_Page_SeeOnDemo": "Pogledajte na Demo",
    "Landing_Page_LeptonThemes": "LeptonTeme",
    "Landing_Page_AccountModuleDescription_1": "Ovaj modul implementira sustav provjere autentičnosti za aplikaciju;",
    "Landing_Page_AccountModuleDescription_2": "Pruža stranicu <strong>za prijavu</strong> s korisničkim imenom i lozinkom",
    "Landing_Page_AccountModuleDescription_3": "Omogućuje stranicu <strong>za registraciju</strong> za stvaranje novog računa.",
    "Landing_Page_AccountModuleDescription_4": "Omogućuje stranicu <strong>sa zaboravljenom lozinkom</strong> za slanje veze <strong>za ponovno postavljanje lozinke</strong> kao e-mail.",
    "Landing_Page_AccountModuleDescription_5": "Omogućuje funkciju <strong>potvrde e-pošte</strong> s korisničkim sučeljem.",
    "Landing_Page_AccountModuleDescription_6": "Implementira <strong>dvostruku</strong> autentifikaciju (SMS i e-mail).",
    "Landing_Page_AccountModuleDescription_7": "Implementira <strong>zaključavanje korisnika</strong> (zaključava račun na postavljeno vrijeme kada se dogodi određeni broj neuspjelih prijava zbog nevažećih vjerodajnica unutar određenog vremenskog intervala).",
    "Landing_Page_AccountModuleDescription_8": "Implementira korisničko sučelje i funkcionalnost poslužitelja za autentifikaciju <strong>poslužitelja identiteta</strong> .",
    "Landing_Page_AccountModuleDescription_9": "Omogućuje <strong>prebacivanje između stanara</strong> u okruženju s više stanara.",
    "Landing_Page_AccountModuleDescription_10": "Omogućuje promjenu <strong>jezika korisničkog sučelja</strong> aplikacije.",
    "Landing_Page_AuditLoggingModuleDescription_1": "Ovaj modul pruža korisničko sučelje za izvješćivanje dnevnika revizije za infrastrukturu revizije. Omogućuje pretraživanje, filtriranje i prikaz unosa revizijskog dnevnika i dnevnika promjena entiteta.",
    "Landing_Page_AuditLoggingModuleDescription_2": "Unos u dnevnik revizije sastoji se od kritičnih podataka o svakom zahtjevu klijenta:",
    "Landing_Page_AuditLoggingModuleDescription_3": "URL, preglednik, IP adresa, ime klijenta",
    "Landing_Page_AuditLoggingModuleDescription_4": "Korisnik",
    "Landing_Page_AuditLoggingModuleDescription_5": "HTTP metoda, HTTP povratni statusni kod",
    "Landing_Page_AuditLoggingModuleDescription_6": "Uspjeh/neuspjeh, pojedinosti o iznimci ako su dostupne",
    "Landing_Page_AuditLoggingModuleDescription_7": "Trajanje izvršenja zahtjeva",
    "Landing_Page_AuditLoggingModuleDescription_8": "Entiteti su stvoreni, izbrisani ili ažurirani u ovom zahtjevu (s promijenjenim svojstvima).",
    "Landing_Page_BloggingModuleDescription_1": "Ovaj modul dodaje jednostavan blog vašoj ABP aplikaciji;",
    "Landing_Page_BloggingModuleDescription_2": "Omogućuje stvaranje više blogova u jednoj aplikaciji.",
    "Landing_Page_BloggingModuleDescription_3": "Podržava Markdown format.",
    "Landing_Page_BloggingModuleDescription_4": "Omogućuje pisanje komentara za post.",
    "Landing_Page_BloggingModuleDescription_5": "Omogućuje dodjeljivanje oznaka postovima na blogu.",
    "Landing_Page_BloggingModuleDescription_6": "Pogledajte web stranicu <a href=\"blog.abp.io\">blog.abp.io</a> kao živi primjer blogging modula.",
    "Landing_Page_ChatModuleDescription_1": "Ovaj modul se koristi za razmjenu poruka u stvarnom vremenu između korisnika u aplikaciji.",
    "Landing_Page_ChatModuleDescription_2": "Razmjena poruka u stvarnom vremenu na stranici za razgovor.",
    "Landing_Page_ChatModuleDescription_3": "Pretražite korisnike u aplikaciji za nove razgovore.",
    "Landing_Page_ChatModuleDescription_4": "Popis kontakata za nedavne razgovore.",
    "Landing_Page_ChatModuleDescription_5": "Obavijesti o novim porukama kada korisnik gleda drugu stranicu.",
    "Landing_Page_ChatModuleDescription_6": "Oznaka ukupnog broja nepročitanih poruka na ikoni izbornika.",
    "Landing_Page_ChatModuleDescription_7": "Broj nepročitanih poruka za svaki razgovor.",
    "Landing_Page_ChatModuleDescription_8": "Lijeno učitani razgovori.",
    "Landing_Page_DocsModuleDescription_1": "Ovaj modul se koristi za izradu web stranica s tehničkom dokumentacijom;",
    "Landing_Page_DocsModuleDescription_2": "Ugrađena <strong>GitHub integracija</strong> : Izravno pišite i upravljajte dokumentima na GitHubu.",
    "Landing_Page_DocsModuleDescription_3": "Podrška <strong>za određivanje verzija</strong> izravno integrirana u GitHub izdanja.",
    "Landing_Page_DocsModuleDescription_4": "Podržava <strong>više jezika</strong> (s rezervnom podrškom za zadani jezik).",
    "Landing_Page_DocsModuleDescription_5": "Podržava <strong>Markdown</strong> i HTML formate.",
    "Landing_Page_DocsModuleDescription_6": "Pruža odjeljak <strong>za navigaciju</strong> i <strong>pregled</strong> .",
    "Landing_Page_DocsModuleDescription_7": "Omogućuje smještaj <strong>više projektne</strong> dokumentacije u jednoj aplikaciji.",
    "Landing_Page_DocsModuleDescription_8": "Veze na datoteku na GitHubu, tako da svatko može lako pridonijeti klikom na <strong>vezu Uredi</strong> .",
    "Landing_Page_DocsModuleDescription_9": "Osim izvora GitHub, omogućuje jednostavno korištenje mape kao izvora dokumentacije.",
    "Landing_Page_FileManagementModuleDescription_1": "Prijenos, preuzimanje i organiziranje datoteka u hijerarhijsku strukturu mapa.",
    "Landing_Page_FileManagementModuleDescription_2": "Ovaj se modul koristi za učitavanje, preuzimanje i organiziranje datoteka u hijerarhijskoj strukturi mapa. Također je kompatibilan s višestrukim zakupom i možete odrediti ograničenje ukupne veličine za svoje stanare.",
    "Landing_Page_FileManagementModuleDescription_3": "Ovaj se modul temelji na <a href=\"https://abp.io/docs/latest/framework/infrastructure/blob-storing\">BLOB sustavu pohrane</a> , tako da može koristiti različite pružatelje pohrane za pohranjivanje sadržaja datoteke.",
    "Landing_Page_IdentityModuleDescription_1": "Ovaj modul implementira sustav korisnika i uloga aplikacije;",
    "Landing_Page_IdentityModuleDescription_2": "Izgrađen na <a href=\"https://docs.microsoft.com/en-us/aspnet/core/security/authentication/identity\">Microsoftovoj biblioteci ASP.NET Core Identity</a> .",
    "Landing_Page_IdentityModuleDescription_3": "Upravljanje <strong>ulogama</strong> i <strong>korisnicima</strong> u sustavu. Korisnik može imati <strong>više uloga</strong> .",
    "Landing_Page_IdentityModuleDescription_4": "Postavite <strong>dopuštenja</strong> na razini uloga i korisnika.",
    "Landing_Page_IdentityModuleDescription_5": "Omogućite/onemogućite <strong>dvofaktornu provjeru autentičnosti</strong> i <strong>zaključavanje</strong> korisnika po korisniku.",
    "Landing_Page_IdentityModuleDescription_6": "Upravljanje osnovnim <strong>korisničkim profilom</strong> i <strong>lozinkom</strong> .",
    "Landing_Page_IdentityModuleDescription_7": "Upravljajte <strong>vrstama zahtjeva</strong> u sustavu, postavite zahtjeve za uloge i korisnike.",
    "Landing_Page_IdentityModuleDescription_8": "Stranica za postavljanje za upravljanje <strong>složenošću lozinke</strong> , prijavom korisnika, računom i zaključavanjem.",
    "Landing_Page_IdentityModuleDescription_9": "Podržava <strong>LDAP</strong> autentifikaciju.",
    "Landing_Page_IdentityModuleDescription_10": "Omogućuje potvrdu <strong>e-pošte i telefonskog broja</strong> .",
    "Landing_Page_IdentityModuleDescription_11": "Podržava društvene integracije za prijavu (Twitter, Facebook, GitHub itd...).",
    "Landing_Page_IdentityModuleDescription_12": "Upravljanje <strong>organizacijskim jedinicama</strong> u sustavu.",
    "Landing_Page_PaymentModuleDescription_1": "Omogućuje integraciju za različite pristupnike plaćanja.",
    "Landing_Page_PaymentModuleDescription_2": "Ovaj modul pruža integraciju za pristupnike plaćanja, tako da možete jednostavno dobiti plaćanje od svojih kupaca.",
    "Landing_Page_PaymentModuleDescription_3": "Ovaj modul podržava sljedeće pristupnike plaćanja",
    "Welcome_Page_UseSameCredentialForCommercialWebsites": "Koristite iste vjerodajnice za <a href=\"https://abp.io\" class=\"text-primary\">commercial.abp.io</a> i <a href=\"https://abp.io/support/questions\" class=\"text-primary\">support.abp.io</a> .",
    "WatchCrudPagesVideo": "Pogledajte video &quot;Izrada CRUD stranica s ABP Suiteom&quot;!",
    "WatchGeneratingFromDatabaseVideo": "Pogledajte video &quot;ABP Suite: Generiranje CRUD stranica iz postojećih tablica baze podataka&quot;!",
    "WatchTakeCloserLookVideo": "Pogledajte video &quot;Pobliže pogledajte generiranje koda: ABP Suite&quot;!",
    "ConfirmedEmailAddressRequiredToStartTrial": "Trebali biste imati potvrđenu adresu e-pošte kako biste započeli probnu licencu.",
    "EmailVerificationMailNotSent": "Pošta za potvrdu e-pošte nije mogla biti poslana.",
    "GetConfirmationEmail": "<a href=\"javascript:void(0);\" id=\"{0}\" class=\"text-decoration-underline\">Kliknite ovdje da biste dobili e-poruku za potvrdu</a> ako je prije niste dobili.",
    "WhichLicenseTypeYouAreInterestedIn": "Koja vrsta licence vas zanima?",
    "DontTakeOurWordForIt": "Nemojte nam vjerovati na riječ...",
    "ReadAbpCommercialUsersWantYouToKnow": "Pročitajte što korisnici ABP Commerciala žele da znate",
    "Testimonial_ShortDescription_1": "Modularnost ABP-a omogućila je timu da isporuči na vrijeme.",
    "Testimonial_ShortDescription_2": "Izgradite nove značajke brže nego prije.",
    "Testimonial_ShortDescription_3": "Počinjemo od značajki izvan okvira i fokusiramo se samo na ono što stvarno trebamo napisati.",
    "Testimonial_ShortDescription_4": "ABP Commercial najbolje je odgovarao našim potrebama.",
    "OnlineReviewersOnAbpCommercial": "Mrežne recenzije na ABP Commercial",
    "SeeWhatToldAboutAbpCommercial": "Pogledajte što je rečeno o ABP Commercialu i napišite svoje mišljenje ako želite.",
    "BlazoriseLicense": "Moramo li kupiti Blazorise licencu?",
    "BlazoriseLicenseExplanation": "Imamo ugovor između Volosofta i Megabita, uz ovaj ugovor Blazorise licenca je u paketu s ABP Commercial proizvodima, stoga naši korisnici ne moraju kupiti dodatnu Blazorise licencu.",
    "ExtendPaymentInfoSection_DeveloperPrice": "{0}x dodatni programer(i)",
    "ExtendPaymentInfoSection_DiscountRate": "Popust {0}%",
    "TotalNetPrice": "Ukupna neto cijena",
    "EFCore": "Entity Framework Core",
    "All": "svi",
    "Mvc": "MVC",
    "DataBaseProvider": "Pružatelj podataka",
    "UIFramework": "UI okvir",
    "LeptonXThemeForDashboard": "LeptonX tema za vašu nadzornu ploču administratora autora",
    "AbpPlatform": "ABP platforma",
    "YouDeserveGoodUXUI": "Zaslužujete dobro korisničko sučelje i bolji UX. Tema LeptonX od ABP-a je tu da joj posluži.",
    "ViewLiveDemo": "Pogledajte demonstraciju teme uživo",
    "GetLeptonX": "Nabavite LeptonX odmah",
    "SeeLeptonXDocumentation": "Vidi LeptonX dokumentaciju",
    "SeeLeptonDocumentation": "Vidi Lepton dokumentaciju",
    "SimplifiedMenu": "Pojednostavljeni izbornik",
    "SimplifiedMenuDescription": "Stranicu koju tražite možete lako pronaći filtriranjem izbornika",
    "YourFavoritePages": "Vaše omiljene stranice na dohvat ruke",
    "YourFavoritePagesDescription": "Jednostavno dodajte ili uklonite stranicu iz favorita klikom na ikonu zvjezdice u gornjem desnom kutu stranice.",
    "BreadCrumbs": "Breadcrumb za besprijekorno prebacivanje",
    "BreadCrumbsDescription": "Koristeći Breadcrumb, možete jednim klikom prelaziti na stranice na istoj razini, čak i kada je lijevi izbornik zatvoren, a radi i na tabletu i mobitelu responsive!",
    "YourMenu": "Vaš jelovnik po želji",
    "YourMenuDescription": "Prilagodite ikone na koje se može izravno kliknuti i padajuće okvire na korisničkom izborniku kako želite. Korisnički izbornik u potpunosti je prilagodljiv vašim potrebama",
    "RtlSupport": "RTL podrška za vaš jezik",
    "RtlSupportDescription": "Tema LeptonX podržava RTL za vaš jezik. Opcije jezika nalaze se u izborniku postavki za promjenu jezika.",
    "YourColors": "Vaše boje na korisničkom sučelju nadzorne ploče administratora",
    "YourColorsDescription": "Tema LeptonX radi u skladu s postavkama vašeg sustava i ima opcije svijetle teme nadzorne ploče, tamne teme nadzorne ploče i opcije polutamne teme nadzorne ploče.",
    "ArrangeContentWidth": "Lako uredite širinu sadržaja",
    "ArrangeContentWidthDescription": "Lako promijenite širinu područja sadržaja.",
    "LeptonXCompatibleWith": "Tema LeptonX kompatibilna je s",
    "MobileResponsiveTemplate": "Mobilni responzivni predložak",
    "MobileResponsiveTemplateDescription1": "Pristupite svojoj LeptonX administratorskoj nadzornoj ploči s bilo kojeg uređaja koji želite.",
    "MobileResponsiveTemplateDescription2": "Osmišljen je za jednostavno korištenje u svakom vašem uređaju. Responzivan je na mobilnim uređajima i veličinama tableta.",
    "TopMenuLayoutOption": "Opcija izgleda gornjeg izbornika",
    "TopMenuLayoutOptionDescription1": "Ako želite postaviti svoju web stranicu s istom administratorskom nadzornom pločom, moguće je to učiniti s temom LeptonX!",
    "TopMenuLayoutOptionDescription2": "Samo isprobajte LeptonX izgled gornjeg izbornika kako biste to ostvarili!",
    "EasilyCustomizable": "Lako prilagodljiv za boje vaše marke",
    "EasilyCustomizableDescription1": "LeptonX temu možete prilagoditi koristeći samo nekoliko SCSS varijabli. Nema nadjačavanja, nema dodatnog učitavanja CSS-a!",
    "EasilyCustomizableDescription2": "S LeptonXom možete urediti svoju nadzornu ploču administratora kako god želite.",
    "IndependentLayout": "Samostalni izgled i prostor za sadržaj",
    "IndependentLayoutDescription1": "LeptonX-ova infrastruktura izgleda dizajnirana je potpuno odvojeno od sadržaja.",
    "IndependentLayoutDescription2": "To znači da možete slobodno dizajnirati svoj projekt sa strukturom sadržaja koja nije Bootstrap ako želite.",
    "MostUsedLibraries": "Najčešće korištene biblioteke integrirane s LeptonX",
    "MostUsedLibrariesDescription1": "LeptonX sadrži vaše najčešće korištene biblioteke. Omogućuje vam korištenje biblioteka kao što su ApexCharts, DataTables, DropZone, FullCalender, JSTree, Select2 i Toastr bez napora.",
    "MostUsedLibrariesDescription2": "LeptonX također podržava MVC Angular i Blazor specifične biblioteke.",
    "CreateAndCustomize": "Izradite i prilagodite stranice koje trebate u nekoliko sekundi s prilagođenim stranicama LeptonX",
    "CreateAndCustomizeDescription": "Korištenjem LeptonX teme također imate pristup mnogim unaprijed napravljenim HTML stranicama. To uključuje mnoge stranice kao što su stranica za prijavu, blog, FAQ, popis pretplata, fakture, cijene i upravljanje datotekama.",
    "LeptonThemeForAdmin": "Lepton Tema za vašu administratorsku nadzornu ploču od",
    "LeptonThemeForAdminDescription": "Tema Lepton je još uvijek dostupna i održavat će se. Ako se želite prebaciti na temu LeptonX kao korisnik teme Lepton, možete pogledati dokumentaciju da biste saznali kako.",
    "LeptonCompatibleWith": "Tema Lepton je kompatibilna sa",
    "BlackFridayDiscount": "Crni petak popust",
    "UpgradePaymentInfoSection_DeveloperPrice": "{0} za {1} dodatnih programera(a)",
    "Upgrade": "Nadogradnja",
    "Renewal": "Obnova",
    "UpgradePaymentInfoSection_LicensePrice": "{0} licenca",
    "UpgradePaymentInfoSection_LicenseRenewalPrice": "Obnova licence",
    "Total": "Ukupno",
    "SupportPolicyFaqTitle": "Kakva je vaša politika podrške?",
    "SupportPolicyFaqExplanation": "Podržavamo samo aktivnu i prethodnu glavnu verziju. Ne jamčimo izdavanje zakrpe za 3. i starije glavne verzije. Na primjer, ako je aktivna verzija 7.0.0, objavit ćemo izdanja zakrpa i za 6.xx i za 7.xx. Osim toga, pružamo podršku samo za ABP Framework i ABP Commercial pitanja. To znači da se ne daje podrška za aplikacije trećih strana, usluge u oblaku i druge periferne biblioteke koje koriste ABP proizvodi. Uložit ćemo komercijalno razumne napore da svojim klijentima pružimo tehničku podršku tijekom službenog radnog vremena &quot;Volosoft Bilisim AS&quot;. S druge strane, ne obvezujemo se na vrijeme odgovora ugovora o razini usluge (SLA), ali ćemo pokušati odgovoriti na tehničke probleme što je brže moguće unutar našeg službenog radnog vremena. Osim ako nije sklopljen poseban ugovor s korisnikom, podršku pružamo samo na https://abp.io/support/questions. Imamo i privatnu podršku e-poštom, koja je dostupna samo nositeljima Enterprise License.",
    "TotalDevelopers": "Ukupno {0} programera(a)",
    "CustomPurchaseExplanation": "Prilagođeno vašim specifičnim potrebama",
    "WhereDidYouHearAboutUs": "Gdje ste čuli za nas?",
    "Twitter": "Cvrkut",
    "Facebook": "Facebook",
    "Youtube": "YouTube",
    "Google": "Google",
    "Github": "GitHub",
    "Friend": "Od prijatelja",
    "Other": "ostalo",
    "WhereDidYouHearAboutUs_explain": "Navedite...",
    "DeletingMemberWarningMessage": "&quot;{0}&quot; će biti uklonjen s popisa programera. Ako želite, kasnije možete dodijeliti ovo prazno mjesto drugom programeru.",
    "AdditionalInfo": "Ako su mjesta za programere iznad vaših zahtjeva, možete ih smanjiti. Možete poslati e-poruku na <a href=\"mailto:info@abp.io\">info@abp.io</a> kako biste uklonili neka od svojih razvojnih mjesta. Brisanje neiskorištenih razvojnih mjesta smanjit će troškove obnove licence. Ako želite, možete ponovno kupiti dodatna razvojna mjesta unutar razdoblja svoje aktivne licence. Imajte na umu da, budući da u ovom licencnom paketu ima {0} programera, ne možete smanjiti ovaj broj.",
    "LinkExpiredErrorMessage": "Veza kojoj pokušavate pristupiti je istekla.",
    "ExpirationDate": "Datum isteka roka trajanja",
    "SpringCampaignDiscount": "Proljetni akcijski popust",
    "WhyUseAbpIoPlatform": "Zašto bih trebao koristiti ABP.IO platformu umjesto stvaranja novog rješenja od nule?",
    "WhyUseAbpIoPlatformFaqExplanation": "Pogledajte <a href=\"/why-abp-io \">tu stranicu</a> za detaljno objašnjenje zašto korištenje ABP.IO Platforme ima značajnu prednost u odnosu na to da sve radite sami.",
    "EulaPageTitle": "Licencni ugovor s krajnjim korisnikom (EULA)",
    "PrivacyPolicyPageTitle": "Politika privatnosti - Politika kolačića",
    "TermsConditionsPageTitle": "Odredbe i uvjeti",
    "TrainingsPageTitle": "ABP paketi obuke",
    "ModulesPageTitle": "ABP unaprijed izgrađeni aplikacijski moduli",
    "Volo.AbpIo.Commercial:040001": "API pristupni ključ je pogrešan.",
    "GetLepton": "Nabavite Lepton odmah",
    "MyOrganizations_Detail_LicenseStartDate": "Datum početka licence",
    "MyOrganizations_Detail_LicenseExpiryDate": "Datum isteka",
    "BlazoriseSupport": "Kako mogu dobiti Blazorise licencni ključ i podršku od Blazorise tima?",
    "BlazoriseSupportExplanation": "Slijedite korake u nastavku kako biste dobili podršku Blazorise tima i dobili svoj Blazorise licencni ključ:",
    "BlazoriseSupportExplanation1": "Prijavite se za novi račun na <a href=\"https://blazorise.com/support/register\">blazorise.com/support/register</a> s istom adresom e-pošte kao i vaš abp.io račun. Ostavite unos &quot;Ključ licence&quot; prazan. <strong>Mora biti ista adresa e-pošte kao i vaš račun e-pošte na abp.io.</strong>",
    "BlazoriseSupportExplanation2": "Potvrdite svoju adresu e-pošte označavanjem pretinca za e-poštu. Provjerite pretinac neželjene pošte ako ne vidite e-poštu u pristigloj pošti!",
    "BlazoriseSupportExplanation3": "Prijavite se na web mjesto za podršku Blazorise na <a href=\"https://blazorise.com/support/login\">blazorise.com/support/login</a> .",
    "BlazoriseSupportExplanation4": "Ako imate aktivnu ABP Commercial licencu, imat ćete i Blazorise PRO licencu. Svoj licencni ključ za Blazorise možete dobiti na <a href=\"https://blazorise.com/support/user/manage/license\">blazorise.com/support/user/manage/license</a> .",
    "BlazoriseSupportExplanation5": "Možete objaviti svoja pitanja na web stranici podrške i generirati token proizvoda za svoju aplikaciju.",
    "AbpLiveTrainingPackages": "ABP paketi obuke uživo",
    "Releases": "Izdanja",
    "ReleasesDescription": "Dnevnici izdanja ABP Commerciala.",
    "ReleaseDate": "Datum izlaska",
    "Labels": "Etikete",
    "PreRelease": "Prije izdanja",
    "AllTypes": "Svi tipovi",
    "Enhancement": "Poboljšanje",
    "Bug": "Bug",
    "Feature": "Značajka",
    "AllUIs": "Sva sučelja",
    "MVC": "MVC",
    "BlazorServer": "Blazor poslužitelj",
    "MAUI": "MAUI",
    "HowItWorks_Page_Title": "Kako radi?",
    "HowItWorks_Page_Description": "ABP Framework proširuje .NET platformu. Dakle, sve što možete učiniti s običnim .NET rješenjem već je moguće s ABP Frameworkom. To olakšava početak s niskom krivuljom učenja.",
    "HowItWorks_Description1": "ABP Framework proširuje .NET platformu. Dakle, sve što možete učiniti s običnim .NET rješenjem već je moguće s ABP Frameworkom. To olakšava početak s niskom krivuljom učenja.",
    "HowItWorks_Description2": "Jednom kada počnete učiti i koristiti značajke ABP Frameworka, razvijanje vašeg softvera bit će puno ugodnije nego ikad.",
    "HowItWorks_Description3": "Ova stranica u osnovi objašnjava kako koristite ABP.IO platformu kao .NET programer.",
    "CreateANewSolution": "Stvorite novo .NET rješenje",
    "CreateANewSolution_Description1": "Sve počinje stvaranjem novog ABP integriranog .NET rješenja.",
    "StartWithStartupTemplates": "Pokrenite jedan od unaprijed izrađenih <a href=\"/startup-templates\">predložaka rješenja za pokretanje</a>",
    "SimpleMonolithApplicationTemplate": "Jednostavan predložak monolitne aplikacije",
    "LayeredApplicationTemplate": "Slojeviti predložak aplikacije",
    "MicroserviceSolutionTemplate": "Predložak rješenja mikroservisa",
    "CreateEmptySolutionAndUseAbp": "Ili izradite novo prazno .NET rješenje i sami instalirajte ABP NuGet &amp; NPM <a href=\"https://abp.io/packages\" target=\"_blank\">pakete</a> .",
    "CreatingSolutionWithMultipleOptions": "Prilikom izrade novog rješenja postoji više opcija korisničkog sučelja i baze podataka.",
    "UIFrameworkOptions": "Opcije okvira korisničkog sučelja",
    "DotnetSolutionWithoutDependency": "Sada imate uobičajeno .NET rješenje na vašem lokalnom računalu koje ne ovisi o platformi u oblaku ili vanjskoj usluzi.",
    "CheckTheDocumentForDetails": "Pojedinosti možete pronaći u dokumentu <a href=\"{0}\" target=\"_blank\">{1}</a> .",
    "UIAndDatabaseIndependent": "ABP može raditi s bilo kojim korisničkim sučeljem i bilo kojim pružateljem baze podataka koje podržava .NET. \n Međutim, ovi pružatelji korisničkog sučelja i baze podataka unaprijed su integrirani i dobro dokumentirani.",
    "InstallAbpModules": "Instalirajte ABP module",
    "DevelopYourSolution": "Razvijte svoje rješenje",
    "DeployAnywhere": "Postavite bilo gdje",
    "InstallAbpModule_Description1": "ABP je modularni okvir za razvoj aplikacija. Predlošci rješenja za pokretanje već dolaze s instaliranim osnovnim modulima. \n Ali postoji više aplikacijskih modula koje biste mogli upotrijebiti u svom rješenju.",
    "InstallAbpModule_Description2": "Svaki modul sastoji se od nekoliko NuGet i NPM paketa i ima instalacijski dokument. <a href=\"/tools/suite\">ABP Suite</a> većinu posla obavlja automatski, a zatim ručno konfigurirate ili fino podešavate modul na temelju njegove dokumentacije.",
    "DevelopYourSolution_Description1": "ABP-ova infrastruktura tjera vas <b class=\"text-white\">da se usredotočite na vlastiti poslovni kod</b> automatizirajući rad koji se ponavlja i pruža unaprijed izgrađenu infrastrukturu i <a href=\"https://abp.io/features\" target=\"_blank\">značajke</a> aplikacije.",
    "DevelopYourSolution_Description2": "U sljedećem bloku koda možete vidjeti kako se ABP Framework neprimjetno integrira u vaš kod i automatizira zadatke koji se ponavljaju umjesto vas.",
    "DevelopYourSolution_Description3": "Čak iu ovom bloku kratkog koda, ABP radi puno stvari za vas.",
    "DevelopYourSolution_Description4": "Omogućuje osnovne klase za primjenu konvencija, poput \n <a href=\"https://abp.io/docs/latest/framework/fundamentals/dependency-injection\" target=\"_blank\">ubrizgavanja ovisnosti</a> . Generičke usluge <a href=\"https://abp.io/docs/latest/framework/architecture/domain-driven-design/repositories\" target=\"_blank\">repozitorija</a> \n pružaju prikladan \n način interakcije s bazom podataka. Deklarativna <a href=\"https://abp.io/docs/latest/framework/fundamentals/authorization\" target=\"_blank\">autorizacija</a> \n radi s fino podešenim sustavom dozvola.",
    "DevelopYourSolution_Description5": "ABP potpuno automatizira <a href=\"https://abp.io/docs/latest/framework/architecture/domain-driven-design/unit-of-work\" target=\"_blank\">radnu jedinicu</a> \n (za povezivanje s bazom podataka i upravljanje transakcijama), <a href=\"https://abp.io/docs/latest/framework/fundamentals/exception-handling\" target=\"_blank\">rukovanje iznimkama</a> \n , <a href=\"https://abp.io/docs/latest/framework/fundamentals/validation\" target=\"_blank\">provjeru valjanosti</a> \n \n i <a href=\"https://abp.io/docs/latest/framework/infrastructure/audit-logging\" target=\"_blank\">revizijsko bilježenje</a> . Omogućuje mnogo više sastavnih dijelova za pojednostavljenje vaših svakodnevnih razvojnih zadataka i fokusiranje na vlastiti kod dok stvarate \n aplikacije spremne za proizvodnju.",
    "DevelopYourSolution_Description6": "Možete zamisliti koliko taj blok koda može biti dug i kompliciran kada biste sve to radili ručno.",
    "SuiteCrudGenerationInFewSeconds": "Osim ručnog kodiranja vašeg rješenja, možete izraditi potpuno radne napredne CRUD stranice u nekoliko minuta pomoću alata ABP Suite. Generira kod u vašem rješenju, tako da ga možete fino prilagoditi na temelju svojih prilagođenih zahtjeva.",
    "DeployAnywhere_Description1": "Na kraju dana, imate čisto .NET rješenje. Svoje rješenje možete implementirati na vlastiti poslužitelj, na platformu u oblaku, na Kubernetes ili gdje god želite. Možete implementirati na onoliko poslužitelja koliko želite. ABP je agnostički alat za razvojnu okolinu.",
    "ExpertiseAbpFramework": "Proučite ABP okvir",
    "ExpertiseAbpFramework_Description1": "Želite ići dalje od osnova i steći stručnost s platformom ABP.IO?",
    "FreeDownload": "Besplatno preuzimanje",
    "Read": "Čitati",
    "HavingTrouble": "Imate problema?",
    "HavingTrouble_Description1": "Imate li problema s razvojem svog rješenja? Mi smo ovdje! Upotrijebite ABP platformu za podršku \n ili pošaljite e-poštu kako biste dobili pomoć izravno od članova tima Core ABP Framework.",
    "WeAreHereToHelp_Description1": "Možete pregledavati naše teme pomoći ili pretraživati u često postavljanim pitanjima, \n ili nam možete postaviti pitanje koristeći obrazac za kontakt.",
    "OtherModules": "Ostali moduli",
    "OtherModules_Description1": "Račun, bilježenje revizije, chat, CMS komplet, upravljanje datotekama, obrasci, GDPR, identitet, upravljanje jezikom, plaćanje, Saas i više...",
    "HowItWorks_DatabaseProviderOptions": "Mogućnosti pružatelja baze podataka",
    "SeeFAQ": "Vidi FAQ",
    "ReleaseLogs": "Dnevnici izdanja",
    "ReleaseLogs_Tag": "{0} Dnevnici izdanja",
    "ReleaseLogs_Pr": "Zahtjev za povlačenje #{0} - {1}",
    "NoLabels": "Nema etiketa",
    "DoesTheSubscriptionRenewAutomatically": "Obnavlja li se pretplata automatski?",
    "DoesTheSubscriptionRenewAutomaticallyExplanation": "ABP Commercial nema model naplate s automatskim obnavljanjem. Stoga <strong>vaša pretplata neće biti automatski obnovljena</strong> na kraju vašeg licencnog razdoblja. Ako želite i dalje imati prednosti ABP Commerciala, trebate ga ručno obnoviti na <a href=\"/my-organizations\">stranici za upravljanje organizacijom</a> . Ako imate više organizacija, kliknite gumb &quot;Upravljanje&quot; u organizaciji kojoj ističe, a zatim kliknite gumb &quot;Produži sada&quot; da obnovite licencu. Možda biste također željeli pogledati <a href=\"/faq#what-happens-when-license-ends\">Što se događa kada istekne moja licenca?</a> odjeljak.",
    "ExtraQuestionCreditsFaqTitle": "Mogu li kupiti dodatne kredite za pitanja podrške?",
    "ExtraQuestionCreditsFaqExplanation": "Da, možeš. Za kupnju dodatnih kredita za pitanja pošaljite e-poštu na <a href=\"mailto:info@abp.io\">info@abp.io</a> s nazivom svoje organizacije. Evo cjenika za dodatne bodove za pitanja:<ul><li> Paket od 50 pitanja 999 USD</li><li> Paket od 25 pitanja 625 USD</li><li> Paket od 15 pitanja 450 USD</li></ul>",
    "AlreadyBetaTester": "Već ste se pridružili programu beta testera.",
    "AbpStudio": "ABP studio",
    "AbpStudio_Description": "ABP Studio je još uvijek u razvoju. Možete ispuniti obrazac ispod i biti jedan od prvih korisnika.",
    "AbpStudio_Description1": "ABP Studio je <span class=\"text-highlight-white\">stolna aplikacija za više platformi</span> za ABP programere.",
    "AbpStudio_Description2": "<span class=\"text-highlight-white\">Dobro je integriran</span> u ABP Framework i ima za cilj pružiti vam ugodno razvojno okruženje <span class=\"text-highlight-white\">automatiziranjem stvari, pružanjem uvida</span> u vaše rješenje, čineći <span class=\"text-highlight-white\">razvoj, pokretanje</span> i <span class=\"text-highlight-white\">implementaciju</span> vaših rješenja puno lakšim.",
    "AbpStudio_PlannedPreviewDate": "Planirani datum izdavanja pregleda: 4. kvartal 2023.",
    "BetaRequest": "Zahtjev za beta verziju",
    "CreateNewSolutions": "Stvorite nova rješenja",
    "CreateNewSolutions_Description1": "Možete jednostavno stvarati od jednostavnih aplikacija do modularnih monolitnih ili mikroservisnih rješenja s puno opcija. Dobivate potpuno softversko rješenje spremno za proizvodnju za vaše poslovanje.",
    "ArchitectYourSolutions": "Projektirajte svoja rješenja",
    "ArchitectYourSolutions_Description1": "Lakše izgradite monolitno-modularne i mikroservisne strukture rješenja stvaranjem modula ili usluga i uspostavljanjem odnosa između njih. Također možete instalirati ili deinstalirati unaprijed izgrađene aplikacijske module.",
    "ExploreYourSolution": "Istražite svoje rješenje",
    "ExploreYourSolution_Description1": "ABP Studio prikazuje visoku razinu prikaza komponenti u vašem rješenju i modula o kojima ovisi vaše rješenje. Možete istraživati entitete, usluge, HTTP API-je i još mnogo toga bez potrebe za otvaranjem baze kodova.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze": "Pokrenite Multi-Application ili Microservice rješenja u povjetarcu",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description1": "Pokrenite jednu, <span class=\"text-highlight-white\">više</span> ili <span class=\"text-highlight-white\">sve usluge</span> jednim klikom. Na taj je način vrlo jednostavno zaustaviti uslugu, pokrenuti je u Visual Studiju za <span class=\"text-highlight-white\">testiranje</span> ili <span class=\"text-highlight-white\">uklanjanje pogrešaka</span> .",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description2": "Pogledajte popis usluga, pogledajte <span class=\"text-highlight-white\">HTTP zahtjeve u stvarnom vremenu</span> i <span class=\"text-highlight-white\">broj izuzetaka</span> za svaku uslugu.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description3": "Pogledajte sve pojedinosti o svim <span class=\"text-highlight-white\">HTTP zahtjevima</span> koji dolaze bilo kojoj usluzi.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description4": "Istražite <span class=\"text-highlight-white\">pojedinosti iznimke</span> u stvarnom vremenu u bilo kojoj usluzi, jednostavno filtrirajte i pretražujte.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description5": "Prikažite <span class=\"text-highlight-white\">zapisnike aplikacije</span> , filtrirajte po razini zapisnika ili pretražite po tekstu..",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description6": "<span class=\"text-highlight-white\">Pregledajte</span> korisničko sučelje svoje aplikacije bez napuštanja pokretača rješenja.",
    "IntegrateToYourKubernetesCluster": "Integrirajte u svoj Kubernetes klaster",
    "IntegrateToYourKubernetesCluster_Description1": "<span class=\"text-highlight-white\">Povežite svoje lokalno razvojno okruženje s lokalnim ili udaljenim Kubernetes klasterom</span> , gdje taj klaster već pokreće vaše mikrouslužno rješenje.",
    "IntegrateToYourKubernetesCluster_Description2": "Pristupite bilo kojoj usluzi u Kubernetesu s nazivom usluge kao DNS, baš kao da se izvodi na vašem lokalnom računalu.",
    "IntegrateToYourKubernetesCluster_Description3": "<span class=\"text-highlight-white\">Presretnite bilo koju uslugu</span> u tom klasteru, tako da se sav <span class=\"text-highlight-white\">promet prema presretnutoj usluzi automatski preusmjerava na vašu uslugu</span> koja se izvodi na vašem lokalnom računalu. Kada vaša usluga treba koristiti bilo koju uslugu u Kubernetesu, promet se preusmjerava natrag u klaster, baš kao što vaša lokalna usluga radi unutar Kubernetesa.",
    "GetInformed": "Informirajte se",
    "Studio_GetInformed_Description1": "Ostavite svoje podatke za kontakt kako <span class=\"text-highlight-white\">biste se informirali</span> i <span class=\"text-highlight-white\">isprobajte prvi</span> kada ABP Studio bude pokrenut.",
    "Studio_GetInformed_Description2": "Planirani datum izdavanja pregleda: treće tromjesečje 2023.",
    "ThankYou!": "Hvala vam!",
    "SendBetaRequest": "Pošalji zahtjev za beta verziju",
    "YouJoinedTheBetaTesterProgram": "Pridružili ste se programu beta testera ABP Studio.",
    "PricingExplanation2": "30 dana jamstva povrata novca — <a href=\"/faq#refund-policy\">saznajte više</a>",
    "MoneyBackGuaranteeText": "* 30-dnevno jamstvo povrata novca za sve licence! 100% povrata za Team, 60% povrata za Business i Enterprise licence u roku od 30 dana.",
    "MobileApplicationStartupTemplates": "Predlošci za pokretanje mobilne aplikacije",
    "MobileApplicationStartupTemplates_Description1": "Integrirani predlošci za pokretanje mobilnih aplikacija za vaša ABP komercijalna rješenja.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates": "Stvorite moćne poslovne aplikacije koristeći ABP Mobile Startup Templates",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description1": "ABP Commercial nudi dva predloška za pokretanje mobilnih aplikacija implementiranih s <span class=\"text-highlight\">React Native</span> i <span class=\"text-highlight\">.NET MAUI.</span> Kada izradite svoje novo rješenje temeljeno na ABP-u, imat ćete i osnovne aplikacije za pokretanje povezane s vašim pozadinskim API-jima.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description2": "Aplikacija ima unaprijed izgrađeni ciklus tokena za provjeru autentičnosti, <span class=\"text-highlight\">podršku za više jezika, podršku za više korisnika, prijavu, zaboravljenu lozinku, upravljanje profilima i stranicu za upravljanje korisnicima</span> . Možete dodati vlastitu poslovnu logiku i prilagoditi je prema svojim zahtjevima.",
    "TwoFrameworkOptions": "Dvije opcije okvira",
    "TwoFrameworkOptions_Description": "ABP nudi i <span class=\"text-highlight\">React Native</span> i <span class=\"text-highlight\">.NET MAUI</span> mobilne predloške za pokretanje. Na taj način možete odabrati onaj koji najbolje odgovara vašim potrebama. Obje aplikacije ponovno koriste kod s najvećom stopom između iOS i Android platformi.",
    "PreIntegratedToYourBackend": "Unaprijed integriran u vašu pozadinu",
    "PreIntegratedToYourBackend_Description": "ABP mobilne aplikacije unaprijed su integrirane u vaše pozadinske API-je. Od poslužitelja dobiva važeći autentifikacijski token i šalje autentificirane zahtjeve.",
    "MultiLanguage": "Višejezično",
    "MultiLanguage_Description": "Već odmah podržava više od 10 jezika. Također možete dodati sljedeće jezike.",
    "Arabic": "arapski",
    "Czech": "češki",
    "English": "Engleski",
    "Hungarian": "mađarski",
    "Finnish": "finski",
    "French": "francuski",
    "Hindi": "hindski",
    "Portuguese": "Portugalski",
    "Italian": "talijanski",
    "Russian": "ruski",
    "Slovak": "slovački",
    "Turkish": "turski",
    "EngageAndRetainYourCustomersWithABPMobileApps": "Uključite i zadržite svoje kupce uz ABP mobilne aplikacije",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description1": "Vaši klijenti žele upravljati svojim proizvodima i pretplatama s bilo kojeg mjesta i bilo kada. To zahtijeva od organizacija stvaranje mobilnih aplikacija koje korisnicima omogućuju brzo i neprimjetno ispunjavanje njihovih zahtjeva.",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description2": "S ABP Mobile aplikacijama možete izraditi visokokvalitetne izvorne mobilne aplikacije za Android i iOS… Koristeći jednu bazu koda i bez kompromisa u pogledu sigurnosti, kvalitete ili skalabilnosti.",
    "OneCodeBaseMultipleDevices": "Jedna baza koda za više uređaja",
    "OneCodeBaseMultipleDevices_Description": "ABP mobilne aplikacije su višeplatformske. Spremni su za instaliranje i rad na iOS i Android uređajima, a prilagođavaju se različitim faktorima forme koristeći jednu bazu koda. Programeri trebaju izraditi UI i front-end kod samo jednom, nema potrebe prilagođavati kod za svaki uređaj koji želite podržati.",
    "ComesWithTheSourceCode": "Dolazi s izvornim kodom",
    "ComesWithTheSourceCode_Description": "Mobilne aplikacije dobivaju se s izvornim kodom. Jednostavno prilagodite UX/UI svojih aplikacija u skladu sa smjernicama za markiranje.",
    "Purchase_OneYearPrice": "Cijena za 1 godinu",
    "Purchase_DeveloperSeatCount": "Broj mjesta programera",
    "Purchase_DevelopersAlreadyIncluded": "Već je uključeno {0} programera",
    "1Year": "1 godina",
    "{0}Years": "{0} godina",
    "1YearLicense": "1 godina licence",
    "{0}YearsLicense": "{0} godina licence",
    "1AdditionalDeveloper": "1 dodatni programer",
    "{0}AdditionalDevelopers": "{0} Dodatni programeri",
    "Discount": "Popust ({0}%)",
    "Summary": "Sažetak",
    "TrainingPack": "Paket za obuku",
    "TrainingPackDiscount": "Popust na paket treninga",
    "Purchase_OnboardingTraining_Description": "Ovaj paket obuke uživo vrijedi za razred od 8 učenika i ovaj popust vrijedi samo kada se kupi s novom licencom. <a href=\"{0}\" class=\"text-white\">Saznajte više<i class=\"fa fa-external-link ms-1\"></i></a>",
    "Purchase_Save": "{0}% <span class=\"save ms-1\">uštede {1} {2}</span>",
    "RemoveBasket": "Izvadite iz košarice",
    "WhyABPIOPlatform?": "Zašto <span class=\"gradient-commercial\">ABP.IO platforma</span> ?",
    "DocumentAim": "Ovaj dokument ima za cilj odgovoriti na veliko pitanje:",
    "DocumentAim_Description": "&quot;Zašto biste trebali koristiti ABP.IO platformu umjesto stvaranja novog rješenja od nule?&quot;",
    "DocumentAim_Description2": "Dokument predstavlja izazove izgradnje modernog softverskog rješenja i objašnjava kako ABP rješava te izazove.",
    "CreatingANewSolution": "Stvaranje novog rješenja",
    "CreatingANewSolution_Description": "Kada trebate pokrenuti novo rješenje, morate si postaviti puno pitanja i trebali biste potrošiti puno vremena prije nego počnete pisati svoj prvi poslovni kod.",
    "CreatingAnEmptySolution": "Stvaranje praznog rješenja",
    "THEPROBLEM": "PROBLEM",
    "CreatingAnEmptySolution_THEPROBLEM_Description": "Čak je i stvaranje gotovo praznog rješenja izazovno;",
    "CreatingAnEmptySolution_THEPROBLEM_Description2": "Kako organizirate svoju bazu kodova po projektima?",
    "CreatingAnEmptySolution_THEPROBLEM_Description3": "Što su slojevi i kako međusobno djeluju?",
    "CreatingAnEmptySolution_THEPROBLEM_Description4": "Kako se integrirate u biblioteku i sustave trećih strana?",
    "CreatingAnEmptySolution_THEPROBLEM_Description5": "Kako postaviti automatizirane testove?",
    "ABPSOLUTION": "ABP RJEŠENJE",
    "CreatingAnEmptySolution_ABPSOLUTION_Description": "ABP pruža dobro projektirano, slojevito i za proizvodnju spremno <a href=\"https://abp.io/docs/latest/solution-templates/layered-web-application\" target=\"_blank\">startup rješenje</a> temeljeno na načelima <a href=\"https://abp.io/docs/latest/framework/architecture/domain-driven-design\" target=\"_blank\">Domain Driven Design</a> . Rješenje također uključuje unaprijed konfiguriranu jedinicu i <a href=\"https://abp.io/docs/latest/testing/overall\" target=\"_blank\">testne</a> projekte integracije za svaki sloj.",
    "CommonLibraries": "Zajedničke knjižnice",
    "CommonLibraries_THEPROBLEM_Description": "Koje bi knjižnice trebali koristiti za implementaciju uobičajenih zahtjeva? Ekosustav razvoja softvera vrlo je dinamičan, što ga čini izazovnim držati korak s najnovijim alatima, bibliotekama, trendovima i pristupima.",
    "CommonLibraries_ABPSOLUTION_Description": "ABP unaprijed integrira popularne, zrele i ažurirane biblioteke u rješenje. Ne morate trošiti vrijeme na njihovu integraciju ili natjeravanje da međusobno komuniciraju. Rade ispravno iz kutije.",
    "UITheme&Layout": "Tema i izgled korisničkog sučelja",
    "UITheme&Layout_THEPROBLEM_Description": "Prilikom rješavanja pitanja korisničkog sučelja na površinu dolazi niz izazova. To uključuje uspostavljanje temelja za odgovarajući, suvremeni i prilagodljivi UI kit s dosljednim izgledom i nizom značajki kao što su navigacijski izbornici, zaglavlja, alatne trake, podnožja, widgeti i više.",
    "UITheme&Layout_THEPROBLEM_Description2": "Čak i ako se odlučite za unaprijed dizajniranu temu, njezino neprimjetno integriranje u vaš projekt može zahtijevati dane razvoja. Dodatna prepreka leži u nadogradnji takvih tema. Često se HTML/CSS struktura teme isprepliće s kodom korisničkog sučelja, renderirajući buduće promjene teme ili nadogradnje zamršenih zadataka. Ovo ispreplitanje koda i dizajna komplicira fleksibilnost prilagodbi niz liniju.",
    "UITheme&Layout_ABPSOLUTION_Description": "ABP Framework nudi karakterističan sustav temiranja koji oslobađa vaš UI kod od ograničenja teme. Teme postoje izolirano, zapakirane kao NuGet ili NPM paketi, što instalaciju ili nadogradnju teme čini pitanjem nekoliko minuta. Dok zadržavate mogućnost razvoja svoje prilagođene teme ili integracije postojeće, ABP Commercial predstavlja kolekciju uglađenih i suvremenih tema.",
    "UITheme&Layout_ABPSOLUTION_Description2": "Osim toga, postoje pružatelji komponenti korisničkog sučelja kao što su Telerik i DevExpress. Međutim, ti pružatelji primarno isporučuju pojedinačne komponente, stavljajući na vas odgovornost da uspostavite svoj sustav rasporeda. Kada radite unutar projekata temeljenih na ABP-u, možete neprimjetno uključiti ove biblioteke, slično kao što biste to učinili u bilo kojem drugom projektu.",
    "TestInfrastructure": "Testna infrastruktura",
    "TestInfrastructure_THEPROBLEM_Description": "Uspostava robusne okoline za testiranje je dugotrajan poduhvat. Uključuje postavljanje namjenskih testnih projekata unutar vašeg rješenja, pažljiv odabir potrebnih alata, kreiranje usluga i lažnih baza podataka, izradu osnovnih osnovnih klasa i uslužnih usluga kako bi se redundantni kod u testovima sveo na najmanju moguću mjeru, te rješavanje raznih povezanih zadataka.",
    "TestInfrastructure_ABPSOLUTION_Description": "ABP predlošci za pokretanje dolaze unaprijed opremljeni konfiguriranim test projektima, pojednostavljujući proces za vas. To znači da od prvog dana možete bez odlaganja započeti pisati svoju početnu jedinicu ili integracijski testni kod.",
    "CodingStandards&Training": "Standardi kodiranja i obuka",
    "CodingStandards&Training_THEPROBLEM_Description": "Nakon što postavite rješenje za razvoj, obično morate podučiti programere kako sustav radi i kako ga izgraditi koristeći iste dogovorene metode. Čak i ako ih obučite, održavanje dokumentacije ažurnom može biti teško. Kako vrijeme prolazi, svaki programer može pisati kod na svoj način, uzrokujući da se pravila za pisanje koda razlikuju jedna od drugih.",
    "CodingStandards&Training_ABPSOLUTION_Description": "ABP rješenje već je uredno organizirano i ima jasna objašnjenja. Upute i vodiči korak po korak pokazuju vam kako točno raditi na ABP projektu.",
    "KeepingYourSolutionUpToDate": "Održavanje vašeg rješenja ažurnim",
    "KeepingYourSolutionUpToDate_THEPROBLEM_Description": "Nakon što započnete svoj razvoj, morate pratiti nove verzije biblioteka koje koristite za nadogradnje i zakrpe.",
    "KeepingYourSolutionUpToDate_ABPSOLUTION_Description": "Sve pakete redovito ažuriramo na najnovije verzije i testiramo ih prije stabilnog izdanja. Kada ažurirate ABP Framework, sve njegove ovisnosti nadograđuju se na vrhunsku tehnologiju.",
    "DRY": "Ne ponavljaj se!",
    "DRY_Description": "Stvaranje osnovnog rješenja oduzima dosta vremena i zahtijeva dobro arhitektonsko iskustvo. Međutim, ovo je tek početak! Kako počnete razvijati, vjerojatno ćete morati napisati puno ponavljajućeg koda; bilo bi sjajno kada bi se sve ovo moglo automatski riješiti.",
    "DRY_Description2": "ABP automatizira i pojednostavljuje ponavljanje koda što je više moguće slijedeći načelo konvencije nad konfiguracijom. Međutim, to vas ne ograničava kada trebate prebaciti na ručni stupanj prijenosa. Kontrola je uvijek u vašim rukama.",
    "Authentication": "Ovjera",
    "Authentication_THEPROBLEM_Description": "Single Sign On, Active Directory / LDAP integracija, OpenIddict integracija, društvene prijave, dvofaktorska autentifikacija, zaboravljena/resetirana lozinka, aktivacija putem e-pošte, registracija novog korisnika, kontrola složenosti lozinke, zaključavanje računa pri neuspjelim pokušajima, prikaz neuspjelih pokušaja prijave... itd. Znamo da su vam svi ovi generički zahtjevi poznati. Nisi sam!",
    "Authentication_ABPSOLUTION_Description": "ABP Framework i komercijalna verzija pružaju sve te standardne stvari unaprijed implementirane za vas kao modul računa koji se može ponovno koristiti. Vi samo omogućite i konfigurirate ono što trebate.",
    "CrossCuttingConcerns": "Međusektorski problemi",
    "CrossCuttingConcerns_THEPROBLEM_Description": "Međusektorski problemi temeljna su ponavljajuća logika koja bi se trebala implementirati za svaki slučaj upotrebe. Neki primjeri;",
    "CrossCuttingConcerns_THEPROBLEM_Description2": "Pokretanje transakcija, izvršenje u slučaju uspjeha i vraćanje unatrag u slučaju pogreške.",
    "CrossCuttingConcerns_THEPROBLEM_Description3": "Rukovanje i izvješćivanje o iznimkama, vraćanje ispravnog odgovora na pogrešku klijentima i rukovanje slučajevima pogreške na strani klijenta.",
    "CrossCuttingConcerns_THEPROBLEM_Description4": "Implementacija autorizacije i provjere valjanosti, vraćanje ispravnih odgovora i rukovanje njima na strani klijenta.",
    "CrossCuttingConcerns_ABPSOLUTION_Description": "ABP Framework automatizira ili pojednostavljuje sva uobičajena međusektorska pitanja. Vi pišete samo kod koji je bitan za vaše poslovanje, a ABP rješava ostalo prema konvencijama.",
    "ArchitecturalInfrastructure": "Arhitektonska infrastruktura",
    "ArchitecturalInfrastructure_THEPROBLEM_Description": "Obično morate izgraditi infrastrukturu kako biste ispravno implementirali svoju arhitekturu. Na primjer, općenito implementirate uzorak Repository. Definirate neke osnovne klase kako biste pojednostavili i standardizirali stvaranje entiteta, usluga, kontrolera i drugih objekata.",
    "ArchitecturalInfrastructure_ABPSOLUTION_Description": "ABP Framework pruža sve to i još mnogo više od samog početka. Zrelo je i dobro dokumentirano.",
    "EnterpriseApplicationRequirements": "Zahtjevi za poslovne aplikacije",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description": "Mnogo je zahtjeva koje stalno implementirate u svaku poslovnu aplikaciju;",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description2": "Detaljan sustav dopuštenja i dopuštenja za upravljanje na korisničkom sučelju na temelju uloga i korisnika.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description3": "Pisanje revizijskih dnevnika i povijesti entiteta za praćenje kada korisnik mijenja zapis baze podataka.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description4": "Napravite meko brisanje svojih entiteta, tako da budu označeni kao izbrisani umjesto fizičkog brisanja iz baze podataka i automatskog filtriranja izbrisanih entiteta na vašim upitima.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description5": "Stvaranje apstrakcija i omotača za korištenje vaših pozadinskih API-ja iz koda sučelja.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description6": "Stavljanje u red i izvršavanje pozadinskih poslova.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description7": "Rukovanje više vremenskih zona u globalnom sustavu.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description8": "Dijeljenje logike provjere valjanosti, lokalizacije, autorizacije između poslužitelja i klijenta.",
    "EnterpriseApplicationRequirements_ABPSOLUTION_Description": "ABP pruža infrastrukturu za jednostavnu implementaciju takvih zahtjeva. Opet, ne trošite svoje dragocjeno vrijeme na ponovnu implementaciju svega ovoga iznova i iznova.",
    "GeneratingInitialCode&Tooling": "Generiranje početnog koda i alata",
    "GeneratingInitialCode&Tooling_THEPROBLEM_Description": "Napravit ćete mnogo sličnih stranica u tipičnoj web aplikaciji. Većina njih će izvoditi slične CRUD operacije. Vrlo je zamorno i također sklono pogreškama opetovano stvarati takve stranice.",
    "GeneratingInitialCode&Tooling_ABPSOLUTION_Description": "<a href=\"/tools/suite\">ABP Suite</a> može generirati CRUD stranicu s punim nizom za vaše entitete u nekoliko sekundi. Generirani kod je slojevit i čist. Implementirani su svi standardni zahtjevi za validaciju i autorizaciju. Osim toga, generiraju se klase jediničnih testova. Nakon što dobijete potpuno aktivnu stranicu, možete je modificirati prema svojim poslovnim zahtjevima.",
    "IntegratingTo3rdPartyLibrariesAndSystems": "Integracija s bibliotekama i sustavima trećih strana",
    "IntegratingTo3rdPartyLibrariesAndSystems_THEPROBLEM_Description": "Većina knjižnica dizajnirana je kao niska razina i obično radite nešto kako biste ih pravilno integrirali bez ponavljanja istog integracijskog i konfiguracijskog koda posvuda u svom rješenju. Na primjer, pretpostavimo da morate koristiti RabbitMQ za implementaciju vaše distribuirane sabirnice događaja. Sve što želite učiniti je; poslati poruku u red čekanja i rukovati dolaznim porukama. Ali morate razumjeti obrasce slanja poruka, redove i detalje razmjene. Da biste napisali učinkovit kod, morate stvoriti skup za upravljanje vezama, klijentima i kanalima. Također se morate nositi s iznimkama, ACK porukama, ponovnim povezivanjem na RabbitMQ u slučaju kvarova i više.",
    "IntegratingTo3rdPartyLibrariesAndSystems_ABPSOLUTION_Description": "Na primjer, ABP-ova integracija RabbitMQ Distributed Event Bus apstrahira sve te detalje. Šaljete i primate poruke bez gužve i žurbe. Trebate li pisati kod niske razine? Nema problema, to uvijek možete. ABP vas ne ograničava kada trebate koristiti značajke niske razine biblioteke koju koristite.",
    "WhyNotBuildYourOwnFramework?": "Zašto ne biste izgradili vlastiti okvir?",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description": "Za svu infrastrukturu, čak i na najjednostavniji način, potrebno je puno vremena da se izgradi, održava i dokumentira. S vremenom postaje sve veći i postaje ga teško održavati u vašem rješenju. Razdvajanje istih u projekt koji se može ponovno koristiti početna je točka za izgradnju vlastitog unutarnjeg okvira.",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description2": "Izgradnja, dokumentiranje, obuka i održavanje unutarnjeg okvira stvarno je teško. Ako nemate iskusan, posvećen okvirni tim, vaš interni okvir brzo postaje nedokumentirani naslijeđeni kod koji više nitko ne može razumjeti i održavati. S druge strane, ove okvire uglavnom razvijaju jedan ili dva programera u timu. A ti ljudi postaju silos znanja. To je dobro za njih, ali loše za tvrtku jer su oni jedina točka neuspjeha projekta <a href=\"https://en.wikipedia.org/wiki/Single_point_of_failure\">-SPOF-</a> . Nakon što napuste tvrtku, projekt dramatično pada.",
    "WhyNotBuildYourOwnFramework_ABPSOLUTION_Description": "ABP Framework je dobro dokumentiran, zreo i generički aplikacijski okvir vođen zajednicom. Tim vrlo iskusnih programera naporno radi kako bi bio ažuran, lak za razumijevanje i ugodan za korištenje. Korištenje takvog stabilnog okvira tjera vas da se usredotočite na vlastiti poslovni kod i dobijete pomoć stručnjaka s okvirom kad god vam je potrebna.",
    "ArchitecturalInfrastructure_Description": "SaaS aplikacije, modularni ili mikroservisni sustavi najčešće su korišteni modeli poslovnog softvera. Izgradnja takvih sustava ne zahtijeva samo dobro razumijevanje i iskustvo, već zahtijeva i jaku softversku infrastrukturu. Inače ćete morati uložiti mnogo truda da podržite ove arhitektonske detalje u svojoj bazi koda.",
    "Modularity": "Modularnost",
    "Modularity_THEPROBLEM_Description": "Izgradnja istinski modularnog sustava nije laka! Svi aspekti sustava (baza podataka, entiteti, API-ji, UI stranice/komponente) mogu se podijeliti u module, a svaki se modul može ponovno koristiti bez drugih. Obični ASP.NET Core ne pruža takvu modularnu arhitekturu. Ako vam treba, razmislite o tome od nule.",
    "Modularity_ABPSOLUTION_Description": "ABP Framework je rođen da bude modularna struktura za razvoj aplikacija. Svaka značajka u okviru razvijena je da bude kompatibilna s modularnošću. Dokumentacija i vodiči objašnjavaju kako razviti module koji se mogu ponovno koristiti na standardni način.",
    "SaaSMultiTenancy": "SaaS / Multi-Tenancy",
    "SaaSMultiTenancy_THEPROBLEM_Description": "<a href=\"https://abp.io/docs/latest/framework/architecture/multi-tenancy\">Multi-Tenancy</a> je uobičajeni način implementacije SaaS sustava. Međutim, implementacija dosljedne infrastrukture s više stanara može postati komplicirana.",
    "SaaSMultiTenancy_ABPSOLUTION_Description": "ABP Framework pruža kompletnu infrastrukturu s više korisnika i apstraktnu složenost iz vašeg poslovnog koda. Vaš aplikacijski kod će uglavnom biti svjestan više zakupaca, dok ABP Framework automatski izolira bazu podataka, predmemoriju i druge detalje zakupaca jedne od drugih. Podržava jedinstvenu bazu podataka, bazu podataka po stanarima i hibridne pristupe. Ispravno konfigurira biblioteke kao što su Microsoft Identity i OpenIddict, koje obično nisu kompatibilne s više korisnika.",
    "Microservices": "Mikroservisi",
    "Microservices_THEPROBLEM_Description": "Izgradnja sustava mikroservisa zahtijeva mnoge infrastrukturne detalje: autentifikacija i autorizacija aplikacija i mikroservisa te implementacija asinkronog slanja poruka i sinkronih (Rest/GRPC) komunikacijskih obrazaca između mikroservisa najosnovnija su pitanja.",
    "Microservices_ABPSOLUTION_Description": "ABP Framework pruža usluge, <a href=\"https://abp.io/docs/latest/framework/architecture/microservices\" target=\"_blank\">vodiče</a> i uzorke koji će vam pomoći implementirati vaše mikrouslužno rješenje pomoću standardnih alata za industriju.",
    "Microservices_ABPSOLUTION_Description2": "ABP Commercial čak ide korak dalje i pruža potpuni <a href=\"https://abp.io/docs/latest/get-started/microservice\" target=\"_blank\">predložak za pokretanje</a> za pokretanje vašeg mikroservisnog rješenja.",
    "PreBuiltModules": "Unaprijed izgrađeni moduli",
    "PreBuiltModules_THEPROBLEM_Description": "Svi mi imamo slične ali pomalo različite poslovne zahtjeve. Međutim, svi bismo trebali ponovno izmisliti kotač jer ničiji kod ne može izravno funkcionirati u našem rješenju. Svi su oni ugrađeni dijelovi većeg rješenja.",
    "PreBuiltModules_ABPSOLUTION_Description": "ABP Commercial <a href=\"/modules\">modules</a> pruža mnoštvo višekratno upotrebljivih aplikacijskih modula kao što su plaćanje, chat, upravljanje datotekama, izvješćivanje dnevnika revizije... itd. Svi ovi moduli lako se instaliraju u vaše rješenje i izravno rade. Stalno dodajemo nove module.",
    "PreBuiltModules_ABPSOLUTION_Description2": "Svi moduli dizajnirani su tako da se mogu prilagoditi vašim poslovnim zahtjevima. Ako trebate potpunu kontrolu, možete preuzeti puni izvorni kod bilo kojeg modula i potpuno ga prilagoditi na temelju vaših specifičnih poslovnih zahtjeva.",
    "ABPCommunity": "ABP zajednica",
    "ABPCommunity_Description": "Naposljetku, biti u velikoj zajednici u kojoj svi slijede slične stilove kodiranja i načela te dijele zajedničku infrastrukturu donosi snagu kada imate problema ili trebate pomoć s odlukama o dizajnu. Budući da kod pišemo na sličan način, možemo puno bolje pomoći jedni drugima. ABP je projekt koji podržava zajednica s više od 10 tisuća zvjezdica na GitHubu.",
    "ABPCommunity_Description2": "Lako je dijeliti kod ili čak biblioteke koje se mogu ponovno koristiti između ABP programera. Isječak koda koji radi za vas također će raditi za druge. Postoji mnogo uzoraka i vodiča koje možete izravno implementirati za svoju aplikaciju.",
    "ABPCommunity_Description3": "Kada angažirate programera koji je prije radio s ABP arhitekturom, odmah će razumjeti vaše rješenje i započeti razvoj u vrlo kratkom roku.",
    "WhyAbpIo_Page_Title": "Zašto ABP.IO platforma?",
    "AbpStudio_Page_Title": "ABP studio",
    "CampaignInfo": "Kupite novu licencu ili obnovite postojeću i <span class=\"text-white\">dobijte dodatna 2 mjeseca</span> bez dodatnih troškova! Ova ponuda vrijedi za sve licencne planove. Iskoristite ovu vremenski ograničenu promociju kako biste proširili svoj pristup premium značajkama i nadogradnjama.",
    "HurryUpLastDay": "Požuri! Zadnji dan: {0}",
    "CreatingCRUDPagesWithABPSuite": "Izrada CRUD stranica s ABP Suiteom",
    "Testimonials": "Svjedočanstva",
    "MultipleYearDiscount": "Višegodišnji popust",
    "CampaignDiscountText": "Crni petak popust",
    "CampaignDiscountName": "Crni petak",
    "CampaignName:BlackFriday": "Crni petak",
    "PaymentFailedInfo": "Nažalost, plaćanje nije uspjelo! ",
    "UsedPayment": "Ovo plaćanje je već iskorišteno",
    "ManageLicense": "Upravljanje licencom",
    "AbpPlatformLeptonXTheme": "LeptonX Tema za vašu administratorsku nadzornu ploču od strane <span class=\"gradient-commercial\">ABP Platform</span>",
    "Previous": "Prethodno",
    "PricingDiscount": "Popust",
    "YourOrganizationOverview": "Pregled vaše organizacije",
    "TrainingDetailsHeaderInfo_TrainingHourSingular": "{0} sat",
    "ContactPageError": "Pošaljite svoju poruku e-poštom na <a href=\"{0}\"> info@abp.io </a><br /> Evo što si napisao:",
    "GoBack": "Idi natrag",
    "HereWhatYouWrote": "Evo što si napisao:",
    "Sales": "Prodajni",
    "LicensingPricing": "Licenciranje / Cijene",
    "TrialDemo": "Probno / Demo",
    "TrainingOnboarding": "Obuka/uvođenje",
    "Resellers": "Preprodavači",
    "Others": "Drugi",
    "Characters": "Likovi",
    "Topic": "Tema",
    "SendUsEmail": "Pošaljite nam e-mail",
    "ErrorExceptionMessage": "Pojavila se greška prilikom obrade Vašeg zahtjeva",
    "WatchTakeCodeGeneration": "Pogledajte video \"Istražite potencijal generiranja koda: ABP Suite\"!",
    "ExtendNow": "Produži / obnovi",
    "AbpStudio_ComingSoon": "Ako želite testirati ABP Studio prije svih ostalih, postanite BETA tester"
  }
}