{
  "culture": "hu",
  "texts": {
    "OrganizationManagement": "Szervezetmenedzsment",
    "OrganizationList": "Szervezet lista",
    "Volo.AbpIo.Commercial:010003": "Ön nem tulajdonosa ennek a szervezetnek!",
    "OrganizationNotFoundMessage": "Nem található szervezet!",
    "DeveloperCount": "Kiosztott/összesen fejlesztő",
    "QuestionCount": "Fennmaradó/összes kérdés",
    "Unlimited": "Korlátlan",
    "Owners": "Tulajdonosok",
    "AddMember": "Tag hozzáadása lehetőségre",
    "AddOwner": "Tulajdonos hozzáadása",
    "AddDeveloper": "Fejlesztő hozzáadása",
    "UserName": "Felhasználónév",
    "Name": "Név",
    "EmailAddress": "Email cím",
    "Developers": "Fejlesztők",
    "LicenseType": "Jogosítvány típus",
    "Manage": "Kezelése",
    "StartDate": "Kezdő dátum",
    "EndDate": "Befejezés dátuma",
    "Modules": "Modulok",
    "LicenseExtendMessage": "Licencének lejárati dátumát meghosszabbították erre: {0}",
    "LicenseUpgradeMessage": "A licence frissítve a következőre: {0}",
    "LicenseExtendAdnUpgradeMessage": "Licencét meghosszabbítottuk {0}-ig, licenctervét pedig frissítettük a következőre: {1}.",
    "LicenseAddDeveloperMessage": "{0} fejlesztő hozzáadva a licencéhez",
    "Volo.AbpIo.Commercial:010004": "Nem található a megadott felhasználó! A felhasználónak már regisztrálnia kell.",
    "MyOrganizations": "Szervezeteim",
    "ApiKey": "API kulcs",
    "UserNameNotFound": "Nincs {0} felhasználónévvel rendelkező felhasználó",
    "SuccessfullyAddedToNewsletter": "Köszönjük, hogy feliratkozott hírlevelünkre!",
    "MyProfile": "A profilom",
    "EmailNotValid": "Kérjük valós e-mail címet adjon meg!",
    "JoinOurMarketingNewsletter": "Csatlakozzon marketing hírlevelünkhöz",
    "WouldLikeToReceiveMarketingMaterials": "Szeretnék marketing anyagokat kapni, például termékajánlatokat és különleges ajánlatokat.",
    "StartUsingYourLicenseNow": "Kezdje el használni licencét most!",
    "WelcomePage": "Üdvözlő oldal",
    "UnsubscriptionExpireEmail": "Leiratkozás a licenc lejárati dátumára emlékeztető e-mailekről",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Ez az e-mail-előfizetés csak emlékezteti a licenc lejárati dátumát.",
    "UnsubscribeFromLicenseExpireEmails": "Ha nem szeretne e-maileket kapni a licence lejárati dátumáról, bármikor leiratkozhat.",
    "Unsubscribe": "Leiratkozás",
    "NotOrganizationMember": "Ön egyetlen szervezetnek sem tagja.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Sikeresen leiratkozott",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Többé nem kap emlékeztető e-mailt a licenc lejárati dátumára.",
    "IndexPageHeroSection": "<span class=\"first-line\">Teljes</span><span class=\"second-line\"> webfejlesztői platform</span><span class=\"third-line\">beépített <img src= \"{0}\" width=\"110\" class=\"ml-1\" /> keretrendszer</span>",
    "AbpCommercialShortDescription": "Az ABP Commercial előre beépített alkalmazásmodulokat, gyors alkalmazásfejlesztési eszközöket, professzionális felhasználói felületi témákat, prémium támogatást és még sok mást kínál.",
    "LiveDemo": "Élő Demo",
    "GetLicence": "Szerezzen engedélyt",
    "Application": "Alkalmazás",
    "StartupTemplates": "Indítási sablonok",
    "Startup": "üzembe helyezés",
    "Templates": "Sablonok",
    "Developer": "Fejlesztő",
    "Tools": "Eszközök",
    "Premium": "Prémium",
    "PremiumSupport": "Prémium támogatás",
    "PremiumForumSupport": "Prémium fórum támogatás",
    "UI": "UI",
    "Themes": "Témák",
    "JoinOurNewsletter": "Csatlakozzon hírlevelünkhöz",
    "Send": "Küld",
    "Learn": "Tanul",
    "AdditionalServices": "További szolgáltatások",
    "WhatIsABPFramework": "MI AZ ABP KERET?",
    "OpenSourceBaseFramework": "Nyílt forráskódú alapkeretrendszer",
    "ABPFrameworkExplanation": "<p class=\"lead\">Az ABP Commercial az ABP-keretrendszeren alapul, amely egy nyílt forráskódú és közösségvezérelt webalkalmazás-keretrendszer az ASP.NET Core számára.</p><p>Az ABP-keretrendszer kiváló infrastruktúrát biztosít karbantartható, bővíthető íráshoz. és tesztelhető kód a bevált gyakorlatokkal.</p><p>Beépített és integrált népszerű eszközök, amelyeket már ismer. Alacsony tanulási görbe, könnyű alkalmazkodás, kényelmes fejlődés.</p>",
    "Modular": "Moduláris",
    "MicroserviceCompatible": "Mikroszolgáltatás kompatibilis",
    "DomainDrivenDesignInfrastructure": "Domainvezérelt tervezési infrastruktúra",
    "MultiTenancy": "Több bérlés",
    "DistributedMessaging": "Elosztott üzenetküldés",
    "DynamicProxying": "Dinamikus proxy",
    "BackgroundJobs": "Háttér állások",
    "AuditLogging": "Audit naplózás",
    "BLOBStoring": "BLOB tárolás",
    "BundlingMinification": "Csomagolás és kicsinyítés",
    "AdvancedLocalization": "Speciális lokalizáció",
    "ManyMore": "Sok más",
    "ExploreTheABPFramework": "Fedezze fel az ABP-keretrendszert",
    "WhyUseTheABPCommercial": "Miért használja az ABP Commercial-t?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\">A vállalati szintű webalkalmazások készítése bonyolult és időigényes lehet.</p><p>Az ABP Commercial tökéletes alapinfrastruktúrát kínál minden modern vállalati szintű ASP.NET Core számára. alapú megoldások. A tervezéstől a telepítésig a teljes fejlesztési ciklust az ABP beépített szolgáltatásai és moduljai hajtják végre.</p>",
    "StartupTemplatesShortDescription": "Az indítási sablonok segítségével néhány másodperc alatt ugrásszerűen elkezdheti a projektet.",
    "UIFrameworksOptions": "UI keretrendszerek beállításai;",
    "DatabaseProviderOptions": "Adatbázis-szolgáltató lehetőségek;",
    "PreBuiltApplicationModules": "Előre elkészített alkalmazásmodulok",
    "PreBuiltApplicationModulesShortDescription": "A legtöbb általános alkalmazási követelményt már kidolgozták az Ön számára, mint újrafelhasználható modulok.",
    "Account": "fiók",
    "Blogging": "Blogolás",
    "Identity": "Identitás",
    "IdentityServer": "Identity Server",
    "Saas": "Saas",
    "LanguageManagement": "Nyelvkezelés",
    "TextTemplateManagement": "Szöveg sablon kezelése",
    "See All Modules": "Lásd az összes modult",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "Az ABP Suite az ABP Commercial kiegészítő eszköze.",
    "AbpSuiteExplanation": "Lehetővé teszi weboldalak készítését percek alatt. Ez egy .NET Core Global eszköz, amely a parancssorból telepíthető. Létrehozhat egy új ABP-megoldást, generálhat CRUD oldalakat az adatbázisból a front-endre.",
    "Details": "Részletek",
    "LeptonTheme": "Lepton téma",
    "ProfessionalModernUIThemes": "Professzionális, modern felhasználói felület témák",
    "LeptonThemeExplanation": "A Lepton a Bootstrap adminisztrátori témák széles skáláját kínálja, amelyek szilárd alapot jelentenek minden olyan projekthez, amelyhez rendszergazdai irányítópult szükséges.",
    "DefaultTheme": "Alapértelmezett téma",
    "MaterialTheme": "Anyag téma",
    "Default2Theme": "Alapértelmezett 2 téma",
    "DarkTheme": "Sötét téma",
    "DarkBlueTheme": "Sötétkék téma",
    "LightTheme": "Fény téma",
    "ProudToWorkWith": "Büszke, hogy vele dolgozhat",
    "OurConsumers": "Vállalkozások és fejlesztők ezrei támaszkodnak az ABP Commercialra világszerte több mint 70 országban.",
    "JoinOurConsumers": "Csatlakozzon hozzájuk, és készítsen gyorsan csodálatos termékeket.",
    "AdditionalServicesExplanation": "További vagy egyedi szolgáltatásokra van szüksége? <strong>Mi és partnereink tudunk biztosítani;</strong>",
    "CustomProjectDevelopment": "Egyedi projektfejlesztés",
    "CustomProjectDevelopmentExplanation": "Elkötelezett fejlesztők egyedi projektjeihez.",
    "PortingExistingProjects": "Meglévő projektek portolása",
    "PortingExistingProjectsExplanation": "A régi projektek migrálása az ABP platformra.",
    "LiveSupport": "Élő támogatás",
    "LiveSupportExplanation": "Élő távoli támogatási lehetőség, amikor szüksége van rá.",
    "Training": "Kiképzés",
    "TrainingExplanation": "Dedikált képzés a fejlesztők számára.",
    "OnBoarding": "Beszállás",
    "OnBoardingExplanation": "Segítség a fejlesztői, CI és CD környezetek beállításában.",
    "PrioritizedTechnicalSupport": "Kiemelt műszaki támogatás",
    "PremiumSupportExplanation": "Az ABP keretrendszer nagyszerű közösségi támogatása mellett támogató csapatunk kiemelten válaszol a kereskedelmi felhasználók technikai kérdéseire és problémáira.",
    "SeeTheSupportOptions": "Lásd a Támogatási lehetőségeket",
    "Contact": "Kapcsolatba lépni",
    "TellUsWhatYouNeed": "Mondja el, mire van szüksége.",
    "YourMessage": "Az üzeneted",
    "YourFullName": "A teljes neved",
    "EmailField": "Email cím",
    "YourEmailAddress": "Az email címed",
    "HowMayWeHelpYou": "Hogyan segíthetünk?",
    "SendMessage": "Üzenet küldése",
    "Success": "Siker",
    "WeWillReplyYou": "Megkaptuk üzenetét, és hamarosan felvesszük Önnel a kapcsolatot.",
    "GoHome": "Hazamenni",
    "CreateLiveDemo": "Élő bemutató létrehozása",
    "RegisterToTheNewsletter": "Regisztráljon a hírlevélre, hogy információkat kapjon az ABP.IO-ról, beleértve az új kiadásokat stb.",
    "EnterYourEmailOrLogin": "Adja meg e-mail címét a bemutató létrehozásához, vagy <a href=\"{0}\">jelentkezzen be</a> meglévő fiókjával.",
    "ApplicationTemplate": "Alkalmazássablon",
    "ApplicationTemplateExplanation": "Az alkalmazásindítási sablon új webalkalmazás létrehozására szolgál.",
    "EfCoreProvider": "Entity Framework (az SQL Server, a MySQL, a PostgreSQL, az Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\">és egyebeket</a> támogatja)",
    "AlreadyIncludedInTemplateModules": "A következő modulok már szerepelnek és konfigurálva vannak ebben a sablonban:",
    "ApplicationTemplateArchitecture": "Ez az alkalmazássablon támogatja a többszintű architektúrát is, ahol a felhasználói felület, az API réteg és a hitelesítési szolgáltatás fizikailag el van választva.",
    "SeeTheGuideOrGoToTheLiveDemo": "A sablonnal kapcsolatos technikai információkért tekintse meg a fejlesztői útmutatót, vagy lépjen az élő bemutatóra.",
    "DeveloperGuide": "Fejlesztői útmutató",
    "ModuleTemplate": "Modul sablon",
    "ModuleTemplateExplanation1": "Létre szeretne hozni egy modult, és újra szeretné használni a különböző alkalmazásokban? Ez az indítási sablon mindent előkészít az újrafelhasználható <strong>alkalmazásmodul</strong> vagy egy <strong>mikroszolgáltatás</strong> létrehozásához.",
    "ModuleTemplateExplanation2": "<p>Támogathat egyetlen vagy több felhasználói felületi keretrendszert, egyetlen vagy több adatbázis-szolgáltatót egyetlen modulhoz. Az indítási sablon úgy van konfigurálva, hogy az egység- és integrációs tesztinfrastruktúrán kívül minimális alkalmazásban futtassa és <strong>tesztelje a modult</strong>. </p> <p>Tekintse meg a fejlesztői útmutatót a sablonnal kapcsolatos technikai információkért.</p>",
    "WithAllStyleOptions": "minden stílus opcióval",
    "Demo": "Demó",
    "SeeAllModules": "Lásd az összes modult",
    "ABPCLIExplanation": "Az ABP CLI (Command Line Interface) egy parancssori eszköz az ABP alapú megoldások általános műveleteinek végrehajtására.",
    "ABPSuiteEasilyCURD": "Az ABP Suite egy olyan eszköz, amellyel könnyedén hozhat létre CRUD oldalakat",
    "WeAreHereToHelp": "Azért vagyunk itt, hogy <span class=\"zero-text\">segítsünk</span>",
    "BrowseOrAskQuestion": "Böngésszen a súgótémáink között, kereshet a gyakran ismételt kérdések között, vagy feltehet nekünk kérdést a <a href=\"{0}\" class=\"text-success\">kapcsolatfelvételi űrlap</a> használatával.",
    "SearchQuestionPlaceholder": "Keressen a gyakran ismételt kérdések között",
    "WhatIsTheABPCommercial": "Mi az az ABP Commercial?",
    "WhatAreDifferencesThanAbpFramework": "Mi a különbség a nyílt forráskódú ABP Framework és az ABP Commercial között?",
    "ABPCommercialExplanation": "Az ABP Commercial prémium modulok, eszközök, témák és szolgáltatások készlete a nyílt forráskódú <a target=\"_blank\" href=\"{0}\">ABP keretrendszerre</a> épül fel. Az ABP Commercial-t ugyanaz a csapat fejleszti és támogatja az ABP keretrendszer mögött.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> Az <a target=\"_blank\" href=\"{0}\">ABP-keretrendszer</a> egy moduláris, tematikus, mikroszolgáltatásokkal kompatibilis alkalmazásfejlesztési keretrendszer az ASP.NET Core számára. Teljes architektúrát és erős infrastruktúrát biztosít ahhoz, hogy a saját üzleti kódjára összpontosítson, ahelyett, hogy megismételné magát minden új projektnél. A szoftverfejlesztés bevált gyakorlatain és a már ismert népszerű eszközökön alapul. </p> <p> Az ABP keretrendszer teljesen ingyenes, nyílt forráskódú és közösségvezérelt. Ingyenes témát és néhány előre beépített modult is biztosít (pl. személyazonosság-kezelés és bérlőkezelés).</p>",
    "VisitTheFrameworkVSCommercialDocument": "További információért keresse fel a következő linket: <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "Az ABP Commercial a következő előnyökkel egészíti ki az ABP keretrendszert;",
    "Professional": "Szakmai",
    "UIThemes": "UI témák",
    "EnterpriseModules": "Vállalati használatra kész, funkciókban gazdag, előre beépített <a href=\"{0}\">alkalmazásmodulok</a> (pl. Identity Server-kezelés, SaaS-kezelés, nyelvkezelés)",
    "ToolingToSupport": "Eszközök a fejlesztési termelékenység támogatására (pl. <a href=\"{0}\">ABP Suite</a>)",
    "PremiumSupportLink": "Prémium <a href=\"{0}\" target=\"_blank\">támogatás</a>",
    "WhatDoIDownloadABPCommercial": "Mit töltsek le az ABP Commercial megvásárlásakor?",
    "CreateUnlimitedSolutions": "Miután megvásárolta az ABP Commercial licencet, korlátlan számú megoldást hozhat létre a <a href=\"{0}\">Kezdő lépések</a> dokumentumban leírtak szerint.",
    "ABPCommercialSolutionExplanation": "Amikor új alkalmazást hoz létre, egy Visual Studio-megoldást (indítósablont) kap a preferenciái alapján. A letöltött megoldás már telepített és konfigurált kereskedelmi modulokat és témákat tartalmaz. Ha szeretné, eltávolíthat egy előre telepített modult, vagy hozzáadhat egy másik modult. Az összes modul és téma alapértelmezés szerint NuGet/NPM-csomagokat használ.",
    "StartDevelopWithTutorials": "A letöltött megoldás jól megtervezett és dokumentált. Az <a href=\"{0}\">oktatóanyagok</a> követésével megkezdheti saját üzleti kódjának fejlesztését az alapján.",
    "TryTheCommercialDemo": "Kipróbálhatja a <a href=\"{0}\">bemutatót</a>, hogy megtekintsen egy mintaalkalmazást, amelyet az ABP Commercial indítósablonjával hoztak létre.",
    "HowManyProducts": "Hány különböző terméket/megoldást építhetek az ABP Commercial használatával?",
    "HowManyProductsExplanation": "ABP-projekt létrehozásának nincs korlátozása. Tetszőleges számú projektet hozhat létre, fejleszthet és tölthet fel különböző szerverekre.",
    "HowManyDevelopers": "Hány fejlesztő dolgozhat az ABP Commercialon?",
    "HowManyDevelopersExplanation": "Az ABP Commercial licencek fejlesztőnként érvényesek. A különböző licenctípusokhoz eltérő fejlesztői korlátok vonatkoznak. Bármilyen licenctípushoz azonban bármikor hozzáadhat további fejlesztőket. Tekintse meg az <a href=\"{0}\">árakat</a> a licenctípusokról, a fejlesztői korlátokról és a további fejlesztői költségekről.",
    "ChangingLicenseType": "Frissíthetem a licenctípusomat később?",
    "ChangingLicenseTypeExplanation": "Magasabb licencre frissíthet, ha az aktív licencidőszakon belül kifizeti a különbözetet. Ha magasabb licenccsomagra frissít, megkapja az új csomag előnyeit, de a licencfrissítés nem módosítja a licenc lejárati dátumát. Emellett új fejlesztői helyeket is hozzáadhat meglévő licencéhez, lásd \"Hány fejlesztő dolgozhat az ABP Commercialon?\"",
    "LicenseExtendUpgradeDiff": "Mi a különbség a licenc kiterjesztése és a frissítés között?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Meghosszabbítás:</strong> A licenc meghosszabbításával/megújításával továbbra is prémium támogatást kap, valamint jelentős frissítéseket kap a modulokhoz és témákhoz. Emellett folytathatja új projektek létrehozását. És továbbra is használhatja az ABP Suite-ot, amely felgyorsítja a fejlesztést.<hr/><strong>Frissítés:</strong> Licencének frissítésével magasabb licenccsomagra lép fel, amely további előnyöket biztosít. . Tekintse meg a <a href=\"/pricing\">licenc-összehasonlító táblázatot</a>, hogy ellenőrizze a licenccsomagok közötti különbségeket.<strong>Másrészt, ha frissít, a licenc lejárati dátuma nem változik!</strong> >A licenc lejárati dátumának meghosszabbításához meg kell hosszabbítania az engedélyt.",
    "LicenseRenewalCost": "Mennyibe kerül a licenc megújítása 1 év után?",
    "LicenseRenewalCostExplanation": "Az összes ABP Commercial örökös licenc megújítási (meghosszabbítási) aránya a licenc listaárának {0}-a. A normál csapatlicenc megújítási ára {1} USD, a normál üzleti licencé {2} USD, a normál vállalati licencé pedig {3} USD. Ha már ügyfele, <a href='{4}' target='_blank'>jelentkezzen be fiókjába</a>, hogy áttekintse az elérhető megújítási árakat.",
    "HowDoIRenewMyLicense": "Hogyan újíthatom meg a jogosítványomat?",
    "HowDoIRenewMyLicenseExplanation": "Licencét megújíthatja, ha felkeresi a <a href='{0}' target='_blank'>szervezetkezelési oldalt</a>. Ha szeretné kihasználni a kedvezményes korai megújítási díjainkat, ne felejtse el megújítani a licence lejárta előtt. Ne aggódjon amiatt, hogy nem tudja, mikor zárul be a korai megújítási lehetősége. Előfizetése lejárta előtt 3 emlékeztető e-mailt fog kapni. 30 nappal, 7 nappal és 1 nappal a lejárat előtt küldjük el.",
    "IsSourceCodeIncluded": "Tartalmazza a licencem a kereskedelmi modulok és témák forráskódját?",
    "IsSourceCodeIncludedExplanation1": "A megvásárolt licenc típusától függően:",
    "IsSourceCodeIncludedExplanation2": "<strong>Csapat</strong>: Az Ön megoldása a modulokat és a témákat NuGet és NPM csomagként használja. Nem tartalmazza a forráskódjukat. Ily módon könnyedén frissítheti ezeket a modulokat és témákat, amikor új verzió érhető el. A modulok és a témák forráskódja azonban nem érhető el.",
    "IsSourceCodeIncludedExplanation3": "<strong>Üzleti/Vállalati</strong>: A csapatlicenc mellett letöltheti bármely szükséges modul vagy téma forráskódját. Még a NuGet/NPM-csomaghivatkozásokat is eltávolíthatja egy adott modulról, és közvetlenül hozzáadhatja a forráskódját a megoldáshoz, hogy teljesen megváltozzon.",
    "IsSourceCodeIncludedExplanation4": "<p>Ha egy modul forráskódját belefoglalja a megoldásba, akkor maximális szabadságot biztosít a modul testreszabásához. Ekkor azonban nem lehet automatikusan frissíteni a modult, amikor új verzió jelenik meg.</p><p>A licencek egyike sem tartalmazza az ABP Suite forráskódját, amely egy külső eszköz, amely kódot generál Önnek és segít az Ön fejlesztéséhez.</p><p>A licenctípusok közötti egyéb különbségekért tekintse meg az <a href=\"{0}\">árazási</a> oldalt.</p>",
    "ChangingDevelopers": "Módosíthatom a szervezetem regisztrált fejlesztőit a jövőben?",
    "ChangingDevelopersExplanation": "Amellett, hogy új fejlesztőket ad hozzá a licenchez, további költségek nélkül módosíthatja a meglévő fejlesztőket is (eltávolíthat egy fejlesztőt, és hozzáadhat egy újat ugyanarra a helyre).",
    "WhatHappensWhenLicenseEnds": "Mi történik, ha lejár a jogosítványom?",
    "WhatHappensWhenLicenseEndsExplanation1": "Az ABP Kereskedelmi licenc típusa <a href=\"{0}\" target=\"_blank\">örök licenc</a>. A licenc lejárta után folytathatja a projekt fejlesztését. És nem köteles megújítani az engedélyt. Licencéhez egyéves frissítési és támogatási csomag tartozik. Ha továbbra is új funkciókat, teljesítményfejlesztéseket, hibajavításokat, támogatást szeretne kapni, és továbbra is használni szeretné az ABP Suite szolgáltatást, minden évben újítsa meg tervét. Ha az engedélye lejár, az alábbi előnyök közül többet nem fog tudni igénybe venni;",
    "WhatHappensWhenLicenseEndsExplanation2": "Az ABP Commercial használatával nem hozhat létre új megoldásokat, de örökké folytathatja meglévő alkalmazásai fejlesztését.",
    "WhatHappensWhenLicenseEndsExplanation3": "Frissítéseket kaphat a MAJOR verziójában található modulokhoz és témákhoz. Például; ha egy modul v3.2.0-s verzióját használja, továbbra is kaphat frissítéseket a modul v3.x.x-hez (v3.3.0, v3.5.2... stb.). De nem kaphat frissítéseket a következő nagyobb verzióhoz (például v4.x, v5.x)",
    "WhatHappensWhenLicenseEndsExplanation4": "A licenc lejárta után nem telepíthet új modulokat és témákat az ABP Commercial platformhoz.",
    "WhatHappensWhenLicenseEndsExplanation5": "Az ABP Suite nem használható.",
    "WhatHappensWhenLicenseEndsExplanation6": "Többé nem veheti igénybe a <a href=\"{0}\">prémium támogatást</a>.",
    "WhatHappensWhenLicenseEndsExplanation7": "Megújíthatja előfizetését, ha továbbra is igénybe kívánja venni ezeket az előnyöket. Ha a licence lejártát követő 1 hónapon belül megújítja előfizetését, 20% kedvezmény jár.",
    "WhenShouldIRenewMyLicense": "Mikor kell megújítanom a jogosítványomat?",
    "WhenShouldIRenewMyLicenseExplanation1": "Ha a licenc lejártát követő <strong>1 hónapon belül</strong> megújítja a licencet, 20 % kedvezményt adunk.",
    "WhenShouldIRenewMyLicenseExplanation2": "Ha a licencet a licenc lejárati dátumától számított 1 hónap elteltével újítja meg, a megújítási ár megegyezik a licenc vételárával, és nem jár kedvezmény a megújításra.",
    "TrialPlan": "Van próbaterv?",
    "TrialPlanExplanation": "Az ABP Commercial egyelőre nem rendelkezik próbatervvel. A Team licencekre 30 napos pénzvisszafizetési garanciát vállalunk. Az első 30 napban csak visszatérítést kérhet. A Business és Enterprise licencek esetén 60% visszatérítést biztosítunk 30 napon belül. Ennek az az oka, hogy a Business és Enterprise licencek tartalmazzák az összes modul és téma teljes forráskódját.",
    "DoYouAcceptBankWireTransfer": "Elfogadja a banki átutalást?",
    "DoYouAcceptBankWireTransferExplanation": "Igen, elfogadunk banki átutalást.<br />Miután banki átutalással elküldte a licencdíjat, küldje el nekünk e-mailben az info@abp.io címre a nyugtát és a kért engedély típusát. Nemzetközi bankszámlánk információi:",
    "HowToUpgrade": "Hogyan lehet frissíteni a meglévő alkalmazásokat, ha új verzió érhető el?",
    "HowToUpgradeExplanation1": "Amikor új alkalmazást hoz létre az ABP Commercial használatával, az összes modul és a téma NuGet és NPM csomagként kerül felhasználásra. Így könnyen frissítheti a csomagokat, ha új verzió érhető el.",
    "HowToUpgradeExplanation2": "A szabványos NuGet/NPM frissítéseken kívül az <a href=\"{0}\">ABP CLI</a> frissítési parancsot biztosít, amely automatikusan megkeresi és frissíti az összes ABP-vel kapcsolatos csomagot a megoldásban.",
    "DatabaseSupport": "Mely adatbázisrendszerek támogatottak?",
    "DatabaseSupportExplanation": "Maga az ABP Framework adatbázis-agnosztikus, és természeténél fogva bármely adatbázis-szolgáltatóval együttműködhet. Tekintse meg az <a href=\"{0}\" target=\"_blank\">adathozzáférési dokumentumot</a> a jelenleg megvalósított szolgáltatók listájáért.",
    "UISupport": "Mely UI keretrendszerek támogatottak?",
    "Supported": "Támogatott",
    "UISupportExplanation": "Maga az ABP-keretrendszer agnosztikus UI-keretrendszer, és bármilyen UI-keretrendszerrel működik. Az indítási sablonok, a modul felhasználói felületek és a témák azonban nem minden felhasználói felület keretrendszerhez kerültek implementálásra. Tekintse meg <a href=\"{0}\">az első lépések dokumentumát</a> a felhasználói felületi lehetőségek naprakész listájáért.",
    "MicroserviceSupport": "Támogatja a mikroszolgáltatási architektúrát?",
    "MicroserviceSupportExplanation1": "Az ABP keretrendszer egyik fő célja, hogy kényelmes infrastruktúrát biztosítson a mikroszolgáltatási megoldások létrehozásához. Tekintse meg a <a href=\"{0}\">mikroszolgáltatási architektúra</a> dokumentumot, hogy megértse, miként segít a mikroszolgáltatási rendszerek létrehozásában.",
    "MicroserviceSupportExplanation2": "Az összes ABP Commercial modult úgy tervezték, hogy támogassa a mikroszolgáltatások telepítési forgatókönyveit (saját API-val és adatbázissal), követve a <a href=\"{0}\">modulfejlesztési bevált gyakorlatokat</a>.",
    "MicroserviceSupportExplanation3": "Példaként kínálunk <a href=\"{0}\">mikroszolgáltatási demómegoldást</a>, amely bemutatja a mikroszolgáltatási architektúra megvalósítását, hogy segítsen létrehozni saját megoldását.",
    "MicroserviceSupportExplanation4": "Tehát a rövid válasz: \"<strong>igen, támogatja a mikroszolgáltatási architektúrát</strong>\".",
    "MicroserviceSupportExplanation5": "A mikroszolgáltatási rendszer azonban megoldás, és minden megoldásnak más-más követelményei, hálózati topológiája, kommunikációs forgatókönyvei, hitelesítési lehetőségei, adatbázis-leválasztási/megosztási döntései, futásidejű konfigurációi, harmadik féltől származó rendszerintegrációk és még sok minden más.",
    "MicroserviceSupportExplanation6": "Az ABP Framework és az ABP Commercial infrastruktúrát biztosít a mikroszolgáltatási forgatókönyvekhez, mikroszolgáltatással kompatibilis modulokat, mintákat és dokumentációt, hogy segítsen felépíteni saját megoldását. De ne várja el, hogy közvetlenül letöltse álmai megoldását, amelyet előre elkészítettek Önnek. Meg kell értenie, és egyes részeit össze kell hangolnia az Ön igényei alapján.",
    "WhereCanIDownloadSourceCode": "Honnan tudom letölteni a forráskódot?",
    "WhereCanIDownloadSourceCodeExplanation": "Az összes ABP modul, Angular csomag és téma forráskódja letölthető az ABP Suite vagy az ABP CLI segítségével. Lásd: <a href=\"{0}\">Hogyan tölthető le a forráskód?</a>",
    "ComputerLimitation": "Hány számítógépre jelentkezhet be egy fejlesztő az ABP fejlesztése során?",
    "ComputerLimitationExplanation": "Kifejezetten <strong>{0} számítógépet</strong> engedélyezünk egyéni/engedéllyel rendelkező fejlesztőnként. Amikor egy fejlesztőnek szüksége van arra, hogy ABP Commercial termékeket fejleszthessen egy harmadik gépen, küldjön egy e-mailt a licenc@abp.io címre, amelyben elmagyarázza a helyzetet, és ezután elvégezzük a megfelelő kiosztást a rendszerünkben.",
    "RefundPolicy": "Van visszatérítési szabályzata?",
    "RefundPolicyExplanation": "Visszatérítést kérhet a licencvásárlástól számított <strong>30 napon belül</strong>. A Vállalati és Vállalati licenctípusok rendelkeznek forráskód-letöltési lehetőséggel, ezért a visszatérítés nem érhető el a Vállalati és Vállalati (és a forráskód fogadására vonatkozó jogot tartalmazó licencek) esetében. Ezenkívül a megújítások és a második licencek vásárlása esetén nem jár visszatérítés.",
    "HowCanIRefundVat": "Hogyan téríthetem vissza az áfát?",
    "HowCanIRefundVatExplanation1": "Ha a 2Checkout használatával fizetett, az áfát 2Checkout fiókján keresztül térítheti vissza:",
    "HowCanIRefundVatExplanation2": "Jelentkezzen be <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\">2Checkout</a>-fiókjába.",
    "HowCanIRefundVatExplanation3": "Keresse meg a megfelelő rendelést, és nyomja meg a \"Késői ÁFA visszatérítés\" gombot (adja meg az áfaazonosítóját)",
    "HowCanIGetMyInvoice": "Hogyan kaphatom meg a számlámat?",
    "HowCanIGetMyInvoiceExplanation": "A licenc megvásárlásához 2 fizetési átjáró áll rendelkezésre: Iyzico és 2Checkout. Ha a licencet a 2Checkout átjárón keresztül vásárolja meg, az elküldi a PDF számlát az Ön e-mail címére, lásd: <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How- do-invoices-work\">2Checkout számlázás.</a> Ha az Iyzico átjárón keresztül, egyedi vásárlási linkkel vagy banki átutalással vásárol, elkészítjük és elküldjük a számlát. A számlát a <a href=\"{0}\">szervezetkezelési oldalon</a> kérheti vagy töltheti le. Mielőtt hozzánk fordulna számláért, ellenőrizze szervezeti menedzsment oldalát!",
    "Forum": "Fórum",
    "SupportExplanation": "Az ABP Commercial licencek prémium fórumtámogatást biztosítanak az ABP Framework szakértőiből álló csapat által.",
    "PrivateTicket": "Privát jegy",
    "PrivateTicketExplanation": "Az Enterprise License magántámogatást is tartalmaz e-mail- és jegyrendszerrel.",
    "AbpSuiteExplanation1": "Az ABP Suite segítségével percek alatt készíthet weboldalakat. Ez egy .NET Core Global eszköz, amely a parancssorból telepíthető.",
    "AbpSuiteExplanation2": "Létrehozhat egy új ABP-megoldást, generálhat CRUD oldalakat az adatbázisból a front-endre. A műszaki áttekintésért tekintse meg a <a href=\"{0}\">dokumentumot</a>",
    "FastEasy": "Gyors és egyszerű",
    "AbpSuiteExplanation3": "Az ABP Suite segítségével könnyedén hozhat létre CRUD oldalakat. Csak meg kell határoznia az entitást és annak tulajdonságait, a többit hagyja, hogy az ABP Suite az Ön számára! Az ABP Suite néhány másodperc alatt generálja az összes szükséges kódot a CRUD oldalához. Támogatja az Angular, MVC és Blazor felhasználói felületeket.",
    "RichOptions": "Gazdag lehetőségek",
    "AbpSuiteExplanation4": "ABP Suite supports multiple UI options like <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\">Razor Pages</a> and <a href=\"https://angular.io\">Angular</a>.It also supports multiple databases like <a href=\"https://www.mongodb.com\">MongoDB</a> and all databases supported by <strong>EntityFramework Core</strong> (MS SQL Server, Oracle, MySql, PostgreSQL and <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\">more</a>).",
    "AbpSuiteExplanation5": "Az a jó, hogy nem kell aggódnia ezek miatt a lehetőségek miatt. Az ABP Suite megérti a projekt típusát, létrehozza a kódot a projekthez, és a generált kódot a megfelelő helyre helyezi a projektben.",
    "SourceCode": "Forráskód",
    "AbpSuiteExplanation6": "Az ABP Suite generálja a forráskódot az Ön számára! Nem generál mágikus fájlokat a weboldal létrehozásához. Az ABP Suite előállítja az <strong>Entity, Repository, Application Service, Code First Migration, JavaScript/TypeScript és CSHTML/HTML</strong> forráskódját, valamint a szükséges felületeket. Az ABP Suite a szoftverfejlesztés <strong>legjobb gyakorlatai</strong> szerint is előállítja a kódot, így nem kell aggódnia a generált kód minősége miatt.",
    "AbpSuiteExplanation7": "Mivel a generált CRUD oldal építőelemeinek forráskódja a megfelelő alkalmazási rétegekben található, könnyen módosíthatja a forráskódot, és beillesztheti egyéni/üzleti logikáját a generált kódba.",
    "CrossPlatform": "Cross Platform",
    "AbpSuiteExplanation8": "Az ABP Suite .NET Core-bal készült, és több platformon működik. Webalkalmazásként fut a helyi számítógépen. Futtathatja <strong>Windows</strong>, <strong>Mac</strong> és <strong>Linux</strong> rendszeren.",
    "OtherFeatures": "Más funkciók",
    "OtherFeatures1": "Egyszerűen frissíti a megoldáson a <strong>NuGet</strong> és az <strong>NPM</strong> csomagokat.",
    "OtherFeatures2": "Újragenerálja a már létrehozott oldalakat a semmiből.",
    "OtherFeatures3": "Új megoldásokat hoz létre",
    "ThanksForCreatingProject": "Köszönjük, hogy létrehozta projektjét!",
    "HotToRunSolution": "Hogyan futtasd a megoldásodat?",
    "HotToRunSolutionExplanation": "A megoldás konfigurálásával és futtatásával kapcsolatos információkért tekintse meg az első lépések dokumentumát.",
    "GettingStarted": "Elkezdeni",
    "WebAppDevTutorial": "Web App Dev oktatóanyag",
    "WebAppDevTutorialExplanation": "Tekintse meg a webalkalmazás-fejlesztési oktatóanyagot a lépésről lépésre bemutatott fejlesztési mintáért.",
    "Document": "Dokumentum",
    "UsingABPSuiteToCURD": "Az ABP Suite használata a CRUD oldalgeneráláshoz és szerszámozáshoz",
    "SeeABPSuiteDocument": "Az ABP Suite használatának megismeréséhez tekintse meg az ABP Suite dokumentumot.",
    "AskQuestionsOnSupport": "Kérdéseket tehet fel az ABP kereskedelmi támogatással kapcsolatban.",
    "Documentation": "Dokumentáció",
    "SeeModulesDocument": "Az összes kereskedelmi(pro) modul és a hozzájuk tartozó dokumentumok listáját lásd a modulok dokumentumában.",
    "Pricing": "Árazás",
    "PricingExplanation": "Válassza ki azokat a szolgáltatásokat és funkciókat, amelyekre ma vállalkozásának szüksége van. Vállalkozása növekedésével könnyedén frissíthet.",
    "Team": "Csapat",
    "Business": "Üzleti",
    "Enterprise": "Vállalkozás",
    "Custom": "Egyedi",
    "IncludedDeveloperLicenses": "Fejlesztői licencek mellékelve",
    "CustomLicenceOrAdditionalServices": "Egyedi licencre vagy további szolgáltatásokra van szüksége?",
    "CustomOrVolumeLicense": "Egyedi vagy mennyiségi licenc",
    "LiveTrainingSupport": "Élő képzés és támogatás",
    "AndMore": "és több",
    "AdditionalDeveloperLicense": "További fejlesztői licenc",
    "ProjectCount": "Projektek száma",
    "AllProModules": "Minden pro modul",
    "AllProThemes": "Minden profi téma",
    "AllProStartupTemplates": "Minden pro indítási sablon",
    "SourceCodeOfAllModules": "Az összes modul forráskódja",
    "SourceCodeOfAllThemes": "Az összes téma forráskódja",
    "PerpetualLicense": "Örökös engedély",
    "UnlimitedServerDeployment": "Korlátlan szervertelepítés",
    "YearUpgrade": "1 év frissítés",
    "YearPremiumForumSupport": "1 éves prémium fórumtámogatás",
    "ForumSupportIncidentCountYear": "A fórum támogatási eseményeinek száma/év",
    "PrivateTicketEmailSupport": "Privát jegy és e-mail támogatás",
    "BuyNow": "Vásárolj most",
    "PayViaAmexCard": "Hogyan fizethetek AMEX kártyámmal?",
    "PayViaAmexCardDescription": "Az alapértelmezett „Iyzico” fizetési átjáró a biztonsági intézkedések miatt elutasíthat egyes AMEX hitelkártyákat. Ebben az esetben a „2Checkout” alternatív fizetési átjárón keresztül fizethet.",
    "ThankYou": "Köszönöm",
    "InvalidReCaptchaErrorMessage": "Hiba történt a reCAPTCHA ellenőrzése során. Kérlek próbáld újra.",
    "CompanyName": "Cégnév",
    "YourCompanyName": "A céged neve",
    "FirstName": "Keresztnév",
    "LastName": "Vezetéknév",
    "Optional": "Választható",
    "YourFirstName": "A keresztneved",
    "YourLastName": "Vezetékneved",
    "SpecialOffer": "Különleges ajánlat",
    "SpecialOfferMessage": "Siess! Az árak korlátozott ideig érvényesek.",
    "DiscountRequest": "Kedvezményigénylés",
    "DiscountRequestDescribeCustomerQuestion": "Az alábbiak közül melyik jellemzi Önt?",
    "DiscountRequestStudentEmailMessage": "Az e-mail címnek tartalmaznia kell az „edu” szót.",
    "DiscountRequestDeveloperCount": "Hány fejlesztő vagy?",
    "DiscountRequestDeveloperCountExceedMessage": "Nem biztosítunk kedvezményes licencet azoknak a cégeknek, amelyeknek több mint {0} fejlesztője van.",
    "DiscountRequestOrganizationName": "Cég/szervezet/iskola neve",
    "Website": "Weboldal",
    "GithubUsername": "GitHub felhasználónév",
    "PhoneNumber": "Telefonszám",
    "Country": "Ország",
    "DescribeABPCommercialUsage": "Mutassa be a fejleszteni kívánt projektet az APB Commercial alapján",
    "DiscountRequestCertifyInformationMessage": "Tanúsítom, hogy minden információ a valóságnak megfelel.",
    "DiscountRequestReceived": "Megkaptuk kedvezményigényét.",
    "DiscountRequestStatusMessage": "Az Ön által megadott adatok ellenőrzése után válaszolunk Önnek.",
    "MVCOrRazorPages": "MVC (Razor Pages)",
    "Angular": "Szögletes",
    "Blazor": "Blazor",
    "New": "Új",
    "MongoDB": "MongoDB",
    "EBookDDD": "E-könyv tartományvezérelt tervezés",
    "PracticalGuideForImplementingDDD": "Ez a könyv egy gyakorlati útmutató a tartományvezérelt tervezés megvalósításához az ABP-keretrendszerrel.",
    "IntroducingDDD": "A tartományvezérelt tervezés bemutatása",
    "DDDLayersAndCleanArchitecture": "DDD rétegek és tiszta architektúra",
    "LayeringOfADotnetSolution": ".NET-megoldás rétegezése",
    "ImplementingDDDBuildingBlocks": "DDD építőelemek megvalósítása",
    "DomainVsApplicationLogic": "Domain Logic vs Application Logic",
    "SamplesAndDiscussions": "Minták és megbeszélések",
    "Free": "Ingyenes",
    "Download": "Letöltés",
    "DDDEBook": "DDD E-könyv",
    "ImplementingDDD": "Domainvezérelt tervezés megvalósítása",
    "DDDBookExplanation": "Gyakorlati útmutató a tartományvezérelt tervezés megvalósításához az ABP-keretrendszerrel.",
    "Overview": "Áttekintés",
    "DDDBookPracticalGuide": "Ez egy gyakorlati útmutató a Domain Driven Design (DDD) megvalósításához. Míg a megvalósítás részletei az ABP Framework infrastruktúrán alapulnak, az alapvető koncepciók, elvek és minták bármilyen megoldásban alkalmazhatók, még akkor is, ha nem .NET-megoldásról van szó.",
    "TableOfContents": "Tartalomjegyzék",
    "IntroductionToImplementingDDD": "Bevezetés a tartományvezérelt tervezés megvalósításába",
    "WhatIsDDD": "Mi az a tartományvezérelt tervezés?",
    "Implementation": "Végrehajtás",
    "TheBigPicture": "A nagy kép",
    "TheBuildingBlock": "Az építőelem",
    "ExampleUseCase": "Példa használati eset",
    "DomainAndApplicationLogic": "Domain logika és alkalmazáslogika",
    "Author": "Szerző",
    "PublishedOn": "Közzétéve:",
    "Page": "oldal",
    "FreeEBook": "Ingyenes e-könyv",
    "EBookSignInForDownload": "Az e-könyv letöltéséhez jelentkezzen be",
    "SignIn": "Bejelentkezés",
    "Or": "Vagy",
    "TellUsAboutYourself": "Mesélj egy kicsit magadról",
    "Surname": "Vezetéknév",
    "DoYouAgreePrivacyPolicy": "Elfogadom az <a href=\"/TermsConditions\">Általános Szerződési Feltételeket<a/> és az <a href=\"/Privacy\">Adatvédelmi irányelveket</a>.",
    "VolosoftMarketingInformationMessage": "Információkat, tippeket és ajánlatokat szeretnék kérni a Megoldások vállalkozásoknak és szervezeteknek, valamint a Volosoft egyéb termékeiről és szolgáltatásairól.",
    "VolosoftSharingInformationMessage": "Szeretném, ha a Volosoft megosztaná az adataimat kiválasztott partnerekkel, hogy releváns információkat kaphassak termékeikről és szolgáltatásaikról.",
    "WeWillSendYouADownloadLink": "Az e-könyv letöltésére szolgáló linket elküldtük a(z) {0} címre.<br/> Ellenőrizze a beérkező leveleket/levélszemét/spam dobozokat!",
    "InvalidFormInputs": "Kérjük, írja be az űrlapon megadott érvényes adatokat.",
    "DDDBookEmailBody": "Köszönöm. <br /> Könyve letöltéséhez <a href=\"{0}\">kattintson ide</a>.",
    "FreeDDDEBook": "Ingyenes DDD e-könyv",
    "StartFree": "Kezdje ingyen",
    "FreeTrial": "Ingyenes próbaverzió",
    "AcceptsMarketingCommunications": " Igen, szeretnék kapni az ABP Commercial marketingkommunikációit.",
    "PurposeOfUsage": "A felhasználás célja",
    "Industry": "Ipar",
    "Choose": "- Választ -",
    "CompanyOrganizationName": "Cég/szervezet neve",
    "CompanySize": "Cég Méret",
    "Next": "Következő",
    "StartTrial": "Indítsa el az ingyenes próbaverziómat",
    "ContactUsIssues": "Ha bármilyen problémája van, lépjen kapcsolatba velünk",
    "TrialActivatedWarning": "Kedves {0}! Egy felhasználó csak 1 ingyenes próbaidőszakra jogosult. Már felhasználta a próbaidőszakot.",
    "ActivationRequirement": "Már egy lépésre van az ingyenes próbaidőszak megkezdésétől.<br>E-mailt küldtünk a(z) <b>{0}</b> címre, hogy aktiváljuk fiókját. Ellenőrizze a beérkező levelek/levélszemét/levélszemét-fiókokat!",
    "SaveAndDownload": "Mentés és letöltés",
    "CompanyNameValidationMessage": "A cég neve túl hosszú!",
    "AddressValidationMessage": "A cím túl hosszú!",
    "TaxNoValidationMessage": "Az ADÓ/ÁFA szám túl hosszú!",
    "NotesValidationMessage": "A megjegyzésmező túl hosszú!",
    "CheckYourBillingInfo": "Számlát csak egyszer készíthet! A számla elkészítése előtt ellenőrizze számlázási adatait.",
    "Volo.AbpIo.Commercial:030000": "Már felhasználta a próbaidőszakot.",
    "Volo.AbpIo.Commercial:030001": "Ez a szervezetnév már létezik.",
    "StartYourFreeTrial": "Indítsa el az ingyenes próbaidőszakát",
    "TrialLicenseModelInvalidErrorMessage": "A következő mezők egyike érvénytelen: Ország neve, vállalat mérete, iparág vagy felhasználás célja.",
    "Trial": "Próba",
    "Purchased": "Vásárolt",
    "PurchaseLicense": "Vásárlási engedély",
    "PurchaseTrialLicenseMessage": "A licence lejárati dátuma: {0}. <br> Ha továbbra is használni szeretné az ingyenes próbaidőszak alatt létrehozott projekteket, módosítania kell a licenckulcsokat az <code>appsettings.secrets.json</code> fájlokban. Itt van a licenckulcsod:",
    "TrialLicenseExpireMessage": "Ön a próbalicencet használja, és a próbalicence a következő napon lejár: {0}.",
    "TryForFree": "Próbáld ki ingyen",
    "TrialLicenseExpiredInfo": "A próbalicensz időszaka lejárt!",
    "CommercialNewsletterConfirmationMessage": "Elfogadom az <a href=\"https://commercial.abp.io/TermsConditions\">Általános Szerződési Feltételeket</a> és az <a href=\"https://commercial.abp.io/Privacy\">Adatvédelmi irányelveket </a>."
  }
}