{
  "culture": "hu",
  "texts": {
    "OrganizationManagement": "Szervezetmenedzsment",
    "OrganizationList": "Szervezet lista",
    "Volo.AbpIo.Commercial:010003": "Ön nem tulajdonosa ennek a szervezetnek!",
    "OrganizationNotFoundMessage": "Nem található szervezet!",
    "DeveloperCount": "Kiosztott/összesen fejlesztő",
    "QuestionCount": "Fennmaradó/összes kérdés",
    "Unlimited": "Korlátlan",
    "Owners": "Tulajdonosok",
    "Owner": "Tulajdonos",
    "AddMember": "Tag hozzáadása lehetőségre",
    "AddNewOwner": "Új tulajdonos hozzáadása",
    "AddNewDeveloper": "Új fejlesztő hozzáadása",
    "UserName": "Felhasználónév",
    "Name": "Név",
    "EmailAddress": "Email cím",
    "Developers": "Fejlesztők",
    "LicenseType": "Jogosítvány típus",
    "Manage": "Kezelése",
    "SetDefault": "Beállítás alapértelmezettként",
    "DefaultOrganization": "Alapértelmezett",
    "StartDate": "Kezdő dátum",
    "EndDate": "Befejezés dátuma",
    "Modules": "Modulok",
    "LicenseExtendMessage": "Licencének lejárati dátumát meghosszabbították erre: {0}",
    "LicenseUpgradeMessage": "A licence frissítve a következőre: {0}",
    "LicenseExtendAdnUpgradeMessage": "Licencét meghosszabbítottuk {0}-ig, licenctervét pedig frissítettük a következőre: {1}.",
    "LicenseAddDeveloperMessage": "{0} fejlesztő hozzáadva a licencéhez",
    "Volo.AbpIo.Commercial:010004": "Nem található a megadott felhasználó! A felhasználónak már regisztrálnia kell.",
    "MyOrganizations": "Szervezeteim",
    "ApiKey": "API kulcs",
    "UserNameNotFound": "Nincs {0} felhasználónévvel rendelkező felhasználó",
    "SuccessfullyAddedToNewsletter": "Köszönjük, hogy feliratkozott hírlevelünkre!",
    "MyProfile": "A profilom",
    "EmailNotValid": "Kérjük valós e-mail címet adjon meg!",
    "JoinOurMarketingNewsletter": "Csatlakozzon marketing hírlevelünkhöz",
    "WouldLikeToReceiveMarketingMaterials": "Szeretnék marketing anyagokat kapni, például termékajánlatokat és különleges ajánlatokat.",
    "StartUsingYourLicenseNow": "Kezdje el használni licencét most!",
    "WelcomePage": "Üdvözlő oldal",
    "UnsubscriptionExpireEmail": "Leiratkozás a licenc lejárati dátumára emlékeztető e-mailekről",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Ez az e-mail-előfizetés csak emlékezteti a licenc lejárati dátumát.",
    "UnsubscribeFromLicenseExpireEmails": "Ha nem szeretne e-maileket kapni a licence lejárati dátumáról, bármikor leiratkozhat.",
    "Unsubscribe": "Leiratkozás",
    "NotOrganizationMember": "Ön egyetlen szervezetnek sem tagja.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Sikeresen leiratkozott",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Többé nem kap emlékeztető e-mailt a licenc lejárati dátumára.",
    "IndexPageHeroSection": "<span class=\"first-line\">Teljes</span><span class=\"second-line\"> webfejlesztői platform</span><span class=\"third-line\">beépített <img src= \"{0}\" width=\"110\" class=\"ml-1\" /> keretrendszer</span>",
    "AbpCommercialShortDescription": "Az ABP Commercial előre beépített alkalmazásmodulokat, gyors alkalmazásfejlesztési eszközöket, professzionális felhasználói felületi témákat, prémium támogatást és még sok mást kínál.",
    "LiveDemo": "Élő Demo",
    "GetLicence": "Szerezzen engedélyt",
    "Application": "Alkalmazás",
    "StartupTemplates": "Indítási sablonok",
    "Startup": "üzembe helyezés",
    "Templates": "Sablonok",
    "Developer": "Fejlesztő",
    "Tools": "Eszközök",
    "Premium": "Prémium",
    "PremiumSupport": "Prémium támogatás",
    "PremiumForumSupport": "Prémium fórum támogatás",
    "UI": "UI",
    "Themes": "Témák",
    "JoinOurNewsletter": "Csatlakozzon hírlevelünkhöz",
    "Send": "Küld",
    "WhatIsABPFramework": "MI AZ ABP KERET?",
    "OpenSourceBaseFramework": "Nyílt forráskódú alapkeretrendszer",
    "ABPFrameworkExplanation": "<p class=\"lead\">Az ABP Commercial az ABP-keretrendszeren alapul, amely egy nyílt forráskódú és közösségvezérelt webalkalmazás-keretrendszer az ASP.NET Core számára.</p><p>Az ABP-keretrendszer kiváló infrastruktúrát biztosít karbantartható, bővíthető íráshoz. és tesztelhető kód a bevált gyakorlatokkal.</p><p>Beépített és integrált népszerű eszközök, amelyeket már ismer. Alacsony tanulási görbe, könnyű alkalmazkodás, kényelmes fejlődés.</p>",
    "Modular": "Moduláris",
    "MicroserviceCompatible": "Mikroszolgáltatás kompatibilis",
    "DomainDrivenDesignInfrastructure": "Domainvezérelt tervezési infrastruktúra",
    "MultiTenancy": "Több bérlés",
    "DistributedMessaging": "Elosztott üzenetküldés",
    "DynamicProxying": "Dinamikus proxy",
    "BackgroundJobs": "Háttér állások",
    "AuditLogging": "Audit naplózás",
    "BLOBStoring": "BLOB tárolás",
    "BundlingMinification": "Csomagolás és kicsinyítés",
    "AdvancedLocalization": "Speciális lokalizáció",
    "ManyMore": "Sok más",
    "ExploreTheABPFramework": "Fedezze fel az ABP-keretrendszert",
    "WhyUseTheABPCommercial": "Miért használja az ABP Commercial-t?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\">A vállalati szintű webalkalmazások készítése bonyolult és időigényes lehet.</p><p>Az ABP Commercial tökéletes alapinfrastruktúrát kínál minden modern vállalati szintű ASP.NET Core számára. alapú megoldások. A tervezéstől a telepítésig a teljes fejlesztési ciklust az ABP beépített szolgáltatásai és moduljai hajtják végre.</p>",
    "StartupTemplatesShortDescription": "Az indítási sablonok segítségével néhány másodperc alatt ugrásszerűen elkezdheti a projektet.",
    "UIFrameworksOptions": "UI keretrendszerek beállításai;",
    "DatabaseProviderOptions": "Adatbázis-szolgáltató lehetőségek;",
    "PreBuiltApplicationModules": "Előre elkészített alkalmazásmodulok",
    "PreBuiltApplicationModulesShortDescription": "A legtöbb általános alkalmazási követelményt már kidolgozták az Ön számára, mint újrafelhasználható modulok.",
    "Account": "fiók",
    "Blogging": "Blogolás",
    "Identity": "Identitás",
    "IdentityServer": "Identity Server",
    "Saas": "Saas",
    "LanguageManagement": "Nyelvkezelés",
    "TextTemplateManagement": "Szöveg sablon kezelése",
    "See All Modules": "Lásd az összes modult",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "Az ABP Suite az ABP Commercial kiegészítő eszköze.",
    "AbpSuiteExplanation": "Lehetővé teszi weboldalak készítését percek alatt. Ez egy .NET Core Global eszköz, amely a parancssorból telepíthető. Létrehozhat egy új ABP-megoldást, generálhat CRUD oldalakat az adatbázisból a front-endre.",
    "Details": "Részletek",
    "LeptonTheme": "Lepton téma",
    "ProfessionalModernUIThemes": "Professzionális, modern felhasználói felület témák",
    "LeptonThemeExplanation": "A Lepton a Bootstrap adminisztrátori témák széles skáláját kínálja, amelyek szilárd alapot jelentenek minden olyan projekthez, amelyhez rendszergazdai irányítópult szükséges.",
    "DefaultTheme": "Alapértelmezett téma",
    "MaterialTheme": "Anyag téma",
    "Default2Theme": "Alapértelmezett 2 téma",
    "DarkTheme": "Sötét téma",
    "DarkBlueTheme": "Sötétkék téma",
    "LightTheme": "Fény téma",
    "ProudToWorkWith": "Büszke, hogy vele dolgozhat",
    "OurConsumers": "Vállalkozások és fejlesztők ezrei támaszkodnak az ABP Commercialra világszerte több mint 70 országban.",
    "JoinOurConsumers": "Csatlakozzon hozzájuk, és készítsen gyorsan csodálatos termékeket.",
    "AdditionalServicesExplanation": "További vagy egyedi szolgáltatásokra van szüksége? <strong>Mi és partnereink tudunk biztosítani;</strong>",
    "CustomProjectDevelopment": "Egyedi projektfejlesztés",
    "CustomProjectDevelopmentExplanation": "Elkötelezett fejlesztők egyedi projektjeihez.",
    "PortingExistingProjects": "Meglévő projektek portolása",
    "PortingExistingProjectsExplanation": "A régi projektek migrálása az ABP platformra.",
    "LiveSupport": "Élő támogatás",
    "LiveSupportExplanation": "Élő távoli támogatási lehetőség, amikor szüksége van rá.",
    "Training": "Kiképzés",
    "TrainingExplanation": "Dedikált képzés a fejlesztők számára.",
    "OnBoarding": "Beszállás",
    "OnBoardingExplanation": "Segítség a fejlesztői, CI és CD környezetek beállításában.",
    "PrioritizedTechnicalSupport": "Kiemelt műszaki támogatás",
    "PremiumSupportExplanation": "Az ABP keretrendszer nagyszerű közösségi támogatása mellett támogató csapatunk kiemelten válaszol a kereskedelmi felhasználók technikai kérdéseire és problémáira.",
    "SeeTheSupportOptions": "Lásd a Támogatási lehetőségeket",
    "Contact": "Kapcsolatba lépni",
    "TellUsWhatYouNeed": "Mondja el, mire van szüksége.",
    "YourMessage": "Az üzeneted",
    "YourFullName": "A teljes neved",
    "FirstNameField": "Keresztnév",
    "LastNameField": "Vezetéknév",
    "EmailField": "Email cím",
    "YourEmailAddress": "Az email címed",
    "HowMayWeHelpYou": "Hogyan segíthetünk?",
    "SendMessage": "Üzenet küldése",
    "Success": "Siker",
    "WeWillReplyYou": "Megkaptuk üzenetét, és hamarosan felvesszük Önnel a kapcsolatot.",
    "GoHome": "Hazamenni",
    "CreateLiveDemo": "Élő bemutató létrehozása",
    "RegisterToTheNewsletter": "Regisztráljon a hírlevélre, hogy információkat kapjon az ABP.IO-ról, beleértve az új kiadásokat stb.",
    "EnterYourEmailOrLogin": "Adja meg e-mail címét a bemutató létrehozásához, vagy <a href=\"{0}\">jelentkezzen be</a> meglévő fiókjával.",
    "ApplicationTemplate": "Alkalmazássablon",
    "ApplicationTemplateExplanation": "Az alkalmazásindítási sablon új webalkalmazás létrehozására szolgál.",
    "EfCoreProvider": "Entity Framework (az SQL Server, a MySQL, a PostgreSQL, az Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\">és egyebeket</a> támogatja)",
    "AlreadyIncludedInTemplateModules": "A következő modulok már szerepelnek és konfigurálva vannak ebben a sablonban:",
    "ApplicationTemplateArchitecture": "Ez az alkalmazássablon támogatja a többszintű architektúrát is, ahol a felhasználói felület, az API réteg és a hitelesítési szolgáltatás fizikailag el van választva.",
    "SeeTheGuideOrGoToTheLiveDemo": "A sablonnal kapcsolatos technikai információkért tekintse meg a fejlesztői útmutatót, vagy lépjen az élő bemutatóra.",
    "DeveloperGuide": "Fejlesztői útmutató",
    "ModuleTemplate": "Modul sablon",
    "ModuleTemplateExplanation1": "Létre szeretne hozni egy modult, és újra szeretné használni a különböző alkalmazásokban? Ez az indítási sablon mindent előkészít az újrafelhasználható <strong>alkalmazásmodul</strong> vagy egy <strong>mikroszolgáltatás</strong> létrehozásához.",
    "ModuleTemplateExplanation2": "<p>Támogathat egyetlen vagy több felhasználói felületi keretrendszert, egyetlen vagy több adatbázis-szolgáltatót egyetlen modulhoz. Az indítási sablon úgy van konfigurálva, hogy az egység- és integrációs tesztinfrastruktúrán kívül minimális alkalmazásban futtassa és <strong>tesztelje a modult</strong>. </p> <p>Tekintse meg a fejlesztői útmutatót a sablonnal kapcsolatos technikai információkért.</p>",
    "WithAllStyleOptions": "minden stílus opcióval",
    "Demo": "Demó",
    "SeeAllModules": "Lásd az összes modult",
    "ABPCLIExplanation": "Az ABP CLI (Command Line Interface) egy parancssori eszköz az ABP alapú megoldások általános műveleteinek végrehajtására.",
    "ABPSuiteEasilyCURD": "Az ABP Suite egy olyan eszköz, amellyel könnyedén hozhat létre CRUD oldalakat",
    "WeAreHereToHelp": "Azért vagyunk itt, hogy <span class=\"zero-text\">segítsünk</span>",
    "BrowseOrAskQuestion": "Böngésszen a súgótémáink között, kereshet a gyakran ismételt kérdések között, vagy feltehet nekünk kérdést a <a href=\"{0}\" class=\"text-success\">kapcsolatfelvételi űrlap</a> használatával.",
    "SearchQuestionPlaceholder": "Keressen a gyakran ismételt kérdések között",
    "WhatIsTheABPCommercial": "Mi az az ABP Commercial?",
    "WhatAreDifferencesThanAbpFramework": "Mi a különbség a nyílt forráskódú ABP Framework és az ABP Commercial között?",
    "AbpCommercialMetaTitle": "ABP Commercial – Teljes webfejlesztési platform: {0} | ABP Commercial",
    "AbpCommercialMetaDescription": "Az ABP Commercial a nyílt forráskódú ABP keretrendszerre épülő előre beépített alkalmazásmodulok, gyorsfejlesztő eszközök, UI témák és szolgáltatások készlete.",
    "ABPCommercialExplanation": "Az ABP Commercial prémium modulok, eszközök, témák és szolgáltatások készlete a nyílt forráskódú <a target=\"_blank\" href=\"{0}\">ABP keretrendszerre</a> épül fel. Az ABP Commercial-t ugyanaz a csapat fejleszti és támogatja az ABP keretrendszer mögött.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> Az <a target=\"_blank\" href=\"{0}\">ABP-keretrendszer</a> egy moduláris, tematikus, mikroszolgáltatásokkal kompatibilis alkalmazásfejlesztési keretrendszer az ASP.NET Core számára. Teljes architektúrát és erős infrastruktúrát biztosít ahhoz, hogy a saját üzleti kódjára összpontosítson, ahelyett, hogy megismételné magát minden új projektnél. A szoftverfejlesztés bevált gyakorlatain és a már ismert népszerű eszközökön alapul. </p> <p> Az ABP keretrendszer teljesen ingyenes, nyílt forráskódú és közösségvezérelt. Ingyenes témát és néhány előre beépített modult is biztosít (pl. személyazonosság-kezelés és bérlőkezelés).</p>",
    "VisitTheFrameworkVSCommercialDocument": "További információért keresse fel a következő linket: <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "Az ABP Commercial a következő előnyökkel egészíti ki az ABP keretrendszert;",
    "Professional": "Szakmai",
    "UIThemes": "UI témák",
    "EnterpriseModules": "Vállalati használatra kész, funkciókban gazdag, előre beépített <a href=\"{0}\">alkalmazásmodulok</a> (pl. Identity Server-kezelés, SaaS-kezelés, nyelvkezelés)",
    "ToolingToSupport": "Eszközök a fejlesztési termelékenység támogatására (pl. <a href=\"{0}\">ABP Suite</a>)",
    "PremiumSupportLink": "Prémium <a href=\"{0}\" target=\"_blank\">támogatás</a>",
    "WhatDoIDownloadABPCommercial": "Mit töltsek le az ABP Commercial megvásárlásakor?",
    "CreateUnlimitedSolutions": "Miután megvásárolta az ABP Commercial licencet, korlátlan számú megoldást hozhat létre a <a href=\"{0}\">Kezdő lépések</a> dokumentumban leírtak szerint.",
    "ABPCommercialSolutionExplanation": "Amikor új alkalmazást hoz létre, egy Visual Studio-megoldást (indítósablont) kap a preferenciái alapján. A letöltött megoldás már telepített és konfigurált kereskedelmi modulokat és témákat tartalmaz. Ha szeretné, eltávolíthat egy előre telepített modult, vagy hozzáadhat egy másik modult. Az összes modul és téma alapértelmezés szerint NuGet/NPM-csomagokat használ.",
    "StartDevelopWithTutorials": "A letöltött megoldás jól megtervezett és dokumentált. Az <a href=\"{0}\">oktatóanyagok</a> követésével megkezdheti saját üzleti kódjának fejlesztését az alapján.",
    "TryTheCommercialDemo": "Kipróbálhatja a <a href=\"{0}\">bemutatót</a>, hogy megtekintsen egy mintaalkalmazást, amelyet az ABP Commercial indítósablonjával hoztak létre.",
    "HowManyProducts": "Hány különböző terméket/megoldást építhetek az ABP Commercial használatával?",
    "HowManyProductsExplanation": "ABP-projekt létrehozásának nincs korlátozása. Tetszőleges számú projektet hozhat létre, fejleszthet és tölthet fel különböző szerverekre.",
    "HowManyDevelopers": "Hány fejlesztő dolgozhat az ABP Commercialon?",
    "HowManyDevelopersExplanation": "Az ABP Commercial licencek fejlesztőnként érvényesek. A különböző licenctípusokhoz eltérő fejlesztői korlátok vonatkoznak. Bármilyen licenctípushoz azonban bármikor hozzáadhat további fejlesztőket. Tekintse meg az <a href=\"{0}\">árakat</a> a licenctípusokról, a fejlesztői korlátokról és a további fejlesztői költségekről.",
    "ChangingLicenseType": "Frissíthetem a licenctípusomat később?",
    "ChangingLicenseTypeExplanation": "Magasabb licencre frissíthet, ha az aktív licencidőszakon belül kifizeti a különbözetet. Ha magasabb licenccsomagra frissít, megkapja az új csomag előnyeit, de a licencfrissítés nem módosítja a licenc lejárati dátumát. Emellett új fejlesztői helyeket is hozzáadhat meglévő licencéhez, lásd \"Hány fejlesztő dolgozhat az ABP Commercialon?\"",
    "LicenseExtendUpgradeDiff": "Mi a különbség a licenc kiterjesztése és a frissítés között?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Meghosszabbítás:</strong> A licensz meghosszabbításával/megújításával továbbra is prémium támogatást kap, valamint kisebb-nagyobb frissítéseket kap a modulokhoz és témákhoz. Emellett folytathatja az új projektek létrehozását. És továbbra is használhatja az ABP Suite-ot, amely felgyorsítja a fejlesztést. A licensz meghosszabbításakor 1 év hozzáadódik a licensz lejárati dátumához.<hr/> <strong>Frissítés:</strong> licenszének frissítésével magasabb licenszcsomagra lép fel, amely további előnyöket biztosít. Tekintse meg a <a href=\"/pricing\">licensz-összehasonlító táblázatot</a> , hogy megtekinthesse a licensztervek közötti különbségeket. <strong>Másrészt, amikor frissít, a licensz lejárati dátuma nem változik!</strong> A licensz lejárati dátumának meghosszabbításához meg kell hosszabbítania a licenszet.",
    "LicenseRenewalCost": "Mennyibe kerül a licenc megújítása 1 év után?",
    "LicenseRenewalCostExplanation": "A normál csapatlicenc megújítási (meghosszabbítási) ára {0} USD, a normál üzleti licencé {1} USD, a normál vállalati licencé pedig {2} USD. Ha Ön már ügyfél, <a href='{3}' target='_blank'>jelentkezzen be fiókjába</a>, hogy áttekintse az elérhető megújítási árakat.",
    "HowDoIRenewMyLicense": "Hogyan újíthatom meg a jogosítványomat?",
    "HowDoIRenewMyLicenseExplanation": "Licencét megújíthatja, ha felkeresi a <a href='{0}' target='_blank'>szervezetkezelési oldalt</a>. Ha szeretné kihasználni a kedvezményes korai megújítási díjainkat, ne felejtse el megújítani a licence lejárta előtt. Ne aggódjon amiatt, hogy nem tudja, mikor zárul be a korai megújítási lehetősége. Előfizetése lejárta előtt 3 emlékeztető e-mailt fog kapni. 30 nappal, 7 nappal és 1 nappal a lejárat előtt küldjük el.",
    "IsSourceCodeIncluded": "Tartalmazza a licencem a kereskedelmi modulok és témák forráskódját?",
    "IsSourceCodeIncludedExplanation1": "A megvásárolt licenc típusától függően:",
    "IsSourceCodeIncludedExplanation2": "<strong>Csapat</strong>: Az Ön megoldása a modulokat és a témákat NuGet és NPM csomagként használja. Nem tartalmazza a forráskódjukat. Ily módon könnyedén frissítheti ezeket a modulokat és témákat, amikor új verzió érhető el. A modulok és a témák forráskódja azonban nem érhető el.",
    "IsSourceCodeIncludedExplanation3": "<strong>Üzleti/Vállalati</strong>: A csapatlicenc mellett letöltheti bármely szükséges modul vagy téma forráskódját. Még a NuGet/NPM-csomaghivatkozásokat is eltávolíthatja egy adott modulról, és közvetlenül hozzáadhatja a forráskódját a megoldáshoz, hogy teljesen megváltozzon.",
    "IsSourceCodeIncludedExplanation4": "<p>Ha egy modul forráskódját belefoglalja a megoldásba, akkor maximális szabadságot biztosít a modul testreszabásához. Ekkor azonban nem lehet automatikusan frissíteni a modult, amikor új verzió jelenik meg.</p><p>A licencek egyike sem tartalmazza az ABP Suite forráskódját, amely egy külső eszköz, amely kódot generál Önnek és segít az Ön fejlesztéséhez.</p><p>A licenctípusok közötti egyéb különbségekért tekintse meg az <a href=\"{0}\">árazási</a> oldalt.</p>",
    "ChangingDevelopers": "Módosíthatom a szervezetem regisztrált fejlesztőit a jövőben?",
    "ChangingDevelopersExplanation": "Amellett, hogy új fejlesztőket ad hozzá a licenchez, további költségek nélkül módosíthatja a meglévő fejlesztőket is (eltávolíthat egy fejlesztőt, és hozzáadhat egy újat ugyanarra a helyre).",
    "WhatHappensWhenLicenseEnds": "Mi történik, ha lejár a licenszidőm?",
    "WhatHappensWhenLicenseEndsExplanation1": "Az ABP Kereskedelmi engedély <a href=\"{0}\" target=\"_blank\">örök érvényű licensz</a> . A licensz lejárta után folytathatja a projekt fejlesztését. És nem köteles megújítani a jogosítványát. licenszéhez egyéves frissítés és támogatási terv tartozik. Ha továbbra is új funkciókat, teljesítménynöveléseket, hibajavításokat, támogatást szeretne kapni, és továbbra is használni szeretné az ABP Suite szolgáltatást, meg kell újítania a licenszet. Ha a licensze lejár, nem részesül a következő előnyökben:",
    "WhatHappensWhenLicenseEndsExplanation2": "Az ABP Commercial használatával nem hozhat létre új megoldásokat, de a meglévő alkalmazásait örökre továbbfejlesztheti.",
    "WhatHappensWhenLicenseEndsExplanation3": "Frissítéseket kaphat a MINOR verzión belüli modulokhoz és témákhoz (kivéve az RC vagy Preview verziókat). Például: ha egy modul v3.2.0-s verzióját használja, továbbra is kaphat frissítéseket a modul v3.2.x-hez (v3.2.1, v3.2.5... stb.). De nem kaphat frissítéseket a következő fő- vagy mellékverzióhoz (például v3.3.0, v3.3.3, 4.xx stb.). Például amikor a licensze lejárt, a legutóbbi kiadás a 4.4.3 volt, és később, amikor a 4.4.4-es és a 4.5.0-s verzió is megjelent, akkor hozzáférhet a v4.4.X-hez, de nem elérheti a v4.5.X.",
    "WhatHappensWhenLicenseEndsExplanation4": "A licensz lejárta után nem telepíthet új modulokat és témákat az ABP Commercial platformhoz.",
    "WhatHappensWhenLicenseEndsExplanation5": "Az ABP Suite nem használható.",
    "WhatHappensWhenLicenseEndsExplanation6": "A <a href=\"{0}\">prémium támogatást</a> már nem kaphatja meg.",
    "WhatHappensWhenLicenseEndsExplanation7": "Meghosszabbíthatja (megújíthatja) a licencét, ha továbbra is szeretné igénybe venni ezeket az előnyöket. Ha a licenc lejártát követő <strong>1 hónapon belül</strong> meghosszabbítja licencét, a következő kedvezmények érvényesek: Csapat Licenc {0}; Üzleti licenc {1}; Vállalati licenc {2}.",
    "discountForYears": "{0}% kedvezmény {1} évre",
    "WhatHappensWhenLicenseEndsExplanation8": "Az Ön által generált ABP projekteket nem tároljuk a szervereinken. Ezért az Ön felelőssége a letöltött forráskód megőrzése. Amikor a licensze lejár, nincs mód a generált ABP projekt forráskódjának lekérésére.",
    "WhenShouldIRenewMyLicense": "Mikor kell megújítanom a jogosítványomat?",
    "WhenShouldIRenewMyLicenseExplanation": "Ha a licenc lejártát követő <strong>1 hónapon belül</strong> megújítja a licencet, a következő kedvezmények érvényesek: Csapatlicenc {0}; Üzleti engedély {1}; Vállalati licenc {2}. Ha azonban a licenc lejárati dátuma óta <strong>1 hónap</strong> után megújítja a licencet, a megújítási ár megegyezik a licenc vásárlási árával, és nem jár kedvezmény a megújításra.",
    "TrialPlan": "Van próbaterv?",
    "TrialPlanExplanation": "14 napos próbaidővel rendelkezik az ABP Commercial csapat licenszéhez. További információért látogasson el <a href={0} target='_blank'>ide</a> . Továbbá a Team licenszekre 30 napos pénz-visszafizetési garanciát biztosítunk. Az első 30 napban csak visszatérítést kérhet. A Business és Enterprise licenszek esetén 30 napon belül 60%-os visszatérítést biztosítunk. Ennek az az oka, hogy a Business és Enterprise licenszek tartalmazzák az összes modul és téma teljes forráskódját.",
    "DoYouAcceptBankWireTransfer": "Elfogadja a banki átutalást?",
    "DoYouAcceptBankWireTransferExplanation": "Igen, elfogadunk banki átutalást.<br />Miután banki átutalással elküldte a licencdíjat, küldje el nekünk e-mailben az accounting@abp.io címre nyugtát és a kért engedély típusát. Nemzetközi bankszámlánk információi:",
    "HowToUpgrade": "Hogyan lehet frissíteni a meglévő alkalmazásokat, ha új verzió érhető el?",
    "HowToUpgradeExplanation1": "Amikor új alkalmazást hoz létre az ABP Commercial használatával, az összes modul és a téma NuGet és NPM csomagként kerül felhasználásra. Így könnyen frissítheti a csomagokat, ha új verzió érhető el.",
    "HowToUpgradeExplanation2": "A szabványos NuGet/NPM frissítéseken kívül az <a href=\"{0}\">ABP CLI</a> frissítési parancsot biztosít, amely automatikusan megkeresi és frissíti az összes ABP-vel kapcsolatos csomagot a megoldásban.",
    "DatabaseSupport": "Mely adatbázisrendszerek támogatottak?",
    "DatabaseSupportExplanation": "Maga az ABP Framework adatbázis-agnosztikus, és természeténél fogva bármely adatbázis-szolgáltatóval együttműködhet. Tekintse meg az <a href=\"{0}\" target=\"_blank\">adathozzáférési dokumentumot</a> a jelenleg megvalósított szolgáltatók listájáért.",
    "UISupport": "Mely UI keretrendszerek támogatottak?",
    "Supported": "Támogatott",
    "UISupportExplanation": "Maga az ABP-keretrendszer agnosztikus UI-keretrendszer, és bármilyen UI-keretrendszerrel működik. Az indítási sablonok, a modul felhasználói felületek és a témák azonban nem minden felhasználói felület keretrendszerhez kerültek implementálásra. Tekintse meg <a href=\"{0}\">az első lépések dokumentumát</a> a felhasználói felületi lehetőségek naprakész listájáért.",
    "MicroserviceSupport": "Támogatja a mikroszolgáltatási architektúrát?",
    "MicroserviceSupportExplanation1": "Az ABP keretrendszer egyik fő célja, hogy kényelmes infrastruktúrát biztosítson a mikroszolgáltatási megoldások létrehozásához. Tekintse meg a <a href=\"{0}\">mikroszolgáltatási architektúra</a> dokumentumot, hogy megértse, miként segít a mikroszolgáltatási rendszerek létrehozásában.",
    "MicroserviceSupportExplanation2": "Az összes ABP Commercial modult úgy tervezték, hogy támogassa a mikroszolgáltatások telepítési forgatókönyveit (saját API-val és adatbázissal), követve a <a href=\"{0}\">modulfejlesztési bevált gyakorlatokat</a>.",
    "MicroserviceSupportExplanation3": "Példaként kínálunk <a href=\"{0}\">mikroszolgáltatási demómegoldást</a>, amely bemutatja a mikroszolgáltatási architektúra megvalósítását, hogy segítsen létrehozni saját megoldását.",
    "MicroserviceSupportExplanation4": "Tehát a rövid válasz: \"<strong>igen, támogatja a mikroszolgáltatási architektúrát</strong>\".",
    "MicroserviceSupportExplanation5": "A mikroszolgáltatási rendszer azonban megoldás, és minden megoldásnak más-más követelményei, hálózati topológiája, kommunikációs forgatókönyvei, hitelesítési lehetőségei, adatbázis-leválasztási/megosztási döntései, futásidejű konfigurációi, harmadik féltől származó rendszerintegrációk és még sok minden más.",
    "MicroserviceSupportExplanation6": "Az ABP Framework és az ABP Commercial infrastruktúrát biztosít a mikroszolgáltatási forgatókönyvekhez, mikroszolgáltatással kompatibilis modulokat, mintákat és dokumentációt, hogy segítsen felépíteni saját megoldását. De ne várja el, hogy közvetlenül letöltse álmai megoldását, amelyet előre elkészítettek Önnek. Meg kell értenie, és egyes részeit össze kell hangolnia az Ön igényei alapján.",
    "WhereCanIDownloadSourceCode": "Honnan tudom letölteni a forráskódot?",
    "WhereCanIDownloadSourceCodeExplanation": "Az összes ABP modul, Angular csomag és téma forráskódja letölthető az ABP Suite vagy az ABP CLI segítségével. Lásd: <a href=\"{0}\">Hogyan tölthető le a forráskód?</a>",
    "ComputerLimitation": "Hány számítógépre jelentkezhet be egy fejlesztő az ABP fejlesztése során?",
    "ComputerLimitationExplanation": "Kifejezetten <strong>{0} számítógépet</strong> engedélyezünk egyéni/engedéllyel rendelkező fejlesztőnként. Amikor egy fejlesztőnek szüksége van arra, hogy ABP Commercial termékeket fejleszthessen egy harmadik gépen, küldjön egy e-mailt a licenc@abp.io címre, amelyben elmagyarázza a helyzetet, és ezután elvégezzük a megfelelő kiosztást a rendszerünkben.",
    "RefundPolicy": "Van visszatérítési szabályzata?",
    "RefundPolicyExplanation": "Visszatérítést kérhet a licencvásárlástól számított <strong>30 napon belül</strong>. A Vállalati és Vállalati licenctípusok rendelkeznek forráskód-letöltési lehetőséggel, ezért a visszatérítés nem érhető el a Vállalati és Vállalati (és a forráskód fogadására vonatkozó jogot tartalmazó licencek) esetében. Ezenkívül a megújítások és a második licencek vásárlása esetén nem jár visszatérítés.",
    "HowCanIRefundVat": "Hogyan téríthetem vissza az áfát?",
    "HowCanIRefundVatExplanation1": "Ha a 2Checkout használatával fizetett, az áfát 2Checkout fiókján keresztül térítheti vissza:",
    "HowCanIRefundVatExplanation2": "Jelentkezzen be <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\">2Checkout</a>-fiókjába.",
    "HowCanIRefundVatExplanation3": "Keresse meg a megfelelő rendelést, és nyomja meg a \"Késői ÁFA visszatérítés\" gombot (adja meg az áfaazonosítóját)",
    "HowCanIGetMyInvoice": "Hogyan kaphatom meg a számlámat?",
    "HowCanIGetMyInvoiceExplanation": "A licenc megvásárlásához 2 fizetési átjáró áll rendelkezésre: Iyzico és 2Checkout. Ha a licencet a 2Checkout átjárón keresztül vásárolja meg, az elküldi a PDF számlát az Ön e-mail címére, lásd: <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How- do-invoices-work\">2Checkout számlázás.</a> Ha az Iyzico átjárón keresztül, egyedi vásárlási linkkel vagy banki átutalással vásárol, elkészítjük és elküldjük a számlát. A számlát a <a href=\"{0}\">szervezetkezelési oldalon</a> kérheti vagy töltheti le. Mielőtt hozzánk fordulna számláért, ellenőrizze szervezeti menedzsment oldalát!",
    "Forum": "Fórum",
    "SupportExplanation": "Az ABP Commercial licencek prémium fórumtámogatást biztosítanak az ABP Framework szakértőiből álló csapat által.",
    "PrivateTicket": "Privát jegy",
    "PrivateTicketExplanation": "Az Enterprise License magántámogatást is tartalmaz e-mail- és jegyrendszerrel.",
    "AbpSuiteExplanation1": "Az ABP Suite segítségével percek alatt készíthet weboldalakat. Ez egy .NET Core Global eszköz, amely a parancssorból telepíthető.",
    "AbpSuiteExplanation2": "Létrehozhat egy új ABP-megoldást, generálhat CRUD oldalakat az adatbázisból a front-endre. A műszaki áttekintésért tekintse meg a <a href=\"{0}\">dokumentumot</a>",
    "FastEasy": "Gyors és egyszerű",
    "AbpSuiteExplanation3": "Az ABP Suite segítségével könnyedén hozhat létre CRUD oldalakat. Csak meg kell határoznia az entitást és annak tulajdonságait, a többit hagyja, hogy az ABP Suite az Ön számára! Az ABP Suite néhány másodperc alatt generálja az összes szükséges kódot a CRUD oldalához. Támogatja az Angular, MVC és Blazor felhasználói felületeket.",
    "RichOptions": "Gazdag lehetőségek",
    "AbpSuiteExplanation4": "ABP Suite supports multiple UI options like <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\">Razor Pages</a> and <a href=\"https://angular.io\">Angular</a>.It also supports multiple databases like <a href=\"https://www.mongodb.com\">MongoDB</a> and all databases supported by <strong>EntityFramework Core</strong> (MS SQL Server, Oracle, MySql, PostgreSQL and <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\">more</a>).",
    "AbpSuiteExplanation5": "Az a jó, hogy nem kell aggódnia ezek miatt a lehetőségek miatt. Az ABP Suite megérti a projekt típusát, létrehozza a kódot a projekthez, és a generált kódot a megfelelő helyre helyezi a projektben.",
    "SourceCode": "Forráskód",
    "AbpSuiteExplanation6": "Az ABP Suite generálja a forráskódot az Ön számára! Nem generál mágikus fájlokat a weboldal létrehozásához. Az ABP Suite előállítja az <strong>Entity, Repository, Application Service, Code First Migration, JavaScript/TypeScript és CSHTML/HTML</strong> forráskódját, valamint a szükséges felületeket. Az ABP Suite a szoftverfejlesztés <strong>legjobb gyakorlatai</strong> szerint is előállítja a kódot, így nem kell aggódnia a generált kód minősége miatt.",
    "AbpSuiteExplanation7": "Mivel a generált CRUD oldal építőelemeinek forráskódja a megfelelő alkalmazási rétegekben található, könnyen módosíthatja a forráskódot, és beillesztheti egyéni/üzleti logikáját a generált kódba.",
    "CrossPlatform": "Cross Platform",
    "AbpSuiteExplanation8": "Az ABP Suite .NET Core-bal készült, és több platformon működik. Webalkalmazásként fut a helyi számítógépen. Futtathatja <strong>Windows</strong>, <strong>Mac</strong> és <strong>Linux</strong> rendszeren.",
    "OtherFeatures": "Más funkciók",
    "OtherFeatures1": "Egyszerűen frissíti a megoldáson a <strong>NuGet</strong> és az <strong>NPM</strong> csomagokat.",
    "OtherFeatures2": "Újragenerálja a már létrehozott oldalakat a semmiből.",
    "OtherFeatures3": "Új megoldásokat hoz létre",
    "ThanksForCreatingProject": "Köszönjük, hogy létrehozta projektjét!",
    "HotToRunSolution": "Hogyan futtasd a megoldásodat?",
    "HotToRunSolutionExplanation": "A megoldás konfigurálásával és futtatásával kapcsolatos információkért tekintse meg az első lépések dokumentumát.",
    "GettingStarted": "Elkezdeni",
    "WebAppDevTutorial": "Web App Dev oktatóanyag",
    "WebAppDevTutorialExplanation": "Tekintse meg a webalkalmazás-fejlesztési oktatóanyagot a lépésről lépésre bemutatott fejlesztési mintáért.",
    "Document": "Dokumentum",
    "UsingABPSuiteToCURD": "Az ABP Suite használata a CRUD oldalgeneráláshoz és szerszámozáshoz",
    "SeeABPSuiteDocument": "Az ABP Suite használatának megismeréséhez tekintse meg az ABP Suite dokumentumot.",
    "AskQuestionsOnSupport": "Kérdéseket tehet fel az ABP kereskedelmi támogatással kapcsolatban.",
    "Documentation": "Dokumentáció",
    "SeeModulesDocument": "Az összes kereskedelmi(pro) modul és a hozzájuk tartozó dokumentumok listáját lásd a modulok dokumentumában.",
    "Pricing": "Árazás",
    "PricingExplanation": "Válassza ki azokat a szolgáltatásokat és funkciókat, amelyekre ma vállalkozásának szüksége van. Vállalkozása növekedésével könnyedén frissíthet.",
    "Team": "Csapat",
    "Business": "Üzleti",
    "Enterprise": "Vállalkozás",
    "Custom": "Egyedi",
    "IncludedDeveloperLicenses": "Fejlesztői licencek mellékelve",
    "CustomLicenceOrAdditionalServices": "Egyedi licencre vagy további szolgáltatásokra van szüksége?",
    "CustomOrVolumeLicense": "Egyedi vagy mennyiségi licenc",
    "LiveTrainingSupport": "Élő képzés és támogatás",
    "AndMore": "és több",
    "AdditionalDeveloperLicense": "További fejlesztői licenc",
    "ProjectCount": "Projektek száma",
    "AllProModules": "Minden pro modul",
    "AllProThemes": "Minden profi téma",
    "AllProStartupTemplates": "Minden pro indítási sablon",
    "SourceCodeOfAllModules": "Az összes modul forráskódja",
    "SourceCodeOfAllThemes": "Az összes téma forráskódja",
    "PerpetualLicense": "Örökös engedély",
    "UnlimitedServerDeployment": "Korlátlan szervertelepítés",
    "YearUpgrade": "1 év frissítés",
    "YearPremiumForumSupport": "1 éves prémium fórumtámogatás",
    "ForumSupportIncidentCountYear": "A fórum támogatási eseményeinek száma/év",
    "PrivateTicketEmailSupport": "Privát jegy és e-mail támogatás",
    "BuyNow": "Vásárolj most",
    "PayViaAmexCard": "Hogyan fizethetek AMEX kártyámmal?",
    "PayViaAmexCardDescription": "Az alapértelmezett „Iyzico” fizetési átjáró a biztonsági intézkedések miatt elutasíthat egyes AMEX hitelkártyákat. Ebben az esetben a „2Checkout” alternatív fizetési átjárón keresztül fizethet.",
    "ThankYou": "Köszönöm",
    "InvalidReCaptchaErrorMessage": "Hiba történt a reCAPTCHA ellenőrzése során. Kérlek próbáld újra.",
    "CompanyName": "Cégnév",
    "YourCompanyName": "A céged neve",
    "FirstName": "Keresztnév",
    "LastName": "Vezetéknév",
    "Optional": "Választható",
    "YourFirstName": "A keresztneved",
    "YourLastName": "Vezetékneved",
    "SpecialOffer": "Különleges ajánlat",
    "SpecialOfferMessage": "Siess! Az árak korlátozott ideig érvényesek.",
    "DiscountRequest": "Kedvezményigénylés",
    "DiscountRequestDescribeCustomerQuestion": "Az alábbiak közül melyik jellemzi Önt?",
    "DiscountRequestStudentEmailMessage": "Az e-mail címnek tartalmaznia kell az „edu” szót.",
    "DiscountRequestDeveloperCount": "Hány fejlesztő vagy?",
    "DiscountRequestDeveloperCountExceedMessage": "Nem biztosítunk kedvezményes licencet azoknak a cégeknek, amelyeknek több mint {0} fejlesztője van.",
    "DiscountRequestOrganizationName": "Cég/szervezet/iskola neve",
    "Website": "Weboldal",
    "GithubUsername": "GitHub felhasználónév",
    "PhoneNumber": "Telefonszám",
    "Country": "Ország",
    "DescribeABPCommercialUsage": "Mutassa be a fejleszteni kívánt projektet az APB Commercial alapján",
    "DiscountRequestCertifyInformationMessage": "Tanúsítom, hogy minden információ a valóságnak megfelel.",
    "DiscountRequestReceived": "Megkaptuk kedvezményigényét.",
    "DiscountRequestStatusMessage": "Az Ön által megadott adatok ellenőrzése után válaszolunk Önnek.",
    "MVCOrRazorPages": "MVC (Razor Pages)",
    "Angular": "Szögletes",
    "Blazor": "Blazor",
    "New": "Új",
    "MongoDB": "MongoDB",
    "EBookDDD": "E-könyv tartományvezérelt tervezés",
    "PracticalGuideForImplementingDDD": "Ez a könyv egy gyakorlati útmutató a tartományvezérelt tervezés megvalósításához az ABP-keretrendszerrel.",
    "IntroducingDDD": "A tartományvezérelt tervezés bemutatása",
    "DDDLayersAndCleanArchitecture": "DDD rétegek és tiszta architektúra",
    "LayeringOfADotnetSolution": ".NET-megoldás rétegezése",
    "ImplementingDDDBuildingBlocks": "DDD építőelemek megvalósítása",
    "DomainVsApplicationLogic": "Domain Logic vs Application Logic",
    "SamplesAndDiscussions": "Minták és megbeszélések",
    "Free": "Ingyenes",
    "Download": "Letöltés",
    "DDDEBook": "DDD E-könyv",
    "ImplementingDDD": "Domainvezérelt tervezés megvalósítása",
    "DDDBookExplanation": "Gyakorlati útmutató a tartományvezérelt tervezés megvalósításához az ABP-keretrendszerrel.",
    "Overview": "Áttekintés",
    "DDDBookPracticalGuide": "Ez egy gyakorlati útmutató a Domain Driven Design (DDD) megvalósításához. Míg a megvalósítás részletei az ABP Framework infrastruktúrán alapulnak, az alapvető koncepciók, elvek és minták bármilyen megoldásban alkalmazhatók, még akkor is, ha nem .NET-megoldásról van szó.",
    "TableOfContents": "Tartalomjegyzék",
    "IntroductionToImplementingDDD": "Bevezetés a tartományvezérelt tervezés megvalósításába",
    "WhatIsDDD": "Mi az a tartományvezérelt tervezés?",
    "Implementation": "Végrehajtás",
    "TheBigPicture": "A nagy kép",
    "TheBuildingBlock": "Az építőelem",
    "ExampleUseCase": "Példa használati eset",
    "DomainAndApplicationLogic": "Domain logika és alkalmazáslogika",
    "Author": "Szerző",
    "PublishedOn": "Közzétéve:",
    "Page": "oldal",
    "FreeEBook": "Ingyenes e-könyv",
    "EBookSignInForDownload": "Az e-könyv letöltéséhez jelentkezzen be",
    "SignIn": "Bejelentkezés",
    "Or": "Vagy",
    "TellUsAboutYourself": "Mesélj egy kicsit magadról",
    "Surname": "Vezetéknév",
    "DoYouAgreePrivacyPolicy": "Elfogadom az <a href=\"/TermsConditions\">Általános Szerződési Feltételeket<a/> és az <a href=\"/Privacy\">Adatvédelmi irányelveket</a>.",
    "VolosoftMarketingInformationMessage": "Információkat, tippeket és ajánlatokat szeretnék kérni a Megoldások vállalkozásoknak és szervezeteknek, valamint a Volosoft egyéb termékeiről és szolgáltatásairól.",
    "VolosoftSharingInformationMessage": "Szeretném, ha a Volosoft megosztaná az adataimat kiválasztott partnerekkel, hogy releváns információkat kaphassak termékeikről és szolgáltatásaikról.",
    "WeWillSendYouADownloadLink": "Az e-könyv letöltésére szolgáló linket elküldtük a(z) {0} címre.<br/> Ellenőrizze a beérkező leveleket/levélszemét/spam dobozokat!",
    "InvalidFormInputs": "Kérjük, írja be az űrlapon megadott érvényes adatokat.",
    "DDDBookEmailBody": "Köszönöm. <br /> Könyve letöltéséhez <a href=\"{0}\">kattintson ide</a>.",
    "StartFree": "Kezdje ingyen",
    "FreeTrial": "Ingyenes próbaverzió",
    "AcceptsMarketingCommunications": " Igen, szeretnék kapni az ABP Commercial marketingkommunikációit.",
    "PurposeOfUsage": "A felhasználás célja",
    "Industry": "Ipar",
    "Choose": "- Választ -",
    "CompanyOrganizationName": "Cég/szervezet neve",
    "CompanySize": "Cég Méret",
    "Next": "Következő",
    "StartTrial": "Indítsa el az ingyenes próbaverziómat",
    "ContactUsQuestions": "Ha bármilyen kérdése van, forduljon hozzánk",
    "TrialActivatedWarning": "Egy felhasználó csak 1 ingyenes próbaidőszakra jogosult. Ön már használta a próbaidőszakot.",
    "ActivationRequirement": "Még egy lépés választja el a próbaidőszak megkezdésétől.<br> Az adatok ellenőrzése után aktiváljuk a licenszét. A licensz aktiválása után e-mailt küldünk a következő címre: <b>{0}</b> . Ne aggódjon, ez a folyamat nem tart sokáig!",
    "SaveAndDownload": "Mentés és letöltés",
    "CompanyNameValidationMessage": "A cég neve túl hosszú!",
    "AddressValidationMessage": "A cím túl hosszú!",
    "TaxNoValidationMessage": "Az ADÓ/ÁFA szám túl hosszú!",
    "NotesValidationMessage": "A megjegyzésmező túl hosszú!",
    "CheckYourBillingInfo": "Számlát csak egyszer készíthet! A számla elkészítése előtt ellenőrizze számlázási adatait.",
    "StartYourFreeTrial": "Indítsa el az ingyenes próbaidőszakát",
    "TrialLicenseModelInvalidErrorMessage": "A következő mezők egyike érvénytelen: Ország neve, vállalat mérete, iparág vagy felhasználás célja.",
    "Trial": "Próba",
    "Purchased": "Vásárolt",
    "PurchaseNow": "Vásároljon most",
    "PurchaseTrialLicenseMessage": "A licence lejárati dátuma: {0}. <br> Ha továbbra is használni szeretné az ingyenes próbaidőszak alatt létrehozott projekteket, módosítania kell a licenckulcsokat az <code>appsettings.secrets.json</code> fájlokban. Itt van a licenckulcsod:",
    "TrialLicenseExpireMessage": "Ön a próbalicencet használja, és a próbalicence a következő napon lejár: {0}.",
    "TryForFree": "Próbáld ki ingyen",
    "TrialLicenseExpiredInfo": "A próbalicensz időszaka lejárt!",
    "DowngradeLicensePlan": "Leválthatok alacsonyabb licenszcsomagra a jövőben?",
    "DowngradeLicensePlanExplanation": "Nem módosíthatja a meglévő licenszcsomagot. De vásárolhat egy új alacsonyabb licenszcsomagot, és folytathatja a fejlesztést az új licenszen. Miután megvásárolta az alacsonyabb licenszet, csak be kell jelentkeznie az új licenszcsomagba az ABP CLI paranccsal: ` abp login <username> -o <organization> `.",
    "LicenseTransfer": "Egy licenszet át lehet adni egyik fejlesztőről a másikra?",
    "LicenseTransferExplanation": "Igen! licensz vásárlásakor Ön lesz a licensz tulajdonosa, így hozzáférhet a szervezetkezelési oldalhoz. Egy szervezetnek tulajdonosi és fejlesztői szerepei vannak. A tulajdonosok kezelhetik a fejlesztői helyeket, és fejlesztőket rendelhetnek hozzá. Minden kijelölt fejlesztő az ABP CLI paranccsal jelentkezik be a rendszerbe, és fejlesztési és támogatási jogosultságokkal rendelkezik.",
    "UserOwnerDescription": "A szervezet „Tulajdonosa” a fiók adminisztrátora. licenszek vásárlásával és fejlesztők kiosztásával irányítja a szervezetet. A „Tulajdonos” nem írhat kódot az ABP Commercial projektekben, nem töltheti le az ABP mintaprojekteket, és nem tehet fel kérdéseket a támogatási webhelyen. Ha mindezeket meg akarja tenni, fel kell vennie magát fejlesztőként is.",
    "UserDeveloperDescription": "A „fejlesztők” kódot írhatnak az ABP Commercial projektekben, letölthetik az ABP mintaprojekteket, és kérdéseket tehetnek fel a támogatási webhelyen. Másrészt a „Fejlesztők” nem kezelhetik ezt a szervezetet.",
    "RemoveCurrentUserFromOrganizationWarningMessage": "Ön eltávolítja magát saját szervezetéből. A továbbiakban nem fogja tudni kezelni ezt a szervezetet, megerősíti?",
    "RenewExistingOrganizationOrCreateNewOneMessage": "Az alábbi \"Meghosszabbítás most\" gomb(ok)ra kattintva megújíthatja szervezete(i) licenszét, és így 1 évvel meghosszabbíthatja a licensz lejárati dátumát. Ha folytatja a fizetést, új szervezete lesz. Új szervezetnél szeretné folytatni?",
    "PurchaseTrialOrganizationOrCreateNewOneMessage": "Van próbaengedélyed. A próbalicensz megvásárlásához kattintson a Vásárlás most gombra. Ha folytatja a fizetést, új szervezete lesz. Új szervezetnél szeretné folytatni?",
    "ExtendNow": "Hosszabbítsa meg most",
    "CreateNewOrganization": "Hozzon létre egy új szervezetet",
    "RenewLicenseEarly": "Ha korán megújítom a jogosítványomat, megkapom a teljes évet?",
    "RenewLicenseEarylExplanation": "Ha megújítja a licenszet a licensz lejárati dátuma előtt, 1 év hozzáadódik a licensz lejárati dátumához. Például, ha licensze {0}-06-06-án lejár, és {0}-01-01-én újítja meg, az új licensz lejárati dátuma {1}-06-06.",
    "OpenSourceWebApplication": "Nyílt forráskódú webes alkalmazás",
    "CompleteWebDevelopment": "Komplett webfejlesztés",
    "ABPFrameworkDescription": "Az ABP Framework egy komplett infrastruktúra modern webalkalmazások létrehozásához a szoftverfejlesztés bevált gyakorlatainak és konvencióinak követésével.",
    "CommunityDescription": "Ossza meg tapasztalatait az ABP keretrendszerrel!",
    "GetStarted": "Fogj neki",
    "Views": "nézetek",
    "LatestPosts": "Legutóbbi bejegyzések",
    "PreBuiltApplication": "Előre beépített alkalmazás",
    "DatabaseProviders": "Adatbázis-szolgáltatók",
    "UIFrameworks": "UI keretrendszerek",
    "UsefulLinks": "Hasznos Linkek",
    "Platform": "Felület",
    "CoolestCompaniesUseABPCommercial": "A legmenőbb cégek már használják az <span class=\"fw-6\">ABP Commercial-t.</span>",
    "UserInterface": "Felhasználói felület",
    "APIGateway": "API átjáró",
    "Microservice": "Mikroszolgáltatás",
    "Database": "Adatbázis",
    "Architecture": "Építészet",
    "MicroserviceArchitectureExplanation": "Ez egy teljes megoldás-architektúra, amely több alkalmazásból, API-átjáróból, mikroszolgáltatásból és adatbázisokból áll, hogy a legújabb technológiákkal skálázható mikroszolgáltatási megoldást építsenek ki.",
    "BusinessLogic": "Üzleti logika",
    "DataAccessLayer": "Adatelérési réteg",
    "Monolith": "Monolit",
    "ModularArchitectureExplanation": "Ez az indítási sablon egy réteges, moduláris és DDD-alapú megoldás-architektúrát kínál tiszta és karbantartható kódbázis létrehozásához.",
    "SeeDetails": "Lásd a részleteket",
    "SeeDocumentation": "Nézze meg a Dokumentációt",
    "Bs5Compatible": "Bootstrap 5 kompatibilis professzionális téma, tökéletes az adminisztrátori webhelyhez.",
    "LeptonXTheme": "LeptonX téma",
    "LeptonXDark": "LeptonX sötét",
    "LeptonXLight": "LeptonX Light",
    "LeptonXSemiDark": "LeptonX félsötét",
    "BuiltOnBs5Library": "Bootstrap 5 könyvtárra építve",
    "FullyCompatibleWithBs5": "100%-ban kompatibilis a Bootstrap 5 HTML struktúrájával és CSS osztályaival",
    "ResponsiveAndMobileCompatible": "Reszponzív, mobil kompatibilis, RTL támogatás",
    "ProvidesStylesForDatatables": "Stílusokat biztosít az adattáblákhoz",
    "MultipleLayoutOptions": "Többféle elrendezési lehetőség",
    "EasilyInstallAndUpgrade": "Könnyen telepíthető és frissíthető",
    "SupportForum": "Támogatói fórum",
    "TrustedBy": "Megbízható",
    "OurPricing": "<span class=\"gradient-commercial\">Áraink</span>",
    "Plans": "Tervek",
    "NameSurname": "Név vezetéknév",
    "Unspecified": "Meg nem határozott",
    "LicenceType": "Licensz típus",
    "LicenseDiscountWarning": "EZ A KEDVEZMÉNYOLDAL ALAPÉRTELMEZETT KEDVEZMÉNYKÓDOT HASZNÁL ÉS A VOLOSOFT FEJLESZTŐK SZÁMÁRA VAN. AZ ALÁBBI VÁSÁRLÁSI LINKEK NEM MŰKÖDNEK.",
    "DiscountedLicenseExplanation": "Ezek a licenszárak kis startup vállalkozásokra, egyéni fejlesztőkre, hallgatókra, nonprofit szervezetekre és projektekre vonatkoznak!",
    "General": "Általános",
    "License": "Licensz",
    "Development": "Fejlődés",
    "Payment": "Fizetés",
    "WatchExplainerVideo": "Találkozzunk! Nézze meg a magyarázó videót",
    "LightDarkAndSemiDarkThemes": "Világos, Sötét és Félsötét",
    "LeptonXThemeExplanation": "A Lepton Theme módosíthatja a témát a rendszerbeállításoknak megfelelően.",
    "PRO": "PRO",
    "WelcomeToABPCommercial": "Üdvözöljük az <span class=\"gradient-commercial\">ABP Commercial oldalán!</span>",
    "YourAccountDetails": "Fiók adatai",
    "OrganizationName": "Szervezet neve",
    "AddDevelopers": "Adjon hozzá fejlesztőket",
    "StartDevelopment": "Kezdje el a fejlesztést",
    "CreateAndRunApplicationUsingStartupTemplate": "Ismerje meg, hogyan hozhat létre és futtathat új webalkalmazást az ABP Commercial indítási sablon használatával.",
    "CommunityDescription2": "A <span class=\"fw-6\">Community.abp.io</span> egy olyan hely, ahol az emberek megoszthatnak ABP-vel kapcsolatos cikkeket. Keressen cikkeket, oktatóanyagokat, kódmintákat, esettanulmányokat, és találkozzon Önnel azonos sávban élő emberekkel.",
    "UseABPSuiteExplanation": "Az ABP Suite segítségével töltse le a modulok és témák forráskódját.",
    "ManageModulesWithSuite": "ABP-moduljait a Suite segítségével is kezelheti.",
    "LearnHowToInstallSuite": "Ismerje meg az ABP Suite telepítését és használatát.",
    "SeeMore": "Többet látni",
    "SeeLess": "Lásd Kevesebb",
    "LayeredSolutionStructure": "Réteges megoldás szerkezete",
    "LayeredSolutionStructureExplanation": "A megoldás a tartományvezérelt tervezési elvek és minták alapján rétegzett, hogy elkülönítse az üzleti logikát az infrastruktúrától és az integrációktól, és maximalizálja a kód karbantarthatóságát és újrafelhasználhatóságát. Az ABP Framework már tartalmaz absztrakciókat, alaposztályokat és útmutatókat a DDD tényleges megvalósításához az alkalmazásban.",
    "MultipleUIOptions": "Több felhasználói felület opció",
    "MultipleUIOptionsExplanation": "Szeretjük a felhasználói felület létrehozásának különböző módjait. Ez az indítási megoldás három különböző felhasználói felületi keretrendszert biztosít az üzleti alkalmazás számára.",
    "MultipleDatabaseOptions": "Több adatbázis-beállítás",
    "MultipleDatabaseOptionsExplanation": "Két adatbázis-szolgáltató lehetősége van (amellett, hogy mindkettőt egyetlen alkalmazásban használhatja). Az Entity Framework Core segítségével bármilyen relációs adatbázissal dolgozhat, és opcionálisan használja a Dappert, ha alacsony szintű lekérdezéseket kell írnia a jobb teljesítmény érdekében. A MongoDB egy másik lehetőség, ha dokumentum alapú NoSQL adatbázist kell használnia. Noha ezek a szolgáltatók jól integráltak, absztraktáltak és előre konfiguráltak, valójában bármilyen adatbázis-rendszerrel kapcsolatba léphet, amelyet a .NET-tel használhat.",
    "ModularArchitectureExplanation2": "A a legfőbb szempont az ABP.IO platformon. Az alkalmazás összes funkciója jól elkülönített opcionális modulokra van felosztva. Az indítási megoldás már előre telepítve tartalmazza az alapvető <a href=\"@Url.Page(\"/Modules\")\" class=\"text-primary\">ABP Commercial modulokat</a> . Saját modulokat is létrehozhat, hogy moduláris rendszert építsen fel saját alkalmazásához.",
    "MultiTenancyForSaasBusiness": "Többérlős felépítés az Ön SaaS-üzleteihez",
    "MultiTenancyForSaasBusinessExplanation": "Az ABP Commercial teljes körű, többbérlős rendszert biztosít SaaS (Software-as-a-Service) rendszereinek létrehozásához. Lehetővé teszi a bérlők számára, hogy megosszák vagy rendelkezzenek saját adatbázisokkal az on-the-fly adatbázis-létrehozó és migrációs rendszerrel.",
    "MicroserviceStartupSolution": "Mikroszolgáltatás indítási megoldás",
    "MicroserviceArchitectureExplanation2": "Beszerezheti következő mikroszolgáltatási rendszeréhez, hogy kihasználhassa az előre elkészített alapmegoldást és tiszta élményt.",
    "PreIntegratedTools": "Előre integrálva a népszerű eszközökbe",
    "PreIntegratedToolsExplanation": "A megoldás már integrálva van az ipari szabványos eszközökbe és technológiákba, miközben Ön bármikor módosíthatja azokat, és integrálhatja kedvenc eszközeibe.",
    "SingleSignOnAuthenticationServer": "Egyszeri bejelentkezéses hitelesítési kiszolgáló",
    "SingleSignOnAuthenticationServerExplanation": "A megoldás rendelkezik egy hitelesítési kiszolgálóalkalmazással, amelyet a többi alkalmazás egyszeri bejelentkezési kiszolgálóként használ API hozzáférés-kezelési szolgáltatásokkal. Az IdentityServeren alapul.",
    "WebAppsWithGateways": "2 webalkalmazás 2 API átjáróval",
    "WebAppsWithGatewaysExplanation": "A megoldás két webalkalmazást tartalmaz, mindegyik rendelkezik dedikált API-átjáróval (BFF - Backend For Frontend minta).",
    "BackOfficeApplication": "Back Office alkalmazás",
    "BackOfficeApplicationExplanation": "A rendszer tényleges webalkalmazása, több felhasználói felületi keretbeállítással. Bármilyen üzleti alkalmazást létrehozhat.",
    "LandingWebsite": "Landing webhely",
    "LandingWebsiteExplanation": "Általános célú/nyilvános webhely, amely többféle célra is használható, például a cég bemutatására, termékei értékesítésére stb.",
    "ABPFrameworkEBook": "Mastering ABP Framework e-book",
    "MasteringAbpFrameworkEBookDescription": "Tartalmazza az ABP kereskedelmi licenszét",
    "FullName": "Teljes név",
    "LicenseTypeNotCorrect": "A licensz típusa nem megfelelő!",
    "Trainings": "Képzések",
    "ChooseTrainingPlaceholder": "Válaszd ki a képzést...",
    "DoYouNeedTrainings": "Szüksége van egy ilyen képzésre?",
    "DoYouNeedTraining": "Szüksége van a(z) {0} képzésére?",
    "GetInTouchUs": "Vegye fel velünk a kapcsolatot",
    "ForMoreInformationClickHere": "További információért kattintson <a href='{0}'>ide.</a>",
    "IsGetOnboardingTraining": "Szeretnél bevezető és webalkalmazás-fejlesztő tréningen részt venni?",
    "OnboardingWebApplicationDevelopmentTrainingMessage": "Képzési naptárának ütemezéséhez a szervezet létrehozása után vegye fel a kapcsolatot a következővel: {0}",
    "CustomPurchaseMessage": "A következő lépéshez kattintson a(z) {0} gombra, és lépjen kapcsolatba velünk.",
    "Note": "jegyzet",
    "AdditionalNote": "Kiegészítő megjegyzés",
    "OnboardingTrainingFaqTitle": "Van ABP bevezető képzése?",
    "OnboardingTrainingFaqExplanation": "Igen, van ABP képzési szolgáltatásunk, amely segít abban, hogy ABP-projektjét gyorsan elindítsa. Megtanulja az ABP-t az ABP törzscsoport egyik tagjától, és elsajátítja az ABP-projekt megkezdéséhez szükséges készségeket. A bevezető tréningen elmagyarázzuk, hogyan állítsa be fejlesztői környezetét, telepítse a szükséges eszközöket, készítsen egy teljesen működőképes CRUD oldalt. A tréning élőben lesz, a Zoom alkalmazást használjuk, valamint nyitottak vagyunk más online találkozóplatformok használatára is. A képzés nyelve angol lesz. A foglalkozások során felteheti kérdéseit az ABP-vel kapcsolatban is. Mindkét fél számára megfelelő időpontot és dátumot tervezünk. További információért lépjen kapcsolatba velünk az <a href=\"mailto:info@abp.io\">info@abp.io címen</a> .",
    "AddBasket": "Kosárba helyez",
    "SendTrainingRequest": "Képzési kérelem küldése",
    "OnlyEnglishVersionOfThisDocumentIsTheRecentAndValid": "* A dokumentum angol nyelvű változata a legfrissebb, és minden vitában az angol verzió az irányadó.",
    "Pricing_Page_Title": "Tervek és árak",
    "Pricing_Page_Description": "Válassza ki azokat a szolgáltatásokat és funkciókat, amelyekre ma vállalkozásának szüksége van. Vásároljon ABP kereskedelmi licenszet, és hozzon létre korlátlan számú projektet.",
    "Pricing_Page_HurryUp": "Siess!",
    "Pricing_Page_BuyLicense": "Vásároljon licenszet <strong>2021-es árakon</strong> január 16-ig!",
    "Pricing_Page_ValidForExistingCustomers": "Meglévő ügyfelekre és licenszmegújításokra is érvényes.",
    "Pricing_Page_Hint1": "A licensz ára bizonyos számú fejlesztői helyet tartalmaz. Ha több fejlesztője van, bármikor vásárolhat további üléseket.",
    "Pricing_Page_Hint2": "További fejlesztői licenszeket vásárolhat most vagy a jövőben. A licenszek szék alapúak, így áthelyezhet egy helyet egy fejlesztőtől a másikhoz.",
    "Pricing_Page_Hint3": "licenszével korlátlan számú különböző terméket fejleszthet.",
    "Pricing_Page_Hint4": "Az ABP Suite egy olyan eszköz, amely segíti a fejlesztést a termelékenység javítása érdekében. Támogatja a CRUD oldalak generálását és új projektek létrehozását.",
    "Pricing_Page_Hint5": "Az összes előre beépített modult használhatja alkalmazásaiban.",
    "Pricing_Page_Hint6": "Az összes előre elkészített témát használhatja alkalmazásaiban.",
    "Pricing_Page_Hint7": "Az indítási sablon a Visual Studiohoz, amellyel azonnal elkezdheti a projektet. Az összes alapvető modul hozzáadásra és előre konfigurálva van az Ön számára.",
    "Pricing_Page_Hint8": "Az ABP-keretrendszer elsajátítása című e-könyv elmagyarázza, hogyan lehet .NET-megoldásokat megvalósítani a legjobb gyakorlatokkal. A könyvet az Amazon.com oldalon árusítják, és licensze keretein belül ingyenesen letöltheti a könyvet.",
    "Pricing_Page_Hint9": "Bármely modul forráskódja letölthető. Érdemes lehet a forráskódot hozzáadni a megoldáshoz, hogy radikális változtatásokat hajtson végre, vagy biztonsági okokból egyszerűen megtarthatja magának.",
    "Pricing_Page_Hint10": "A licenszek életre szólnak. Ez azt jelenti, hogy örökké folytathatja az alkalmazás fejlesztését. A legfrissebb verzióhoz való hozzáférés és a támogatás megszerzése a licensz időtartamán belül biztosított (1 év, ha nem újítja meg).",
    "Pricing_Page_Hint11": "Nincs korlátozás a telepítésre! Tetszőleges számú kiszolgálóra telepítheti, beleértve a felhőszolgáltatásokat vagy a helyszíni szolgáltatásokat.",
    "Pricing_Page_Hint12": "A modulokat, témákat és eszközöket frissítheti a legújabb verzióra az aktív licenszidőszakon belül. A licensz lejárta után meg kell újítania, hogy továbbra is frissítéseket kaphasson a hibajavításokról, új funkciókról és fejlesztésekről.",
    "Pricing_Page_Hint13": "A prémium támogatást egy évre kaphatja meg (a licensz megújításával meghosszabbítható).",
    "Pricing_Page_Hint14": "A csapat- és üzleti licenszeknek van incidens/kérdésszám korlátja. Ha további fejlesztői licenszeket vásárol, az incidensek korlátja fejlesztőnként {0}-kal (a csapatlicensz esetén) vagy {1}-kal (az üzleti licensz esetében) nő.",
    "Pricing_Page_Hint15": "Csak az Enterprise licensz tartalmaz magántámogatást. Küldhet e-mailt közvetlenül az ABP csapatának, vagy kérdéseket tehet fel a support.abp.io oldalon privát jegy opcióval. A privát jegyek nem láthatók a nyilvánosság számára.",
    "Pricing_Page_Hint16": "Letöltheti az összes ABP téma forráskódját. Érdemes lehet a forráskódot hozzáadni a megoldáshoz, hogy radikális változtatásokat hajtson végre, vagy biztonsági okokból egyszerűen megtarthatja magának.",
    "Pricing_Page_Testimonial_1": "Az ABP Commercial lehetővé tette az SC Ventures számára, hogy 9 hónapon belül egy banki szintű többbérlős silo-adatbázis SaaS-platformot szállítson a követelések/tartozások ellátási láncának támogatására, jelentős értékű számlák több integrált horgonyból történő finanszírozásához. Az ABP modularitása lehetővé tette a csapat számára, hogy rekordidő alatt szállítsa, átadja az összes VAPT-t, és a konténeres mikroszolgáltatások veremét teljes CI/CD-n és csővezetékeken keresztül üzembe helyezze.",
    "Pricing_Page_Testimonial_2": "Látjuk az ABP Commercial használatának értékét az egyedi fejlesztési projektek általános költségeinek csökkentésére. És a csapat képes egységesíteni a kódmintát a különböző projektfolyamokban. Több lehetőséget látunk a keretrendszerben arra, hogy a korábbinál gyorsabban építsünk új funkciókat. Bízunk benne, hogy folyamatosan látni fogjuk az ABP Commercial kihasználásának értékét.",
    "Pricing_Page_Testimonial_3": "Szeretjük az ABP-t. Nem kell mindent a nulláról írnunk. A beépített funkciókból indulunk ki, és csak arra koncentrálunk, amit valóban meg kell írnunk. Ezenkívül az ABP jól felépített, és a kód kiváló minőségű, kevesebb hibával. Ha magunknak kellene megírnunk mindent, amire szükségünk van, akkor lehet, hogy éveket kellene töltenünk. Még egyszer, amit szeretünk, az az, hogy az új verzió, a hibajavítás vagy a fejlesztés nagyon hamar, minden második héten megjelenik. Nem várunk túl sokáig.",
    "Pricing_Page_Testimonial_4": "Az ABP Commercial egy fantasztikus termék, amelyet ajánlunk. Kereskedelmi termékek, amelyeket ügyfeleink számára egyetlen konfigurálható platformon értékesíthetnek. Az ugrásszerű indítás, amelyet a keret és az eszközök biztosítanak bármely csapat számára, minden centet megér. Az ABP Commercial volt a legjobban megfelelő az igényeinknek.",
    "Pricing_Page_Testimonial_5": "Az ABP Framework nem csak keretrendszer, hanem útmutató is a projektfejlesztéshez/menedzsmenthez, mert DDD, GenericRepository, DI, Microservice és Modularity képzést biztosít. Ha magát a keretrendszert nem is használja, fejlesztheti magát a docs.abp.io-val, amely jól és professzionálisan elkészített (OpenIddict, Redis, Quartz stb.) leírás. Mivel sok minden előre be van építve, jelentősen lerövidíti a projektfejlesztési időt (például bejelentkezési oldal, kivételkezelés, adatszűrés, aéapadatok, audit naplózás, lokalizáció, automatikus API vezérlő stb.). Alkalmazásunkból példaként a Helyi Event Bus-t használtam az állomány karbantartására. Így a rendelési mozgásokat eseményekkel tudom a készlethez igazítani. Csodálatos, hogy nem veszítünk időt a CreationTime-ra, a CreatorId-re. Automatikusan feltöltődnek.",
    "AbpBookDownloadArea_ClaimYourEBook": "Igényelje <span class='gradient-framework'>Mastering ABP Framework</span> e-könyvét",
    "AddMemberModal_Warning_1": "Ha a hozzáadni kívánt <strong>felhasználónév</strong> nem létezik a rendszerben, kérje meg csapattagját, hogy regisztráljon a <a href='{0}/Account/Register'>(z) {0}</a> webhelyen, és ossza meg fiókja felhasználónevét Önnel.",
    "MyOrganizations_Detail_WelcomeMessage": "Üdvözöljük szervezetében, {0}",
    "MyOrganizations_Detail_OrganizationManagement": "<span class=\"gradient-commercial\">Szervezetmenedzsment</span>",
    "OrganizationDisplayName": "Szervezet megjelenített neve",
    "MyOrganizations_Detail_EditDisplayName": "Megjelenítési név szerkesztése",
    "MyOrganizations_Detail_UpgradeYourLicense": "Frissítse licenszét",
    "MyOrganizations_Detail_LicenseStartAndExpiryDate": "licensz kezdő dátuma – lejárati dátum",
    "MyOrganizations_Detail_OwnerRightInfo": "Ön {1} tulajdonosi jogának {0}-át használja.",
    "MyOrganizations_Detail_CopyApiKey": "Másolja ki a kulcsot",
    "MyOrganizations_Detail_ApiKeyDescription": "Az API-kulcs a(z) <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{1} webhelyen tárolt PRO-csomagok tokenje.</a>",
    "MyOrganizations_Detail_YourPrivateNugetSource": "Az Ön privát NuGet-forrása <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{0}</a>",
    "MyOrganizations_Detail_PrivateNugetSourceWarning": "Ez automatikusan hozzáadódik feedként a NuGet.Config-hoz az ABP-megoldásban. Ne ossza meg privát kulcsát illetéktelen felhasználókkal!",
    "MyOrganizations_Detail_DeveloperSeatInfo": "Ön {1} fejlesztői helyéből {0}-ot használ.",
    "NeedMoreSeatsForYourTeam": "Több hozzáférésre van szüksége a csapatának?",
    "MyOrganizations_Detail_PricePerYear": "{0}/év",
    "MyOrganizations_Detail_PurchaseDeveloperSeats": "Vásároljon fejlesztői hozzáféréseket",
    "Invoices": "Számlák",
    "RequestInvoice": "Kérjen számlát",
    "OrderNumber": "Rendelésszám",
    "Date": "Dátum",
    "Products": "Termékek",
    "TotalPrice": "Teljes ár",
    "ThereIsNoInvoice": "Nincs számla",
    "MyOrganizations_Detail_PaymentProviderInfo": "Ha licenszét a <i>(z) {0}</i> átjárón keresztül vásárolta, az elküldi a PDF számlát az Ön e-mail címére, lásd: <a href=\"{1}\" target=\"_blank\">{0} számlázás.</a>",
    "MyOrganizations_Detail_PayUInfo": "Ha a <i>PayU</i> átjárón keresztül vásárolt, kattintson a \"Számla kérése\" gombra, és töltse ki a számlázási adatokat.",
    "MyOrganizations_Detail_ConclusionInfo": "Számlakérését {0} munkanapon belül lezárjuk.",
    "ExtendYourLicense": "Hosszabbítsa meg <span class=\"text-primary\">{0}</span> licenszét",
    "Continue": "Folytatni",
    "PurchaseLicense": "Vásároljon {0} licencet",
    "DownloadInvoiceModal_DownloadInvoice": "Számla letöltése",
    "DownloadInvoiceModal_SaveInformationOnlyOnce": "Számlázási adatait csak egyszer mentheti el.",
    "InvoiceModal_EnterCompanyName": "Adja meg cégének hivatalos nevét...",
    "InvoiceModal_EnterCompanyAddress": "Adja meg cége jogi címét...",
    "InvoiceModal_EnterTaxNumber": "Adja meg adószámát, ha van...",
    "RequestInvoiceModal_EnterNotes": "Írja be a számlával kapcsolatos extra üzenetet...",
    "PrePayment_PayWithIyzico": "Iyzico-val fog fizetni",
    "ContinueToCheckout": "Tovább a Pénztárhoz",
    "PrePayment_IyzicoRedirectionInfo": "A vásárlás biztonságos befejezéséhez átirányítjuk az Iyzico Payment Gateway oldalra.",
    "PrePayment_IyzicoAcceptVisaAndMasterCard": "Az Iyzico Visa és MasterCard kártyákat fogad el.",
    "Purchase": "Vásárlás",
    "AcceptTermsAndConditions": "Elolvastam, megértettem és elfogadom az <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">adatvédelmi szabályzatot</a> , a <a href=\"{1}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">feltételeket</a> és az <a href=\"{2}\" target=\"_blank\" class=\"text-primary\">EULA-t.</a>",
    "AcceptTermsAndConditionsWarningMessage": "Kérjük, fogadja el az adatvédelmi szabályzatot és a feltételeket",
    "SelectGatewayToContinue": "Kérjük, válasszon egy átjárót a folytatáshoz!",
    "GatewaySelection_SelectGateway": "Válasszon fizetési átjárót",
    "GatewaySelection_RedirectionMessage": "Ezután átirányítjuk a kiválasztott fizetési átjáró webhelyére a tranzakcióhoz.",
    "PaymentSucceed_PaymentSuccessMessage": "Sikeres fizetés",
    "PaymentSucceed_ThanksForPurchase": "Köszönjük a vásárlást!",
    "PaymentSucceed_CreateYourOrganization": "Hozd létre a szervezetedet",
    "PaymentSucceed_AddMeAsDeveloper": "Én is fejlesztő vagyok, vegyen fel fejlesztőként a szervezetembe.",
    "PaymentSucceed_CreateOrganization": "Szervezet létrehozása",
    "PaymentSucceed_OrganizationDescription": "Egy szervezet fejlesztőkből és tulajdonosokból áll. A fejlesztők olyan felhasználók, akik kódot írnak az ABP projektben, és részesülnek a <a href=\"{0}\" target=\"_blank\">{1}</a> webhely előnyeiből. A tulajdonosok olyan felhasználók, akik fejlesztői helyeket osztanak ki és kezelik a licenszelést.",
    "PaymentSucceed_ViewOrganization": "Kattintson ide a szervezet megtekintéséhez",
    "Purchase_TotalAnnualPrice": "ÖSSZESEN <small class=\"opacity-50\">(éves díj)</small>",
    "Purchase_TrainingPrice": "Képzési ár",
    "Purchase_OnboardingTraining": "ABP Onboarding és webalkalmazás-fejlesztés élő képzés",
    "TotalDeveloperPrice": "Teljes fejlesztői ár",
    "Purchase_PricePerDeveloper": "<span>{0} {1}</span> fejlesztőnként",
    "Purchase_IncludedDeveloperInfo": "{0} {1} tartalmazza.",
    "Purchase_LicenseExtraDeveloperPurchaseMessage": "A(z) <span class=\"fw-6\">{0} licensz</span> {1} fejlesztőt tartalmaz. Hozzáadhat további fejlesztőket most vagy később.",
    "StartupTemplates_Page_Title": "Az indítási sablonok",
    "StartupTemplates_Page_Description": "Az ABP Commercial lehetővé teszi, hogy bármilyen bonyolultságú megoldást készítsen. Két fő előre beépített indítási megoldást kínál. Kiválaszthatja az igényeinek megfelelőt, és ráépítheti saját egyedi megoldását.",
    "MicroserviceStartupSolutionForDotnet": "Microservice Startup Solution for .NET",
    "MonolithSolutionForDotnet": "Monolith (moduláris) megoldás .NET-hez",
    "TrainingDetailsHeaderInfo_TrainingHour": "{0} óra",
    "Trainings_Content": "A képzés tartalma",
    "Trial_Page_StartYourFreeTrial": "Indítsa el az <span class=\"gradient-commercial\">ingyenes próbaverziót</span>",
    "TrialLicenseFeatures": "Élvezheti az ABP összes kereskedelmi funkcióját",
    "TrialPeriodDays": "{0} napos csapatengedéllyel rendelkezik",
    "TrialForumSupportIncident": "{0} fórumtámogatási incidense lesz",
    "Contact_Page_Title": "Lépjen kapcsolatba az ABP fejlesztési csapatával",
    "Contact_Page_Description": "Lépjen kapcsolatba az ABP Development csapatával, ha segítségre van szüksége, vagy ossza meg gondolatait és véleményét! Az ABP támogatási csapata készen áll a segítségére.",
    "Demo_Page_Title": "Hozzon létre egy demót",
    "Demo_Page_Description": "Hozzon létre egy ingyenes demót az ABP Commercial indítósablon segítségével létrehozott mintaalkalmazás megtekintéséhez. Ne ismételje magát a gyakori alkalmazási követelmények miatt.",
    "Discounted_Page_Title": "Kedvezményes ár",
    "Discounted_Page_Description": "Válassza ki azokat a szolgáltatásokat és funkciókat, amelyekre ma vállalkozásának szüksége van. Vásároljon ABP kereskedelmi licenszet, és hozzon létre korlátlan számú projektet",
    "Faq_Page_Title": "Gyakran Ismételt Kérdések (GYIK)",
    "Faq_Page_Description": "Van kérdésed? Keressen gyakran ismételt kérdésekre, vagy tegyen fel nekünk kérdést a kapcsolatfelvételi űrlap segítségével.",
    "Faq_Page_SwiftCode": "Swift kód",
    "Faq_Page_BankName": "A bank neve",
    "Faq_Page_AccountName": "Felhasználónév",
    "Faq_Page_AccountNumber": "Számlaszám",
    "Faq_Page_Currency": "Valuta",
    "Faq_Page_VatNumber": "Adószám",
    "Faq_Page_OtherCurrenciesInfo": "A többi pénznemhez lásd <a href='{0}'>az összes fiókot</a>",
    "ModuleDetail_Page_Title": "Modul részletei – {0}",
    "ProjectCreatedSuccess_Page_Title": "A projekt létrehozva",
    "ProjectCreatedSuccess_Page_Description": "ABP projektje sikeresen létrejött!",
    "Suite_Page_Title": "ABP Suite – CRUD oldalak létrehozása",
    "Suite_Page_Description": "Az ABP Commercial gyors alkalmazásfejlesztési eszközöket biztosít a fejlesztők termelékenységének növelése érdekében. Az ABP Suite segítségével könnyedén hozhat létre CRUD oldalakat.",
    "Themes_Page_Title": "Modern és funkcionális felhasználói felület témák",
    "Themes_Page_Description": "Az ABP Commercial több professzionális, modern felhasználói felület témát kínál. Hozzon létre egy ingyenes bemutatót, hogy gyorsan áttekintse, hogyan néz ki a felhasználói felület.",
    "Tools_Page_Title": "Gyors alkalmazásfejlesztő eszközök",
    "Tools_Page_Description": "Az ABP Commercial gyors alkalmazásfejlesztési eszközöket biztosít a fejlesztők termelékenységének növelése érdekében. Az ABP Suite segítségével könnyedén hozhat létre CRUD oldalakat.",
    "DeveloperPrice": "Fejlesztői ár",
    "AdditionalDeveloperPaymentInfoSection_AdditionalDevelopers": "{0} <small>fejlesztő</small>",
    "LicenseRemainingDays": "<span>{0}</span> napig",
    "ExtendPaymentInfoSection_Description": "A licensz meghosszabbításával/megújításával továbbra is <a href=\"{0}\" target=\"_blank\">prémium támogatást</a> kap. Emellett kisebb-nagyobb frissítéseket is kaphat a modulokhoz és témákhoz. Folytathatja új projektek létrehozását. És továbbra is használhatja az <a href=\"{1}\" target=\"_blank\">ABP Suite</a> -ot, amely felgyorsítja a fejlesztést.",
    "LicenseRenewalPrice": "Licensz megújítási ára",
    "LicensePrice": "Licensz ára",
    "TrialLicensePaymentInfoSection_Description": "<strong>Licensz vásárlása: licensz</strong> megvásárlásával továbbra is <a href=\"{0}\" target=\"_blank\" rel=\"noopener\">prémium támogatást</a> kap . Emellett kisebb-nagyobb frissítéseket is kaphat a modulokhoz és témákhoz. Folytathatja új projektek létrehozását. És továbbra is használhatja az <a href=\"{1}\" target=\"_blank\" rel=\"noopener\">ABP Suite</a> -ot, amely felgyorsítja a fejlesztést.<br> Tekintse meg a <a href=\"{2}\" target=\"_blank\" rel=\"noopener\">licensz-összehasonlító táblázatot</a> a licensztípusok közötti különbségek ellenőrzéséhez.",
    "SelectTargetLicense": "Válassza a Target License lehetőséget",
    "UpgradePaymentInfoSection_ExtendMyLicenseForOneYear": "Igen, meghosszabbítom az engedélyem lejárati dátumát 1 évvel.",
    "UpgradePaymentInfoSection_WantToExtendLicense": "Szeretné meghosszabbítani licenszét további {0} évre?",
    "UpgradePaymentInfoSection_UpgradingWillNotExtendLicense": "A frissítés nem hosszabbítja meg a licensz lejárati dátumát!",
    "UpgradePaymentInfoSection_LicenseUpgradeDescription": "Licenszének frissítésével magasabb licensztípusra lép, amely további előnyökhöz juttatja Önt. Tekintse meg a <a href=\"/Pricing\" target=\"_blank\">licensz-összehasonlító táblázatot</a> a licensztípusok közötti különbségek ellenőrzéséhez.",
    "Landing_Page_CustomerStories": "Ügyféltörténetek",
    "Landing_Page_OurGreatCustomers": "Nagyszerű vásárlóink",
    "Landing_Page_WebApplicationFramework": "Web Application Framework",
    "Landing_Page_WebDevelopmentPlatform": "Webfejlesztési platform",
    "Landing_Page_CompleteWebDevelopmentPlatform": "Komplett webfejlesztési platform",
    "Landing_Page_TryFreeDemo": "Próbáld ki az ingyenes demót",
    "Landing_Page_StartingPointForWebApplications": "Az ASP.NET Core alapú webes alkalmazások kiindulópontja! A legjobb webfejlesztés érdekében az ABP-keretrendszeren alapul.",
    "Landing_Page_AbpProvidesSoftwareInfrastructure": "Az ABP Framework szoftver infrastruktúrát biztosít kiváló webalkalmazások fejlesztéséhez a legjobb gyakorlatokkal.",
    "Landing_Page_MicroserviceCompatibleArchitecture": "Mikroszolgáltatással kompatibilis architektúra",
    "Landing_Page_PreBuiltApplicationModulesAndThemes": "Előre elkészített alkalmazásmodulok és témák",
    "Landing_Page_MultiTenantArchitecture": "Több bérlős építészet",
    "Landing_Page_MultiTenancyDescription": "SaaS alkalmazások egyszerűen! Integrált több bérlés az adatbázistól a felhasználói felületig.",
    "Landing_Page_DDDIntroduction": "DDD minták és elvek alapján tervezték és fejlesztették. Réteges modellt biztosít az alkalmazáshoz.",
    "Landing_Page_CrossCuttingConcernsInfo": "Teljes infrastruktúra az engedélyezéshez, érvényesítéshez, kivételkezeléshez, gyorsítótárazáshoz, auditnaplózáshoz, tranzakciókezeléshez és még sok máshoz.",
    "Landing_Page_PreBuiltApplicationModules": "Előre beépített alkalmazásmodulok, amelyek a leggyakoribb webalkalmazási követelményeket tartalmazzák.",
    "Landing_Page_ChatModule": "Csevegés",
    "Landing_Page_DocsModule": "Dokumentumok",
    "Landing_Page_FileManagementModule": "Dokumentumok",
    "Landing_Page_CustomerStory_1": "Az ABP Commercial lehetővé tette az SC Ventures számára, hogy 9 hónapon belül egy banki szintű többbérlős silo-adatbázis SaaS-platformot szállítson a követelések/tartozások ellátási láncának támogatására, jelentős értékű számlák több integrált horgonyból történő finanszírozásához. Az ABP modularitása lehetővé tette a csapat számára, hogy rekordidő alatt szállítson, átadja az összes VAPT-t, és a konténeres mikroszolgáltatások veremét teljes CI/CD-n és csővezetékeken keresztül üzembe helyezze.",
    "Landing_Page_CustomerStory_2": "Látjuk az ABP Commercial használatának értékét az egyedi fejlesztési projektek általános költségeinek csökkentésére. És a csapat képes egységesíteni a kódmintát a különböző projektfolyamokban. Több lehetőséget látunk a keretrendszerben arra, hogy a korábbinál gyorsabban építsünk új funkciókat. Bízunk benne, hogy folyamatosan látni fogjuk az ABP Commercial kihasználásának értékét.",
    "Landing_Page_CustomerStory_3": "Szeretjük az ABP-t. Nem kell mindent a nulláról írnunk. A beépített funkciókból indulunk ki, és csak arra koncentrálunk, amit valóban meg kell írnunk. Ezenkívül az ABP jól felépített, és a kód kiváló minőségű, kevesebb hibával. Ha magunknak kellene megírnunk mindent, amire szükségünk van, akkor lehet, hogy éveket kellene töltenünk. Még egyszer, amit szeretünk, az az, hogy az új verzió, a hibajavítás vagy a fejlesztés nagyon hamar, minden második héten megjelenik. Nem várunk túl sokáig.",
    "Landing_Page_CustomerStory_4": "Az ABP Commercial egy fantasztikus termék, amelyet ajánlunk. Kereskedelmi termékek, amelyeket ügyfeleink számára egyetlen konfigurálható platformon értékesíthetnek. Az ugrásszerű indítás, amelyet a keret és az eszközök biztosítanak bármely csapat számára, minden centet megér. Az ABP Commercial volt a legjobban megfelel az igényeinknek.",
    "Landing_Page_AdditionalServices": "Egyedi vagy mennyiségi licensz, beépítés, élő képzés és támogatás, egyedi projektfejlesztés, meglévő projektek portolása és így tovább...",
    "Landing_Page_IncludedDeveloperLicenses": "<strong>{0}</strong> fejlesztői licenszet tartalmaz",
    "Landing_Page_SeeOnDemo": "Lásd a demóban",
    "Landing_Page_LeptonThemes": "Lepton Themes",
    "Landing_Page_AccountModuleDescription_1": "Ez a modul egy alkalmazás hitelesítési rendszerét valósítja meg;",
    "Landing_Page_AccountModuleDescription_2": "<strong>Bejelentkezési</strong> oldalt biztosít a felhasználónévvel és jelszóval",
    "Landing_Page_AccountModuleDescription_3": "<strong>Regisztrációs</strong> oldalt biztosít új fiók létrehozásához.",
    "Landing_Page_AccountModuleDescription_4": "<strong>Elfelejtett jelszó</strong> oldalt biztosít a <strong>jelszó-visszaállítási</strong> hivatkozás e-mailben történő elküldéséhez.",
    "Landing_Page_AccountModuleDescription_5": "E- <strong>mail megerősítési</strong> funkciót biztosít felhasználói felülettel.",
    "Landing_Page_AccountModuleDescription_6": "<strong>Kétfaktoros</strong> hitelesítést valósít meg (SMS és e-mail).",
    "Landing_Page_AccountModuleDescription_7": "Megvalósítja <strong>a felhasználói zárolást</strong> (zárolja a fiókot a beállított időtartamra, ha bizonyos számú sikertelen bejelentkezés történik érvénytelen hitelesítő adatok miatt egy bizonyos időintervallumon belül).",
    "Landing_Page_AccountModuleDescription_8": "Megvalósítja <strong>az Identity Server</strong> hitelesítési kiszolgáló felhasználói felületét és funkcióit.",
    "Landing_Page_AccountModuleDescription_9": "Lehetővé teszi a <strong>bérlők közötti váltást</strong> több bérlős környezetben.",
    "Landing_Page_AccountModuleDescription_10": "Lehetővé teszi az alkalmazás <strong>felhasználói felületének nyelvének</strong> módosítását.",
    "Landing_Page_AuditLoggingModuleDescription_1": "Ez a modul biztosítja a naplózási felületet a naplózási infrastruktúra számára. Lehetővé teszi az ellenőrzési naplóbejegyzések és entitásmódosítási naplók keresését, szűrését és megjelenítését.",
    "Landing_Page_AuditLoggingModuleDescription_2": "Az ellenőrzési naplóbejegyzés kritikus adatokat tartalmaz minden ügyfélkérelemről:",
    "Landing_Page_AuditLoggingModuleDescription_3": "URL, böngésző, IP-cím, ügyfélnév",
    "Landing_Page_AuditLoggingModuleDescription_4": "A felhasználó",
    "Landing_Page_AuditLoggingModuleDescription_5": "HTTP metódus, HTTP visszatérési állapotkód",
    "Landing_Page_AuditLoggingModuleDescription_6": "Siker/kudarc, kivétel részletei, ha rendelkezésre állnak",
    "Landing_Page_AuditLoggingModuleDescription_7": "Kérelem végrehajtásának időtartama",
    "Landing_Page_AuditLoggingModuleDescription_8": "Az entitások létrejöttek, törölve vagy frissítve ebben a kérésben (módosított tulajdonságokkal).",
    "Landing_Page_BloggingModuleDescription_1": "Ez a modul egy egyszerű blogot ad hozzá az ABP-alkalmazáshoz;",
    "Landing_Page_BloggingModuleDescription_2": "Lehetővé teszi több blog létrehozását egyetlen alkalmazásban.",
    "Landing_Page_BloggingModuleDescription_3": "Támogatja a Markdown formátumot.",
    "Landing_Page_BloggingModuleDescription_4": "Lehetővé teszi megjegyzés írását egy bejegyzéshez.",
    "Landing_Page_BloggingModuleDescription_5": "Lehetővé teszi címkék hozzárendelését a blogbejegyzésekhez.",
    "Landing_Page_BloggingModuleDescription_6": "Tekintse meg a <a href=\"blog.abp.io\">blog.abp.io</a> webhelyet a blogolási modul élő példájaként.",
    "Landing_Page_ChatModuleDescription_1": "Ez a modul valós idejű üzenetküldésre szolgál az alkalmazásban lévő felhasználók között.",
    "Landing_Page_ChatModuleDescription_2": "Valós idejű üzenetküldés a chat oldalon.",
    "Landing_Page_ChatModuleDescription_3": "Keressen felhasználókat az alkalmazásban új beszélgetésekhez.",
    "Landing_Page_ChatModuleDescription_4": "Névjegylista a legutóbbi beszélgetésekhez.",
    "Landing_Page_ChatModuleDescription_5": "Új üzenet értesítések, amikor a felhasználó egy másik oldalt néz.",
    "Landing_Page_ChatModuleDescription_6": "Teljes olvasatlan üzenetek száma jelvény a menüikonon.",
    "Landing_Page_ChatModuleDescription_7": "Az olvasatlan üzenetek száma az egyes beszélgetéseknél.",
    "Landing_Page_ChatModuleDescription_8": "Lusta betöltött beszélgetések.",
    "Landing_Page_DocsModuleDescription_1": "Ez a modul műszaki dokumentációs weboldalak létrehozására szolgál;",
    "Landing_Page_DocsModuleDescription_2": "Beépített <strong>GitHub integráció</strong> : közvetlenül írhat és kezelhet dokumentumokat a GitHubon.",
    "Landing_Page_DocsModuleDescription_3": "<strong>Verziókezelési</strong> támogatás közvetlenül integrálva a GitHub-kiadásokba.",
    "Landing_Page_DocsModuleDescription_4": "Támogatja a <strong>több nyelvet</strong> (az alapértelmezett nyelv tartalék támogatásával).",
    "Landing_Page_DocsModuleDescription_5": "Támogatja a <strong>Markdown</strong> és HTML formátumokat.",
    "Landing_Page_DocsModuleDescription_6": "<strong>Navigációt</strong> és <strong>vázlatos</strong> részt biztosít.",
    "Landing_Page_DocsModuleDescription_7": "Lehetővé teszi <strong>több projektdokumentáció</strong> tárolását egyetlen alkalmazásban.",
    "Landing_Page_DocsModuleDescription_8": "Hivatkozások a fájlra a GitHubon, így bárki könnyedén hozzájárulhat a <strong>Szerkesztés linkre kattintva</strong> .",
    "Landing_Page_DocsModuleDescription_9": "A GitHub-forrás mellett lehetővé teszi egy mappa egyszerű használatát dokumentációs forrásként.",
    "Landing_Page_FileManagementModuleDescription_1": "Fájlok feltöltése, letöltése és rendezése hierarchikus mappastruktúrában.",
    "Landing_Page_FileManagementModuleDescription_2": "Ez a modul fájlok feltöltésére, letöltésére és hierarchikus mappastruktúrába rendezésére szolgál. Több bérléssel is kompatibilis, és meghatározhatja bérlői teljes méretkorlátját.",
    "Landing_Page_FileManagementModuleDescription_3": "Ez a modul a <a href=\"https://docs.abp.io/en/abp/latest/Blob-Storing\">BLOB Storing</a> rendszeren alapul, így különböző tárolószolgáltatókat használhat a fájltartalom tárolására.",
    "Landing_Page_IdentityModuleDescription_1": "Ez a modul egy alkalmazás Felhasználó és szerepkör rendszerét valósítja meg;",
    "Landing_Page_IdentityModuleDescription_2": "A <a href=\"https://docs.microsoft.com/en-us/aspnet/core/security/authentication/identity\">Microsoft ASP.NET Core Identity</a> könyvtárára épül.",
    "Landing_Page_IdentityModuleDescription_3": "<strong>Szerepkörök</strong> és <strong>felhasználók</strong> kezelése a rendszerben. Egy felhasználónak <strong>több szerepe</strong> is lehet.",
    "Landing_Page_IdentityModuleDescription_4": "Állítsa be az <strong>engedélyeket</strong> szerep- és felhasználói szinteken.",
    "Landing_Page_IdentityModuleDescription_5": "Felhasználónként <strong>kétfaktoros hitelesítés</strong> és felhasználói <strong>kizárás</strong> engedélyezése/letiltása.",
    "Landing_Page_IdentityModuleDescription_6": "Az alapvető <strong>felhasználói profil</strong> és <strong>jelszó</strong> kezelése.",
    "Landing_Page_IdentityModuleDescription_7": "<strong>Igénytípusok</strong> kezelése a rendszerben, igények beállítása szerepkörökhöz és felhasználókhoz.",
    "Landing_Page_IdentityModuleDescription_8": "Beállítási oldal a <strong>jelszó összetettségének</strong> , a felhasználói bejelentkezés, a fiók és a kizárás kezeléséhez.",
    "Landing_Page_IdentityModuleDescription_9": "Támogatja <strong>az LDAP</strong> hitelesítést.",
    "Landing_Page_IdentityModuleDescription_10": "<strong>E-mail és telefonszám</strong> ellenőrzést biztosít.",
    "Landing_Page_IdentityModuleDescription_11": "Támogatja a közösségi bejelentkezési integrációkat (Twitter, Facebook, GitHub stb.).",
    "Landing_Page_IdentityModuleDescription_12": "<strong>Szervezeti egységek</strong> kezelése a rendszerben.",
    "Landing_Page_PaymentModuleDescription_1": "Integrációt biztosít a különböző fizetési átjárókhoz.",
    "Landing_Page_PaymentModuleDescription_2": "Ez a modul integrációt biztosít a fizetési átjárókhoz, így könnyen kaphat fizetést ügyfeleitől.",
    "Landing_Page_PaymentModuleDescription_3": "Ez a modul a következő fizetési átjárókat támogatja",
    "Welcome_Page_UseSameCredentialForCommercialWebsites": "Ugyanazokat a hitelesítési adatokat használja a <a href=\"https://commercial.abp.io\" class=\"text-primary\">commercial.abp.io</a> és a <a href=\"https://support.abp.io\" class=\"text-primary\">support.abp.io fájlokhoz</a> .",
    "WatchCrudPagesVideo": "Nézze meg a \"CRUD oldalak létrehozása az ABP Suite segítségével\" videót!",
    "WatchGeneratingFromDatabaseVideo": "Nézze meg az \"ABP Suite: CRUD-oldalak generálása meglévő adatbázistáblákból\" videót!",
    "WatchTakeCloserLookVideo": "Tekintse meg a „Nézze meg közelebbről a kódgenerálást: ABP Suite” videót!",
    "ConfirmedEmailAddressRequiredToStartTrial": "A próbalicenc elindításához rendelkeznie kell egy megerősített e-mail címmel.",
    "EmailVerificationMailNotSent": "Nem sikerült elküldeni az ellenőrző e-mailt.",
    "GetConfirmationEmail": "<a href=\"javascript:void(0);\" id=\"{0}\">Kattintson ide, ha megerősítő e-mailt szeretne kapni,</a> ha még nem kapta meg.",
    "WhichLicenseTypeYouAreInterestedIn": "Melyik licenctípus érdekli?",
    "DontTakeOurWordForIt": "Ne fogadd el a szavunkat...",
    "ReadAbpCommercialUsersWantYouToKnow": "Olvassa el, hogy az ABP Commercial felhasználói mit szeretnének tudni",
    "Testimonial_ShortDescription_1": "Az ABP modularitása lehetővé tette, hogy a csapat időben teljesítsen.",
    "Testimonial_ShortDescription_2": "Építsen új funkciókat gyorsabban, mint korábban.",
    "Testimonial_ShortDescription_3": "A beépített funkciókból indulunk ki, és csak arra koncentrálunk, amit valóban meg kell írnunk.",
    "Testimonial_ShortDescription_4": "Az ABP Commercial volt a legjobban megfelelő az igényeinknek.",
    "OnlineReviewersOnAbpCommercial": "Online vélemények az ABP Commercial-ról",
    "SeeWhatToldAboutAbpCommercial": "Tekintse meg, mit mondtak az ABP Commercialról, és írja le gondolatait, ha akarja.",
    "ExtendPaymentInfoSection_DeveloperPrice": "{0}x További Fejlesztő(k)",
    "ExtendPaymentInfoSection_DiscountRate": "Kedvezmény: {0}%",
    "TotalNetPrice": "Total Net Price",
    "BlackFridayDiscount": "Black Friday Kedvezmény"
  }
}
