{
  "culture": "is",
  "texts": {
    "OrganizationManagement": "Umsjá Skipulagsheilda",
    "OrganizationList": "Listi yfir Skipulagsheildir",
    "Volo.AbpIo.Commercial:010003": "Þú ert ekki eigandi þessarri skipulagsheild!",
    "OrganizationNotFoundMessage": "Eingin skipulagsheild fannst!",
    "DeveloperCount": "Úthlutað/alls forritarar",
    "QuestionCount": "Eftirstöðvar/alls spurningar",
    "Unlimited": "Ótakmarkað",
    "Owners": "Eigendur",
    "Owner": "Eigandi",
    "AddMember": "Bæta við meðlimi",
    "AddNewOwner": "Bæta við nýjum eiganda",
    "AddNewDeveloper": "Bæta við nýjum forritara",
    "UserName": "Notandanafn",
    "Name": "Nafn",
    "EmailAddress": "Netfang",
    "Developers": "Forritarar",
    "LicenseType": "Tegund Leyfis",
    "Manage": "Umsjón",
    "SetDefault": "Stillt sem sjálfgefið",
    "DefaultOrganization": "Sjálfgefið",
    "StartDate": "Upphafsdagur",
    "EndDate": "Lokadagur",
    "Modules": "Einingar",
    "LicenseExtendMessage": "Leyfið þitt og lokadagur hefur verið framlengt til {0}",
    "LicenseUpgradeMessage": "Leyfið þitt hefur verið uppfært í {0}",
    "LicenseExtendAdnUpgradeMessage": "Leyfið þitt hefur verið framlengt til {0} og leyfisáætlunin þín er uppfærð í {1}.",
    "LicenseAddDeveloperMessage": "{0} forritarar bættu við Leyfið þitt",
    "Volo.AbpIo.Commercial:010004": "Finn ekki tiltekinn notanda! Notandinn er líklega nú þegar skráður.",
    "MyOrganizations": "Félögin mín",
    "ApiKey": "API lykill",
    "UserNameNotFound": "Enginn notandi finnst með notandanafninu {0}",
    "SuccessfullyAddedToNewsletter": "Takk fyrir að gerast áskrifandi að fréttabréfinu okkar!",
    "MyProfile": "Sniðmátið mitt",
    "EmailNotValid": "Vinsamlegast setjið inn virkan netpóst.",
    "JoinOurMarketingNewsletter": "Gerast áskrifandi að markaðs fréttabréfinu okkar",
    "WouldLikeToReceiveMarketingMaterials": "Ég óska eftir því að fá send markaðsefni þ.m.t. upplýsingar um góð kjör og sérstök tilboð.",
    "StartUsingYourLicenseNow": "Byrjaðu að nota leyfið þitt núna!",
    "WelcomePage": "Velkomin síða",
    "UnsubscriptionExpireEmail": "Afskráning af póstlista sem minnir á hvenær Leyfi rennur út",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Þessi póstlisti felur einungis í sér áminningu um hvenær leyfið þitt rennur út.",
    "UnsubscribeFromLicenseExpireEmails": "Ef þú kýst að fá ekki vefpóst til áminningar um hvenær leyfið þitt rennur út, þá getur þú afskráð þig hvenær sem er.",
    "Unsubscribe": "Afskráning",
    "NotOrganizationMember": "Þú ert ekki meðlimur í neinni skipulagsheild.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Þú hefur verið afskráður af póstlistanum",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Þú munt ekki fá vefpóst um áminningu þess hvenær leyfið þitt rennur út.",
    "IndexPageHeroSection": "<span class=\"first-line\">Heilstætt</span><span class=\"second-line\"> vefþróunar umhverfi </span><span class=\"third-line\">byggt á <img src=\"{0}\" width=\"110\" class=\"ml-1\" /> ABP</span>",
    "AbpCommercialShortDescription": "ABP Commercial býður upp á forsmíðaðar forritareiningar, tól sem hraða þróun, fagmanlega hannaðar UI þemur, úrvals stuðning og fleira.",
    "LiveDemo": "Virkt sýnidæmi",
    "LiveDemoLead": "<a href=\"{0}\">{1}</a> með þínum ABP reikningi, <a href=\"{2}\">{3}</a> til abp.io.<br/>Eða fylltu út formið hér að neðan til að búa til virkt sýnidæmi núna",
    "ThereIsAlreadyAnAccountWithTheGivenEmailAddress": "Það er nú þegar reikningur með þessu netfangi: <b>{0}</b><br/> Þú getur skráð þig inn með þínum reikningi til að halda áfram.",
    "GetLicence": "Sækja Leyfi",
    "Application": "Umsókn",
    "StartupTemplates": "Byrjunar Sniðmát",
    "Startup": "Byrjun",
    "Templates": "Sniðmát",
    "Developer": "Forritari",
    "Tools": "Verkfæri",
    "Premium": "Viðbót",
    "PremiumSupport": "Viðbótar stuðningur",
    "PremiumForumSupport": "Spjallborð Viðbótar Stuðnings",
    "UI": "UI",
    "Themes": "Þemu",
    "JoinOurNewsletter": "Vertu áskrifandi að fréttabréfinu okkar",
    "Send": "Senda",
    "WhatIsABPFramework": "HVAÐ ER ABP?",
    "OpenSourceBaseFramework": "Opin hugbúnaður",
    "ABPFrameworkExplanation": "<p class=\"lead\">ABP Commercial er byggt á ABP umhverfinu, sem er opin og frír hugbúnaður og samfélagslega keyrður vefforritunar umhverfi fyrir ASP.NET Core.ABP Framework, veitir framúrskarandi innviði til að skrifa viðhaldanlegan, auðbreytanlegann og prófanlegan kóða með bestu starfsháttum. </p> <p> Byggt á og samþætt við vinsæl tól sem þú þekkir nú þegar. Auðvelt að læra, auðvelt að aðlaga, þægilegt í  þróun.</p>",
    "Modular": "Einingavæddur",
    "MicroserviceCompatible": "Möguleiki á Microservice högun",
    "DomainDrivenDesignInfrastructure": "Domain Driven Design Innviðir",
    "MultiTenancy": "Multi-Tenancy",
    "DistributedMessaging": "Dreyfðar skeytasendingar",
    "DynamicProxying": "Dynamic Proxying",
    "BackgroundJobs": "Bakgrunns Keyrslur",
    "AuditLogging": "Endurskoðunarskráning",
    "BLOBStoring": "BLOB Geymsla",
    "BundlingMinification": "Samantekt og minkun",
    "AdvancedLocalization": "Fullkomin þýðingarvirkni",
    "ManyMore": "Mikið meira",
    "ExploreTheABPFramework": "Skoða ABP",
    "WhyUseTheABPCommercial": "Afhverju að nota ABP Commercial?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\">Það getur verið flókið og tímafrekt að byggja upp vefsíðuforrit fyrir fyrirtæki. </p> <p> ABP Commercial býður upp á fullkomna grunninnviði sem er nauðsynlegur fyrir allar nútíma ASP.NET Core lausnir sem byggja á fyrirtækjum. Allt frá hönnun til dreifingar er allt þróunarferlið styrkt af innbyggðum eiginleikum og einingum ABP. </p> ",
    "StartupTemplatesShortDescription": "Upphafssniðmát gera þér kleift að byrja verkefnið á nokkrum sekúndum.",
    "UIFrameworksOptions": "Valmöguleikar UI viðmóts;",
    "DatabaseProviderOptions": "Gagnagrunna valkostir;",
    "PreBuiltApplicationModules": "Forbyggðar forritareiningar",
    "PreBuiltApplicationModulesShortDescription": "Algengustu kröfur um forrit eru þegar þróaðar fyrir þig sem margnota einingar.",
    "Account": "Aðgangur",
    "Blogging": "Blogging",
    "Identity": "Auðkenni",
    "IdentityServer": "Auðkenningarþjónn",
    "Saas": "Saas",
    "LanguageManagement": "Túngumálaumsjón",
    "TextTemplateManagement": "Textasmíðastjórnun",
    "See All Modules": "Sjá AllModules",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "ABP Suite er viðbótar tól sem kemur með ABP Commercial.",
    "AbpSuiteExplanation": "Það gerir þér kleift að byggja vefsíður á örfáum mínútum. Það er .NET Core Global tól sem hægt er að setja upp frá skipanalínunni. Það getur búið til nýja ABP lausn, búið til CRUD síður úr gagnagrunninum í framendann.",
    "Details": "Nánari upplýsingar",
    "LeptonTheme": "Lepton Þema",
    "ProfessionalModernUIThemes": "Faglega hannað núttíma útlit",
    "LeptonThemeExplanation": "Lepton býður upp á úrval af Bootstrap admin þemum sem þjóna sem traustur grunnur fyrir öll verkefni sem krefjast admin mælaborðs.",
    "DefaultTheme": "Sjálfvalin Þema",
    "MaterialTheme": "Material Þema",
    "Default2Theme": "Sjálfvalin 2 þema",
    "DarkTheme": "Dökk Þema",
    "DarkBlueTheme": "Dökk Blá Þema",
    "LightTheme": "Ljós Þema",
    "ProudToWorkWith": "Stoltur að vinna með",
    "OurConsumers": "Þúsundir fyrirtækja og þróunaraðila yfir 70 löndum um allan heim treysta á ABP Commercial.",
    "JoinOurConsumers": "Vertu með þeim og smíðaðu ótrúlegar vörur hratt.",
    "AdditionalServicesExplanation": "Þarftu viðbótarþjónustu eða sérsniðna þjónustu? <strong> Við og samstarfsaðilar okkar getum veitt;</strong>",
    "CustomProjectDevelopment": "Sérsniðin verkefnaþróun",
    "CustomProjectDevelopmentExplanation": "Verktaar sérstaklega fyrir þín sérsniðnu verkefni",
    "PortingExistingProjects": "Flytja núverandi verkefni",
    "PortingExistingProjectsExplanation": "Flytja gömlu legacy verkefnin þín yfir í ABP",
    "LiveSupport": "Stuðningur í beinni",
    "LiveSupportExplanation": "Fjarstuðningsmöguleiki í beinni þegar þú þarft á því að halda.",
    "Training": "Þjálfun",
    "TrainingExplanation": "Sértæk þjálfun fyrir forritarana þína.",
    "OnBoarding": "Byrðing",
    "OnBoardingExplanation": "Hjálp við að setja upp þróunarumhverfin þína, CI & CD.",
    "PrioritizedTechnicalSupport": "Forgangsröðun tæknilegs stuðnings",
    "PremiumSupportExplanation": "Auk hins mikkla samfélagsstuðnings ABP rammans, svarar stuðningsteymi okkar tæknilegum spurningum og vandamálum viðskiptalegra notenda með mikla forgang.",
    "SeeTheSupportOptions": "Sjá Stuðningsmöguleikar",
    "Contact": "Hafa samband",
    "TellUsWhatYouNeed": "Segðu okkur hvað þig vantar.",
    "YourMessage": "Skilaboðin þín",
    "YourFullName": "Þitt fulla nafn",
    "FirstNameField": "Fyrsta nafn",
    "LastNameField": "Eftirnafn",
    "EmailField": "Netfang",
    "YourEmailAddress": "Netfangið þitt",
    "ValidEmailAddressIsRequired": "Netfangið þarf að vera gilt.",
    "HowMayWeHelpYou": "Hvernig getum við aðstoðað þig?",
    "SendMessage": "Senda skilaboð",
    "Success": "Heppnaðist",
    "WeWillReplyYou": "Við höfum móttekið skilaboðin þín og munum hafa samband innan tíðar.",
    "GoHome": "Fara heim",
    "CreateLiveDemo": "Búa til Live Demo",
    "CreateLiveDemoDescription": "Þegar þú sendir þetta form, færðu tölvupóst sem inniheldur tengilinn þinn.",
    "RegisterToTheNewsletter": "Skráning á póstlista fyrir fréttabréf með upplýsingum um ABP.IO, þ.á.m. nýjar útgáfur o.s.frv..",
    "EnterYourEmailOrLogin": "Settu inn netfangið þitt til að búa til kynningu eða <a href=\"{0}\">Login</a> með þínum notandareikningi.",
    "ApplicationTemplate": "Forritssniðmát",
    "ApplicationTemplateExplanation": "Upphafssniðmát forrits er notað til að búa til nýtt vefforrit.",
    "EfCoreProvider": "Entity Framework (Virkar fyrir SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\">og fleiri</a>)",
    "AlreadyIncludedInTemplateModules": "Eftirfarandi einingar eru þegar innifalin og stilltar í þessu sniðmáti:",
    "ApplicationTemplateArchitecture": "Þetta forritasniðmát styður einnig þrepaskiptann arkitektúr þar sem UI -lag, API -lag og auðkenningarþjónusta eru líkamlega aðskild.",
    "SeeTheGuideOrGoToTheLiveDemo": "Sjá þróunarleiðbeiningarnar fyrir tæknilegar upplýsingar um þetta sniðmát eða farðu í lifandi kynningu.",
    "DeveloperGuide": "Þróunar leiðbeiningar",
    "ModuleTemplate": "Sniðmát fyrir einingu",
    "ModuleTemplateExplanation1": "Viltu búa til einingu og endurnýta í mismunandi forritum? Þetta gangsetningarsniðmát undirbýr allt til að byrja að búa til einnota <strong> forritareining </strong> eða <strong> örþjónustu </strong>.",
    "ModuleTemplateExplanation2": "<p> Þú getur stutt einn eða marga UI ramma, eina eða margar gagnagrunnsveitur fyrir hverja einingu. Uppsetningarsniðmátið er stillt til að keyra og <strong> prófa eininguna þína </strong> í lágmarksforriti auk einingarinnar og samþættingarprófunarinnviða. </p> <p> Sjá þróunarleiðbeiningar fyrir tæknilegar upplýsingar um þetta sniðmát. </p>",
    "WithAllStyleOptions": "með öllum stílvalkostum",
    "Demo": "Sýningardæmi",
    "SeeAllModules": "Sjá allar einingar",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) er skipanalínutæki til að framkvæma nokkrar algengar aðgerðir fyrir ABP byggðar lausnir.",
    "ABPSuiteEasilyCURD": "ABP Suite er tæki sem gerir þér kleift að búa til CRUD síður auðveldlega",
    "WeAreHereToHelp": "Við erum hérna til að <span class=\"zero-text\">Hjálpa</span>",
    "BrowseOrAskQuestion": "Þú getur skoðað hjálparefni okkar eða leitað í algengum spurningum, eða þú getur spurt okkur spurningar með því að nota <a href=\"{0}\" class=\"text-success\"> samskiptaform </a> .",
    "SearchQuestionPlaceholder": "Leitaðu í algengum spurningum",
    "WhatIsTheABPCommercial": "Hvað er ABP Commercial?",
    "WhatAreDifferencesThanAbpFramework": "Hver er munurinn á milli open source ABP Framework og ABP Commercial?",
    "AbpCommercialMetaTitle": "{0} | ABP auglýsing",
    "AbpCommercialMetaDescription": "Alhliða vefþróunarvettvangur á ABP Framework með fyrirframbyggðum einingum, gangsetningarsniðmátum, hröðum þróunarverkfærum, atvinnuviðmótsþemum og úrvalsstuðningi.",
    "ABPCommercialExplanation": "ABP Commercial er safn af hágæða einingum, verkfærum, þemum og þjónustu sem er byggt ofan á opnum heimildum <a target=\"_blank\" href=\"{0}\"> ABP ramma </a>. ABP Commercial er þróað og stutt af sama teymi á bak við ABP rammann.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\"> ABP</a> er einingar, þemu og ör-þjónusta  þróunarramma fyrir ASP.NET Core. Það býður upp á fullkominn arkitektúr og sterka innviði til að láta þig einblína á eigin viðskiptakóða frekar en að endurtaka sjálfan þig fyrir hvert nýtt verkefni. Það er byggt á bestu starfsháttum hugbúnaðarþróunar og vinsælum tækjum sem þú þekkir nú þegar. </p> <p> ABP er algjörlega ókeypis og opinn uppspretta (open source). Það býður einnig upp á ókeypis þemur og nokkrar fyrirfram byggðar einingar (t.d. auðkennisstjórnun og tenant stjórnun). </p>",
    "VisitTheFrameworkVSCommercialDocument": "Farðu á eftirfarandi krækju til að fá meiri upplýsingar <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial bætir eftirfarandi ávinningi ofan á ABP rammann;",
    "Professional": "Fagmannlegt",
    "UIThemes": "UI þemur",
    "EnterpriseModules": "Tilbúið til notkunnar fyrir stór fyrirtæki, eiginleikaríkt, forsmíðaðar <a href=\"{0}\"> forritareiningar </a> (t.d. Identity Server stjórnun, SaaS stjórnun, tungumálastjórnun)",
    "ToolingToSupport": "Verkfæri til að styðja við framleiðni þinnar (t.d. <a href=\"{0}\"> ABP Suite </a>)",
    "PremiumSupportLink": "Hágæða <a href=\"{0}\" target=\"_blank\">þjónusta</a>",
    "WhatDoIDownloadABPCommercial": "Hverju þarf ég að niðurhala þegar ég kaupi the ABP Commercial?",
    "CreateUnlimitedSolutions": "Við kaup á ABP Commercial leyfinu, munt þú geta útbúið ótakmarkaðar lausnir líkt og kemur fram í <a href=\"{0}\">Að byrja</a> document.",
    "ABPCommercialSolutionExplanation": "Þegar þú býrð til nýtt forrit færðu Visual Studio lausn (upphafssniðmát) byggt á óskum þínum. Sótta lausnin er með viðskiptaeiningar og þemu þegar uppsett og stillt fyrir þig. Þú getur fjarlægt fyrirfram uppsetta einingu eða bætt við annarri einingu ef þú vilt. Allar einingar og þemu eru notuð NuGet/NPM pakkar sjálfgefið.",
    "StartDevelopWithTutorials": "Niðurhalin lausnin er vel byggð og skjalfest. Þú getur byrjað að þróa þína eigin viðskiptakóða byggt á því eftir <a href=\"{0}\"> námskeiðunum </a>",
    "TryTheCommercialDemo": "Þú getur prófað <a href=\"{0}\"> kynninguna </a> til að sjá sýnishorn af forriti sem búið var til með því að nota upphafssniðmát ABP Commercial.",
    "HowManyProducts": "Hversu margar mismunandi vörur/lausnir get ég smíðað með ABP Commercial?",
    "HowManyProductsExplanation": "Það eru engin takmörk fyrir því að búa til ABP verkefni. Þú getur búið til eins mörg verkefni og þú vilt, þróað og hlaðið þeim upp á mismunandi netþjóna.",
    "HowManyDevelopers": "Hversu margir forritarar geta unnið á ABP Commercial?",
    "HowManyDevelopersExplanation": "ABP Commercial leyfi eru á hvern verktaki. Mismunandi gerðir leyfa hafa mismunandi takmörk þróunaraðila. Hins vegar getur þú bætt fleiri forriturum við hvaða tegund leyfis sem er hvenær sem þú þarft. Sjá <a href=\"{0}\"> verðlagssíðuna </a> fyrir tegundir leyfa, takmarkanir þróunaraðila og viðbótarkostnað verktaki.",
    "ChangingLicenseType": "Get ég uppfært tegund leyfis síðar?",
    "ChangingLicenseTypeExplanation": "Þú getur uppfært í hærra leyfi með því að greiða mismuninn innan virka leyfistímabilsins. Þegar þú uppfærir í hærri leyfisáætlun færðu ávinninginn af nýju áætluninni en uppfærsla leyfisins breytir ekki gildistíma leyfis. Að auki geturðu einnig bætt nýjum þróunarstólum við núverandi leyfi, sjá \"Hversu margir verktaki geta unnið á ABP auglýsingunni? \"",
    "LicenseExtendUpgradeDiff": "Hver er munurinn á lengingu leyfis og uppfærslu?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Framlenging:</strong> Með því að framlengja/endurnýja leyfið muntu halda áfram að fá úrvalsstuðning og fá meiriháttar eða minniháttar uppfærslur fyrir einingarnar og þemu. Að auki munt þú geta haldið áfram að búa til ný verkefni. Og þú munt samt geta notað ABP Suite, sem flýtir fyrir þróun þinni. Þegar þú framlengir leyfið þitt bætist 1 ár við gildistíma leyfisins.<hr/> <strong>Uppfærsla:</strong> Með því að uppfæra leyfið þitt færðu hærra leyfisáætlun, sem gerir þér kleift að fá frekari fríðindi. Skoðaðu <a href=\"/pricing\">leyfissamanburðartöfluna</a> til að sjá muninn á leyfisáætlunum. <strong>Á hinn bóginn, þegar þú uppfærir, breytist gildistími leyfis þíns ekki!</strong> Til að framlengja lokadag leyfis þíns þarftu að framlengja leyfið.",
    "LicenseRenewalCost": "Hver er kostnaður við endurnýjun leyfis eftir 1 ár?",
    "LicenseRenewalCostExplanation": "Endurnýjunarverð (framlengja) venjulegs liðsleyfis er ${0}, venjulegt viðskiptaleyfi er ${1} og staðlað fyrirtækisleyfi er ${2}. Ef þú ert nú þegar viðskiptavinur skaltu <a href='{3}' target='_blank'>skrá þig inn á reikninginn þinn</a> til að skoða tiltæk endurnýjunarverð.",
    "HowDoIRenewMyLicense": "Hvernig endurnýi ég leyfi mitt?",
    "HowDoIRenewMyLicenseExplanation": "Þú getur endurnýjað leyfið með því að fara á <a href='{0}' target='_blank'> stjórnunarsíðu fyrirtækisins </a>. Til að nýta afsláttarverð okkar fyrir snemma endurnýjun, vertu viss um að endurnýja áður en leyfið þitt rennur út. Ekki hafa áhyggjur af því að vita ekki hvenær tækifæri þínu til endurnýjunar lokast. Þú færð 2 áminningarpósta áður en áskriftin rennur út. Við sendum þau 30 dögum, 7 dögum fyrir lok.",
    "IsSourceCodeIncluded": "Inniheldur leyfi mitt frumkóða viðskiptareininganna og þemanna?",
    "IsSourceCodeIncludedExplanation1": "Það fer eftir tegund leyfis sem þú hefur keypt:",
    "IsSourceCodeIncludedExplanation2": "<strong> Team </strong>: Lausnin þín notar einingar og þemu sem NuGet og NPM pakka. Það inniheldur ekki frumkóða þeirra. Þannig geturðu auðveldlega uppfært þessar einingar og þemu hvenær sem ný útgáfa er fáanleg. Hins vegar geturðu ekki fengið frumkóða mátanna og þemanna.",
    "IsSourceCodeIncludedExplanation3": "<strong> Business/Enterprise </strong>: Auk liðsleyfisins geturðu sótt kóða hvers einingar eða þema sem þú þarft. Þú getur jafnvel fjarlægt NuGet/NPM pakkatilvísanir fyrir tiltekna einingu og bætt frumkóða þess beint við lausn þína til að breyta henni að fullu.",
    "IsSourceCodeIncludedExplanation4": "<p> Með því að fá frumkóða eininganna í lausn þinni gefur þú þér hámarks frelsi til að sérsníða þá einingu. Hins vegar verður ekki hægt að uppfæra eininguna sjálfkrafa þegar ný útgáfa er gefin út. </p> <p> Ekkert af leyfunum inniheldur ABP Suite frumkóða, sem er ytra tæki sem býr til kóða fyrir þig og aðstoðar til þróunar þinnar. </p> <p> Sjá <a href=\"{0}\"> verðlagningarsíðuna </a> fyrir annan mun á tegund leyfis. </p>",
    "ChangingDevelopers": "Get ég breytt skráðum forriturum fyrirtækisins míns í framtíðinni?",
    "ChangingDevelopersExplanation": "Til viðbótar við að bæta nýjum verktaka við leyfi þitt geturðu einnig breytt núverandi forriturum (þú getur fjarlægt verktaka og bætt nýjum við) án aukakostnaðar.",
    "WhatHappensWhenLicenseEnds": "Hvað gerist þegar leyfistímabilinu lýkur?",
    "WhatHappensWhenLicenseEndsExplanation1": "ABP Commercial leyfið er <a href=\"{0}\" target=\"_blank\">ævarandi leyfi</a> . Eftir að leyfið þitt rennur út geturðu haldið áfram að þróa verkefnið þitt. Og þú ert ekki skyldugur til að endurnýja leyfið þitt. Leyfinu þínu fylgir eins árs uppfærsla og stuðningsáætlun beint úr kassanum. Til þess að halda áfram að fá nýja eiginleika, auka afköst, villuleiðréttingar, stuðning og halda áfram að nota ABP Suite þarftu að endurnýja leyfið þitt. Þegar leyfið þitt rennur út;",
    "WhatHappensWhenLicenseEndsExplanation2": "Þú getur ekki búið til nýjar lausnir með því að nota ABP Commercial, en þú getur haldið áfram að þróa núverandi forrit þín að eilífu.",
    "WhatHappensWhenLicenseEndsExplanation3": "Þú munt geta fengið uppfærslur fyrir einingarnar og þemu í MINOR útgáfunni þinni (nema RC eða Preview útgáfur). Til dæmis, ef þú ert að nota v3.2.0 af einingu, geturðu samt fengið uppfærslur fyrir v3.2.x (v3.2.1, v3.2.5... osfrv.) af þeirri einingu. En þú getur ekki fengið uppfærslur fyrir næstu meiriháttar eða minni útgáfu (eins og v3.3.0, v3.3.3, 4.xx. osfrv.). Til dæmis, þegar leyfið þitt rann út, var nýjasta útgáfan v4.4.3, og síðar birti hún bæði 4.4.4 útgáfuna og 4.5.0 útgáfuna, þú gætir fengið aðgang að v4.4.X en þú myndir ekki vera fáðu aðgang að v4.5.X.",
    "WhatHappensWhenLicenseEndsExplanation4": "Þú getur ekki sett upp nýjar einingar og þemu sem bætt er við ABP Commercial pallinn eftir að leyfinu þínu lýkur.",
    "WhatHappensWhenLicenseEndsExplanation5": "Þú getur ekki notað ABP Suite.",
    "WhatHappensWhenLicenseEndsExplanation6": "Þú getur ekki fengið <a href=\"{0}\">aukagjaldsstuðninginn</a> lengur.",
    "WhatHappensWhenLicenseEndsExplanation7": "Þú getur framlengt (endurnýjað) leyfið þitt ef þú vilt halda áfram að njóta þessara fríðinda. Ef þú framlengir leyfið þitt innan <strong>{3} daga</strong> eftir að leyfið þitt rennur út, verða eftirfarandi afslættir notaðir: Team Leyfi {0}; Fyrirtækjaleyfi {1}; Fyrirtækjaleyfi {2}.",
    "discountForYears": "{0}% afsláttur í {1} ár",
    "WhatHappensWhenLicenseEndsExplanation8": "ABP verkefnin sem þú bjóst til eru ekki geymd á netþjónum okkar. Þess vegna er það á þína ábyrgð að geyma frumkóðann sem þú halar niður. Þegar leyfið þitt rennur út er engin leið til að fá útbúið ABP verkefni frumkóðann.",
    "WhenShouldIRenewMyLicense": "Hvenær ætti ég að endurnýja leyfið mitt?",
    "WhenShouldIRenewMyLicenseExplanation": "Ef þú endurnýjar leyfið þitt innan <strong>{3} dagar</strong> eftir að leyfið þitt rennur út verða eftirfarandi afslættir notaðir: Team Leyfi {0}% afsláttur, Business License {1}% afsláttur, Enterprise License {2}% afsláttur . Ef þú endurnýjar leyfið þitt <strong>{3} dagar</strong> eftir að leyfið rennur út, verður endurnýjunarverðið það sama og kaupverð leyfisins og enginn afsláttur af endurnýjun þinni.",
    "TrialPlan": "Ertu með prufuáætlun?",
    "TrialPlanExplanation": "Já, hafðu samband við <a href=\"mailto:marketing@volosoft.com?subject=ABP Commercial — Trial License Request\">marketing@volosoft.com</a> til að hefja ókeypis prufuáskrift. Við bjóðum einnig upp á 30 daga peningaábyrgð fyrir Team leyfið, engar spurningar! Þú getur beðið um fulla endurgreiðslu á fyrstu 30 dögum frá kaupum á leyfinu. Við veitum 60% endurgreiðslu innan 30 daga fyrir viðskipta- og fyrirtækjaleyfi. Þetta er vegna þess að viðskipta- og fyrirtækjaleyfin innihalda allan frumkóðann fyrir allar einingar og þemu.",
    "DoYouAcceptBankWireTransfer": "Samþykki þið bankamillifærslu?",
    "DoYouAcceptBankWireTransferExplanation": "Já, við tökum við bankamillifærslu.<br />Eftir að hafa sent leyfisgjaldið með millifærslu skaltu senda okkur tölvupóst á accounting@abp.io kvittun þína og tegund leyfis sem óskað er eftir. Upplýsingar um alþjóðlega bankareikninginn okkar:",
    "HowToUpgrade": "Hvernig á að uppfæra núverandi forrit þegar ný útgáfa er í boði?",
    "HowToUpgradeExplanation1": "Þegar þú býrð til nýtt forrit með ABP Commercial eru allar einingarnar og þemað notað sem NuGet og NPM pakkar. Svo þú getur auðveldlega uppfært pakkana þegar ný útgáfa er fáanleg.",
    "HowToUpgradeExplanation2": "Til viðbótar við hefðbundna NuGet/NPM uppfærslu veitir <a href=\"{0}\"> ABP CLI </a> uppfærsluskipun sem finnur og uppfærir sjálfkrafa alla ABP tengda pakka í lausninni þinni.",
    "DatabaseSupport": "Hvaða gagnagrunnar eru studdir?",
    "DatabaseSupportExplanation": "ABP sjálft er óháð gagnagrunnum og getur unnið með hvaða gagnagrunni sem er. Skoðaðu <a href=\"{0}\" target=\"_blank\"> gagnaaðgangsskjalið </a> til að sjá lista yfir þá grunna sem búið er að útfæra á móti.",
    "UISupport": "Hvaða UI umgjarðir eru studdar?",
    "Supported": "Stutt",
    "UISupportExplanation": "ABP sjálft er óháð UI umgjörðum og getur unnið með hvaða UI umgjörð. Hins vegar eru uppsetningarsniðmát, UI einingar og þemur ekki útfærð fyrir allar mögulegar UI umgjarðir. Sjá <a href=\"{0}\"> byrjunarskjalið </a> fyrir uppfærða lista yfir UI valmöguleika.",
    "MicroserviceSupport": "Styður það örþjónustu arkitektúr?",
    "MicroserviceSupportExplanation1": "Eitt helsta markmið ABP ramma er að veita þægilega innviði til að búa til örþjónustulausnir. Skoðaðu <a href=\"{0}\"> örþjónustu arkitektúr </a> skjalið til að skilja hvernig það hjálpar til við að búa til örþjónustu kerfi.",
    "MicroserviceSupportExplanation2": "Allar ABP Commercial einingar eru hannaðar til að styðja við örverudreifingaraðstæður (\"microservises\") (með eigin API og gagnagrunni) með því að fylgja <a href=\"{0}\"> bestu vinnubrögðum mátþróunar </a>.",
    "MicroserviceSupportExplanation3": "Við bjóðum upp á sýnishorn af <a href=\"{0}\"> sýnishornalausn fyrir örþjónustu </a> sem sýnir sýningu á örþjónustu arkitektúr til að hjálpa þér að búa til þína eigin lausn.",
    "MicroserviceSupportExplanation4": "svo, stutta svarið er \"<strong> já, það styður örþjónustu arkitektúr </strong> \".",
    "MicroserviceSupportExplanation5": "Hins hafa örþjónustukerfi sýnar útfærslur og mismunandi kröfur, netfræði, staðsetningarsamskipti, sannvottunarmöguleika, ákvarðanir um gagnagrunn aðskilnað/miðlun, keyrslutíma, kerfis samþættingu þriðja aðila og margt fleira.",
    "MicroserviceSupportExplanation6": "ABP Framework og ABP Commercial bjóða upp á innviði fyrir ör-þjónustusvið, samhæfðar einingar fyrir örþjónustu, sýnishorn og skjöl til að hjálpa þér að byggja þína eigin lausn. En ekki búast við að hlaða niður draumalausninni þinni sem er fyrirfram smíðuð fyrir þig. Þú verður að skilja það og koma nokkrum hlutum saman eftir þörfum þínum.",
    "WhereCanIDownloadSourceCode": "Hvar get ég sótt frumkóðann?",
    "WhereCanIDownloadSourceCodeExplanation": "Þú getur halað niður kóðanum fyrir allar ABP einingar, Angular pakka og þemu í gegnum ABP Suite eða ABP CLI. Sjá <a href=\"{0}\"> Hvernig á að hlaða niður frumkóða? </a>",
    "ComputerLimitation": "Hversu margar tölvur getur forritari skráð sig inn þegar hann þróar ABP?",
    "ComputerLimitationExplanation": "Við leyfum sérstaklega <strong> {0} tölvur </strong> fyrir hvern einstakling/verktaki sem er með leyfi. Hvenær sem það er þörf fyrir verktaki til að þróa ABP Commercial á annarri vél, þá ætti að senda tölvupóst til licens@abp.io þar sem útskýrt er ástandið og við munum síðan gera viðeigandi úthlutun í kerfinu okkar.",
    "RefundPolicy": "Ertu með endurgreiðslustefnu?",
    "RefundPolicyExplanation": "Þú getur óskað eftir endurgreiðslu innan <strong> 30 daga </strong> frá kaupum á leyfi. Viðskipta- og fyrirtækjalyfistegundirnar hafa möguleika á niðurhalskóða og því eru endurgreiðslur ekki í boði fyrir fyrirtækið og fyrirtækið (og leyfi sem innihalda rétt til að fá frumkóða). Að auki er ekki endurgreitt fyrir endurnýjun og önnur leyfiskaup.",
    "HowCanIRefundVat": "Hvernig get ég endurgreitt virðisaukaskatt?",
    "HowCanIRefundVatExplanation1": "Ef þú greiddir með 2Checkout geturðu endurgreitt virðisaukaskatt með 2Checkout reikningnum þínum:",
    "HowCanIRefundVatExplanation2": "Skráðu þig inn á <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\"> 2Checkout </a> reikninginn þinn",
    "HowCanIRefundVatExplanation3": "Finndu viðeigandi pöntun og ýttu á „Endurgreiða vangreiddann virðisaukaskatt“ (sláðu inn VSK -auðkenni þitt)",
    "HowCanIGetMyInvoice": "Hvernig get ég fengið reikninginn minn?",
    "HowCanIGetMyInvoiceExplanation": "Það eru 2 greiðslugáttir fyrir kaup á leyfi: PayU og 2Checkout. Ef þú kaupir leyfið þitt í gegnum 2Checkout gateway sendir það PDF reikninginn á netfangið þitt, sjá <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How-do-invoices-work \"> 2Afgreiðslureikningur. </a> Ef þú kaupir í gegnum PayU eða með bankamillifærslu munum við útbúa og senda reikninginn þinn. Þú getur beðið um reikninginn þinn á <a href=\"{0}\"> stjórnunarsíðu fyrirtækisins. </a>",
    "Forum": "Spjallborð",
    "SupportExplanation": "ABP Commercial leyfi veitir hágæða spjallstuðning frá teymi sem samanstendur af sérfræðingum ABP Framework.",
    "PrivateTicket": "Einkamiði",
    "PrivateTicketExplanation": "Fyrirtækja leyfi inniheldur einnig einkaaðstoð með tölvupósti og miðakerfi.",
    "AbpSuiteExplanation1": "ABP Suite gerir þér kleift að byggja vefsíður á örfáum mínútum. Það er .NET Core Global tól sem hægt er að setja upp frá skipanalínunni.",
    "AbpSuiteExplanation2": "Það getur búið til nýja ABP lausn, búið til CRUD síður úr gagnagrunninum í framendann. Fyrir tæknilegt yfirlit, sjá <a href=\"{0}\"> skjalið </a>",
    "FastEasy": "Fljótlegt og auðvelt",
    "AbpSuiteExplanation3": "ABP Suite gerir þér kleift að búa til CRUD síður auðveldlega. Þú þarft bara að skilgreina einingu þína og eiginleika hennar, leyfðu ABP Suite að gera restina fyrir þig! ABP Suite býr til alla nauðsynlega kóða fyrir CRUD síðuna þína á nokkrum sekúndum. Það styður notendaviðmót Angular, MVC og Blazor.",
    "RichOptions": "Ríkt af valkostum",
    "AbpSuiteExplanation4": "ABP Suite styður marga notendaviðmótvalkosti fyrir UI eins og t.d <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\"> Razor Pages </a> og <a href=\" https://angular.io \"> Angular </a>. Það styður einnig marga gagnagrunna eins og <a href=\"https://www.mongodb.com\"> MongoDB </a> og alla gagnagrunna studda af <strong> EntityFramework Core </strong> (MS SQL Server, Oracle, MySql, PostgreSQL og <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli \"> meira </a>).",
    "AbpSuiteExplanation5": "Það góða er að þú þarft ekki að hafa áhyggjur af þessum valkostum. ABP Suite skilur gerð verkefnis þíns og býr til kóða fyrir verkefnið þitt og setur kóðann sem er búinn til á réttan stað í verkefninu.",
    "SourceCode": "Frumkóði",
    "AbpSuiteExplanation6": "ABP Suite býr til kóðann fyrir þig! Það býr ekki til töfraskrár til að búa til vefsíðuna. ABP Suite býr til frumkóða fyrir <strong> einingu, geymslu, umsóknarþjónustu, flutning kóða fyrst, JavaScript/TypeScript og CSHTML/HTML </strong> og nauðsynleg tengi líka. ABP Suite býr einnig til kóðann í samræmi við <strong> Best Practices </strong> hugbúnaðarþróunar, þannig að þú þarft ekki að hafa áhyggjur af gæðum kóðans.",
    "AbpSuiteExplanation7": "Þar sem þú ert með frumkóða byggingareiningana í CRUD síðunni, skipt upp í forritalög geturðu auðveldlega breytt frumkóðanum og bætt við sérsniðnu virkninni þinn.",
    "CrossPlatform": "Cross Platform",
    "AbpSuiteExplanation8": "ABP Suite er byggt með .NET Core og það er Cross Platform. Það keyrir sem vefforrit á tölvunni þinni. Þú getur keyrt það á <strong> Windows </strong>, <strong> Mac </strong> og <strong> Linux </strong>",
    "OtherFeatures": "Aðrir valmöguleikar",
    "OtherFeatures1": "Uppfærir <strong>NuGet</strong> og <strong>NPM</strong> pakka á lausn þína auðveldlega.",
    "OtherFeatures2": "Endurgerir þegar tilbúnar síður frá grunni.",
    "OtherFeatures3": "Býr til nýjar lausnir",
    "ThanksForCreatingProject": "Takk fyrir að búa til verkefnið þitt!",
    "HotToRunSolution": "Hvernig á að keyra lausnina þína?",
    "HotToRunSolutionExplanation": "Sjá byrjunarskjal til að læra hvernig á að stilla og keyra lausnina þína.",
    "GettingStarted": "Byrja",
    "WebAppDevTutorial": "Kennsla í vefforritum",
    "WebAppDevTutorialExplanation": "Sjá kennslu skjal fyrir vefforrit til að fá skref fyrir skref kennslu í þróun.",
    "Document": "Skjal",
    "UsingABPSuiteToCURD": "Notkun ABP Suite fyrir CRUD síðugerð og verkfæri",
    "SeeABPSuiteDocument": "Sjá ABP Suite skjal til að læra notkun ABP Suite.",
    "AskQuestionsOnSupport": "Þú getur spurt spurninga um ABP Commercial á stuðningssíðunni.",
    "Documentation": "Skjölun",
    "SeeModulesDocument": "Sjá skjal yfir einingar fyrir lista yfir allar commercial(pro) einingar og skjöl þeirra.",
    "Pricing": "Verðlagning",
    "PricingExplanation": "Veldu þá eiginleika og virkni sem fyrirtækið þitt þarfnast í dag. Uppfærðu auðveldlega þegar fyrirtæki þitt vex.",
    "Team": "Teymi",
    "Business": "Fyrirtækið",
    "Enterprise": "Enterprise",
    "Custom": "Sérsnið",
    "IncludedDeveloperLicenses": "Innifalin þróunarleyfi",
    "CustomLicenceOrAdditionalServices": "Þarftu sérsniðið leyfi eða viðbótarþjónustu?",
    "CustomOrVolumeLicense": "Sérsniðið eða fjölda leyfi",
    "LiveTrainingSupport": "Þjálfun í vbeinni og stuðningur",
    "AndMore": "og fleira",
    "AdditionalDeveloperLicense": "Auka þróunarleyfi",
    "ProjectCount": "Fjöldi verkefna",
    "AllProModules": "Allar pro einingar",
    "AllProThemes": "Allar pro þemur",
    "AllProStartupTemplates": "Öll pro upphafssniðmát",
    "SourceCodeOfAllModules": "Frumkóði fyrir allar einingar",
    "SourceCodeOfAllThemes": "Frumkóði fyrir allar þemur",
    "PerpetualLicense": "Ævarandi leyfi",
    "UnlimitedServerDeployment": "Ótakmörkuð dreifing á þjóna",
    "YearUpgrade": "1 árs uppfærsla",
    "YearPremiumForumSupport": "1 árs aðgangur að þjónustu spjallborði",
    "ForumSupportIncidentCountYear": "Fjöldi stuðnings atburða/ár",
    "PrivateTicketEmailSupport": "Persónuleg þjónustu mál og netfangs aðstoð",
    "BuyNow": "Kaupa núna",
    "PayViaAmexCard": "Hvernig get ég greitt með AMEX kortinu mínu?",
    "PayViaAmexCardDescription": "Sjálfgefna greiðslugáttin 'Iyzico' getur hafnað sumum AMEX kreditkortum vegna öryggisráðstafana. Í þessu tilfelli geturðu greitt í gegnum aðra greiðslugáttina '2Checkout'.",
    "ThankYou": "Takk fyrir",
    "InvalidReCaptchaErrorMessage": "Villa kom upp við að staðfesta reCAPTCHA. Vinsamlegast reyndu aftur.",
    "CompanyName": "Nafn fyrirtækis",
    "YourCompanyName": "Nafn fyrirtækis þíns",
    "FirstName": "Fornafn",
    "LastName": "Eftirnafn",
    "Optional": "Valfrjálst",
    "YourFirstName": "Fornafn þitt",
    "YourLastName": "Eftirnafnið þitt",
    "SpecialOffer": "Sérstakt tilboð",
    "SpecialOfferMessage": "Flýttu þér! Verð gilda í takmarkaðan tíma.",
    "DiscountRequest": "Afsláttarbeiðni",
    "DiscountRequestDescribeCustomerQuestion": "Hvert af eftirfarandi lýsir þér best?",
    "DiscountRequestStudentEmailMessage": "Netfang verður að innihalda 'edu'.",
    "DiscountRequestDeveloperCount": "Hversu margir forritarar eru þið?",
    "DiscountRequestDeveloperCountExceedMessage": "Við veitum ekki afsláttarleyfi fyrir fyrirtæki sem eru með yfir {0} forritara.",
    "DiscountRequestOrganizationName": "Fyrirtæki/stofnun/skólanafn",
    "Website": "Vefur",
    "GithubUsername": "GitHub notandanafn",
    "PhoneNumber": "Símanúmer",
    "Country": "Land",
    "DescribeABPCommercialUsage": "Lýstu verkefninu sem þú ætlar að þróa út frá APB Commercial",
    "DiscountRequestCertifyInformationMessage": "Ég staðfesti að allar upplýsingar eru sannar og réttar.",
    "DiscountRequestReceived": "Við höfum fengið beiðni þína um afslátt.",
    "DiscountRequestStatusMessage": "Við munum svara þér eftir að hafa skoðað upplýsingarnar sem þú hefur veitt.",
    "MVCOrRazorPages": "MVC (Razor Pages)",
    "Angular": "Angular",
    "Blazor": "Blazor",
    "New": "Nýtt",
    "MongoDB": "MongoDB",
    "EBookDDD": "Rafbók um Domain Driven Design",
    "PracticalGuideForImplementingDDD": "Þessi bók er hagnýtur leiðarvísir um innleiðingu DDD hönnun með ABP.",
    "IntroducingDDD": "Kynning á Domain Driven Design",
    "DDDLayersAndCleanArchitecture": "DDD lög & Clean Architecture",
    "LayeringOfADotnetSolution": "Lagskipti .NET lausnar",
    "ImplementingDDDBuildingBlocks": "Útfærsla DDD byggingareininga",
    "DomainVsApplicationLogic": "Domain Logic vs Application Logic",
    "SamplesAndDiscussions": "Dæmi og umræður",
    "Free": "Gjaldfrjáls",
    "Download": "Hlaða niður",
    "DDDEBook": "DDD rafbók",
    "ImplementingDDD": "Útfæra Domain Driven Design",
    "DDDBookExplanation": "Hagnýt handbók til að útfæra DDD hönnun með ABP ramma.",
    "Overview": "Yfirlit",
    "DDDBookPracticalGuide": "Þetta er hagnýtur leiðarvísir til að útfæra Domain Driven Design (DDD). Þó að upplýsingar um útfærsluna byggi á innviðum ABP, þá eiga kjarnahugtök, meginreglur og mynstur við hvers konar lausn, jafnvel þó að það sé ekki .NET lausn.",
    "TableOfContents": "Efnisyfirlit",
    "IntroductionToImplementingDDD": "Inngangur að útfærslu DDD hönnunar",
    "WhatIsDDD": "Hvað er Domain Driven Design?",
    "Implementation": "Útfærsla",
    "TheBigPicture": "Stóra myndin",
    "TheBuildingBlock": "Byggingar einingarnar",
    "ExampleUseCase": "Dæmi um notkunartilfelli",
    "DomainAndApplicationLogic": "Domain Logic & Application Logic",
    "Author": "Höfundur",
    "PublishedOn": "Útgéfið",
    "Page": "Síða",
    "FreeEBook": "Frí rafbókina",
    "EBookSignInForDownload": "Til að sækja rafbókina skráðu þig inn",
    "SignIn": "Innskrá",
    "Or": "Eða",
    "TellUsAboutYourself": "Segðu okkur svolítið frá þér",
    "Surname": "Eftirnafn",
    "DoYouAgreePrivacyPolicy": "Ég samþykki <a href=\"/TermsConditions\"> skilmála og skilyrði <a/> og <a href=\"/Privacy\"> persónuverndarstefnu </a>.",
    "VolosoftMarketingInformationMessage": "Ég vil fá upplýsingar, ábendingar og tilboð um lausnir fyrir fyrirtæki og stofnanir og aðrar vörur og þjónustu Volosoft.",
    "VolosoftSharingInformationMessage": "Ég vil að Volosoft deili upplýsingum mínum með völdum samstarfsaðilum svo ég geti fengið viðeigandi upplýsingar um vörur þeirra og þjónustu.",
    "WeWillSendYouADownloadLink": "Tengill til að hlaða niður rafbókinni hefur verið sendur á {0}. <br/> Athugaðu pósthólfið/rusl/ruslpóstsboxin þín!",
    "InvalidFormInputs": "Vinsamlegast sláðu inn gildar upplýsingar sem tilgreindar eru á eyðublaðinu.",
    "DDDBookEmailBody": "Þakka þér fyrir. <be /> Til að hlaða niður bókinni þinni, <a href=\"{0}\"> smelltu hér </a>.",
    "StartFree": "Byrjaðu ókeypis",
    "FreeTrial": "Ókeypis prufa",
    "AcceptsMarketingCommunications": " Já, ég vil fá ABP Commercial markaðsefni.",
    "PurposeOfUsage": "Tilgangur með notkun",
    "Choose": "- Velja -",
    "CompanyOrganizationName": "Nafn Fyrirtækis/Stofnunar",
    "CompanySize": "Stærð Fyrirtækis",
    "Next": "Næsta",
    "StartTrial": "Byrjaðu ókeypis prufuáskriftina mína",
    "ContactUsQuestions": "Hafðu samband ef þú hefur einhverjar spurningar",
    "TrialActivatedWarning": "Notandi á aðeins rétt á að fá 1 ókeypis prufutímabil. Þú hefur þegar notað prufutímabilið þitt.",
    "ActivationRequirement": "Þú ert síðasta skrefið frá því að hefja prufutímann.<br> Eftir að hafa skoðað upplýsingarnar þínar munum við virkja leyfið þitt. Þegar leyfið þitt hefur verið virkt munum við senda tölvupóst á <b>{0}</b> . Ekki hafa áhyggjur, þetta ferli mun ekki taka langan tíma!",
    "SaveAndDownload": "Vista og hala niður",
    "CompanyNameValidationMessage": "Nafn fyrirtækis er of langt!",
    "AddressValidationMessage": "Heimilisfang er of langt!",
    "TaxNoValidationMessage": "SKATTA/VSK númber er of langt!",
    "NotesValidationMessage": "Skýringareiturinn er of langur!",
    "CheckYourBillingInfo": "Þú getur aðeins búið til reikninginn þinn einu sinni! Athugaðu innheimtuupplýsingar þínar áður en þú býrð til reikninginn þinn.",
    "StartYourFreeTrial": "Byrjaðu ókeypis prufuáskrift",
    "TrialLicenseModelInvalidErrorMessage": "Einn af eftirfarandi reitum er ógildur: heiti lands, stærð fyrirtækis, iðnaður eða tilgangur notkunar.",
    "Trial": "Prufu aðgangur",
    "Purchased": "Keypt",
    "PurchaseNow": "Kaupa núna",
    "PurchaseTrialLicenseMessage": "Gildistími leyfis þíns er {0}. <br> Ef þú vilt halda áfram að nota verkefnin sem þú bjóst til á ókeypis prufutímabilinu þarftu að breyta leyfislyklunum í <code> appsettings.secrets.json </code> skránni þinn. Hér er leyfislykillinn þinn:",
    "TrialLicenseExpireMessage": "Þú ert að nota prufuleyfið og prufuleyfið rennur út {0}.",
    "TryForFree": "Prófaðu ókeypis",
    "TrialLicenseExpiredInfo": "Prófunartímabil þitt er útrunnið!",
    "DowngradeLicensePlan": "Get ég lækkað niður í lægra leyfisáætlun í framtíðinni?",
    "DowngradeLicensePlanExplanation": "Þú getur ekki niðurfært núverandi leyfisáætlun þína. En þú getur keypt nýja lægri leyfisáætlun og haldið áfram þróun þinni á nýja leyfinu. Eftir að þú hefur keypt lægra leyfi þarftu bara að skrá þig inn á nýju leyfisáætlunina þína með ABP CLI skipuninni: ` abp login<username> -o<organization> `.",
    "LicenseTransfer": "Er hægt að flytja leyfi frá einum forritara til annars?",
    "LicenseTransferExplanation": "Já! Þegar þú kaupir leyfi verður þú leyfishafi, þess vegna hefurðu aðgang að stjórnunarsíðu fyrirtækisins. Stofnun hefur hlutverk eiganda og þróunaraðila. Eigendur geta stjórnað þróunarsætum og úthlutað þróunaraðilum. Hver úthlutaður verktaki mun skrá sig inn með ABP CLI skipun í kerfið og mun hafa þróunar- og stuðningsheimildir.",
    "UserOwnerDescription": "&#39;Eigandi&#39; stofnunarinnar er stjórnandi þessa reiknings. Hann/hún stjórnar stofnuninni með því að kaupa leyfi og úthluta þróunaraðilum. &#39;Eigandi&#39; getur ekki skrifað kóða í ABP viðskiptaverkefnin, getur ekki hlaðið niður ABP sýnishornsverkefnum og getur ekki spurt spurninga á stuðningsvefsíðunni. Ef þú vilt gera allt þetta þarftu að bæta sjálfum þér við sem þróunaraðila líka.",
    "UserDeveloperDescription": "„Hönnuðirnir“ geta skrifað kóða í ABP viðskiptaverkefnin, hlaðið niður ABP sýnishornsverkefnunum og spurt spurninga á stuðningsvefsíðunni. Á hinn bóginn geta &#39;þróunaraðilar&#39; ekki stjórnað þessari stofnun.",
    "RemoveCurrentUserFromOrganizationWarningMessage": "Þú ert að fjarlægja þig úr eigin stofnun. Þú munt ekki lengur geta stjórnað þessari stofnun, staðfestirðu það?",
    "RenewExistingOrganizationOrCreateNewOneMessage": "Þú getur endurnýjað leyfi fyrirtækisins/fyrirtækjanna þinna með því að smella á &quot;Framlengja núna&quot; hnappinn fyrir neðan og þannig geturðu framlengt gildistíma leyfisins um 1 ár. Ef þú heldur áfram að borga færðu nýtt skipulag. Viltu halda áfram með nýja stofnun?",
    "PurchaseTrialOrganizationOrCreateNewOneMessage": "Þú ert með prufuleyfi. Til að kaupa prufuleyfið þitt smelltu á hnappinn Kaupa núna. Ef þú heldur áfram að borga færðu nýtt skipulag. Viltu halda áfram með nýja stofnun?",
    "ExtendNow": "Framlengdu núna",
    "CreateNewOrganization": "Búðu til nýja stofnun",
    "RenewLicenseEarly": "Ef ég endurnýja leyfið mitt snemma, fæ ég þá allt árið?",
    "RenewLicenseEarylExplanation": "Þegar þú endurnýjar leyfið þitt áður en leyfið rennur út, mun 1 ári bætast við lokadag leyfisins. Til dæmis, ef leyfið þitt rennur út {0}-06-06 og þú endurnýjar það {0}-01-01, verður nýr leyfisdagur {1}-06-06.",
    "OpenSourceWebApplication": "Open source vefforrit",
    "CompleteWebDevelopment": "Fullkomin vefþróun",
    "ABPFrameworkDescription": "ABP Framework er fullkomið innviði til að búa til nútíma vefforrit með því að fylgja bestu starfsvenjum hugbúnaðarþróunar og venja.",
    "CommunityDescription": "Deildu reynslu þinni með ABP Framework!",
    "GetStarted": "Byrja",
    "Views": "skoðanir",
    "LatestPosts": "Nýjustu færslur",
    "PreBuiltApplication": "Forbyggt forrit",
    "DatabaseProviders": "Gagnagrunnsveitur",
    "UIFrameworks": "HÍ ramma",
    "UsefulLinks": "Gagnlegar hlekkir",
    "Platform": "Pallur",
    "CoolestCompaniesUseABPCommercial": "Flottustu fyrirtækin nota nú þegar <span class=\"fw-bold\">ABP Commercial.</span>",
    "UserInterface": "Notendaviðmót",
    "APIGateway": "API hlið",
    "Microservice": "Örþjónusta",
    "Database": "Gagnagrunnur",
    "Architecture": "Arkitektúr",
    "MicroserviceArchitectureExplanation": "Þetta er heildarlausnararkitektúr sem samanstendur af mörgum forritum, API gáttum, örþjónustum og gagnagrunnum til að byggja upp stigstærða örþjónustulausn með nýjustu tækni.",
    "BusinessLogic": "Viðskiptarökfræði",
    "DataAccessLayer": "Gagnaaðgangslag",
    "Monolith": "Monolith",
    "ModularArchitectureExplanation": "Þetta ræsingarsniðmát býður upp á lagskipt, mát og DDD-byggðan lausnararkitektúr til að byggja upp hreinan og viðhaldanlegan kóðagrunn.",
    "SeeDetails": "Sjá nánari upplýsingar",
    "SeeDocumentation": "Skoðaðu skjölin",
    "Bs5Compatible": "Bootstrap 5 samhæft faglegt þema, fullkomið fyrir stjórnunarvefsíðuna þína.",
    "LeptonXTheme": "LeptonX þema",
    "LeptonXDark": "LeptonX dökk",
    "LeptonXLight": "LeptonX ljós",
    "LeptonXSemiDark": "LeptonX hálfdökk",
    "BuiltOnBs5Library": "Byggt á Bootstrap 5 bókasafni",
    "FullyCompatibleWithBs5": "100% samhæft við Bootstrap 5 HTML uppbyggingu og CSS flokka",
    "ResponsiveAndMobileCompatible": "Móttækilegur, farsímasamhæfður, RTL stuðningur",
    "ProvidesStylesForDatatables": "Veitir stíl fyrir gagnatöflur",
    "MultipleLayoutOptions": "Margir skipulagsvalkostir",
    "EasilyInstallAndUpgrade": "Settu upp og uppfærðu auðveldlega",
    "SupportForum": "Stuðningsvettvangur",
    "TrustedBy": "Treyst af",
    "OurPricing": "<span class=\"gradient-commercial\">Verðlagning</span> okkar",
    "Plans": "Áætlanir",
    "NameSurname": "Nafn eftirnafn",
    "Unspecified": "Ótilgreint",
    "LicenceType": "Tegund leyfis",
    "LicenseDiscountWarning": "ÞESSI AFSLÁTTARSÍÐA NOTAR SJÁGJÁLFANNA AFSLÁTTARKÓÐA OG FYRIR VOLOSOFT HANNA. KAUPATENGLAR HÉR fyrir neðan virka EKKI.",
    "DiscountedLicenseExplanation": "Þessi leyfisverð eru fyrir lítil sprotafyrirtæki, einstaka þróunaraðila, námsmenn, sjálfseignarstofnanir og verkefni!",
    "General": "Almennt",
    "License": "Leyfi",
    "Development": "Þróun",
    "Payment": "Greiðsla",
    "WatchExplainerVideo": "Hittumst! Horfðu á Explainer Video",
    "LightDarkAndSemiDarkThemes": "Ljós, dökk og hálfdökk",
    "LeptonXThemeExplanation": "Lepton Þema getur breytt þema þínu í samræmi við kerfisstillingar þínar.",
    "PRO": "PRO",
    "WelcomeToABPCommercial": "Velkomin í <span class=\"gradient-commercial\">ABP Auglýsing!</span>",
    "YourAccountDetails": "Reikningsupplýsingar þínar",
    "OrganizationName": "nafn samtaka",
    "AddDevelopers": "Bæta við hönnuði",
    "StartDevelopment": "Byrjaðu þróun",
    "CreateAndRunApplicationUsingStartupTemplate": "Lærðu hvernig á að búa til og keyra nýtt vefforrit með því að nota ABP Commercial ræsingarsniðmátið.",
    "CommunityDescription2": "<span class=\"fw-6\">community.abp.io</span> er staður þar sem fólk getur deilt ABP-tengdum greinum. Leitaðu að greinum, námskeiðum, kóðadæmum, dæmisögum og hittu fólk á sömu braut og þú.",
    "UseABPSuiteExplanation": "Notaðu ABP Suite til að hlaða niður frumkóða eininganna og þemanna.",
    "ManageModulesWithSuite": "Þú getur líka stjórnað ABP einingunum þínum með Suite.",
    "LearnHowToInstallSuite": "Lærðu hvernig á að setja upp og nota ABP Suite.",
    "SeeMore": "Sjá meira",
    "SeeLess": "Sjá Minna",
    "LayeredSolutionStructure": "Lagskipt lausnaruppbygging",
    "LayeredSolutionStructureExplanation": "Lausnin er lagskipt byggð á lénsdrifinni hönnunarreglum og mynstrum til að einangra viðskiptarökfræði þína frá innviðum og samþættingum og til að hámarka viðhaldshæfni kóða og endurnýtanleika. ABP Framework veitir nú þegar útdrætti, grunnflokka og leiðbeiningar til að virkilega útfæra DDD fyrir forritið þitt.",
    "MultipleUIOptions": "Margir UI valkostir",
    "MultipleUIOptionsExplanation": "Við elskum mismunandi leiðir til að búa til notendaviðmótið. Þessi ræsingarlausn býður upp á þrjá mismunandi UI rammavalkosti fyrir viðskiptaforritið þitt.",
    "MultipleDatabaseOptions": "Margir gagnagrunnsvalkostir",
    "MultipleDatabaseOptionsExplanation": "Þú hefur tvo valkosti fyrir gagnagrunnsveitu (auk þess að nota báða í einu forriti). Notaðu Entity Framework Core til að vinna með hvaða venslagagnagrunn sem er og notaðu valfrjálst Dapper þegar þú þarft að skrifa fyrirspurnir á lágu stigi fyrir betri árangur. MongoDB er annar valkostur ef þú þarft að nota skjalabyggðan NoSQL gagnagrunn. Þó að þessar veitendur séu vel samþættar, óhlutbundnar og forstilltar, geturðu í raun átt samskipti við hvaða gagnagrunnskerfi sem er sem þú getur notað með .NET.",
    "ModularArchitectureExplanation2": "Modularity er fyrsta flokks borgari í ABP.IO pallinum. Öllum forritavirkni er skipt í vel einangraðar valfrjálsar einingar. Upphafslausnin kemur nú þegar með grundvallar <a href=\"/modules\" class=\"text-primary\">ABP Commercial einingarnar</a> foruppsettar. Þú getur líka búið til þínar eigin einingar til að byggja upp einingakerfi fyrir þitt eigið forrit.",
    "MultiTenancyForSaasBusiness": "Fjölleigusamningur fyrir SaaS fyrirtæki þitt",
    "MultiTenancyForSaasBusinessExplanation": "ABP Commercial býður upp á fullkomið, enda-til-enda fjölleigukerfi til að búa til SaaS (Software-as-a-Service) kerfin þín. Það gerir leigjendum kleift að deila eða hafa sína eigin gagnagrunna með gagnagrunnssköpun og flutningskerfi á flugi.",
    "MicroserviceStartupSolution": "Microservice Startup Solution",
    "MicroserviceArchitectureExplanation2": "Þú getur fengið það fyrir næsta smáþjónustukerfi þitt til að nýta þér forbyggðu grunnlausnina og eimuðu reynsluna.",
    "PreIntegratedTools": "Forsamþætt við vinsæl verkfæri",
    "PreIntegratedToolsExplanation": "Lausnin er nú þegar samþætt í iðnaðarstöðluðum verkfærum og tækni, á meðan þú getur alltaf breytt þeim og samþætt við uppáhalds verkfærin þín.",
    "SingleSignOnAuthenticationServer": "Staðfestingarþjónn fyrir staka innskráningu",
    "SingleSignOnAuthenticationServerExplanation": "Lausnin er með auðkenningarmiðlaraforrit sem er notað af hinum forritunum sem einn innskráningarþjónn með API aðgangsstjórnunareiginleikum. Það er byggt á IdentityServer.",
    "WebAppsWithGateways": "2 vefforrit með 2 API gáttum",
    "WebAppsWithGatewaysExplanation": "Lausnin inniheldur tvö vefforrit, hvert þeirra er með sérstaka API-gátt (BFF - Backend For Frontend mynstur).",
    "BackOfficeApplication": "Back Office umsókn",
    "BackOfficeApplicationExplanation": "Raunverulegt vefforrit kerfisins þíns, með mörgum valmöguleikum UI ramma. Þú getur búið til hvers konar viðskiptaforrit.",
    "LandingWebsite": "Lendingarvefsíða",
    "LandingWebsiteExplanation": "Almenn lendingar-/opinber vefsíða sem hægt er að nota í ýmsum tilgangi, eins og að kynna fyrirtækið þitt, selja vörur þínar osfrv.",
    "ABPFrameworkEBook": "Að læra ABP Framework rafbók",
    "MasteringAbpFrameworkEBookDescription": "Innifalið í ABP Commercial leyfinu þínu",
    "FullName": "Fullt nafn",
    "LicenseTypeNotCorrect": "Tegund leyfisins er ekki rétt!",
    "Trainings": "Æfingar",
    "ChooseTrainingPlaceholder": "Veldu þjálfun...",
    "DoYouNeedTrainings": "Vantar þig eina af þessum þjálfun?",
    "DoYouNeedTraining": "Þarftu {0} þjálfun?",
    "GetInTouchUs": "Hafðu samband við okkur",
    "ForMoreInformationClickHere": "Fyrir frekari upplýsingar, smelltu <a href='{0}'>hér.</a>",
    "ForMoreInformationClickHereByClass": "<span class=\"{1}\">Fyrir frekari upplýsingar, smelltu</span> <a href='{0}'>hér.</a>",
    "IsGetOnboardingTraining": "Langar þig að fá þjálfun um borð og þróun vefforrita?",
    "OnboardingWebApplicationDevelopmentTrainingMessage": "Til að skipuleggja æfingadagatalið þitt skaltu hafa samband við {0} eftir að fyrirtækið hefur verið stofnað",
    "CustomPurchaseMessage": "Fyrir næsta skref, smelltu á {0} til að hafa samband við okkur.",
    "Note": "Athugið",
    "AdditionalNote": "Viðbótarathugasemd",
    "OnboardingTrainingFaqTitle": "Ertu með ABP umborðsþjálfun?",
    "OnboardingTrainingFaqExplanation": "Já, við höfum ABP þjálfunarþjónustu til að hjálpa þér að koma ABP verkefninu þínu hratt af stað. Þú munt læra um ABP frá ABP kjarna liðsmanni og þú munt fá færni til að hefja ABP verkefnið þitt. Í farþjálfuninni munum við útskýra hvernig á að setja upp þróunarumhverfið þitt, setja upp nauðsynleg verkfæri og búa til fullkomlega virka CRUD síðu. Fræðslan verður í beinni og Zoom forritið verður notað, við erum opin fyrir því að nota aðra netfundarvettvang. Tungumál kennslunnar verður enska. Þú getur líka spurt spurninga þinna um ABP á fundunum. Hentugur tími og dagsetning verður skipulögð fyrir báða aðila. Til að fá frekari upplýsingar, hafðu samband við okkur á <a href=\"mailto:info@abp.io\">info@abp.io</a> .",
    "AddBasket": "Setja í körfu",
    "SendTrainingRequest": "Sendu þjálfunarbeiðni",
    "OnlyEnglishVersionOfThisDocumentIsTheRecentAndValid": "* Enska útgáfan af þessu skjali er sú nýjasta og enska útgáfan mun gilda í öllum deilum.",
    "Pricing_Page_Title": "Verðlagning og áætlanir",
    "Pricing_Page_Description": "Veldu þá eiginleika og virkni sem fyrirtækið þitt þarfnast í dag. Kauptu ABP Commercial leyfi og búðu til ótakmarkað verkefni.",
    "Pricing_Page_HurryUp": "Flýttu þér!",
    "Pricing_Page_BuyLicense": "Kauptu leyfi á <strong>2021 verði</strong> til 16. janúar!",
    "Pricing_Page_ValidForExistingCustomers": "Gildir einnig fyrir núverandi viðskiptavini og leyfisendurnýjun.",
    "Pricing_Page_Hint1": "Leyfisverðið inniheldur ákveðinn fjölda þróunarsæta. Ef þú ert með fleiri forritara geturðu alltaf keypt fleiri sæti.",
    "Pricing_Page_Hint2": "Þú getur keypt fleiri forritaraleyfi núna eða í framtíðinni. Leyfi eru sætisbundin, svo þú getur flutt sæti frá einum þróunaraðila til annars.",
    "Pricing_Page_Hint3": "Þú getur þróað ótakmarkaðan fjölda mismunandi vara með leyfinu þínu.",
    "Pricing_Page_Hint4": "ABP Suite er tæki til að aðstoða þróun þína til að bæta framleiðni þína. Það styður að búa til CRUD síður og búa til ný verkefni.",
    "Pricing_Page_Hint5": "Þú getur notað allar forsmíðaðar einingarnar í forritunum þínum.",
    "Pricing_Page_Hint6": "Þú getur notað öll forsmíðuð þemu í forritunum þínum.",
    "Pricing_Page_Hint7": "Ræsingarsniðmát er Visual Studio lausn til að koma verkefninu þínu í gang. Öllum grundvallareiningum er bætt við og forstillt fyrir þig.",
    "Pricing_Page_Hint8": "Að læra ABP Framework rafbók útskýrir hvernig á að innleiða .NET lausnir með bestu starfsvenjum. Hún er seld á Amazon.com og þú getur halað niður bókinni ókeypis með leyfi þínu.",
    "Pricing_Page_Hint9": "Þú getur halað niður frumkóða hvaða einingu sem er. Þú gætir viljað bæta frumkóðann við lausnina þína til að gera róttækar breytingar eða bara halda honum fyrir sjálfan þig af öryggisástæðum.",
    "Pricing_Page_Hint10": "Leyfi eru til lífstíðar. Það þýðir að þú getur haldið áfram að þróa forritið þitt að eilífu. Aðgangur að nýjustu útgáfunni og stuðningur er veittur innan leyfistímabilsins (1 ár nema þú endurnýjar það).",
    "Pricing_Page_Hint11": "Engar takmarkanir á dreifingu! Þú getur sent á eins marga netþjóna og þú vilt, þar á meðal skýjaþjónustuna eða á staðnum.",
    "Pricing_Page_Hint12": "Þú getur uppfært einingar, þemu og verkfæri í nýjustu útgáfuna innan virka leyfistímabilsins þíns. Eftir að leyfið þitt rennur út þarftu að endurnýja það til að halda áfram að fá uppfærslur fyrir villuleiðréttingar, nýja eiginleika og endurbætur.",
    "Pricing_Page_Hint13": "Þú getur fengið aukagjaldsstuðninginn í eitt ár (þú getur endurnýjað leyfið þitt til að framlengja það).",
    "Pricing_Page_Hint14": "Liðs- og viðskiptaleyfi hafa takmörk fyrir fjölda atvika/spurninga. Ef þú kaupir viðbótarleyfi þróunaraðila hækkar atvikamörkin þín um {0} (fyrir liðsleyfið) eða {1} (fyrir viðskiptaleyfið) á hvern þróunaraðila.",
    "Pricing_Page_Hint15": "Aðeins Enterprise License inniheldur einkaaðstoð. Þú getur sent tölvupóst beint á ABP teymið eða spurt spurninga á support.abp.io með valmöguleika fyrir einkamiða. Einkamiðarnir eru ekki sýnilegir almenningi.",
    "Pricing_Page_Hint16": "Þú getur halað niður frumkóða allra ABP þema. Þú gætir viljað bæta frumkóðann við lausnina þína til að gera róttækar breytingar eða bara halda honum fyrir sjálfan þig af öryggisástæðum.",
    "Pricing_Page_Testimonial_1": "ABP Commercial leyfði SC Ventures að afhenda SaaS gagnagrunnsvettvang fyrir marga leigjendur í banka á 9 mánuðum til að styðja við fjármögnun viðskiptakrafna/viðskiptaskulda aðfangakeðjunnar á reikningum með verulegum verðmætum frá mörgum samþættum akkerum. Einingakerfi ABP gerði teymið mögulegt að afhenda á mettíma, fara framhjá öllum VAPT og dreifa gámamiklu örþjónustustaflanum með fullum CI/CD og leiðslum í framleiðslu.",
    "Pricing_Page_Testimonial_2": "Við sjáum gildi þess að nota ABP Commercial til að draga úr kostnaði við sérsniðnar þróunarverkefni. Teymið er fær um að sameina kóðamynstrið í mismunandi verkefnastraumum. Við sjáum meiri möguleika í rammanum fyrir okkur til að byggja nýja eiginleika hraðar en áður. Við treystum því að við munum stöðugt sjá gildi þess að nýta ABP Commercial.",
    "Pricing_Page_Testimonial_3": "Við elskum ABP. Við þurfum ekki að skrifa allt frá grunni. Við byrjum á út-af-the-boxinu eiginleikum og einbeitum okkur bara að því sem við þurfum í raun að skrifa. Einnig er ABP vel smíðað og kóðinn er hágæða með færri villur. Ef við þyrftum að skrifa allt sem við þurftum á eigin spýtur gætum við þurft að eyða árum saman. Eitt enn sem okkur líkar er að nýja útgáfan, lagfæring eða endurbætur koma út mjög fljótlega aðra hverja viku. Við bíðum ekki of lengi.",
    "Pricing_Page_Testimonial_4": "ABP Commercial er frábær vara sem ég mæli með. Auglýsingavörur á markað fyrir viðskiptavini okkar á einum stillanlegum vettvangi. Stökkið byrjar sem umgjörðin og verkfærin veita hvaða lið sem er hverrar cent virði. ABP Commercial var best fyrir þarfir okkar.",
    "Pricing_Page_Testimonial_5": "ABP Framework er ekki aðeins rammi, heldur er það einnig leiðarvísir fyrir þróun/stjórnun verkefna, vegna þess að það veitir DDD, GenericRepository, DI, Microservice og Modularity þjálfun. Jafnvel þótt þú ætlir ekki að nota rammann sjálfan geturðu þróað sjálfan þig með docs.abp.io sem er vel og faglega undirbúinn (OpenIddict, Redis, Quartz o.fl.). Vegna þess að margt er forsmíðað styttir það þróunartíma verkefnisins verulega (svo sem innskráningarsíðu, meðhöndlun undantekninga, gagnasíun, sáningu, endurskoðunarskráningu, staðfærslu, sjálfvirkan API stjórnandi osfrv.). Sem dæmi úr forritinu okkar hef ég notað Local Event Bus fyrir lagerstýringu. Þannig að ég get stjórnað pöntunarhreyfingum með því að skrifa lager meðhöndlun. Það er dásamlegt að missa ekki tíma fyrir CreationTime, CreatorId. Verið er að fylla þær sjálfkrafa.",
    "Pricing_Page_Testimonial_6": "ABP Framework er góður rammi en það þarf tíma til að skilja mismunandi lög, flokka og bókasöfn sem það notar (sérstaklega ABP). Ég eyddi miklum tíma í að lesa kóðagrunninn, en ABP Commercial sparaði okkur tíma við að búa til sérgreinaeiningar verkefnisins (AR) og geymsluna sem tengdust hverjum þeirra. Mér líkaði líka að nálgunin sem notuð er í ABP er mjög þroskuð; við vitum að byggir á DDD og monolith.",
    "Pricing_Page_Testimonial_7": "Sem gangsetning þurfum við að endurtaka hratt og eyða lágmarks tíma í ketilplötu og eiginleika sem ekki eru kjarna. \n Verkfræðingar okkar eru allt frá mjög reyndum til yngri verkfræðinga, og við þurftum sameiginlegan skilning og leið til að deila tækni- og lénsþekkingu, ABP leyfði okkur að gera þetta vegna frábærra leiðbeininga og skjala. \n Það eru hlutir sem við höfum ekki þurft að hafa áhyggjur af þar sem þeir vinna úr kassanum með ABP. \n ABP hjálpaði okkur að hagræða hraðri frumgerð og þróun, innan við 4 vikur frá upphafi eiginleika til framleiðslu. Með öllum hágæða eiginleikum þess innifalinn í leyfinu hefur ABP gefið okkur „Startup in a Box“ á hugbúnaðarverkfræðihliðinni.",
    "Pricing_Page_Testimonial_8": "Ég myndi mæla með ABP auglýsing fyrir alla þá sem vilja auka vöruúrvalið sem er í boði fyrir viðskiptavini sína. Það er frábært þegar þú þarft að nota dreifð fyrirtækisumhverfi (Angular, WPF, Win&amp;Linux). Fyrir utan vörurnar þeirra elskum við stuðning þeirra, sem gerir starf okkar hraðara og auðveldara. Við vitum nú þegar að við höfum fundið frábæran samstarfsaðila til framtíðar sem mun styðja okkur við að auka viðskipti okkar.",
    "Pricing_Page_Testimonial_9": "Við erum fyrirtæki með 2 starfsmenn sem hafa verið í viðskiptum í yfir 20 ár. \n Hvað varðar reynslu okkar af ABP Commercial, leitaði til okkar viðskiptavinar sem óskaði eftir því að við þróuðum nýtt mannauðsforrit í nútímalegu umhverfi í stað 25 ára gamla Access forritsins þeirra. Við ákváðum að skipta úr skrifborðslausn yfir í veflausn. \n \n Á þeim tíma höfðum við mjög litla þekkingu á vefforritum og .NET, en við rákumst á ABP Commercial og með hjálp ABP Framework, tækniskjala og ABP Suite gátum við ekki aðeins þróað forritið til að forskriftir viðskiptavinarins en einnig að vinna í .NET umhverfi innan árs.",
    "AbpBookDownloadArea_ClaimYourEBook": "Gerðu kröfu <span class='gradient-framework'>um Mastering ABP Framework</span> rafbókina þína",
    "AddMemberModal_Warning_1": "Ef <strong>notandanafnið</strong> sem þú ert að reyna að bæta við er ekki til í kerfinu skaltu biðja liðsmann þinn að skrá sig á <a href='{0}/Account/Register'>{0}</a> og deila notendanafninu á reikningnum sínum með þér.",
    "MyOrganizations_Detail_WelcomeMessage": "Velkomin í fyrirtækið þitt, {0}",
    "MyOrganizations_Detail_OrganizationManagement": "<span class=\"gradient-commercial\">Skipulagsstjórnun</span>",
    "OrganizationDisplayName": "Sýningarnafn stofnunar",
    "MyOrganizations_Detail_EditDisplayName": "Breyta skjánafni",
    "MyOrganizations_Detail_UpgradeYourLicense": "Uppfærðu leyfið þitt",
    "MyOrganizations_Detail_LicenseStartAndExpiryDate": "Upphafsdagur leyfis - Fyrningardagsetning",
    "MyOrganizations_Detail_OwnerRightInfo": "Þú ert að nota {0} af {1} eigendaréttindum þínum.",
    "MyOrganizations_Detail_CopyApiKey": "Afritaðu lykilinn",
    "MyOrganizations_Detail_ApiKeyDescription": "API lykillinn er tákn PRO pakka sem hýst er á <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{1}.</a>",
    "MyOrganizations_Detail_YourPrivateNugetSource": "Einka NuGet uppspretta þín er <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{0}</a>",
    "MyOrganizations_Detail_PrivateNugetSourceWarning": "Þessu er sjálfkrafa bætt við sem straumi í NuGet.Config þinn í ABP lausninni þinni. Ekki deila einkalyklinum þínum með óviðkomandi notendum!",
    "MyOrganizations_Detail_DeveloperSeatInfo": "Þú ert að nota {0} af {1} þróunarsætum þínum.",
    "NeedMoreSeatsForYourTeam": "Vantar þig fleiri sæti fyrir liðið þitt?",
    "MyOrganizations_Detail_PricePerYear": "{0} / á ári",
    "MyOrganizations_Detail_PurchaseDeveloperSeats": "Kaupa þróunarsæti",
    "Invoices": "Reikningar",
    "RequestInvoice": "Óska eftir reikningi",
    "OrderNumber": "Pöntunarnúmer",
    "Date": "Dagsetning",
    "Products": "Vörur",
    "TotalPrice": "Heildarverð",
    "ThereIsNoInvoice": "Það er enginn reikningur",
    "MyOrganizations_Detail_PaymentProviderInfo": "Ef þú hefur keypt leyfið þitt í gegnum <i>{0}</i> gátt, sendir það PDF reikninginn á netfangið þitt, sjá <a href=\"{1}\" target=\"_blank\">{0} reikningagerð.</a>",
    "MyOrganizations_Detail_PayUInfo": "Ef þú hefur keypt í gegnum <i>Iyzico</i> gáttina, smelltu á hnappinn „Biðja um reikning“ og fylltu út greiðsluupplýsingarnar.",
    "MyOrganizations_Detail_ConclusionInfo": "Reikningsbeiðninni þinni verður lokið innan {0} virkra daga.",
    "ExtendYourLicense": "Framlengdu <span class=\"text-primary\">{0}</span> leyfið þitt",
    "Continue": "Halda áfram",
    "PurchaseLicense": "Kaupa {0} leyfi",
    "DownloadInvoiceModal_DownloadInvoice": "Sækja reikning",
    "DownloadInvoiceModal_SaveInformationOnlyOnce": "Þú getur aðeins vistað innheimtuupplýsingarnar þínar einu sinni.",
    "InvoiceModal_EnterCompanyName": "Sláðu inn löglegt nafn fyrirtækis þíns...",
    "InvoiceModal_EnterCompanyAddress": "Sláðu inn löglegt heimilisfang fyrirtækis þíns...",
    "InvoiceModal_EnterTaxNumber": "Sláðu inn SKATT/VSK númerið þitt ef það er tiltækt...",
    "RequestInvoiceModal_EnterNotes": "Sláðu inn aukaskilaboðin þín um reikninginn þinn...",
    "PrePayment_PayWithIyzico": "Þú borgar með Iyzico",
    "ContinueToCheckout": "Haltu áfram í Checkout",
    "PrePayment_IyzicoRedirectionInfo": "Þér verður vísað á Iyzico Payment Gateway til að ganga frá kaupum þínum á öruggan hátt.",
    "PrePayment_IyzicoAcceptVisaAndMasterCard": "Iyzico tekur við Visa og MasterCard.",
    "Purchase": "Kaup",
    "AcceptTermsAndConditions": "Ég hef lesið, skilið og samþykki <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">persónuverndarstefnuna</a> , <a href=\"{1}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">skilmála og skilyrði</a> og <a href=\"{2}\" target=\"_blank\" class=\"text-primary\">ESBLA.</a>",
    "AcceptTermsAndConditionsWarningMessage": "Vinsamlegast samþykktu persónuverndarstefnuna og skilmálana",
    "SelectGatewayToContinue": "Vinsamlegast veldu hlið til að halda áfram!",
    "GatewaySelection_SelectGateway": "Veldu greiðslugátt",
    "GatewaySelection_RedirectionMessage": "Næst verður þér vísað á vefsíðu valinnar greiðslugáttar fyrir viðskiptin.",
    "PaymentSucceed_PaymentSuccessMessage": "Greiðsla tókst",
    "PaymentSucceed_ThanksForPurchase": "Takk fyrir viðskiptin!",
    "PaymentSucceed_CreateYourOrganization": "Búðu til fyrirtæki þitt",
    "PaymentSucceed_AddMeAsDeveloper": "Ég er þróunaraðili líka, bættu mér við sem þróunaraðila við fyrirtækið mitt.",
    "PaymentSucceed_CreateOrganization": "Búðu til stofnun",
    "PaymentSucceed_OrganizationDescription": "Stofnun samanstendur af þróunaraðilum og eigendum. Hönnuðir eru notendur sem skrifa kóða á ABP verkefnið og munu njóta góðs af <a href=\"{0}\" target=\"_blank\">{1}</a> vefsíðunni. Eigendur eru notendur sem úthluta þróunarsæti og stjórna leyfisveitingum.",
    "PaymentSucceed_ViewOrganization": "Smelltu hér til að skoða skipulag",
    "Purchase_TotalAnnualPrice": "TOTAL <small class=\"opacity-50\">(árlegt gjald)</small>",
    "Purchase_TrainingPrice": "Þjálfunarverð",
    "Purchase_OnboardingTraining": "Um borð og vefumsóknaþróun Lifandi þjálfun",
    "TotalDeveloperPrice": "Heildarverð þróunaraðila",
    "Purchase_PricePerDeveloper": "<span>{0} {1}</span> á hvern þróunaraðila",
    "Purchase_IncludedDeveloperInfo": "{0} {1} innifalinn.",
    "Purchase_LicenseExtraDeveloperPurchaseMessage": "<span class=\"fw-bold\">{0} Leyfið</span> inniheldur {1} forritara. Þú getur bætt við fleiri forriturum.",
    "StartupTemplates_Page_Title": "ABP ræsingarsniðmát",
    "StartupTemplates_Page_Description": "ABP Commercial gerir þér kleift að smíða lausnir með hvaða flækjustig sem er. Það býður upp á tvær helstu forsmíðaðar gangsetningarlausnir. Þú getur valið þann sem er nálægt þörfum þínum og byggt þína eigin sérsniðnu lausn ofan á hana.",
    "MicroserviceStartupSolutionForDotnet": "Microservice Startup Solution fyrir .NET",
    "MonolithSolutionForDotnet": "Monolith (modular) Lausn fyrir .NET",
    "TrainingDetailsHeaderInfo_TrainingHour": "{0} klukkustundir",
    "Trainings_Content": "Innihald þjálfunar",
    "Trial_Page_StartYourFreeTrial": "Byrjaðu <span class=\"gradient-commercial\">ókeypis prufuáskrift</span> þína",
    "TrialLicenseFeatures": "Þú munt geta notið góðs af öllum ABP auglýsingum",
    "TrialPeriodDays": "Þú munt hafa {0} daga liðsleyfi",
    "TrialForumSupportIncident": "Þú munt hafa {0} stuðningsatvik á vettvangi",
    "Contact_Page_Title": "Hafðu samband við ABP þróunarteymi",
    "Contact_Page_Description": "Hafðu samband við ABP þróunarteymi, ef þú þarft einhverja hjálp eða deildu hugsunum þínum og skoðunum! ABP Support Team er tilbúið til að hjálpa.",
    "Demo_Page_Title": "Búðu til kynningu",
    "Demo_Page_Description": "Búðu til ókeypis kynningu til að sjá sýnishorn af forriti sem búið er til með ABP Commercial ræsingarsniðmátinu. Ekki endurtaka þig fyrir algengar umsóknarkröfur.",
    "Discounted_Page_Title": "Afsláttur verð",
    "Discounted_Page_Description": "Veldu þá eiginleika og virkni sem fyrirtækið þitt þarfnast í dag. Kauptu ABP Commercial leyfi og búðu til ótakmarkað verkefni",
    "Faq_Page_Title": "Algengar spurningar (algengar spurningar)",
    "Faq_Page_Description": "Hefur þú einhverjar spurningar? Leitaðu að algengum spurningum eða spurðu okkur spurningar með því að nota snertingareyðublaðið.",
    "Faq_Page_SwiftCode": "SWIFT kóða",
    "Faq_Page_BankName": "Nafn banka",
    "Faq_Page_AccountName": "Nafn reiknings",
    "Faq_Page_AccountNumber": "Reikningsnúmer",
    "Faq_Page_Currency": "Gjaldmiðill",
    "Faq_Page_VatNumber": "VSK númer",
    "Faq_Page_OtherCurrenciesInfo": "Fyrir aðra gjaldmiðla, sjá <a href='{0}'>alla reikninga</a>",
    "ProjectCreatedSuccess_Page_Title": "Verkefnið þitt búið til",
    "ProjectCreatedSuccess_Page_Description": "ABP verkefnið þitt var búið til með góðum árangri!",
    "Suite_Page_Title": "ABP svíta",
    "Suite_Page_Description": "ABP Commercial býður upp á hraðvirk forritaþróunartæki til að auka framleiðni þróunaraðila. ABP Suite gerir þér kleift að búa til CRUD síður auðveldlega.",
    "Themes_Page_Title": "ABP þemu",
    "Themes_Page_Description": "ABP Commercial býður upp á mörg fagleg, nútímaleg viðmótsþemu. Búðu til ókeypis kynningu til að fá skjóta sýn á hvernig notendaviðmótið lítur út.",
    "Tools_Page_Title": "Hröð forritaþróunartæki",
    "Tools_Page_Description": "ABP Commercial býður upp á hraðvirk forritaþróunartæki til að auka framleiðni þróunaraðila. ABP Suite gerir þér kleift að búa til CRUD síður auðveldlega.",
    "DeveloperPrice": "Verð þróunaraðila",
    "AdditionalDeveloperPaymentInfoSection_AdditionalDevelopers": "{0} <small>verktaki</small>",
    "LicenseRemainingDays": "í <span>{0}</span> daga",
    "ExtendPaymentInfoSection_Description": "Með því að framlengja/endurnýja leyfið muntu halda áfram að fá <a href=\"{0}\" target=\"_blank\">úrvalsstuðning</a> . Þú munt einnig geta fengið meiriháttar eða minniháttar uppfærslur fyrir einingar og þemu. Þú munt geta haldið áfram að búa til ný verkefni. Og þú munt samt geta notað <a href=\"{1}\" target=\"_blank\">ABP Suite</a> sem flýtir fyrir þróun þinni.",
    "LicenseRenewalPrice": "Endurnýjunarverð leyfis",
    "LicensePrice": "Leyfisverð",
    "TrialLicensePaymentInfoSection_Description": "<strong>Kaupaleyfi:</strong> Með því að kaupa leyfi muntu halda áfram að fá <a href=\"{0}\" target=\"_blank\" rel=\"noopener\">úrvalsstuðning</a> . Þú munt einnig geta fengið meiriháttar eða minniháttar uppfærslur fyrir einingar og þemu. Þú munt geta haldið áfram að búa til ný verkefni. Og þú munt samt geta notað <a href=\"{1}\" target=\"_blank\" rel=\"noopener\">ABP Suite</a> sem flýtir fyrir þróun þinni.<br> Sjá <a href=\"{2}\" target=\"_blank\" rel=\"noopener\">leyfissamanburðartöfluna</a> til að athuga muninn á leyfisgerðunum.",
    "SelectTargetLicense": "Veldu Target License",
    "UpgradePaymentInfoSection_ExtendMyLicenseForOneYear": "Já, framlengdu gildistíma leyfisins um 1 ár.",
    "UpgradePaymentInfoSection_WantToExtendLicense": "Viltu framlengja leyfið um 1 ár í viðbót?",
    "UpgradePaymentInfoSection_UpgradingWillNotExtendLicense": "Uppfærsla mun ekki lengja gildistíma leyfis þíns!",
    "UpgradePaymentInfoSection_LicenseUpgradeDescription": "Með því að uppfæra leyfið þitt færðu upp í hærri leyfistegund, sem gerir þér kleift að fá frekari fríðindi. Sjá <a href=\"/Pricing\" target=\"_blank\">leyfissamanburðartöfluna</a> til að athuga muninn á leyfisgerðunum.",
    "Landing_Page_CustomerStories": "Sögur viðskiptavina",
    "Landing_Page_OurGreatCustomers": "Frábærir viðskiptavinir okkar",
    "Landing_Page_WebApplicationFramework": "Vefumsóknarrammi",
    "Landing_Page_WebDevelopmentPlatform": "Vefþróunarvettvangur",
    "Landing_Page_CompleteWebDevelopmentPlatform": "Heill vefþróunarvettvangur",
    "Landing_Page_TryFreeDemo": "Prófaðu ókeypis kynningu",
    "Landing_Page_StartingPointForWebApplications": "Upphafspunktur fyrir ASP.NET Core byggð vefforrit! Það er byggt á ABP Framework fyrir bestu vefþróun.",
    "Landing_Page_AbpProvidesSoftwareInfrastructure": "ABP Framework býður upp á hugbúnaðarinnviði til að þróa framúrskarandi vefforrit með bestu starfsvenjum.",
    "Landing_Page_MicroserviceCompatibleArchitecture": "Microservice samhæfður arkitektúr",
    "Landing_Page_PreBuiltApplicationModulesAndThemes": "Forsmíðaðar forritaeiningar og þemu",
    "Landing_Page_MultiTenantArchitecture": "Arkitektúr með mörgum leigjendum",
    "Landing_Page_MultiTenancyDescription": "SaaS forrit auðveld! Samþætt fjölleigu frá gagnagrunni yfir í HÍ.",
    "Landing_Page_DDDIntroduction": "Hannað og þróað út frá DDD mynstrum og meginreglum. Veitir lagskipt líkan fyrir forritið þitt.",
    "Landing_Page_CrossCuttingConcernsInfo": "Fullkominn innviði fyrir heimildir, löggildingu, meðhöndlun undantekninga, skyndiminni, endurskoðunarskráningu, viðskiptastjórnun og fleira.",
    "Landing_Page_PreBuiltApplicationModules": "Forsmíðaðar forritaeiningar sem innihalda algengustu kröfur um vefforrit.",
    "Landing_Page_ChatModule": "Spjall",
    "Landing_Page_DocsModule": "Skjöl",
    "Landing_Page_FileManagementModule": "Skráastjórnun",
    "Landing_Page_CustomerStory_1": "ABP Commercial leyfði SC Ventures að afhenda SaaS gagnagrunnsvettvang fyrir marga leigjendur í banka á 9 mánuðum til að styðja við fjármögnun viðskiptakrafna / viðskiptaskulda aðfangakeðjunnar á reikningum um veruleg verðmæti frá mörgum samþættum akkerum. Einingakerfi ABP gerði teymið mögulegt að afhenda á mettíma, fara framhjá öllum VAPT og dreifa gámamiklu örþjónustustaflanum með fullum CI/CD og leiðslum í framleiðslu.",
    "Landing_Page_CustomerStory_2": "Við sjáum gildi þess að nota ABP Commercial til að draga úr kostnaði við sérsniðnar þróunarverkefni. Teymið getur sameinað kóðamynstrið í mismunandi verkefnastraumum. Við sjáum meiri möguleika í rammanum fyrir okkur til að byggja nýja eiginleika hraðar en áður. Við treystum því að við munum stöðugt sjá gildi þess að nýta ABP Commercial.",
    "Landing_Page_CustomerStory_3": "Við elskum ABP. Við þurfum ekki að skrifa allt frá grunni. Við byrjum á út-af-the-boxinu eiginleikum og einbeitum okkur bara að því sem við þurfum í raun að skrifa. Einnig er ABP vel smíðað og kóðinn er hágæða með færri villur. Ef við þyrftum að skrifa allt sem við þurftum á eigin spýtur gætum við þurft að eyða árum saman. Eitt enn sem okkur líkar er að nýja útgáfan, eða lagfæring á vandamálum, eða endurbætur kemur út mjög fljótlega \n aðra hverja viku. Við bíðum ekki of lengi.",
    "Landing_Page_CustomerStory_4": "ABP Commercial er frábær vara sem ég mæli með. Auglýsingavörur á markað fyrir viðskiptavini okkar á einum stillanlegum vettvangi. Stökkið byrjar sem umgjörðin og verkfærin veita hvaða lið sem er hverrar cent virði. ABP Commercial var best fyrir þarfir okkar.",
    "Landing_Page_AdditionalServices": "Sérsniðið leyfi eða magn leyfis, inngöngu um borð, lifandi þjálfun og stuðningur, sérsniðin verkefnaþróun, flutningur á núverandi verkefnum og fleira...",
    "Landing_Page_IncludedDeveloperLicenses": "Innifalið <strong>{0}</strong> forritaraleyfi",
    "Landing_Page_SeeOnDemo": "Sjá á Demo",
    "Landing_Page_LeptonThemes": "Lepton Þemu",
    "Landing_Page_AccountModuleDescription_1": "Þessi eining útfærir auðkenningarkerfið fyrir forrit;",
    "Landing_Page_AccountModuleDescription_2": "Býður upp á <strong>innskráningarsíðu</strong> með notandanafni og lykilorði",
    "Landing_Page_AccountModuleDescription_3": "Býður upp á <strong>skráningarsíðu</strong> til að búa til nýjan reikning.",
    "Landing_Page_AccountModuleDescription_4": "Býður upp á <strong>gleymt</strong> lykilorðssíðu til að senda hlekk <strong>til að endurstilla lykilorð</strong> sem tölvupóst.",
    "Landing_Page_AccountModuleDescription_5": "Býður upp á <strong>staðfestingarvirkni tölvupósts</strong> með notendaviðmóti.",
    "Landing_Page_AccountModuleDescription_6": "Innleiðir <strong>tveggja þátta</strong> auðkenningu (SMS og tölvupóstur).",
    "Landing_Page_AccountModuleDescription_7": "Innleiðir <strong>læsingu notenda</strong> (læsir reikningnum í ákveðinn tíma þegar ákveðinn fjöldi misheppnaðra innskráninga á sér stað vegna ógildra skilríkja innan ákveðins tíma).",
    "Landing_Page_AccountModuleDescription_8": "Innleiðir <strong>auðkenningarmiðlara notendaviðmót</strong> og virkni.",
    "Landing_Page_AccountModuleDescription_9": "Gerir kleift að <strong>skipta á milli leigjenda</strong> í fjölleigjanda umhverfi.",
    "Landing_Page_AccountModuleDescription_10": "Leyfir að breyta <strong>UI tungumáli</strong> forritsins.",
    "Landing_Page_AuditLoggingModuleDescription_1": "Þessi eining býður upp á notendaviðmót endurskoðunarskrárskýrslu fyrir endurskoðunarinnviðina. Gerir kleift að leita, sía og sýna endurskoðunarskrárfærslur og einingarbreytingaskrár.",
    "Landing_Page_AuditLoggingModuleDescription_2": "Endurskoðunarskrárfærsla samanstendur af mikilvægum gögnum um hverja beiðni viðskiptavinar:",
    "Landing_Page_AuditLoggingModuleDescription_3": "Vefslóð, vafri, IP-tala, nafn viðskiptavinar",
    "Landing_Page_AuditLoggingModuleDescription_4": "Notandinn",
    "Landing_Page_AuditLoggingModuleDescription_5": "HTTP aðferð, HTTP skila stöðukóði",
    "Landing_Page_AuditLoggingModuleDescription_6": "Árangur/bilun, upplýsingar um undantekningar ef þær eru tiltækar",
    "Landing_Page_AuditLoggingModuleDescription_7": "Biðja um framkvæmdartíma",
    "Landing_Page_AuditLoggingModuleDescription_8": "Einingarnar hafa verið búnar til, eytt eða uppfært í þessari beiðni (með breyttum eiginleikum).",
    "Landing_Page_BloggingModuleDescription_1": "Þessi eining bætir einföldu bloggi við ABP forritið þitt;",
    "Landing_Page_BloggingModuleDescription_2": "Gerir kleift að búa til mörg blogg í einu forriti.",
    "Landing_Page_BloggingModuleDescription_3": "Styður Markdown sniðið.",
    "Landing_Page_BloggingModuleDescription_4": "Leyfir að skrifa athugasemd fyrir færslu.",
    "Landing_Page_BloggingModuleDescription_5": "Gerir kleift að tengja merki á bloggfærslurnar.",
    "Landing_Page_BloggingModuleDescription_6": "Sjáðu <a href=\"blog.abp.io\">blog.abp.io</a> vefsíðuna sem lifandi dæmi um bloggeininguna.",
    "Landing_Page_ChatModuleDescription_1": "Þessi eining er notuð fyrir rauntíma skilaboð á milli notenda í forritinu.",
    "Landing_Page_ChatModuleDescription_2": "Rauntíma skilaboð á spjallsíðunni.",
    "Landing_Page_ChatModuleDescription_3": "Leitaðu að notendum í forritinu að nýjum samtölum.",
    "Landing_Page_ChatModuleDescription_4": "Tengiliðalisti fyrir nýleg samtöl.",
    "Landing_Page_ChatModuleDescription_5": "Tilkynningar um ný skilaboð þegar notandi er að skoða aðra síðu.",
    "Landing_Page_ChatModuleDescription_6": "Heildarfjölda ólesin skilaboðamerki á valmyndartákninu.",
    "Landing_Page_ChatModuleDescription_7": "Fjöldi ólesinna skilaboða fyrir hvert samtal.",
    "Landing_Page_ChatModuleDescription_8": "Latur hlaðinn samtöl.",
    "Landing_Page_DocsModuleDescription_1": "Þessi eining er notuð til að búa til vefsíður fyrir tækniskjöl;",
    "Landing_Page_DocsModuleDescription_2": "Innbyggð <strong>GitHub samþætting</strong> : Skrifaðu og stjórnaðu skjölum beint á GitHub.",
    "Landing_Page_DocsModuleDescription_3": "<strong>Útgáfustuðningur</strong> beint samþættur GitHub útgáfum.",
    "Landing_Page_DocsModuleDescription_4": "Styður <strong>fjöltungumál</strong> (með varastuðningi við sjálfgefið tungumál).",
    "Landing_Page_DocsModuleDescription_5": "Styður <strong>Markdown</strong> og HTML sniðin.",
    "Landing_Page_DocsModuleDescription_6": "Veitir <strong>leiðsögn</strong> og <strong>útlínur</strong> hluta.",
    "Landing_Page_DocsModuleDescription_7": "Gerir kleift að hýsa skjöl <strong>fyrir mörg verkefni</strong> í einu forriti.",
    "Landing_Page_DocsModuleDescription_8": "Tenglar á skrána á GitHub, svo hver sem er getur auðveldlega lagt sitt af mörkum með því að smella á <strong>Breyta hlekkinn</strong> .",
    "Landing_Page_DocsModuleDescription_9": "Til viðbótar við GitHub uppsprettu, gerir það kleift að nota einfaldlega möppu sem heimildargjafa.",
    "Landing_Page_FileManagementModuleDescription_1": "Hlaða upp, hlaða niður og skipuleggja skrár í stigveldisskipulagi möppu.",
    "Landing_Page_FileManagementModuleDescription_2": "Þessi eining er notuð til að hlaða upp, hlaða niður og skipuleggja skrár í stigveldismöppuskipulagi. Það er líka samhæft við fjölleigu og þú getur ákvarðað heildarstærðarmörk fyrir leigjendur þína.",
    "Landing_Page_FileManagementModuleDescription_3": "Þessi eining er byggð á <a href=\"https://docs.abp.io/en/abp/latest/Blob-Storing\">BLOB geymslukerfinu</a> , þannig að það getur notað mismunandi geymsluveitur til að geyma innihald skráarinnar.",
    "Landing_Page_IdentityModuleDescription_1": "Þessi eining útfærir notanda- og hlutverkakerfi forrits;",
    "Landing_Page_IdentityModuleDescription_2": "Byggt á <a href=\"https://docs.microsoft.com/en-us/aspnet/core/security/authentication/identity\">ASP.NET Core Identity bókasafni Microsoft</a> .",
    "Landing_Page_IdentityModuleDescription_3": "Stjórna <strong>hlutverkum</strong> og <strong>notendum</strong> í kerfinu. Notanda er heimilt að hafa <strong>mörg hlutverk</strong> .",
    "Landing_Page_IdentityModuleDescription_4": "Stilltu <strong>heimildir</strong> í hlutverka- og notendastigum.",
    "Landing_Page_IdentityModuleDescription_5": "Virkja/slökkva á <strong>tveggja þátta auðkenningu</strong> og <strong>læsingu</strong> notanda fyrir hvern notanda.",
    "Landing_Page_IdentityModuleDescription_6": "Hafa umsjón með <strong>grunnnotandasniði</strong> og <strong>lykilorði</strong> .",
    "Landing_Page_IdentityModuleDescription_7": "Stjórna <strong>kröfugerðum</strong> í kerfinu, stilla kröfur á hlutverk og notendur.",
    "Landing_Page_IdentityModuleDescription_8": "Stillingarsíðu til að stjórna <strong>flækjustigi lykilorðs</strong> , innskráningu notanda, reikningi og læsingu.",
    "Landing_Page_IdentityModuleDescription_9": "Styður <strong>LDAP</strong> auðkenningu.",
    "Landing_Page_IdentityModuleDescription_10": "Veitir staðfestingu <strong>á tölvupósti og símanúmeri</strong> .",
    "Landing_Page_IdentityModuleDescription_11": "Styður samþættingu félagslegra innskráningar (Twitter, Facebook, GitHub osfrv.).",
    "Landing_Page_IdentityModuleDescription_12": "Stjórna <strong>skipulagseiningum</strong> í kerfinu.",
    "Landing_Page_PaymentModuleDescription_1": "Veitir samþættingu fyrir mismunandi greiðslugáttir.",
    "Landing_Page_PaymentModuleDescription_2": "Þessi eining veitir samþættingu fyrir greiðslugáttir, svo þú getur auðveldlega fengið greiðslur frá viðskiptavinum þínum.",
    "Landing_Page_PaymentModuleDescription_3": "Þessi eining styður eftirfarandi greiðslugáttir",
    "Welcome_Page_UseSameCredentialForCommercialWebsites": "Notaðu sömu skilríkin fyrir bæði <a href=\"https://commercial.abp.io\" class=\"text-primary\">commercial.abp.io</a> og <a href=\"https://support.abp.io\" class=\"text-primary\">support.abp.io</a> .",
    "WatchCrudPagesVideo": "Horfðu á &quot;Creating CRUD Pages with ABP Suite&quot; myndbandið!",
    "WatchGeneratingFromDatabaseVideo": "Horfðu á &quot;ABP Suite: Búa til CRUD síður úr núverandi gagnagrunnstöflum&quot; myndbandið!",
    "WatchTakeCloserLookVideo": "Horfðu á &quot;Skoðaðu nánar kóða kynslóðina: ABP Suite&quot; myndbandið!",
    "ConfirmedEmailAddressRequiredToStartTrial": "Þú ættir að hafa staðfest netfang til að hefja prufuleyfi.",
    "EmailVerificationMailNotSent": "Staðfestingarpóstur í tölvupósti gat ekki sent.",
    "GetConfirmationEmail": "<a href=\"javascript:void(0);\" id=\"{0}\" class=\"text-decoration-underline\">Smelltu hér til að fá staðfestingarpóst</a> ef þú hefur ekki fengið hann áður.",
    "WhichLicenseTypeYouAreInterestedIn": "Hvaða leyfistegund hefur þú áhuga á?",
    "DontTakeOurWordForIt": "Ekki taka orð okkar fyrir það...",
    "ReadAbpCommercialUsersWantYouToKnow": "Lestu það sem ABP Commercial notendur vilja að þú vitir",
    "Testimonial_ShortDescription_1": "Einingakerfi ABP gerði liðinu mögulegt að skila tímanlega.",
    "Testimonial_ShortDescription_2": "Byggðu nýja eiginleika hraðar en áður.",
    "Testimonial_ShortDescription_3": "Við byrjum á út-af-the-boxinu eiginleikum og einbeitum okkur bara að því sem við þurfum í raun að skrifa.",
    "Testimonial_ShortDescription_4": "ABP Commercial var best fyrir þarfir okkar.",
    "OnlineReviewersOnAbpCommercial": "Umsagnir á netinu um ABP Commercial",
    "SeeWhatToldAboutAbpCommercial": "Sjáðu hvað hefur verið sagt um ABP Commercial og skrifaðu hugsanir þínar ef þú vilt.",
    "BlazoriseLicense": "Þurfum við að kaupa Blazorise leyfi?",
    "BlazoriseLicenseExplanation": "Við erum með samning á milli Volosoft og Megabit, með þessum samningi er Blazorise leyfið fylgt með ABP Commercial vörum og því þurfa viðskiptavinir okkar ekki að kaupa auka Blazorise leyfi.",
    "ExtendPaymentInfoSection_DeveloperPrice": "{0}x viðbótarhönnuðir",
    "ExtendPaymentInfoSection_DiscountRate": "Afsláttur {0}%",
    "TotalNetPrice": "Heildarnettóverð",
    "EFCore": "Entity Framework Core",
    "All": "Allt",
    "Mvc": "MVC",
    "DataBaseProvider": "Gagnaveita",
    "UIFramework": "UI ramma",
    "LeptonXThemeForDashboard": "LeptonX þema fyrir stjórnunarborðið þitt eftir",
    "AbpPlatform": "ABP vettvangur",
    "YouDeserveGoodUXUI": "Þú átt skilið gott UI og betra UX. LeptonX Theme eftir ABP er hér til að þjóna því.",
    "ViewLiveDemo": "Skoðaðu kynningu á lifandi þema",
    "GetLeptonX": "Fáðu LeptonX núna",
    "SeeLeptonXDocumentation": "Sjá LeptonX skjöl",
    "SeeLeptonDocumentation": "Sjá Lepton Documentation",
    "SimplifiedMenu": "Einfaldur matseðill",
    "SimplifiedMenuDescription": "Þú getur auðveldlega fundið síðuna sem þú ert að leita að með því að sía valmyndina",
    "YourFavoritePages": "Uppáhaldssíðurnar þínar innan seilingar",
    "YourFavoritePagesDescription": "Bættu auðveldlega við eða fjarlægðu síðuna úr eftirlæti með því að smella á stjörnutáknið í efra hægra horninu á síðunni.",
    "BreadCrumbs": "Brauðmola fyrir óaðfinnanlega skiptingu",
    "BreadCrumbsDescription": "Með því að nota Breadcrumb geturðu skipt yfir á síðurnar á sama stigi með einum smelli, jafnvel þegar vinstri valmyndin er lokuð, og það virkar á spjaldtölvu og farsímum sem svara!",
    "YourMenu": "Matseðillinn þinn eins og þú vilt",
    "YourMenuDescription": "Sérsníddu beint smellanleg tákn og fellilista í notendavalmyndinni eins og þú vilt. Notendavalmyndin er fullkomlega sérsniðin að þínum þörfum",
    "RtlSupport": "RTL stuðningur fyrir tungumálið þitt",
    "RtlSupportDescription": "LeptonX Theme styður RTL fyrir tungumálið þitt. Tungumálavalkostirnir eru í stillingavalmyndinni svo þú getir breytt tungumálinu.",
    "YourColors": "Litirnir þínir á notendaviðmóti stjórnanda stjórnborðsins",
    "YourColorsDescription": "LeptonX Þema virkar í samræmi við kerfisstillingar þínar og hefur ljós þema mælaborðs, dökkt þema mælaborðs og hálfdökkt þema mælaborðs.",
    "ArrangeContentWidth": "Raða auðveldlega innihaldsbreidd þinni",
    "ArrangeContentWidthDescription": "Breyttu auðveldlega breidd efnissvæðisins þíns.",
    "LeptonXCompatibleWith": "LeptonX Þema er samhæft við",
    "MobileResponsiveTemplate": "Móttækilegt sniðmát fyrir farsíma",
    "MobileResponsiveTemplateDescription1": "Fáðu aðgang að LeptonX stjórnendaborðinu þínu úr hvaða tæki sem þú vilt.",
    "MobileResponsiveTemplateDescription2": "Það er hannað fyrir þig til að nota auðveldlega í hverju tæki þínu. Það er móttækilegt í farsímum og spjaldtölvum.",
    "TopMenuLayoutOption": "Uppsetningarvalkostur efst í valmyndinni",
    "TopMenuLayoutOptionDescription1": "Ef þú vilt setja upp vefsíðuna þína með sama stjórnborði, þá er hægt að gera það með LeptonX Þema!",
    "TopMenuLayoutOptionDescription2": "Prófaðu bara LeptonX efstu valmyndina til að láta það gerast!",
    "EasilyCustomizable": "Auðvelt að sérsníða fyrir vörumerkjalitina þína",
    "EasilyCustomizableDescription1": "Þú getur sérsniðið LeptonX þemað með því að nota aðeins nokkrar SCSS breytur. Engin hnekkja, engin auka CSS hleðsla!",
    "EasilyCustomizableDescription2": "Með LeptonX geturðu raðað stjórnborðinu þínu eins og þú vilt.",
    "IndependentLayout": "Sjálfstætt skipulag og efnissvæði",
    "IndependentLayoutDescription1": "Skipulagsinnviði LeptonX var hannaður algjörlega aðskilinn frá innihaldinu.",
    "IndependentLayoutDescription2": "Þetta þýðir að þú getur frjálslega hannað verkefnið þitt með annarri innihaldsuppbyggingu en Bootstrap ef þú vilt.",
    "MostUsedLibraries": "Mest notuð bókasöfn samþætt LeptonX",
    "MostUsedLibrariesDescription1": "LeptonX inniheldur mest notuðu bókasöfnin þín. Það gerir þér kleift að nota bókasöfn eins og ApexCharts, DataTables, DropZone, FullCalender, JSTree, Select2 og Toastr áreynslulaust.",
    "MostUsedLibrariesDescription2": "LeptonX styður einnig MVC Angular og Blazor sértæk bókasöfn.",
    "CreateAndCustomize": "Búðu til og sérsníddu síðurnar sem þú þarft á nokkrum sekúndum með LeptonX sérsniðnum síðum",
    "CreateAndCustomizeDescription": "Með því að nota LeptonX Theme hefurðu einnig aðgang að mörgum fyrirfram gerðum HTML síðum. Þetta felur í sér margar síður eins og innskráningarsíðu, blogg, algengar spurningar, áskriftarlisti, reikning, verðlagningu og skráastjórnun.",
    "LeptonThemeForAdmin": "Lepton Þema fyrir stjórnborðið þitt eftir",
    "LeptonThemeForAdminDescription": "Lepton Theme er enn í boði og verður viðhaldið. Ef þú vilt skipta yfir í LeptonX Theme sem Lepton Theme notanda geturðu séð skjölin til að læra hvernig á að gera það.",
    "LeptonCompatibleWith": "Lepton Þema er samhæft við",
    "BlackFridayDiscount": "Black Friday afsláttur",
    "UpgradePaymentInfoSection_DeveloperPrice": "{0} fyrir {1} forritara til viðbótar",
    "Upgrade": "Uppfærsla",
    "Renewal": "Endurnýjun",
    "UpgradePaymentInfoSection_LicensePrice": "{0} leyfi",
    "UpgradePaymentInfoSection_LicenseRenewalPrice": "Endurnýjun leyfis",
    "Total": "Samtals",
    "SupportPolicyFaqTitle": "Hver er stuðningsstefna þín?",
    "SupportPolicyFaqExplanation": "Við styðjum aðeins virku útgáfuna og fyrri útgáfuna. Við ábyrgjumst ekki plásturútgáfu fyrir 3. og eldri helstu útgáfur. Til dæmis, ef virka útgáfan er 7.0.0, munum við gefa út plástraútgáfur fyrir bæði 6.xx og 7.xx. Auk þess veitum við aðeins stuðning fyrir ABP Framework og ABP Commercial tengd málefni. Það þýðir að enginn stuðningur er veittur fyrir þriðja aðila forrit, skýjaþjónustu og önnur jaðarsöfn sem notuð eru af ABP vörum. Við munum beita viðskiptalegum viðleitni til að veita viðskiptavinum okkar tæknilega aðstoð á opinberum opnunartíma &quot;Volosoft Bilisim AS&quot;. Aftur á móti skuldbindum við okkur ekki til viðbragðstíma þjónustustigssamnings (SLA), en við munum reyna að bregðast við tæknilegum vandamálum eins fljótt og auðið er innan opinbers vinnutíma okkar. Nema sérstakur samningur sé gerður við viðskiptavininn, veitum við aðeins aðstoð á https://support.abp.io. Við höfum einnig einkapóststuðning, sem er aðeins í boði fyrir Enterprise leyfishafa.",
    "TotalDevelopers": "Samtals {0} þróunaraðilar",
    "CustomPurchaseExplanation": "Sérsniðin að þínum sérstökum þörfum",
    "WhereDidYouHearAboutUs": "Hvar heyrðirðu um okkur?",
    "Twitter": "Twitter",
    "Facebook": "Facebook",
    "Youtube": "Youtube",
    "Google": "Google",
    "Github": "GitHub",
    "Friend": "Frá vini",
    "Other": "Annað",
    "WhereDidYouHearAboutUs_explain": "Tilgreindu...",
    "DeletingMemberWarningMessage": "„{0}“ verður fjarlægt af lista yfir þróunaraðila. Ef þú vilt geturðu úthlutað þessu tóma sæti til annars þróunaraðila síðar.",
    "AdditionalInfo": "Ef þróunarsæti eru yfir kröfum þínum geturðu dregið úr þeim. Þú getur sent tölvupóst á <a href=\"mailto:info@abp.io\">info@abp.io</a> til að fjarlægja nokkur af þróunarsætum þínum. Að hreinsa ónotuð þróunarsæti mun draga úr endurnýjunarkostnaði leyfisins. Ef þú vilt geturðu keypt aftur auka þróunarsæti innan virka leyfistímabilsins. Athugaðu að þar sem það eru {0} forritarar í þessum leyfispakka geturðu ekki lækkað þennan fjölda.",
    "LinkExpiredErrorMessage": "Tengillinn sem þú ert að reyna að fá aðgang að er útrunninn.",
    "ExpirationDate": "Gildistími",
    "SpringCampaignDiscount": "Afsláttur af vorherferð",
    "WhyUseAbpIoPlatform": "Af hverju ætti ég að nota ABP.IO pallinn í stað þess að búa til nýja lausn frá grunni?",
    "WhyUseAbpIoPlatformFaqExplanation": "Sjá <a href=\"/why-abp-io \">þá síðu</a> til að fá nákvæma útskýringu á því hvers vegna notkun ABP.IO pallur hefur verulegan kost á því að gera allt sjálfur.",
    "EulaPageTitle": "Notendaleyfissamningur (EULA)",
    "PrivacyPolicyPageTitle": "Persónuverndarstefna - Vafrakökustefna",
    "TermsConditionsPageTitle": "Skilmálar og skilyrði",
    "TrainingsPageTitle": "ABP þjálfunarpakkar",
    "ModulesPageTitle": "ABP Forsmíðaðar forritaeiningar",
    "Volo.AbpIo.Commercial:040001": "API aðgangslykill er rangur.",
    "GetLepton": "Sæktu Lepton núna",
    "MyOrganizations_Detail_LicenseStartDate": "Upphafsdagur leyfis",
    "MyOrganizations_Detail_LicenseExpiryDate": "Fyrningardagsetning",
    "BlazoriseSupport": "Hvernig fæ ég Blazorise leyfislykil og stuðning frá Blazorise teyminu?",
    "BlazoriseSupportExplanation": "Fylgdu skrefunum hér að neðan til að fá stuðning frá Blazorise teyminu og fá Blazorise leyfislykilinn þinn:",
    "BlazoriseSupportExplanation1": "Skráðu þig fyrir nýjan reikning á <a href=\"https://blazorise.com/support/register\">blazorise.com/support/register</a> með sama netfangi og abp.io reikningurinn þinn. Skildu færsluna „Leyfislykill“ eftir auða. <strong>Það verður að vera sama netfang og netfangið þitt á abp.io.</strong>",
    "BlazoriseSupportExplanation2": "Staðfestu netfangið þitt með því að haka við netfangið þitt. Athugaðu ruslpósthólfið þitt ef þú sérð ekki tölvupóst í pósthólfinu þínu!",
    "BlazoriseSupportExplanation3": "Skráðu þig inn á Blazorise stuðningsvefsíðuna á <a href=\"https://blazorise.com/support/login\">blazorise.com/support/login</a> .",
    "BlazoriseSupportExplanation4": "Ef þú ert með virkt ABP Commercial leyfi muntu einnig hafa Blazorise PRO leyfi. Þú getur fengið Blazorise leyfislykilinn þinn á <a href=\"https://blazorise.com/support/user/manage/license\">blazorise.com/support/user/manage/license</a> .",
    "BlazoriseSupportExplanation5": "Þú getur sent spurningar þínar á stuðningsvefsíðuna og búið til vörumerki fyrir umsókn þína.",
    "AbpLiveTrainingPackages": "ABP Lifandi þjálfunarpakkar",
    "Releases": "Útgáfur",
    "ReleasesDescription": "Gefa út logs af ABP Commercial.",
    "ReleaseDate": "Útgáfudagur",
    "Labels": "Merki",
    "PreRelease": "Forútgáfa",
    "AllTypes": "Allar tegundir",
    "Enhancement": "Aukning",
    "Bug": "Bug",
    "Feature": "Eiginleiki",
    "AllUIs": "Öll notendaviðmót",
    "MVC": "MVC",
    "BlazorServer": "Blazor þjónn",
    "MAUI": "MAUI",
    "HowItWorks_Page_Title": "Hvernig það virkar?",
    "HowItWorks_Page_Description": "ABP Framework framlengir .NET vettvang. Svo, allt sem þú getur gert með látlausri .NET lausn er nú þegar mögulegt með ABP Framework. Það gerir það auðvelt að byrja með lágan námsferil.",
    "HowItWorks_Description1": "ABP Framework framlengir .NET vettvang. Svo, allt sem þú getur gert með látlausri .NET lausn er nú þegar mögulegt með ABP Framework. Það gerir það auðvelt að byrja með lágan námsferil.",
    "HowItWorks_Description2": "Þegar þú byrjar að læra og nota ABP Framework eiginleikana verður mun ánægjulegra en nokkru sinni fyrr að þróa hugbúnaðinn þinn.",
    "HowItWorks_Description3": "Þessi síða útskýrir í grundvallaratriðum hvernig þú notar ABP.IO pallinn sem .NET verktaki.",
    "CreateANewSolution": "Búðu til nýja .NET lausn",
    "CreateANewSolution_Description1": "Allt byrjar á því að búa til nýja ABP samþætta .NET lausn.",
    "StartWithStartupTemplates": "Byrjaðu eitt af forsmíðuðu <a href=\"/startup-templates\">sniðmátunum fyrir ræsingarlausnir</a>",
    "SimpleMonolithApplicationTemplate": "Einfalt monolith umsóknarsniðmát",
    "LayeredApplicationTemplate": "Lagskipt umsóknarsniðmát",
    "MicroserviceSolutionTemplate": "Sniðmát fyrir örþjónustulausn",
    "CreateEmptySolutionAndUseAbp": "Eða búðu til nýja tóma .NET lausn og settu upp ABP NuGet &amp; NPM <a href=\"https://abp.io/packages\" target=\"_blank\">pakka</a> sjálfur.",
    "CreatingSolutionWithMultipleOptions": "Það eru mörg notendaviðmót og gagnagrunnsvalkostir þegar þú býrð til nýja lausn.",
    "UIFrameworkOptions": "UI rammavalkostir",
    "DotnetSolutionWithoutDependency": "Nú hefurðu venjulega .NET lausn í tölvunni þinni sem er ekki háð skýjapalli eða ytri þjónustu.",
    "CheckTheDocumentForDetails": "Þú getur skoðað <a href=\"{0}\" target=\"_blank\">{1}</a> skjalið fyrir frekari upplýsingar.",
    "UIAndDatabaseIndependent": "ABP getur unnið með hvaða notendaviðmóti sem er og hvaða gagnagrunnsveitu sem er studd af .NET. \n Hins vegar eru þessar notendaviðmóts- og gagnagrunnsveitur fyrirfram samþættar og vel skjalfestar.",
    "InstallAbpModules": "Settu upp ABP einingar",
    "DevelopYourSolution": "Þróaðu lausnina þína",
    "DeployAnywhere": "Senda hvar sem er",
    "InstallAbpModule_Description1": "ABP er mát forritsþróunarrammi. Sniðmát til ræsingarlausna fylgja nú þegar nauðsynlegum einingum uppsettum. \n En það eru fleiri forritaeiningar sem þú gætir viljað nota í lausninni þinni.",
    "InstallAbpModule_Description2": "Sérhver eining samanstendur af nokkrum NuGet og NPM pökkum og hefur uppsetningarskjal. <a href=\"/tools/suite\">ABP Suite</a> gerir mest af verkinu sjálfkrafa, síðan stillir þú handvirkt eða fínstillir eininguna út frá skjölum hennar.",
    "DevelopYourSolution_Description1": "Innviði ABP gerir þér <b class=\"text-white\">kleift að einbeita þér að eigin viðskiptakóða</b> með því að gera endurtekna vinnu sjálfvirkan og bjóða upp á fyrirframbyggða innviði og <a href=\"https://abp.io/features\" target=\"_blank\">forritaeiginleika</a> .",
    "DevelopYourSolution_Description2": "Í eftirfarandi kóðablokk geturðu séð hvernig ABP Framework fellur óaðfinnanlega inn í kóðann þinn og gerir endurtekin verkefni sjálfvirk fyrir þig.",
    "DevelopYourSolution_Description3": "Jafnvel í þessum stuttkóðablokk gerir ABP margt fyrir þig.",
    "DevelopYourSolution_Description4": "Það býður upp á grunnflokka til að beita venjum, eins og \n <a href=\"https://docs.abp.io/en/abp/latest/Dependency-Injection\" target=\"_blank\">háð innspýting</a> . Almenn \n <a href=\"https://docs.abp.io/en/abp/latest/Repositories\" target=\"_blank\">geymsluþjónusta</a> veitir þægilega \n leið til að hafa samskipti við gagnagrunninn. Yfirlýsandi \n <a href=\"https://docs.abp.io/en/abp/latest/Authorization\" target=\"_blank\">heimild</a> vinnur með fínstilltu leyfiskerfi.",
    "DevelopYourSolution_Description5": "ABP gerir fullkomlega sjálfvirkan \n <a href=\"https://docs.abp.io/en/abp/latest/Unit-Of-Work\" target=\"_blank\">vinnueiningu</a> (fyrir gagnagrunnstengingu og færslustjórnun), \n <a href=\"https://docs.abp.io/en/abp/latest/Exception-Handling\" target=\"_blank\">undantekningarmeðferð</a> , \n <a href=\"https://docs.abp.io/en/abp/latest/Validation\" target=\"_blank\">staðfestingu</a> \n og <a href=\"https://docs.abp.io/en/abp/latest/Audit-Logging\" target=\"_blank\">endurskoðunarskráningu</a> . Það býður upp á marga fleiri byggingareiningar til að einfalda dagleg þróunarverkefni þín og einbeita þér að þínum eigin kóða á meðan þú býrð til framleiðslutilbúin \n forrit.",
    "DevelopYourSolution_Description6": "Þú getur ímyndað þér hversu mikið þessi kóðablokk getur verið langur og flókinn ef þú myndir gera þetta allt handvirkt.",
    "SuiteCrudGenerationInFewSeconds": "Auk þess að handkóða lausnina þína geturðu búið til fullkomlega virkar háþróaðar CRUD síður á nokkrum mínútum með því að nota ABP Suite verkfærin. Það býr til kóðann í lausnina þína, svo þú getur fínstillt hann út frá sérsniðnum kröfum þínum.",
    "DeployAnywhere_Description1": "Þegar öllu er á botninn hvolft ertu með hreina .NET lausn. Þú getur sett lausnina þína á þinn eigin netþjón, á skýjapallur, á Kubernetes eða hvar sem þú vilt. Þú getur dreift á eins marga netþjóna og þú vilt. ABP er agnostic verkfæri fyrir dreifingarumhverfi.",
    "ExpertiseAbpFramework": "Sérfræðiþekkingu á ABP ramma",
    "ExpertiseAbpFramework_Description1": "Viltu fara lengra en grunnatriðin og fá sérþekkingu með ABP.IO pallinum?",
    "FreeDownload": "Ókeypis niðurhal",
    "Read": "Lesið",
    "HavingTrouble": "Áttu í vandræðum?",
    "HavingTrouble_Description1": "Áttu í vandræðum með að þróa lausnina þína? Við erum hér! Notaðu ABP stuðningsvettvang \n eða sendu tölvupóst til að fá hjálp beint frá Core ABP Framework teyminu.",
    "WeAreHereToHelp_Description1": "Þú getur skoðað hjálparefni okkar eða leitað í algengum spurningum, \n eða þú getur spurt okkur spurningar með því að nota snertingareyðublaðið.",
    "OtherModules": "Aðrar einingar",
    "OtherModules_Description1": "Reikningur, endurskoðunarskráning, spjall, CMS Kit, skráastjórnun, eyðublöð, GDPR, auðkenni, tungumálastjórnun, greiðslur, Saas og fleira...",
    "HowItWorks_DatabaseProviderOptions": "Valkostir gagnagrunnsveitu",
    "SeeFAQ": "Sjá FAQ",
    "ReleaseLogs": "Gefa út logs",
    "ReleaseLogs_Tag": "{0} Útgáfuskrár",
    "ReleaseLogs_Pr": "Dragabeiðni #{0} - {1}",
    "NoLabels": "Engir merkimiðar",
    "DoesTheSubscriptionRenewAutomatically": "Endurnýjast áskriftin sjálfkrafa?",
    "DoesTheSubscriptionRenewAutomaticallyExplanation": "ABP auglýsing er ekki með sjálfvirka endurnýjun innheimtulíkan. Þess vegna <strong>verður áskrift þín ekki endurnýjuð sjálfkrafa</strong> í lok leyfistímabilsins. Ef þú vilt halda áfram að njóta góðs af ABP Commercial þarftu að endurnýja það handvirkt á <a href=\"/my-organizations\">stjórnunarsíðu fyrirtækisins</a> . Ef þú ert með margar stofnanir, smelltu á &quot;Stjórna&quot; hnappinn hjá fyrirtækinu þínu sem er að renna út og smelltu síðan á &quot;Framlengja núna&quot; hnappinn til að endurnýja leyfið þitt. Þú gætir líka viljað kíkja á <a href=\"/faq#what-happens-when-license-ends\">Hvað gerist þegar leyfinu mínu lýkur?</a> kafla.",
    "ExtraQuestionCreditsFaqTitle": "Get ég keypt auka inneign fyrir stuðningsspurningar?",
    "ExtraQuestionCreditsFaqExplanation": "Já þú getur. Til að kaupa auka spurningainneign, sendu tölvupóst á <a href=\"mailto:info@abp.io\">info@abp.io</a> með nafni fyrirtækisins þíns. Hér er verðlisti fyrir auka spurningaeiningar:<ul><li> 50 spurninga pakki $999</li><li> 25 spurninga pakki $625</li><li> 15 spurninga pakki $450</li></ul>",
    "AlreadyBetaTester": "Þú hefur nú þegar gengið í beta prófunarkerfið.",
    "AbpStudio": "ABP stúdíó",
    "AbpStudio_Description": "ABP Studio er enn í þróun. Þú getur fyllt út eyðublaðið hér að neðan til að vera einn af fyrstu notendum.",
    "AbpStudio_Description1": "ABP Studio er <span class=\"text-highlight-white\">skrifborðsforrit á vettvangi</span> fyrir ABP forritara.",
    "AbpStudio_Description2": "Það er <span class=\"text-highlight-white\">vel samþætt</span> ABP Framework og miðar að því að veita þér þægilegt þróunarumhverfi með því að <span class=\"text-highlight-white\">gera hlutina sjálfvirka, veita innsýn</span> í lausnina þína, gera <span class=\"text-highlight-white\">þróun, keyra</span> og <span class=\"text-highlight-white\">dreifa</span> lausnum þínum miklu auðveldara.",
    "AbpStudio_ComingSoon": "Væntanlegt <span class=\"opacity-50 ms-0 ms-md-3 d-block d-md-inline-block \">Fyrirhuguð beta útgáfudagur: Fjórði ársfjórðungur 2023.</span>",
    "AbpStudio_PlannedPreviewDate": "Fyrirhuguð forskoðunarútgáfudagur: 4. ársfjórðungur 2023.",
    "BetaRequest": "Beta beiðni",
    "CreateNewSolutions": "Búðu til nýjar lausnir",
    "CreateNewSolutions_Description1": "Þú getur búið til frá einföldum forritum til einingaeininga eða örþjónustulausna auðveldlega með mörgum valkostum. Þú færð fulla framleiðslutilbúna grunnhugbúnaðarlausn fyrir fyrirtækið þitt.",
    "ArchitectYourSolutions": "Byggðu lausnirnar þínar",
    "ArchitectYourSolutions_Description1": "Byggja einfaldari uppbyggingu einingaeininga og örþjónustulausna með því að búa til einingar eða þjónustu og koma á tengslum þeirra á milli. Þú getur líka sett upp eða fjarlægt forsmíðaðar forritaeiningar.",
    "ExploreYourSolution": "Kannaðu lausnina þína",
    "ExploreYourSolution_Description1": "ABP Studio sýnir yfirsýn á háu stigi yfir íhluti í lausninni þinni og einingarnar sem lausnin þín er háð. Þú getur skoðað einingar, þjónustu, HTTP API og margt fleira án þess að þurfa að opna kóðagrunninn þinn.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze": "Keyrðu fjölforrita- eða örþjónustulausnir á léttum tíma",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description1": "Keyra eina, <span class=\"text-highlight-white\">margar</span> eða <span class=\"text-highlight-white\">allar þjónustur</span> með einum smelli. Þannig er mjög auðvelt að stöðva þjónustu, keyra hana í Visual Studio til að <span class=\"text-highlight-white\">prófa</span> eða <span class=\"text-highlight-white\">kemba</span> .",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description2": "Sjá lista yfir þjónustu, skoða <span class=\"text-highlight-white\">rauntíma HTTP beiðni</span> og <span class=\"text-highlight-white\">undantekningarfjölda</span> fyrir hverja þjónustu.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description3": "Sjáðu allar upplýsingar um allar <span class=\"text-highlight-white\">HTTP beiðnir</span> sem koma til hvaða þjónustu sem er.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description4": "Skoðaðu <span class=\"text-highlight-white\">undantekningarupplýsingar</span> í rauntíma í hvaða þjónustu sem er, síaðu og leitaðu auðveldlega.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description5": "Sýndu <span class=\"text-highlight-white\">forritaskrárnar</span> , síaðu eftir skráarstigi eða leitaðu með texta..",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description6": "<span class=\"text-highlight-white\">Skoðaðu</span> notendaviðmót forritsins þíns án þess að fara úr lausnarhlauparanum.",
    "IntegrateToYourKubernetesCluster": "Aðlagast Kubernetes þyrpingunni þinni",
    "IntegrateToYourKubernetesCluster_Description1": "<span class=\"text-highlight-white\">Tengdu staðbundið þróunarumhverfi þitt við staðbundinn eða fjarlægan Kubernetes þyrping</span> , þar sem þessi þyrping rekur nú þegar örþjónustulausnina þína.",
    "IntegrateToYourKubernetesCluster_Description2": "Fáðu aðgang að hvaða þjónustu sem er í Kubernetes með þjónustuheiti sínu sem DNS, alveg eins og þær eru í gangi í tölvunni þinni.",
    "IntegrateToYourKubernetesCluster_Description3": "<span class=\"text-highlight-white\">Hlera hvaða þjónustu</span> sem er í þeim klasa, þannig að allri <span class=\"text-highlight-white\">umferð til þjónustunnar sem er stöðvuð er sjálfkrafa vísað á þjónustuna þína</span> sem er í gangi í þinni staðbundnu vél. Þegar þjónustan þín þarf að nota hvaða þjónustu sem er í Kubernetes er umferðinni beint aftur í þyrpinguna, rétt eins og staðbundin þjónusta þín er í gangi innan Kubernetes.",
    "GetInformed": "Fáðu upplýsingar",
    "Studio_GetInformed_Description1": "Skildu eftir tengiliðaupplýsingarnar þínar til <span class=\"text-highlight-white\">að fá upplýsingar</span> og <span class=\"text-highlight-white\">prófaðu þær fyrst</span> þegar ABP Studio hefur verið opnað.",
    "Studio_GetInformed_Description2": "Áætluð útgáfudagur forsýningar: 3. ársfjórðungur 2023.",
    "ThankYou!": "Þakka þér fyrir!",
    "SendBetaRequest": "Sendu Beta beiðni",
    "YouJoinedTheBetaTesterProgram": "Þú gekkst í ABP Studio beta prófunarforritið.",
    "PricingExplanation2": "30 daga peningaábyrgð - <a href=\"/faq#refund-policy\">Lærðu meira</a>",
    "MoneyBackGuaranteeText": "* 30 daga peningaábyrgð á öllum leyfum! 100% endurgreiðsla á Team, 60% endurgreiðsla á Business og Enterprise leyfi innan 30 daga.",
    "MobileApplicationStartupTemplates": "Uppsetningarsniðmát fyrir farsímaforrit",
    "MobileApplicationStartupTemplates_Description1": "Samþætt ræsingarsniðmát fyrir farsímaforrit fyrir ABP viðskiptalausnir þínar.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates": "Búðu til öflug viðskiptaforrit með ABP Mobile Startup Templates",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description1": "ABP Commercial útvegar tvö ræsingarsniðmát fyrir farsímaforrit útfærð með <span class=\"text-highlight\">React Native</span> og <span class=\"text-highlight\">.NET MAUI.</span> Þegar þú býrð til nýju ABP-byggðu lausnina þína muntu einnig hafa grunn ræsingarforrit tengd við bakenda API.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description2": "Forritið er með forsmíðaðan auðkenningarhring, <span class=\"text-highlight\">fjöltungumálastuðning, fjölleigustuðning, innskráningu, gleymt lykilorð, prófílstjórnun og notendastjórnunarsíðu</span> . Þú getur bætt við þinni eigin viðskiptarökfræði og sérsniðið það miðað við kröfur þínar.",
    "TwoFrameworkOptions": "Tveir rammavalkostir",
    "TwoFrameworkOptions_Description": "ABP veitir bæði <span class=\"text-highlight\">React Native</span> og <span class=\"text-highlight\">.NET MAUI</span> ræsingarsniðmát fyrir farsíma. Þannig geturðu valið þann sem hentar þínum þörfum best. Bæði forritin endurnota kóða á hæsta hraða milli iOS og Android kerfa.",
    "PreIntegratedToYourBackend": "Forsamþætt við bakendann þinn",
    "PreIntegratedToYourBackend_Description": "ABP farsímaforrit eru fyrirfram samþætt við bakenda API. Það fær gilt auðkenningartákn frá þjóninum og gerir staðfestar beiðnir.",
    "MultiLanguage": "Fjöltungumál",
    "MultiLanguage_Description": "Það styður nú þegar meira en 10 tungumál úr kassanum. Þú getur líka bætt við næstu tungumálum.",
    "Arabic": "arabíska",
    "Czech": "tékkneska",
    "English": "Enska",
    "Hungarian": "ungverska, Ungverji, ungverskt",
    "Finnish": "finnska",
    "French": "franska",
    "Hindi": "hindí",
    "Portuguese": "portúgalska",
    "Italian": "ítalska",
    "Russian": "Rússneskt",
    "Slovak": "Slóvakíu",
    "Turkish": "tyrkneska",
    "EngageAndRetainYourCustomersWithABPMobileApps": "Taktu þátt og haltu viðskiptavinum þínum með ABP farsímaforritum",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description1": "Viðskiptavinir þínir vilja hafa umsjón með vörum sínum og áskriftum hvar og hvenær sem er. Það krefst þess að stofnanir búi til farsímaforrit sem gera viðskiptavinum kleift að uppfylla beiðnir sínar fljótt og óaðfinnanlega.",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description2": "Með ABP Mobile öppum geturðu búið til hágæða innfædd farsímaöpp fyrir Android og iOS... Með því að nota einn kóðagrunn og án þess að skerða öryggi, gæði eða sveigjanleika.",
    "OneCodeBaseMultipleDevices": "Einn kóða-Base Mörg tæki",
    "OneCodeBaseMultipleDevices_Description": "ABP farsímaforrit eru þvert á vettvang. Þau eru tilbúin til uppsetningar og keyrslu á iOS og Android tækjum og þau laga sig að mismunandi formþáttum með því að nota einn kóðagrunn. Hönnuðir þurfa aðeins að búa til notendaviðmótið og framendakóðann einu sinni, það er engin þörf á að aðlaga kóðann fyrir hvert tæki sem þú vilt styðja.",
    "ComesWithTheSourceCode": "Kemur með frumkóðanum",
    "ComesWithTheSourceCode_Description": "Farsímaöppin eru með frumkóðann. Sérsníddu notendaviðmót/viðmót forritanna þinna auðveldlega til að uppfylla vörumerkjaleiðbeiningar.",
    "Purchase_OneYearPrice": "1 árs verð",
    "Purchase_DeveloperSeatCount": "Sætafjöldi þróunaraðila",
    "Purchase_DevelopersAlreadyIncluded": "{0} forritarar eru þegar með",
    "1Year": "1 ár",
    "{0}Years": "{0} ár",
    "1YearLicense": "1 árs leyfi",
    "{0}YearsLicense": "{0} ára leyfi",
    "1AdditionalDeveloper": "1 viðbótarhönnuður",
    "{0}AdditionalDevelopers": "{0} Viðbótarhönnuðir",
    "Discount": "Afsláttur ({0}%)",
    "Summary": "Samantekt",
    "TrainingPack": "Æfingapakki",
    "TrainingPackDiscount": "Afsláttur á æfingapakka",
    "Purchase_OnboardingTraining_Description": "Þessi lifandi þjálfunarpakki gildir fyrir 8 nemendur í bekk og þessi afsláttur gildir aðeins þegar hann er keyptur með nýja leyfinu. <a href=\"{0}\" class=\"text-white\">Læra meira<i class=\"fa fa-external-link ms-1\"></i></a>",
    "Purchase_Save": "{0}% <span class=\"save ms-1\">sparnaður {1} {2}</span>",
    "RemoveBasket": "Takið úr körfunni",
    "WhyABPIOPlatform?": "Af hverju <span class=\"gradient-commercial\">ABP.IO pallur</span> ?",
    "DocumentAim": "Þetta skjal miðar að því að svara stóru spurningunni:",
    "DocumentAim_Description": "&quot;Hvers vegna ættir þú að nota ABP.IO vettvanginn í stað þess að búa til nýja lausn frá grunni?&quot;",
    "DocumentAim_Description2": "Skjalið kynnir áskoranir þess að byggja upp nútíma hugbúnaðarlausn og útskýrir hvernig ABP tekur á þessum áskorunum.",
    "CreatingANewSolution": "Að búa til nýja lausn",
    "CreatingANewSolution_Description": "Þegar þú þarft að byrja á nýrri lausn eru margar spurningar sem þú þarft að spyrja sjálfan þig og þú ættir að eyða miklum tíma áður en þú byrjar að skrifa fyrsta viðskiptakóðann þinn.",
    "CreatingAnEmptySolution": "Að búa til tóma lausn",
    "THEPROBLEM": "VANDAMÁLIÐ",
    "CreatingAnEmptySolution_THEPROBLEM_Description": "Jafnvel að búa til næstum tóma lausn er krefjandi;",
    "CreatingAnEmptySolution_THEPROBLEM_Description2": "Hvernig skipuleggur þú kóðagrunninn þinn á milli verkefna?",
    "CreatingAnEmptySolution_THEPROBLEM_Description3": "Hver eru lögin og hvernig hafa þau samskipti?",
    "CreatingAnEmptySolution_THEPROBLEM_Description4": "Hvernig samþættir þú bókasafn og kerfi þriðja aðila?",
    "CreatingAnEmptySolution_THEPROBLEM_Description5": "Hvernig á að setja upp sjálfvirku prófin?",
    "ABPSOLUTION": "ABP LAUSN",
    "CreatingAnEmptySolution_ABPSOLUTION_Description": "ABP býður upp á vel útfærða, lagskiptu og framleiðslutilbúna <a href=\"https://docs.abp.io/en/abp/latest/Startup-Templates/Application\" target=\"_blank\">ræsilausn</a> byggða á <a href=\"https://docs.abp.io/en/abp/latest/Domain-Driven-Design\" target=\"_blank\">lénsdrifinni hönnunarreglum</a> . Lausnin inniheldur einnig forstillta einingu og <a href=\"https://docs.abp.io/en/abp/latest/Testing\" target=\"_blank\">samþættingarprófunarverkefni</a> fyrir hvert lag.",
    "CommonLibraries": "Algeng bókasöfn",
    "CommonLibraries_THEPROBLEM_Description": "Hvaða bókasöfn ættir þú að nota til að innleiða algengar kröfur? Hugbúnaðarþróunarvistkerfið er mjög kraftmikið, sem gerir það krefjandi að fylgjast með nýjustu verkfærum, bókasöfnum, straumum og aðferðum.",
    "CommonLibraries_ABPSOLUTION_Description": "ABP forsamþættir vinsæl, þroskuð og uppfærð bókasöfn inn í lausnina. Þú þarft ekki að eyða tíma í að samþætta þau eða láta þau eiga samskipti sín á milli. Þeir virka almennilega út úr kassanum.",
    "UITheme&Layout": "HÍ þema og útlit",
    "UITheme&Layout_THEPROBLEM_Description": "Þegar tekist er á við áhyggjur HÍ koma upp ýmsar áskoranir. Þetta felur í sér að koma á fót grunni fyrir móttækilegt, nútímalegt og aðlögunarhæft notendasett með samræmdu útliti og fjölda eiginleika eins og leiðsöguvalmyndir, hausa, tækjastikur, fætur, græjur og fleira.",
    "UITheme&Layout_THEPROBLEM_Description2": "Jafnvel ef þú velur fyrirfram hannað þema, gæti óaðfinnanlegur samþætting þess inn í verkefnið þitt krafist daga þróunar. Önnur hindrun liggur í því að uppfæra slík þemu. Oft er HTML/CSS uppbygging þemunnar samtvinnuð við HÍ kóðann þinn, sem gerir framtíðarþemabreytingar eða uppfærslur flókin verkefni. Þessi samfléttun kóða og hönnunar flækir sveigjanleikann við að gera breytingar á línunni.",
    "UITheme&Layout_ABPSOLUTION_Description": "ABP Framework býður upp á sérstakt þemakerfi sem leysir UI kóðann þinn frá þemaþvingunum. Þemu eru til í einangrun, pakkað sem NuGet eða NPM pakka, sem gerir uppsetningu þema eða uppfærslur nokkrar mínútur. Þó að þú haldir möguleikanum á að þróa sérsniðið þema þitt eða samþætta það sem fyrir er, kynnir ABP Commercial safn af fáguðum og nútímalegum þemum.",
    "UITheme&Layout_ABPSOLUTION_Description2": "Að auki eru veitendur notendahluta eins og Telerik og DevExpress. Hins vegar útvega þessar veitendur fyrst og fremst einstaka íhluti og leggja þá ábyrgð á þig að koma upp skipulagskerfinu þínu. Þegar þú vinnur innan verkefna sem byggjast á ABP geturðu fellt þessi bókasöfn óaðfinnanlega inn, svipað og þú myndir gera í öðrum verkefnum.",
    "TestInfrastructure": "Prófaðu innviði",
    "TestInfrastructure_THEPROBLEM_Description": "Að koma á öflugu prófunarumhverfi er tímafrekt viðleitni. Það felur í sér að setja upp sérstök prófunarverkefni innan lausnarinnar þinnar, velja vandlega nauðsynleg verkfæri, búa til þjónustu- og gagnagrunnsspotta, búa til nauðsynlega grunnflokka og gagnsemisþjónustu til að lágmarka óþarfa kóða í prófunum og takast á við ýmis tengd verkefni.",
    "TestInfrastructure_ABPSOLUTION_Description": "ABP Startup Templates koma fyrirfram útbúin með stilltum prófunarverkefnum, sem hagræða ferlið fyrir þig. Þetta þýðir að frá fyrsta degi geturðu auðveldlega byrjað að skrifa upphafseiningar- eða samþættingarprófunarkóða án tafar.",
    "CodingStandards&Training": "Kóðunarstaðlar og þjálfun",
    "CodingStandards&Training_THEPROBLEM_Description": "Eftir að þú hefur sett upp lausnina fyrir þróun þarftu venjulega að kenna þróunaraðilum hvernig kerfið virkar og hvernig á að byggja það upp með sömu samþykktum aðferðum. Jafnvel ef þú gefur þeim þjálfun getur verið erfitt að halda skjölunum uppfærðum. Þegar fram líða stundir gæti hver þróunaraðili skrifað kóða á sinn hátt, sem veldur því að reglurnar um ritun kóða verða ólíkar hver öðrum.",
    "CodingStandards&Training_ABPSOLUTION_Description": "ABP lausnin er nú þegar snyrtilega skipulögð og hefur skýrar skýringar. Skref-fyrir-skref kennsluefni og leiðbeiningar sýna þér nákvæmlega hvernig á að vinna að ABP verkefni.",
    "KeepingYourSolutionUpToDate": "Haltu lausninni þinni uppfærðri",
    "KeepingYourSolutionUpToDate_THEPROBLEM_Description": "Eftir að þú hefur hafið þróun þína verður þú að halda utan um nýju útgáfurnar af söfnunum sem þú notar fyrir uppfærslur og plástra.",
    "KeepingYourSolutionUpToDate_ABPSOLUTION_Description": "Við uppfærum alla pakka reglulega í nýjustu útgáfur og prófum þá fyrir stöðuga útgáfu. Þegar þú uppfærir ABP Framework eru öll ósjálfstæði þess uppfærð í hátækni.",
    "DRY": "Ekki endurtaka sjálfan þig!",
    "DRY_Description": "Að búa til grunnlausn tekur verulegan tíma og krefst góðrar byggingarreynslu. Hins vegar er þetta bara byrjunin! Þegar þú byrjar að þróa þarftu líklega að skrifa mikið af endurteknum kóða; það væri frábært ef hægt væri að höndla þetta allt sjálfkrafa.",
    "DRY_Description2": "ABP gerir sjálfvirkan og einfaldar endurtekningu kóða eins mikið og mögulegt er með því að fylgja meginreglunni um stillingar. Hins vegar takmarkar það þig ekki þegar þú þarft að skipta yfir í beinskiptingu. Stjórnin er alltaf í þínum höndum.",
    "Authentication": "Auðkenning",
    "Authentication_THEPROBLEM_Description": "Einskráning, Active Directory / LDAP samþætting, OpenIddict samþætting, félagsleg innskráning, tvíþætt auðkenning, gleymt/endurstillt lykilorð, virkjun tölvupósts, nýr notendaskráning, flækjustýring lykilorðs, læsing á reikningi við misheppnaðar tilraunir, sýnir misheppnaðar innskráningartilraunir... osfrv. Við vitum að allar þessar almennu kröfur eru þér kunnuglegar. Þú ert ekki einn!",
    "Authentication_ABPSOLUTION_Description": "ABP Framework og viðskiptaútgáfan bjóða upp á allt þetta staðlaða efni sem er fyrirfram útfært fyrir þig sem endurnotanleg reikningseining. Þú virkjar bara og stillir það sem þú þarft.",
    "CrossCuttingConcerns": "Þverlægar áhyggjur",
    "CrossCuttingConcerns_THEPROBLEM_Description": "Þverskurðaráhyggjur eru grundvallar endurtekin rökfræði sem ætti að innleiða fyrir hvert notkunartilvik. Nokkur dæmi;",
    "CrossCuttingConcerns_THEPROBLEM_Description2": "Að hefja viðskipti, skuldbinda sig til að ná árangri og afturkalla villur.",
    "CrossCuttingConcerns_THEPROBLEM_Description3": "Meðhöndla og tilkynna undantekningar, skila réttu villuviðbrögðum til viðskiptavina og meðhöndla villumál viðskiptavinamegin.",
    "CrossCuttingConcerns_THEPROBLEM_Description4": "Innleiða heimild og fullgildingu, skila réttum svörum og meðhöndla þau á viðskiptavinum megin.",
    "CrossCuttingConcerns_ABPSOLUTION_Description": "ABP Framework gerir sjálfvirkan eða einfaldar allar algengar þverskurðaráhyggjur. Þú skrifar aðeins kóða sem skiptir máli fyrir fyrirtækið þitt og ABP sér um afganginn samkvæmt venjum.",
    "ArchitecturalInfrastructure": "Innviðir byggingarlistar",
    "ArchitecturalInfrastructure_THEPROBLEM_Description": "Þú þarft venjulega að byggja upp innviði til að útfæra arkitektúrinn þinn rétt. Til dæmis, þú innleiðir venjulega Repository mynstur. Þú skilgreinir nokkra grunnflokka til að einfalda og staðla til að búa til einingar, þjónustu, stýringar og aðra hluti.",
    "ArchitecturalInfrastructure_ABPSOLUTION_Description": "ABP Framework veitir allt þetta og fleira úr kassanum. Það er þroskað og vel skjalfest.",
    "EnterpriseApplicationRequirements": "Kröfur fyrirtækjaumsókna",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description": "Það eru margar kröfur sem þú framkvæmir ítrekað í hverju viðskiptaforriti;",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description2": "Ítarlegt heimildakerfi og umsjón með heimildum í HÍ út frá hlutverkum og notendum.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description3": "Að skrifa endurskoðunarskrár og einingarsögu til að fylgjast með því þegar notandi breytir gagnagrunnsskrá.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description4": "Gerðu einingarnar þínar mjúkar eyðingar, svo þær séu merktar sem eytt í stað þess að eyða líkamlega úr gagnagrunninum og sía sjálfkrafa eyddar einingar á fyrirspurnum þínum.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description5": "Að búa til ágrip og umbúðir til að neyta bakenda API frá framenda kóðanum.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description6": "Setja í biðröð og framkvæma bakgrunnsstörf.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description7": "Meðhöndla mörg tímabelti í alþjóðlegu kerfi.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description8": "Samnýting sannprófunar, staðsetningar, heimildarrökfræði milli netþjóns og viðskiptavinar.",
    "EnterpriseApplicationRequirements_ABPSOLUTION_Description": "ABP býður upp á innviði til að framkvæma slíkar kröfur auðveldlega. Aftur, þú eyðir ekki dýrmætum tíma þínum í að innleiða allt þetta aftur og aftur.",
    "GeneratingInitialCode&Tooling": "Búa til upphafskóða og verkfæri",
    "GeneratingInitialCode&Tooling_THEPROBLEM_Description": "Þú munt byggja margar svipaðar síður í dæmigerðu vefforriti. Flestir þeirra munu framkvæma svipaðar CRUD aðgerðir. Það er mjög leiðinlegt og einnig villuhættulegt að búa til slíkar síður ítrekað.",
    "GeneratingInitialCode&Tooling_ABPSOLUTION_Description": "<a href=\"/tools/suite\">ABP Suite</a> getur búið til CRUD síðu í fullri stafla fyrir aðila þína á nokkrum sekúndum. Kóðinn sem myndaður er er lagskiptur og hreinn. Allar stöðluðu löggildingar- og leyfiskröfur eru innleiddar. Auk þess eru einingaprófunarflokkar búnir til. Þegar þú hefur fengið fullkomna síðu geturðu breytt henni í samræmi við kröfur fyrirtækisins.",
    "IntegratingTo3rdPartyLibrariesAndSystems": "Aðlögun að bókasöfnum og kerfum þriðja aðila",
    "IntegratingTo3rdPartyLibrariesAndSystems_THEPROBLEM_Description": "Flest bókasöfn eru hönnuð sem lágstig og þú vinnur venjulega til að samþætta þau almennilega án þess að endurtaka sama samþættingar- og stillingarkóðann alls staðar í lausninni þinni. Til dæmis, gerðu ráð fyrir að þú verðir að nota RabbitMQ til að útfæra dreifða viðburðarrútuna þína. Allt sem þú vilt gera er; senda skilaboð í biðröð og sjá um þau skilaboð sem berast. En þú þarft að skilja skilaboðamynstur, biðraðir og skiptast á upplýsingum. Til að skrifa skilvirkan kóða verður þú að búa til laug til að stjórna tengingum, viðskiptavinum og rásum. Þú verður líka að takast á við undantekningar, ACK skilaboð, endurtengja RabbitMQ við bilanir og fleira.",
    "IntegratingTo3rdPartyLibrariesAndSystems_ABPSOLUTION_Description": "Til dæmis, RabbitMQ Distributed Event Bus sameining ABP tekur saman allar þessar upplýsingar. Þú sendir og tekur á móti skilaboðum án ys og þys. Þarftu að skrifa lágstigs kóða? Ekkert mál, þú getur alltaf gert það. ABP takmarkar þig ekki þegar þú þarft að nota lág-stigi eiginleika bókasafnsins sem þú ert að nota.",
    "WhyNotBuildYourOwnFramework?": "Af hverju ekki að byggja upp þinn eigin ramma?",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description": "Öll innviði, jafnvel á einfaldasta hátt, tekur mikinn tíma að byggja, viðhalda og skrásetja. Það stækkar með tímanum og það verður erfitt að viðhalda því í lausninni þinni. Að aðgreina þetta í endurnýtanlegt verkefni er upphafið að því að byggja upp þinn eigin innri ramma.",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description2": "Það er mjög erfitt að byggja upp, skrásetja, þjálfa og viðhalda innri ramma. Ef þú ert ekki með reyndan, hollur rammahópur, verður innri rammi þinn fljótt að óskráðum arfleifðarkóða sem enginn getur skilið og viðhaldið lengur. Á hinn bóginn eru þessar rammar venjulega þróaðar af einum eða tveimur hönnuðum í teyminu. Og þessir náungar eru að verða þekkingarsíló. Það er gott fyrir þá en slæmt fyrir fyrirtækið vegna þess að þeir eru eini bilunarpunktur verkefnisins <a href=\"https://en.wikipedia.org/wiki/Single_point_of_failure\">-SPOF-</a> . Þegar þeir yfirgefa fyrirtækið fer verkefnið verulega niður.",
    "WhyNotBuildYourOwnFramework_ABPSOLUTION_Description": "ABP Framework er samfélagsdrifinn, vel skjalfestur, þroskaður og almennur umsóknarrammi. Hópur mjög reyndra þróunaraðila vinnur hörðum höndum að því að halda því uppfærðu, auðskiljanlegri og þægilegri í notkun. Með því að nota svona stöðugan ramma geturðu einbeitt þér að eigin viðskiptakóða og færð hjálp við rammann frá sérfræðingum hvenær sem þú þarft á því að halda.",
    "ArchitecturalInfrastructure_Description": "SaaS forrit, mát eða örþjónustukerfi eru mest notuðu hugbúnaðarlíkön fyrirtækja. Að byggja slík kerfi krefst ekki aðeins góðs skilnings og reynslu heldur einnig sterka hugbúnaðarinnviði. Annars muntu finna að þú eyðir miklu átaki til að styðja þessar byggingarlistarupplýsingar í kóðagrunninum þínum.",
    "Modularity": "Modularity",
    "Modularity_THEPROBLEM_Description": "Það er ekki auðvelt að byggja upp raunverulegt mátkerfi! Hægt er að skipta öllum þáttum kerfisins (gagnagrunni, einingar, API, UI síður/íhluti) í einingar og hægt er að endurnýta hverja einingu án annarra. Hinn látlausi ASP.NET Core býður ekki upp á slíkan einingaarkitektúr. Ef þú þarft á því að halda ættirðu að hugsa um það frá grunni.",
    "Modularity_ABPSOLUTION_Description": "ABP Framework er fæddur til að vera mát forritaþróunarskipulag. Sérhver eiginleiki í rammanum er þróaður til að vera samhæfður við mát. Skjöl og leiðbeiningar útskýra hvernig á að þróa endurnotanlegar einingar á staðlaðan hátt.",
    "SaaSMultiTenancy": "SaaS / Multi-Tenancy",
    "SaaSMultiTenancy_THEPROBLEM_Description": "<a href=\"https://docs.abp.io/en/abp/latest/Multi-Tenancy\">Multi-Tenancy</a> er algeng leið til að innleiða SaaS kerfi. Hins vegar getur það orðið flókið að innleiða samræmdan innviði fyrir marga leigjendur.",
    "SaaSMultiTenancy_ABPSOLUTION_Description": "ABP Framework veitir fullkomna innviði fyrir marga leigjendur og óhlutbundið flókið úr viðskiptakóðanum þínum. Umsóknarkóði þinn mun að mestu leyti vera meðvitaður um fjölleigu, á meðan ABP Framework einangrar sjálfkrafa gagnagrunn, skyndiminni og aðrar upplýsingar um leigjendur hver frá öðrum. Það styður einn gagnagrunn, gagnagrunn fyrir hvern leigjanda og blendingaaðferðir. Það stillir söfnin á réttan hátt eins og Microsoft Identity og OpenIddict, sem eru venjulega ekki samhæfð við fjölleigu.",
    "Microservices": "Örþjónusta",
    "Microservices_THEPROBLEM_Description": "Að byggja upp smáþjónustukerfi krefst margra innviðaupplýsinga: Auðkenning og leyfisveiting forrita og örþjónustu og innleiða ósamstillt skilaboð og samstillt (Rest/GRPC) samskiptamynstur milli örþjónustu eru grundvallaratriðin.",
    "Microservices_ABPSOLUTION_Description": "ABP Framework veitir þjónustu, <a href=\"https://docs.abp.io/en/abp/latest/Microservice-Architecture\" target=\"_blank\">leiðbeiningar</a> og sýnishorn til að hjálpa þér að innleiða örþjónustulausnina þína með því að nota iðnaðarstaðlaða verkfærin.",
    "Microservices_ABPSOLUTION_Description2": "ABP Commercial gengur jafnvel einu skrefi lengra og býður upp á fullkomið <a href=\"https://docs.abp.io/en/commercial/latest/startup-templates/microservice/index\" target=\"_blank\">ræsingarsniðmát</a> til að koma örþjónustulausninni þinni í gang.",
    "PreBuiltModules": "Forsmíðaðar einingar",
    "PreBuiltModules_THEPROBLEM_Description": "Öll höfum við svipaðar en aðeins mismunandi viðskiptakröfur. Hins vegar ættum við öll að finna upp hjólið aftur þar sem enginn kóði getur beint virkað í lausn okkar. Þeir eru allir innbyggðir hlutar stærri lausnar.",
    "PreBuiltModules_ABPSOLUTION_Description": "ABP Commercial <a href=\"/modules\">einingar</a> bjóða upp á mikið af endurnotanlegum forritaeiningum eins og greiðslum, spjalli, skjalastjórnun, skýrslugerð um endurskoðunarskrá... osfrv. Allar þessar einingar eru auðveldlega settar upp í lausnina þína og virka beint. Við erum stöðugt að bæta við fleiri einingum.",
    "PreBuiltModules_ABPSOLUTION_Description2": "Allar einingar eru hannaðar sem sérhannaðar fyrir viðskiptaþörf þína. Ef þú þarft fullkomna stjórn geturðu halað niður öllum frumkóða hvaða einingu sem er og sérsniðið algjörlega út frá sérstökum viðskiptaþörfum þínum.",
    "ABPCommunity": "ABP samfélag",
    "ABPCommunity_Description": "Að lokum, Að vera í stóru samfélagi þar sem allir fylgja svipuðum kóðunarstílum og meginreglum og deila sameiginlegum innviðum færir kraft þegar þú átt í vandræðum eða þarft hjálp við hönnunarákvarðanir. Þar sem við skrifum kóða á svipaðan hátt getum við hjálpað hvort öðru miklu betur. ABP er samfélagsstutt verkefni með meira en 10K stjörnum á GitHub.",
    "ABPCommunity_Description2": "Það er auðvelt að deila kóða eða jafnvel endurnotanlegum bókasöfnum á milli ABP forritara. Kóðabútur sem virkar fyrir þig mun einnig virka fyrir aðra. Það eru fullt af sýnum og námskeiðum sem þú getur beint útfært fyrir umsókn þína.",
    "ABPCommunity_Description3": "Þegar þú ræður verktaki sem vann áður með ABP arkitektúr mun strax skilja lausnina þína og hefja þróun á mjög stuttum tíma.",
    "WhyAbpIo_Page_Title": "Af hverju ABP.IO pallur?",
    "AbpStudio_Page_Title": "ABP stúdíó",
    "CampaignInfo": "Kauptu nýtt leyfi eða endurnýjaðu núverandi leyfi og <span class=\"text-white\">fáðu 2 mánuði til viðbótar</span> án aukakostnaðar! Þetta tilboð gildir fyrir allar leyfisáætlanir. Gakktu úr skugga um að þú nýtir þér þessa takmarkaða kynningu til að auka aðgang þinn að úrvalsaðgerðum og uppfærslum.",
    "HurryUpLastDay": "Flýttu þér! Síðasti dagur: {0}",
    "CreatingCRUDPagesWithABPSuite": "Að búa til CRUD síður með ABP Suite",
    "Testimonials": "Vitnisburður",
    "MultipleYearDiscount": "Margra ára afsláttur",
    "CampaignDiscountText": "Black Friday afsláttur",
    "CampaignDiscountName": "Svartur föstudagur",
    "CampaignName:BlackFriday": "Svartur föstudagur"
  }
}