{
  "culture": "is",
  "texts": {
    "OrganizationManagement": "Umsjá Skipulagsheilda",
    "OrganizationList": "Listi yfir Skipulagsheildir",
    "Volo.AbpIo.Commercial:010003": "Þú ert ekki eigandi þessarri skipulagsheild!",
    "OrganizationNotFoundMessage": "Eingin skipulagsheild fannst!",
    "DeveloperCount": "Úthlutað/alls forritarar",
    "QuestionCount": "Eftirstöðvar/alls spurningar",
    "Unlimited": "Ótakmarkað",
    "Owners": "Eigendur",
    "AddMember": "Bæta við meðlimi",
    "AddOwner": "Bæta við eiganda",
    "AddDeveloper": "Bæta við forritara",
    "UserName": "Notandanafn",
    "Name": "Nafn",
    "EmailAddress": "Netfang",
    "Developers": "Forritarar",
    "LicenseType": "Tegund Leyfis",
    "Manage": "Umsjón",
    "StartDate": "Upphafsdagur",
    "EndDate": "Lokadagur",
    "Modules": "Einingar",
    "LicenseExtendMessage": "Leyfið þitt og lokadagur hefur verið framlengt til {0}",
    "LicenseUpgradeMessage": "Leyfið þitt hefur verið uppfært í {0}",
    "LicenseExtendAdnUpgradeMessage": "Leyfið þitt hefur verið framlengt til {0} og leyfisáætlunin þín er uppfærð í {1}.",
    "LicenseAddDeveloperMessage": "{0} forritarar bættu við Leyfið þitt",
    "Volo.AbpIo.Commercial:010004": "Finn ekki tiltekinn notanda! Notandinn er líklega nú þegar skráður.",
    "MyOrganizations": "Félögin mín",
    "ApiKey": "API lykill",
    "UserNameNotFound": "Enginn notandi finnst með notandanafninu {0}",
    "SuccessfullyAddedToNewsletter": "Takk fyrir að gerast áskrifandi að fréttabréfinu okkar!",
    "MyProfile": "Sniðmátið mitt",
    "EmailNotValid": "Vinsamlegast setjið inn virkan netpóst.",
    "JoinOurMarketingNewsletter": "Gerast áskrifandi að markaðs fréttabréfinu okkar",
    "WouldLikeToReceiveMarketingMaterials": "Ég óska eftir því að fá send markaðsefni þ.m.t. upplýsingar um góð kjör og sérstök tilboð.",
    "StartUsingYourLicenseNow": "Byrjaðu að nota leyfið þitt núna!",
    "WelcomePage": "Velkomin síða",
    "UnsubscriptionExpireEmail": "Afskráning af póstlista sem minnir á hvenær Leyfi rennur út",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Þessi póstlisti felur einungis í sér áminningu um hvenær leyfið þitt rennur út.",
    "UnsubscribeFromLicenseExpireEmails": "Ef þú kýst að fá ekki vefpóst til áminningar um hvenær leyfið þitt rennur út, þá getur þú afskráð þig hvenær sem er.",
    "Unsubscribe": "Afskráning",
    "NotOrganizationMember": "Þú ert ekki meðlimur í neinni skipulagsheild.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Þú hefur verið afskráður af póstlistanum",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Þú munt ekki fá vefpóst um áminningu þess hvenær leyfið þitt rennur út.",
    "IndexPageHeroSection": "<span class=\"first-line\">Heilstætt</span><span class=\"second-line\"> vefþróunar umhverfi </span><span class=\"third-line\">byggt á <img src=\"{0}\" width=\"110\" class=\"ml-1\" /> ABP</span>",
    "AbpCommercialShortDescription": "ABP Commercial býður upp á forsmíðaðar forritareiningar, tól sem hraða þróun, fagmanlega hannaðar UI þemur, úrvals stuðning og fleira.",
    "LiveDemo": "Virkt sýnidæmi",
    "GetLicence": "Sækja Leyfi",
    "Application": "Umsókn",
    "StartupTemplates": "Byrjunar Sniðmát",
    "Startup": "Byrjun",
    "Templates": "Sniðmát",
    "Developer": "Forritari",
    "Tools": "Verkfæri",
    "Premium": "Viðbót",
    "PremiumSupport": "Viðbótar stuðningur",
    "PremiumForumSupport": "Spjallborð Viðbótar Stuðnings",
    "UI": "UI",
    "Themes": "Þemu",
    "JoinOurNewsletter": "Vertu áskrifandi að fréttabréfinu okkar",
    "Send": "Senda",
    "Learn": "Læra",
    "AdditionalServices": "Auka þjónustur",
    "WhatIsABPFramework": "HVAÐ ER ABP?",
    "OpenSourceBaseFramework": "Opin hugbúnaður",
    "ABPFrameworkExplanation": "<p class=\"lead\">ABP Commercial er byggt á ABP umhverfinu, sem er opin og frír hugbúnaður og samfélagslega keyrður vefforritunar umhverfi fyrir ASP.NET Core.ABP Framework, veitir framúrskarandi innviði til að skrifa viðhaldanlegan, auðbreytanlegann og prófanlegan kóða með bestu starfsháttum. </p> <p> Byggt á og samþætt við vinsæl tól sem þú þekkir nú þegar. Auðvelt að læra, auðvelt að aðlaga, þægilegt í  þróun.</p>",
    "Modular": "Einingavæddur",
    "MicroserviceCompatible": "Möguleiki á Microservice högun",
    "DomainDrivenDesignInfrastructure": "Domain Driven Design Innviðir",
    "MultiTenancy": "Multi-Tenancy",
    "DistributedMessaging": "Dreyfðar skeytasendingar",
    "DynamicProxying": "Dynamic Proxying",
    "BackgroundJobs": "Bakgrunns Keyrslur",
    "AuditLogging": "Endurskoðunarskráning",
    "BLOBStoring": "BLOB Geymsla",
    "BundlingMinification": "Samantekt og minkun",
    "AdvancedLocalization": "Fullkomin þýðingarvirkni",
    "ManyMore": "Mikið meira",
    "ExploreTheABPFramework": "Skoða ABP",
    "WhyUseTheABPCommercial": "Afhverju að nota ABP Commercial?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt- 5\">Það getur verið flókið og tímafrekt að byggja upp vefsíðuforrit fyrir fyrirtæki. </p> <p> ABP Commercial býður upp á fullkomna grunninnviði sem er nauðsynlegur fyrir allar nútíma ASP.NET Core lausnir sem byggja á fyrirtækjum. Allt frá hönnun til dreifingar er allt þróunarferlið styrkt af innbyggðum eiginleikum og einingum ABP. </p> ",
    "StartupTemplatesShortDescription": "Upphafssniðmát gera þér kleift að byrja verkefnið á nokkrum sekúndum.",
    "UIFrameworksOptions": "Valmöguleikar UI viðmóts;",
    "DatabaseProviderOptions": "Gagnagrunna valkostir;",
    "PreBuiltApplicationModules": "Forbyggðar forritareiningar",
    "PreBuiltApplicationModulesShortDescription": "Algengustu kröfur um forrit eru þegar þróaðar fyrir þig sem margnota einingar.",
    "Account": "Aðgangur",
    "Blogging": "Blogging",
    "Identity": "Auðkenni",
    "IdentityServer": "Auðkenningarþjónn",
    "Saas": "Saas",
    "LanguageManagement": "Túngumálaumsjón",
    "TextTemplateManagement": "Textasmíðastjórnun",
    "See All Modules": "Sjá AllModules",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "ABP Suite er viðbótar tól sem kemur með ABP Commercial.",
    "AbpSuiteExplanation": "Það gerir þér kleift að byggja vefsíður á örfáum mínútum. Það er .NET Core Global tól sem hægt er að setja upp frá skipanalínunni. Það getur búið til nýja ABP lausn, búið til CRUD síður úr gagnagrunninum í framendann.",
    "Details": "Nánari upplýsingar",
    "LeptonTheme": "Lepton Þema",
    "ProfessionalModernUIThemes": "Faglega hannað núttíma útlit",
    "LeptonThemeExplanation": "Lepton býður upp á úrval af Bootstrap admin þemum sem þjóna sem traustur grunnur fyrir öll verkefni sem krefjast admin mælaborðs.",
    "DefaultTheme": "Sjálfvalin Þema",
    "MaterialTheme": "Material Þema",
    "Default2Theme": "Sjálfvalin 2 þema",
    "DarkTheme": "Dökk Þema",
    "DarkBlueTheme": "Dökk Blá Þema",
    "LightTheme": "Ljós Þema",
    "ProudToWorkWith": "Stoltur að vinna með",
    "OurConsumers": "Þúsundir fyrirtækja og þróunaraðila yfir 70 löndum um allan heim treysta á ABP Commercial.",
    "JoinOurConsumers": "Vertu með þeim og smíðaðu ótrúlegar vörur hratt.",
    "AdditionalServicesExplanation": "Þarftu viðbótarþjónustu eða sérsniðna þjónustu? <strong> Við og samstarfsaðilar okkar getum veitt;</strong>",
    "CustomProjectDevelopment": "Sérsniðin verkefnaþróun",
    "CustomProjectDevelopmentExplanation": "Verktaar sérstaklega fyrir þín sérsniðnu verkefni",
    "PortingExistingProjects": "Flytja núverandi verkefni",
    "PortingExistingProjectsExplanation": "Flytja gömlu legacy verkefnin þín yfir í ABP",
    "LiveSupport": "Stuðningur í beinni",
    "LiveSupportExplanation": "Fjarstuðningsmöguleiki í beinni þegar þú þarft á því að halda.",
    "Training": "Þjálfun",
    "TrainingExplanation": "Sértæk þjálfun fyrir forritarana þína.",
    "OnBoarding": "Byrðing",
    "OnBoardingExplanation": "Hjálp við að setja upp þróunarumhverfin þína, CI & CD.",
    "PrioritizedTechnicalSupport": "Forgangsröðun tæknilegs stuðnings",
    "PremiumSupportExplanation": "Auk hins mikkla samfélagsstuðnings ABP rammans, svarar stuðningsteymi okkar tæknilegum spurningum og vandamálum viðskiptalegra notenda með mikla forgang.",
    "SeeTheSupportOptions": "Sjá Stuðningsmöguleikar",
    "Contact": "Hafa samband",
    "TellUsWhatYouNeed": "Segðu okkur hvað þig vantar.",
    "YourMessage": "Skilaboðin þín",
    "YourFullName": "Þitt fulla nafn",
    "EmailField": "Netfang",
    "YourEmailAddress": "Netfangið þitt",
    "HowMayWeHelpYou": "Hvernig getum við aðstoðað þig?",
    "SendMessage": "Senda skilaboð",
    "Success": "Heppnaðist",
    "WeWillReplyYou": "Við höfum móttekið skilaboðin þín og munum hafa samband innan tíðar.",
    "GoHome": "Fara heim",
    "CreateLiveDemo": "Búa til Live Demo",
    "RegisterToTheNewsletter": "Skráning á póstlista fyrir fréttabréf með upplýsingum um ABP.IO, þ.á.m. nýjar útgáfur o.s.frv..",
    "EnterYourEmailOrLogin": "Settu inn netfangið þitt til að búa til kynningu eða <a href=\"{0}\">Login</a> með þínum notandareikningi.",
    "ApplicationTemplate": "Forritssniðmát",
    "ApplicationTemplateExplanation": "Upphafssniðmát forrits er notað til að búa til nýtt vefforrit.",
    "EfCoreProvider": "Entity Framework (Virkar fyrir SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\">og fleiri</a>)",
    "AlreadyIncludedInTemplateModules": "Eftirfarandi einingar eru þegar innifalin og stilltar í þessu sniðmáti:",
    "ApplicationTemplateArchitecture": "Þetta forritasniðmát styður einnig þrepaskiptann arkitektúr þar sem UI -lag, API -lag og auðkenningarþjónusta eru líkamlega aðskild.",
    "SeeTheGuideOrGoToTheLiveDemo": "Sjá þróunarleiðbeiningarnar fyrir tæknilegar upplýsingar um þetta sniðmát eða farðu í lifandi kynningu.",
    "DeveloperGuide": "Þróunar leiðbeiningar",
    "ModuleTemplate": "Sniðmát fyrir einingu",
    "ModuleTemplateExplanation1": "Viltu búa til einingu og endurnýta í mismunandi forritum? Þetta gangsetningarsniðmát undirbýr allt til að byrja að búa til einnota <strong> forritareining </strong> eða <strong> örþjónustu </strong>.",
    "ModuleTemplateExplanation2": "<p> Þú getur stutt einn eða marga UI ramma, eina eða margar gagnagrunnsveitur fyrir hverja einingu. Uppsetningarsniðmátið er stillt til að keyra og <strong> prófa eininguna þína </strong> í lágmarksforriti auk einingarinnar og samþættingarprófunarinnviða. </p> <p> Sjá þróunarleiðbeiningar fyrir tæknilegar upplýsingar um þetta sniðmát. </p>",
    "WithAllStyleOptions": "með öllum stílvalkostum",
    "Demo": "Sýningardæmi",
    "SeeAllModules": "Sjá allar einingar",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) er skipanalínutæki til að framkvæma nokkrar algengar aðgerðir fyrir ABP byggðar lausnir.",
    "ABPSuiteEasilyCURD": "ABP Suite er tæki sem gerir þér kleift að búa til CRUD síður auðveldlega",
    "WeAreHereToHelp": "Við erum hérna til að <span class=\"zero-text\">Hjálpa</span>",
    "BrowseOrAskQuestion": "Þú getur skoðað hjálparefni okkar eða leitað í algengum spurningum, eða þú getur spurt okkur spurningar með því að nota <a href=\"{0}\" class=\"text-success\"> samskiptaform </a> .",
    "SearchQuestionPlaceholder": "Leitaðu í algengum spurningum",
    "WhatIsTheABPCommercial": "Hvað er ABP Commercial?",
    "WhatAreDifferencesThanAbpFramework": "Hver er munurinn á milli open source ABP Framework og ABP Commercial?",
    "ABPCommercialExplanation": "ABP Commercial er safn af hágæða einingum, verkfærum, þemum og þjónustu sem er byggt ofan á opnum heimildum <a target=\"_blank\" href=\"{0}\"> ABP ramma </a>. ABP Commercial er þróað og stutt af sama teymi á bak við ABP rammann.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\"> ABP</a> er einingar, þemu og ör-þjónusta  þróunarramma fyrir ASP.NET Core. Það býður upp á fullkominn arkitektúr og sterka innviði til að láta þig einblína á eigin viðskiptakóða frekar en að endurtaka sjálfan þig fyrir hvert nýtt verkefni. Það er byggt á bestu starfsháttum hugbúnaðarþróunar og vinsælum tækjum sem þú þekkir nú þegar. </p> <p> ABP er algjörlega ókeypis og opinn uppspretta (open source). Það býður einnig upp á ókeypis þemur og nokkrar fyrirfram byggðar einingar (t.d. auðkennisstjórnun og tenant stjórnun). </p>",
    "VisitTheFrameworkVSCommercialDocument": "Farðu á eftirfarandi krækju til að fá meiri upplýsingar <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial bætir eftirfarandi ávinningi ofan á ABP rammann;",
    "Professional": "Fagmannlegt",
    "UIThemes": "UI þemur",
    "EnterpriseModules": "Tilbúið til notkunnar fyrir stór fyrirtæki, eiginleikaríkt, forsmíðaðar <a href=\"{0}\"> forritareiningar </a> (t.d. Identity Server stjórnun, SaaS stjórnun, tungumálastjórnun)",
    "ToolingToSupport": "Verkfæri til að styðja við framleiðni þinnar (t.d. <a href=\"{0}\"> ABP Suite </a>)",
    "PremiumSupportLink": "Hágæða <a href=\"{0}\" target=\"_blank\">þjónusta</a>",
    "WhatDoIDownloadABPCommercial": "Hverju þarf ég að niðurhala þegar ég kaupi the ABP Commercial?",
    "CreateUnlimitedSolutions": "Við kaup á ABP Commercial leyfinu, munt þú geta útbúið ótakmarkaðar lausnir líkt og kemur fram í <a href=\"{0}\">Að byrja</a> document.",
    "ABPCommercialSolutionExplanation": "Þegar þú býrð til nýtt forrit færðu Visual Studio lausn (upphafssniðmát) byggt á óskum þínum. Sótta lausnin er með viðskiptaeiningar og þemu þegar uppsett og stillt fyrir þig. Þú getur fjarlægt fyrirfram uppsetta einingu eða bætt við annarri einingu ef þú vilt. Allar einingar og þemu eru notuð NuGet/NPM pakkar sjálfgefið.",
    "StartDevelopWithTutorials": "Niðurhalin lausnin er vel byggð og skjalfest. Þú getur byrjað að þróa þína eigin viðskiptakóða byggt á því eftir <a href=\"{0}\"> námskeiðunum </a>",
    "TryTheCommercialDemo": "Þú getur prófað <a href=\"{0}\"> kynninguna </a> til að sjá sýnishorn af forriti sem búið var til með því að nota upphafssniðmát ABP Commercial.",
    "HowManyProducts": "Hversu margar mismunandi vörur/lausnir get ég smíðað með ABP Commercial?",
    "HowManyProductsExplanation": "Það eru engin takmörk fyrir því að búa til ABP verkefni. Þú getur búið til eins mörg verkefni og þú vilt, þróað og hlaðið þeim upp á mismunandi netþjóna.",
    "HowManyDevelopers": "Hversu margir forritarar geta unnið á ABP Commercial?",
    "HowManyDevelopersExplanation": "ABP Commercial leyfi eru á hvern verktaki. Mismunandi gerðir leyfa hafa mismunandi takmörk þróunaraðila. Hins vegar getur þú bætt fleiri forriturum við hvaða tegund leyfis sem er hvenær sem þú þarft. Sjá <a href=\"{0}\"> verðlagssíðuna </a> fyrir tegundir leyfa, takmarkanir þróunaraðila og viðbótarkostnað verktaki.",
    "ChangingLicenseType": "Get ég uppfært tegund leyfis síðar?",
    "ChangingLicenseTypeExplanation": "Þú getur uppfært í hærra leyfi með því að greiða mismuninn innan virka leyfistímabilsins. Þegar þú uppfærir í hærri leyfisáætlun færðu ávinninginn af nýju áætluninni en uppfærsla leyfisins breytir ekki gildistíma leyfis. Að auki geturðu einnig bætt nýjum þróunarstólum við núverandi leyfi, sjá \"Hversu margir verktaki geta unnið á ABP auglýsingunni? \"",
    "LicenseExtendUpgradeDiff": "Hver er munurinn á lengingu leyfis og uppfærslu?",
    "LicenseExtendUpgradeDiffExplanation": "<strong> Framlenging: </strong> Með því að framlengja/endurnýja leyfið þitt muntu halda áfram að fá aukagjaldstuðning og fá stórar uppfærslur fyrir einingarnar og þemu. Að auki muntu geta haldið áfram að búa til ný verkefni. Og þú munt samt geta notað ABP Suite sem flýtir fyrir þróun þinni. <Hr/> <strong> Uppfærsla: </strong> Með því að uppfæra leyfið þitt muntu kynna þér hærri leyfisáætlun sem gerir þér kleift að fá frekari ávinning . Skoðaðu <a href=\"/pricing\"> tafla til samanburðar leyfa </a> til að athuga muninn á leyfisáætlunum. <strong> Á hinn bóginn, þegar þú uppfærir mun gildistími leyfis þíns ekki breytast! < /strong> Til að framlengja lokadagsetningu leyfis þíns þarftu að framlengja leyfið.",
    "LicenseRenewalCost": "Hver er kostnaður við endurnýjun leyfis eftir 1 ár?",
    "LicenseRenewalCostExplanation": "Endurnýjun (framlenging) hlutfall allra ABP Commercial leyfa er {0} af leyfislistaverði. Endurnýjunarverð staðlaða teymisleyfis er $ {1}, venjulegt viðskiptaleyfi er $ {2} og venjulegt fyrirtækjaleyfi er $ {3}. Ef þú ert þegar viðskiptavinur, <a href='{4}' target='_blank'> skráðu þig inn á reikninginn þinn </a> til að fara yfir tiltæk endurnýjunarverð.",
    "HowDoIRenewMyLicense": "Hvernig endurnýi ég leyfi mitt?",
    "HowDoIRenewMyLicenseExplanation": "Þú getur endurnýjað leyfið með því að fara á <a href='{0}' target='_blank'> stjórnunarsíðu fyrirtækisins </a>. Til að nýta afsláttarverð okkar fyrir snemma endurnýjun, vertu viss um að endurnýja áður en leyfið þitt rennur út. Ekki hafa áhyggjur af því að vita ekki hvenær tækifæri þínu til endurnýjunar lokast. Þú færð 2 áminningarpósta áður en áskriftin rennur út. Við sendum þau 30 dögum, 7 dögum fyrir lok.",
    "IsSourceCodeIncluded": "Inniheldur leyfi mitt frumkóða viðskiptareininganna og þemanna?",
    "IsSourceCodeIncludedExplanation1": "Það fer eftir tegund leyfis sem þú hefur keypt:",
    "IsSourceCodeIncludedExplanation2": "<strong> Team </strong>: Lausnin þín notar einingar og þemu sem NuGet og NPM pakka. Það inniheldur ekki frumkóða þeirra. Þannig geturðu auðveldlega uppfært þessar einingar og þemu hvenær sem ný útgáfa er fáanleg. Hins vegar geturðu ekki fengið frumkóða mátanna og þemanna.",
    "IsSourceCodeIncludedExplanation3": "<strong> Business/Enterprise </strong>: Auk liðsleyfisins geturðu sótt kóða hvers einingar eða þema sem þú þarft. Þú getur jafnvel fjarlægt NuGet/NPM pakkatilvísanir fyrir tiltekna einingu og bætt frumkóða þess beint við lausn þína til að breyta henni að fullu.",
    "IsSourceCodeIncludedExplanation4": "<p> Með því að fá frumkóða eininganna í lausn þinni gefur þú þér hámarks frelsi til að sérsníða þá einingu. Hins vegar verður ekki hægt að uppfæra eininguna sjálfkrafa þegar ný útgáfa er gefin út. </p> <p> Ekkert af leyfunum inniheldur ABP Suite frumkóða, sem er ytra tæki sem býr til kóða fyrir þig og aðstoðar til þróunar þinnar. </p> <p> Sjá <a href=\"{0}\"> verðlagningarsíðuna </a> fyrir annan mun á tegund leyfis. </p>",
    "ChangingDevelopers": "Get ég breytt skráðum forriturum fyrirtækisins míns í framtíðinni?",
    "ChangingDevelopersExplanation": "Til viðbótar við að bæta nýjum verktaka við leyfi þitt geturðu einnig breytt núverandi forriturum (þú getur fjarlægt verktaka og bætt nýjum við) án aukakostnaðar.",
    "WhatHappensWhenLicenseEnds": "Hvað gerist þegar leyfistímabilinu lýkur?",
    "WhatHappensWhenLicenseEndsExplanation1": "ABP Commercial er <a href=\"{0}\" target=\"_blank\"> eilíft leyfi </a>. Eftir að leyfi þitt rennur út geturðu haldið áfram að þróa verkefnið þitt. Og þér er ekki skylt að endurnýja leyfið. Leyfi þínu fylgir eins árs uppfærslur og stuðningsáætlun úr kassanum. Til að halda áfram að fá nýja eiginleika, endurbætur á afköstum, villuleiðréttingar, stuðning og halda áfram að nota ABP Suite, vertu viss um að endurnýja áætlun þína á hverju ári. Þegar leyfi þitt rennur út muntu ekki geta fengið fleiri af eftirfarandi ávinningi;",
    "WhatHappensWhenLicenseEndsExplanation2": "Þú getur ekki búið til nýjar lausnir með því að nota ABP Commercial, en þú getur haldið áfram að þróa núverandi forrit þín að eilífu.",
    "WhatHappensWhenLicenseEndsExplanation3": "Þú munt geta fengið uppfærslur fyrir einingar og þemu í MAJOR útgáfunni þinni. Til dæmis; ef þú ert að nota v3.2.0 af einingu geturðu samt fengið uppfærslur fyrir v3.x.x (v3.3.0, v3.5.2 ... osfrv.) þeirrar einingar. En þú getur ekki fengið uppfærslur fyrir næstu stóru útgáfuna (eins og v4.x, v5.x)",
    "WhatHappensWhenLicenseEndsExplanation4": "Þú getur ekki sett upp nýjar einingar og þemu sem bætt er við ABP Commercial eftir að leyfi þínu lýkur.",
    "WhatHappensWhenLicenseEndsExplanation5": "Þú getur ekki notað ABP Suite.",
    "WhatHappensWhenLicenseEndsExplanation6": "Þú getur ekki fengið <a href=\"{0}\"> úrvalsstuðninginn </a> lengur.",
    "WhatHappensWhenLicenseEndsExplanation7": "Þú getur endurnýjað áskriftina þína ef þú vilt halda áfram að fá þessa kosti. Ef þú endurnýjar áskriftina innan 1 mánaðar eftir að leyfi þitt rennur út, er 20% afsláttur veittur.",
    "WhenShouldIRenewMyLicense": "Hvenær ætti ég að endurnýja leyfið mitt?",
    "WhenShouldIRenewMyLicenseExplanation1": "Ef þú endurnýjar leyfið þitt innan <strong> 1 mánaðar </strong> eftir að leyfið þitt rennur út, er notaður 20 %afsláttur.",
    "WhenShouldIRenewMyLicenseExplanation2": "Ef þú endurnýjar leyfið þitt eftir 1 mánuð frá því að leyfi þitt rennur út, þá verður endurnýjunarverð það sama og kaupverð leyfis og enginn afsláttur verður af endurnýjun þinni.",
    "TrialPlan": "Ertu með prufuáætlun?",
    "TrialPlanExplanation": "Í bili hefur ABP Commercial ekki prufuáætlun. Fyrir teymis leyfi veitum við 30 daga endurgreiðsluábyrgð. Þú getur bara óskað eftir endurgreiðslu fyrstu 30 dagana. Viðskipta- og fyrirtækjalyfið veitir 60% endurgreiðslu á 30 dögum. Þetta er vegna þess að viðskipta- og fyrirtækjaleyfi innihalda fullan kóða allra eininga og þemanna.",
    "DoYouAcceptBankWireTransfer": "Samþykki þið bankamillifærslu?",
    "DoYouAcceptBankWireTransferExplanation": "Já, við samþykkjum bankamillifærslu. <br /> Eftir að þú hefur sent leyfisgjaldið með millifærslu, sendu okkur kvittunina þína í tölvupósti á info@abp.io með tegund leyfis sem óskað er eftir. Alþjóðlegar bankareikningsupplýsingar okkar:",
    "HowToUpgrade": "Hvernig á að uppfæra núverandi forrit þegar ný útgáfa er í boði?",
    "HowToUpgradeExplanation1": "Þegar þú býrð til nýtt forrit með ABP Commercial eru allar einingarnar og þemað notað sem NuGet og NPM pakkar. Svo þú getur auðveldlega uppfært pakkana þegar ný útgáfa er fáanleg.",
    "HowToUpgradeExplanation2": "Til viðbótar við hefðbundna NuGet/NPM uppfærslu veitir <a href=\"{0}\"> ABP CLI </a> uppfærsluskipun sem finnur og uppfærir sjálfkrafa alla ABP tengda pakka í lausninni þinni.",
    "DatabaseSupport": "Hvaða gagnagrunnar eru studdir?",
    "DatabaseSupportExplanation": "ABP sjálft er óháð gagnagrunnum og getur unnið með hvaða gagnagrunni sem er. Skoðaðu <a href=\"{0}\" target=\"_blank\"> gagnaaðgangsskjalið </a> til að sjá lista yfir þá grunna sem búið er að útfæra á móti.",
    "UISupport": "Hvaða UI umgjarðir eru studdar?",
    "Supported": "Stutt",
    "UISupportExplanation": "ABP sjálft er óháð UI umgjörðum og getur unnið með hvaða UI umgjörð. Hins vegar eru uppsetningarsniðmát, UI einingar og þemur ekki útfærð fyrir allar mögulegar UI umgjarðir. Sjá <a href=\"{0}\"> byrjunarskjalið </a> fyrir uppfærða lista yfir UI valmöguleika.",
    "MicroserviceSupport": "Styður það örþjónustu arkitektúr?",
    "MicroserviceSupportExplanation1": "Eitt helsta markmið ABP ramma er að veita þægilega innviði til að búa til örþjónustulausnir. Skoðaðu <a href=\"{0}\"> örþjónustu arkitektúr </a> skjalið til að skilja hvernig það hjálpar til við að búa til örþjónustu kerfi.",
    "MicroserviceSupportExplanation2": "Allar ABP Commercial einingar eru hannaðar til að styðja við örverudreifingaraðstæður (\"microservises\") (með eigin API og gagnagrunni) með því að fylgja <a href=\"{0}\"> bestu vinnubrögðum mátþróunar </a>.",
    "MicroserviceSupportExplanation3": "Við bjóðum upp á sýnishorn af <a href=\"{0}\"> sýnishornalausn fyrir örþjónustu </a> sem sýnir sýningu á örþjónustu arkitektúr til að hjálpa þér að búa til þína eigin lausn.",
    "MicroserviceSupportExplanation4": "svo, stutta svarið er \"<strong> já, það styður örþjónustu arkitektúr </strong> \".",
    "MicroserviceSupportExplanation5": "Hins hafa örþjónustukerfi sýnar útfærslur og mismunandi kröfur, netfræði, staðsetningarsamskipti, sannvottunarmöguleika, ákvarðanir um gagnagrunn aðskilnað/miðlun, keyrslutíma, kerfis samþættingu þriðja aðila og margt fleira.",
    "MicroserviceSupportExplanation6": "ABP Framework og ABP Commercial bjóða upp á innviði fyrir ör-þjónustusvið, samhæfðar einingar fyrir örþjónustu, sýnishorn og skjöl til að hjálpa þér að byggja þína eigin lausn. En ekki búast við að hlaða niður draumalausninni þinni sem er fyrirfram smíðuð fyrir þig. Þú verður að skilja það og koma nokkrum hlutum saman eftir þörfum þínum.",
    "WhereCanIDownloadSourceCode": "Hvar get ég sótt frumkóðann?",
    "WhereCanIDownloadSourceCodeExplanation": "Þú getur halað niður kóðanum fyrir allar ABP einingar, Angular pakka og þemu í gegnum ABP Suite eða ABP CLI. Sjá <a href=\"{0}\"> Hvernig á að hlaða niður frumkóða? </a>",
    "ComputerLimitation": "Hversu margar tölvur getur forritari skráð sig inn þegar hann þróar ABP?",
    "ComputerLimitationExplanation": "Við leyfum sérstaklega <strong> {0} tölvur </strong> fyrir hvern einstakling/verktaki sem er með leyfi. Hvenær sem það er þörf fyrir verktaki til að þróa ABP Commercial á annarri vél, þá ætti að senda tölvupóst til licens@abp.io þar sem útskýrt er ástandið og við munum síðan gera viðeigandi úthlutun í kerfinu okkar.",
    "RefundPolicy": "Ertu með endurgreiðslustefnu?",
    "RefundPolicyExplanation": "Þú getur óskað eftir endurgreiðslu innan <strong> 30 daga </strong> frá kaupum á leyfi. Viðskipta- og fyrirtækjalyfistegundirnar hafa möguleika á niðurhalskóða og því eru endurgreiðslur ekki í boði fyrir fyrirtækið og fyrirtækið (og leyfi sem innihalda rétt til að fá frumkóða). Að auki er ekki endurgreitt fyrir endurnýjun og önnur leyfiskaup.",
    "HowCanIRefundVat": "Hvernig get ég endurgreitt virðisaukaskatt?",
    "HowCanIRefundVatExplanation1": "Ef þú greiddir með 2Checkout geturðu endurgreitt virðisaukaskatt með 2Checkout reikningnum þínum:",
    "HowCanIRefundVatExplanation2": "Skráðu þig inn á <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\"> 2Checkout </a> reikninginn þinn",
    "HowCanIRefundVatExplanation3": "Finndu viðeigandi pöntun og ýttu á „Endurgreiða vangreiddann virðisaukaskatt“ (sláðu inn VSK -auðkenni þitt)",
    "HowCanIGetMyInvoice": "Hvernig get ég fengið reikninginn minn?",
    "HowCanIGetMyInvoiceExplanation": "Það eru 2 greiðslugáttir fyrir kaup á leyfi: PayU og 2Checkout. Ef þú kaupir leyfið þitt í gegnum 2Checkout gateway sendir það PDF reikninginn á netfangið þitt, sjá <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How-do-invoices-work \"> 2Afgreiðslureikningur. </a> Ef þú kaupir í gegnum PayU eða með bankamillifærslu munum við útbúa og senda reikninginn þinn. Þú getur beðið um reikninginn þinn á <a href=\"{0}\"> stjórnunarsíðu fyrirtækisins. </a>",
    "Forum": "Spjallborð",
    "SupportExplanation": "ABP Commercial leyfi veitir hágæða spjallstuðning frá teymi sem samanstendur af sérfræðingum ABP Framework.",
    "PrivateTicket": "Einkamiði",
    "PrivateTicketExplanation": "Fyrirtækja leyfi inniheldur einnig einkaaðstoð með tölvupósti og miðakerfi.",
    "AbpSuiteExplanation1": "ABP Suite gerir þér kleift að byggja vefsíður á örfáum mínútum. Það er .NET Core Global tól sem hægt er að setja upp frá skipanalínunni.",
    "AbpSuiteExplanation2": "Það getur búið til nýja ABP lausn, búið til CRUD síður úr gagnagrunninum í framendann. Fyrir tæknilegt yfirlit, sjá <a href=\"{0}\"> skjalið </a>",
    "FastEasy": "Fljótlegt og auðvelt",
    "AbpSuiteExplanation3": "ABP Suite gerir þér kleift að búa til CRUD síður auðveldlega. Þú þarft bara að skilgreina einingu þína og eiginleika hennar, leyfðu ABP Suite að gera restina fyrir þig! ABP Suite býr til alla nauðsynlega kóða fyrir CRUD síðuna þína á nokkrum sekúndum. Það styður notendaviðmót Angular, MVC og Blazor.",
    "RichOptions": "Ríkt af valkostum",
    "AbpSuiteExplanation4": "ABP Suite styður marga notendaviðmótvalkosti fyrir UI eins og t.d <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\"> Razor Pages </a> og <a href=\" https://angular.io \"> Angular </a>. Það styður einnig marga gagnagrunna eins og <a href=\"https://www.mongodb.com\"> MongoDB </a> og alla gagnagrunna studda af <strong> EntityFramework Core </strong> (MS SQL Server, Oracle, MySql, PostgreSQL og <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli \"> meira </a>).",
    "AbpSuiteExplanation5": "Það góða er að þú þarft ekki að hafa áhyggjur af þessum valkostum. ABP Suite skilur gerð verkefnis þíns og býr til kóða fyrir verkefnið þitt og setur kóðann sem er búinn til á réttan stað í verkefninu.",
    "SourceCode": "Frumkóði",
    "AbpSuiteExplanation6": "ABP Suite býr til kóðann fyrir þig! Það býr ekki til töfraskrár til að búa til vefsíðuna. ABP Suite býr til frumkóða fyrir <strong> einingu, geymslu, umsóknarþjónustu, flutning kóða fyrst, JavaScript/TypeScript og CSHTML/HTML </strong> og nauðsynleg tengi líka. ABP Suite býr einnig til kóðann í samræmi við <strong> Best Practices </strong> hugbúnaðarþróunar, þannig að þú þarft ekki að hafa áhyggjur af gæðum kóðans.",
    "AbpSuiteExplanation7": "Þar sem þú ert með frumkóða byggingareiningana í CRUD síðunni, skipt upp í forritalög geturðu auðveldlega breytt frumkóðanum og bætt við sérsniðnu virkninni þinn.",
    "CrossPlatform": "Cross Platform",
    "AbpSuiteExplanation8": "ABP Suite er byggt með .NET Core og það er Cross Platform. Það keyrir sem vefforrit á tölvunni þinni. Þú getur keyrt það á <strong> Windows </strong>, <strong> Mac </strong> og <strong> Linux </strong>",
    "OtherFeatures": "Aðrir valmöguleikar",
    "OtherFeatures1": "Uppfærir <strong> NuGet </strong> og <strong> NPM </strong> pakka á lausn þína auðveldlega.",
    "OtherFeatures2": "Endurgerir þegar tilbúnar síður frá grunni.",
    "OtherFeatures3": "Býr til nýjar lausnir",
    "ThanksForCreatingProject": "Takk fyrir að búa til verkefnið þitt!",
    "HotToRunSolution": "Hvernig á að keyra lausnina þína?",
    "HotToRunSolutionExplanation": "Sjá byrjunarskjal til að læra hvernig á að stilla og keyra lausnina þína.",
    "GettingStarted": "Byrja",
    "WebAppDevTutorial": "Kennsla í vefforritum",
    "WebAppDevTutorialExplanation": "Sjá kennslu skjal fyrir vefforrit til að fá skref fyrir skref kennslu í þróun.",
    "Document": "Skjal",
    "UsingABPSuiteToCURD": "Notkun ABP Suite fyrir CRUD síðugerð og verkfæri",
    "SeeABPSuiteDocument": "Sjá ABP Suite skjal til að læra notkun ABP Suite.",
    "AskQuestionsOnSupport": "Þú getur spurt spurninga um ABP Commercial á stuðningssíðunni.",
    "Documentation": "Skjölun",
    "SeeModulesDocument": "Sjá skjal yfir einingar fyrir lista yfir allar commercial (pro) einingar og skjöl þeirra.",
    "Pricing": "Verðlagning",
    "PricingExplanation": "Veldu þá eiginleika og virkni sem fyrirtækið þitt þarfnast í dag. Uppfærðu auðveldlega þegar fyrirtæki þitt vex.",
    "Team": "Teymi",
    "Business": "Fyrirtækið",
    "Enterprise": "Enterprise",
    "Custom": "Sérsnið",
    "IncludedDeveloperLicenses": "Innifalin þróunarleyfi",
    "CustomLicenceOrAdditionalServices": "Þarftu sérsniðið leyfi eða viðbótarþjónustu?",
    "CustomOrVolumeLicense": "Sérsniðið eða fjölda leyfi",
    "LiveTrainingSupport": "Þjálfun í vbeinni og stuðningur",
    "AndMore": "og fleira",
    "AdditionalDeveloperLicense": "Auka þróunarleyfi",
    "ProjectCount": "Fjöldi verkefna",
    "AllProModules": "Allar pro einingar",
    "AllProThemes": "Allar pro þemur",
    "AllProStartupTemplates": "Öll pro upphafssniðmát",
    "SourceCodeOfAllModules": "Frumkóði fyrir allar einingar",
    "SourceCodeOfAllThemes": "Frumkóði fyrir allar þemur",
    "PerpetualLicense": "Ævarandi leyfi",
    "UnlimitedServerDeployment": "Ótakmörkuð dreifing á þjóna",
    "YearUpgrade": "1 árs uppfærsla",
    "YearPremiumForumSupport": "1 árs aðgangur að þjónustu spjallborði",
    "ForumSupportIncidentCountYear": "Fjöldi stuðnings atburða/ár",
    "PrivateTicketEmailSupport": "Persónuleg þjónustu mál og netfangs aðstoð",
    "BuyNow": "Kaupa núna",
    "PayViaAmexCard": "Hvernig get ég greitt með AMEX kortinu mínu?",
    "PayViaAmexCardDescription": "Sjálfgefna greiðslugáttin 'Iyzico' getur hafnað sumum AMEX kreditkortum vegna öryggisráðstafana. Í þessu tilfelli geturðu greitt í gegnum aðra greiðslugáttina '2Checkout'.",
    "ThankYou": "Takk fyrir",
    "InvalidReCaptchaErrorMessage": "Villa kom upp við að staðfesta reCAPTCHA. Vinsamlegast reyndu aftur.",
    "CompanyName": "Nafn fyrirtækis",
    "YourCompanyName": "Nafn fyrirtækis þíns",
    "FirstName": "Fornafn",
    "LastName": "Eftirnafn",
    "Optional": "Valfrjálst",
    "YourFirstName": "Fornafn þitt",
    "YourLastName": "Eftirnafnið þitt",
    "SpecialOffer": "Sérstakt tilboð",
    "SpecialOfferMessage": "Flýttu þér! Verð gilda í takmarkaðan tíma.",
    "DiscountRequest": "Afsláttarbeiðni",
    "DiscountRequestDescribeCustomerQuestion": "Hvert af eftirfarandi lýsir þér best?",
    "DiscountRequestStudentEmailMessage": "Netfang verður að innihalda 'edu'.",
    "DiscountRequestDeveloperCount": "Hversu margir forritarar eru þið?",
    "DiscountRequestDeveloperCountExceedMessage": "Við veitum ekki afsláttarleyfi fyrir fyrirtæki sem eru með yfir {0} forritara.",
    "DiscountRequestOrganizationName": "Fyrirtæki/stofnun/skólanafn",
    "Website": "Vefur",
    "GithubUsername": "GitHub notandanafn",
    "PhoneNumber": "Símanúmer",
    "Country": "Land",
    "DescribeABPCommercialUsage": "Lýstu verkefninu sem þú ætlar að þróa út frá APB Commercial",
    "DiscountRequestCertifyInformationMessage": "Ég staðfesti að allar upplýsingar eru sannar og réttar.",
    "DiscountRequestReceived": "Við höfum fengið beiðni þína um afslátt.",
    "DiscountRequestStatusMessage": "Við munum svara þér eftir að hafa skoðað upplýsingarnar sem þú hefur veitt.",
    "MVCOrRazorPages": "MVC (Razor Pages)",
    "Angular": "Angular",
    "Blazor": "Blazor",
    "New": "Nýtt",
    "MongoDB": "MongoDB",
    "EBookDDD": "Rafbók um Domain Driven Design",
    "PracticalGuideForImplementingDDD": "Þessi bók er hagnýtur leiðarvísir um innleiðingu DDD hönnun með ABP.",
    "IntroducingDDD": "Kynning á Domain Driven Design",
    "DDDLayersAndCleanArchitecture": "DDD lög & Clean Architecture",
    "LayeringOfADotnetSolution": "Lagskipti .NET lausnar",
    "ImplementingDDDBuildingBlocks": "Útfærsla DDD byggingareininga",
    "DomainVsApplicationLogic": "Domain Logic vs Application Logic",
    "SamplesAndDiscussions": "Dæmi og umræður",
    "Free": "Gjaldfrjáls",
    "Download": "Hlaða niður",
    "DDDEBook": "DDD rafbók",
    "ImplementingDDD": "Útfæra Domain Driven Design",
    "DDDBookExplanation": "Hagnýt handbók til að útfæra DDD hönnun með ABP ramma.",
    "Overview": "Yfirlit",
    "DDDBookPracticalGuide": "Þetta er hagnýtur leiðarvísir til að útfæra Domain Driven Design (DDD). Þó að upplýsingar um útfærsluna byggi á innviðum ABP, þá eiga kjarnahugtök, meginreglur og mynstur við hvers konar lausn, jafnvel þó að það sé ekki .NET lausn.",
    "TableOfContents": "Efnisyfirlit",
    "IntroductionToImplementingDDD": "Inngangur að útfærslu DDD hönnunar",
    "WhatIsDDD": "Hvað er Domain Driven Design?",
    "Implementation": "Útfærsla",
    "TheBigPicture": "Stóra myndin",
    "TheBuildingBlock": "Byggingar einingarnar",
    "ExampleUseCase": "Dæmi um notkunartilfelli",
    "DomainAndApplicationLogic": "Domain Logic & Application Logic",
    "Author": "Höfundur",
    "PublishedOn": "Útgéfið",
    "Page": "Síða",
    "FreeEBook": "Frí rafbókina",
    "EBookSignInForDownload": "Til að sækja rafbókina skráðu þig inn",
    "SignIn": "Innskrá",
    "Or": "Eða",
    "TellUsAboutYourself": "Segðu okkur svolítið frá þér",
    "Surname": "Eftirnafn",
    "DoYouAgreePrivacyPolicy": "Ég samþykki <a href=\"/TermsConditions\"> skilmála og skilyrði <a/> og <a href=\"/Privacy\"> persónuverndarstefnu </a>.",
    "VolosoftMarketingInformationMessage": "Ég vil fá upplýsingar, ábendingar og tilboð um lausnir fyrir fyrirtæki og stofnanir og aðrar vörur og þjónustu Volosoft.",
    "VolosoftSharingInformationMessage": "Ég vil að Volosoft deili upplýsingum mínum með völdum samstarfsaðilum svo ég geti fengið viðeigandi upplýsingar um vörur þeirra og þjónustu.",
    "WeWillSendYouADownloadLink": "Tengill til að hlaða niður rafbókinni hefur verið sendur á {0}. <br/> Athugaðu pósthólfið/rusl/ruslpóstsboxin þín!",
    "InvalidFormInputs": "Vinsamlegast sláðu inn gildar upplýsingar sem tilgreindar eru á eyðublaðinu.",
    "DDDBookEmailBody": "Þakka þér fyrir. <be /> Til að hlaða niður bókinni þinni, <a href=\"{0}\"> smelltu hér </a>.",
    "FreeDDDEBook": "Frí DDD rafbók",
    "StartFree": "Byrjaðu ókeypis",
    "FreeTrial": "Ókeypis prufa",
    "AcceptsMarketingCommunications": " Já, ég vil fá ABP Commercial markaðsefni.",
    "PurposeOfUsage": "Tilgangur með notkun",
    "Industry": "Iðnaður",
    "Choose": "- Velja -",
    "CompanyOrganizationName": "Nafn Fyrirtækis/Stofnunar",
    "CompanySize": "Stærð Fyrirtækis",
    "Next": "Næsta",
    "StartTrial": "Byrjaðu ókeypis prufuáskriftina mína",
    "ContactUsIssues": "Hafðu samband við okkur ef þú hefur einhver vandamál",
    "TrialActivatedWarning": "Kæri {0}, notandi á rétt á aðeins 1 ókeypis prufutíma. Þú hefur þegar notað prufutíma þinn.",
    "ActivationRequirement": "Þú ert einu skrefi frá því að hefja ókeypis prufuáskriftina. <br> Við höfum sent tölvupóst til <b> {0} </b> til að virkja reikninginn þinn. Athugaðu pósthólfið þitt/rusl/ruslpóstsboxin!",
    "SaveAndDownload": "Vista og hala niður",
    "CompanyNameValidationMessage": "Nafn fyrirtækis er of langt!",
    "AddressValidationMessage": "Heimilisfang er of langt!",
    "TaxNoValidationMessage": "SKATTA/VSK númber er of langt!",
    "NotesValidationMessage": "Skýringareiturinn er of langur!",
    "CheckYourBillingInfo": "Þú getur aðeins búið til reikninginn þinn einu sinni! Athugaðu innheimtuupplýsingar þínar áður en þú býrð til reikninginn þinn.",
    "Volo.AbpIo.Commercial:030000": "Þú hefur þegar notað prufutíma þinn.",
    "Volo.AbpIo.Commercial:030001": "Þetta nafn fyrirtækis er þegar til.",
    "StartYourFreeTrial": "Byrjaðu ókeypis prufuáskrift",
    "TrialLicenseModelInvalidErrorMessage": "Einn af eftirfarandi reitum er ógildur: heiti lands, stærð fyrirtækis, iðnaður eða tilgangur notkunar.",
    "Trial": "Prufu aðgangur",
    "Purchased": "Keypt",
    "PurchaseLicense": "Keypt leyfi",
    "PurchaseTrialLicenseMessage": "Gildistími leyfis þíns er {0}. <br> Ef þú vilt halda áfram að nota verkefnin sem þú bjóst til á ókeypis prufutímabilinu þarftu að breyta leyfislyklunum í <code> appsettings.secrets.json </code> skránni þinn. Hér er leyfislykillinn þinn:",
    "TrialLicenseExpireMessage": "Þú ert að nota prufuleyfið og prufuleyfið rennur út {0}.",
    "TryForFree": "Prófaðu ókeypis",
    "TrialLicenseExpiredInfo": "Prófunartímabil þitt er útrunnið!",
    "CommercialNewsletterConfirmationMessage": "Ég samþykki <a href=\"https://commercial.abp.io/TermsConditions\">skilmálana</a> og <a href=\"https://commercial.abp.io/Privacy\">persónuverndarstefnuna </a>."
  }
}