{
  "culture": "it",
  "texts": {
    "OrganizationManagement": "Gestione dell'organizzazione",
    "OrganizationList": "Elenco delle organizzazioni",
    "Volo.AbpIo.Commercial:010003": "Non sei il proprietario di questa organizzazione!",
    "OrganizationNotFoundMessage": "Nessuna organizzazione trovata!",
    "DeveloperCount": "Sviluppatori allocati/totali",
    "QuestionCount": "Domande rimanenti/totali",
    "Unlimited": "Illimitato",
    "Owners": "Proprietari",
    "AddMember": "Aggiungi membro",
    "AddOwner": "Aggiungi proprietario",
    "AddDeveloper": "Aggiungi sviluppatore",
    "UserName": "Nome utente",
    "Name": "Nome",
    "EmailAddress": "Indirizzo e-mail",
    "Developers": "Sviluppatori",
    "LicenseType": "Tipo di licenza",
    "Manage": "Gestire",
    "StartDate": "Data d'inizio",
    "EndDate": "Data di fine",
    "Modules": "Moduli",
    "LicenseExtendMessage": "La data di fine della tua licenza è estesa a {0}",
    "LicenseUpgradeMessage": "La tua licenza è stata aggiornata a {0}",
    "LicenseExtendAdnUpgradeMessage": "La tua licenza è stata estesa fino al {0} e il tuo piano di licenza è stato aggiornato a {1}.",
    "LicenseAddDeveloperMessage": "{0} sviluppatori aggiunti alla tua licenza",
    "Volo.AbpIo.Commercial:010004": "Impossibile trovare l'utente specificato! L'utente deve essere già registrato.",
    "MyOrganizations": "Le mie organizzazioni",
    "ApiKey": "Chiave API",
    "UserNameNotFound": "Nessun utente con nome utente {0}",
    "SuccessfullyAddedToNewsletter": "Grazie per esserti iscritto alla nostra newsletter!",
    "MyProfile": "Il mio profilo",
    "EmailNotValid": "Si prega di inserire un indirizzo email valido.",
    "JoinOurMarketingNewsletter": "Iscriviti alla nostra newsletter di marketing",
    "WouldLikeToReceiveMarketingMaterials": "Vorrei ricevere materiale di marketing come offerte di prodotti e offerte speciali.",
    "StartUsingYourLicenseNow": "Inizia subito a usare la tua licenza!",
    "WelcomePage": "Pagina di benvenuto",
    "UnsubscriptionExpireEmail": "Annulla l'iscrizione alle e-mail di promemoria della data di scadenza della licenza",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Questa sottoscrizione e-mail contiene solo il promemoria della data di scadenza della licenza.",
    "UnsubscribeFromLicenseExpireEmails": "Se non desideri ricevere le e-mail sulla data di scadenza della licenza, puoi annullare l'iscrizione in qualsiasi momento lo desideri.",
    "Unsubscribe": "Annulla l'iscrizione",
    "NotOrganizationMember": "Non sei membro di nessuna organizzazione.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Iscrizione annullata con successo",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Non riceverai più email di promemoria della data di scadenza della licenza.",
    "IndexPageHeroSection": "<span class=\"first-line\"> Una completa </span><span class=\"second-line\"> piattaforma di sviluppo web </span><span class=\"third-line\"> integrata <img src=\"{0}\" width=\"110\" class=\"ml-1\" /> framework </span>",
    "AbpCommercialShortDescription": "ABP Commercial fornisce moduli applicativi predefiniti, strumenti per lo sviluppo rapido di applicazioni, temi dell'interfaccia utente professionale, supporto premium e altro ancora.",
    "LiveDemo": "Dimostrazione dal vivo",
    "GetLicence": "Ottieni una licenza",
    "Application": "Applicazione",
    "StartupTemplates": "Modelli di avvio",
    "Startup": "Avviare",
    "Templates": "Modelli",
    "Developer": "Sviluppatore",
    "Tools": "Strumenti",
    "Premium": "Premium",
    "PremiumSupport": "Supporto Premium",
    "PremiumForumSupport": "Supporto Forum Premium",
    "UI": "Interfaccia Utente",
    "Themes": "Temi",
    "JoinOurNewsletter": "Iscriviti alla nostra newsletter",
    "Send": "Spedire",
    "Learn": "Imparare",
    "AdditionalServices": "Servizi aggiuntivi",
    "WhatIsABPFramework": "COSA E` IL FRAMEWORK ABP?",
    "OpenSourceBaseFramework": "Framework di base open source",
    "ABPFrameworkExplanation": "<p class=\"lead\"> ABP Commercial si basa su ABP Framework, un framework per applicazioni web open source e guidato dalla comunità per ASP.NET Core.</p><p> ABP Framework fornisce un'eccellente infrastruttura per la scrittura gestibile ed estensibile e codice testabile con best practice.</p><p> Costruito e integrato in strumenti popolari che già conosci. Bassa curva di apprendimento, facile adattamento, sviluppo confortevole.</p>",
    "Modular": "Modulare",
    "MicroserviceCompatible": "Compatibile con microservizi",
    "DomainDrivenDesignInfrastructure": "Infrastruttura Domain Driven Design",
    "MultiTenancy": "Multi-Tenancy",
    "DistributedMessaging": "Messaggistica distribuita",
    "DynamicProxying": "Proxying dinamico",
    "BackgroundJobs": "Operazioni in background",
    "AuditLogging": "Registri di controllo",
    "BLOBStoring": "Archiviazione BLOB",
    "BundlingMinification": "Raggruppamento e minimizzazione",
    "AdvancedLocalization": "Localizzazione avanzata",
    "ManyMore": "Molti altri",
    "ExploreTheABPFramework": "Esplora il framework ABP",
    "WhyUseTheABPCommercial": "Perché utilizzare ABP Commercial?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\"> La creazione di applicazioni Web di livello aziendale può essere complessa e richiede tempo.</p><p> ABP Commercial offre l'infrastruttura di base perfetta necessaria per tutti i moderni ASP.NET Core di livello aziendale soluzioni basate. Dalla progettazione all'implementazione, l'intero ciclo di sviluppo è potenziato dalle funzionalità e dai moduli integrati di ABP.</p>",
    "StartupTemplatesShortDescription": "I modelli di avvio ti consentono di avviare rapidamente il tuo progetto in pochi secondi.",
    "UIFrameworksOptions": "Opzioni dei framework dell'interfaccia utente;",
    "DatabaseProviderOptions": "Opzioni del provider di database;",
    "PreBuiltApplicationModules": "Moduli applicativi predefiniti",
    "PreBuiltApplicationModulesShortDescription": "I requisiti delle applicazioni più comuni sono già stati sviluppati per te come moduli riutilizzabili.",
    "Account": "Account",
    "Blogging": "Blogging",
    "Identity": "Identità",
    "IdentityServer": "Identity Server",
    "Saas": "Saas",
    "LanguageManagement": "Gestione della lingua",
    "TextTemplateManagement": "Gestione dei modelli di testo",
    "See All Modules": "Vedi tutti i moduli",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "ABP Suite è uno strumento complementare all'ABP Commercial.",
    "AbpSuiteExplanation": "Ti consente di creare pagine web in pochi minuti. È uno strumento .NET Core Global che può essere installato dalla riga di comando. Può creare una nuova soluzione ABP, generare pagine CRUD dal database al front-end.",
    "Details": "Dettagli",
    "LeptonTheme": "Tema Lepton",
    "ProfessionalModernUIThemes": "Temi dell'interfaccia utente moderni e professionali",
    "LeptonThemeExplanation": "Lepton fornisce una gamma di temi di amministrazione Bootstrap che fungono da solida base per qualsiasi progetto che richieda cruscotto di amministrazione.",
    "DefaultTheme": "Tema predefinito",
    "MaterialTheme": "Tema Material",
    "Default2Theme": "Tema predefinito 2",
    "DarkTheme": "Tema scuro",
    "DarkBlueTheme": "Tema blu scuro",
    "LightTheme": "Tema chiaro",
    "ProudToWorkWith": "Orgoglioso di lavorare con",
    "OurConsumers": "Centinaia di aziende e sviluppatori in oltre 70 paesi in tutto il mondo si affidano a ABP Commercial.",
    "JoinOurConsumers": "Unisciti a loro e crea prodotti sorprendenti velocemente.",
    "AdditionalServicesExplanation": "Hai bisogno di servizi aggiuntivi o personalizzati? <strong> Noi e i nostri partner possiamo fornire; </strong>",
    "CustomProjectDevelopment": "Sviluppo di progetti personalizzati",
    "CustomProjectDevelopmentExplanation": "Sviluppatori dedicati per i tuoi progetti personalizzati.",
    "PortingExistingProjects": "Miigrazione di progetti esistenti",
    "PortingExistingProjectsExplanation": "Migrazione dei tuoi progetti legacy alla piattaforma ABP.",
    "LiveSupport": "Supporto dal vivo",
    "LiveSupportExplanation": "Opzione di supporto remoto dal vivo quando ne hai bisogno.",
    "Training": "Formazione",
    "TrainingExplanation": "Formazione dedicata per i tuoi sviluppatori.",
    "OnBoarding": "Affiancamento",
    "OnBoardingExplanation": "Aiuta a configurare i tuoi ambienti di sviluppo, CI e CD.",
    "PrioritizedTechnicalSupport": "Assistenza tecnica prioritaria",
    "PremiumSupportExplanation": "Oltre al grande supporto della comunità del framework ABP, il nostro team di supporto risponde alle domande tecniche e ai problemi degli utenti commerciali con alta priorità.",
    "SeeTheSupportOptions": "Vedi le opzioni di supporto",
    "Contact": "Contatto",
    "TellUsWhatYouNeed": "Dicci di cosa hai bisogno.",
    "YourMessage": "Il tuo messaggio",
    "YourFullName": "Il tuo nome completo",
    "EmailField": "Indirizzo e-mail",
    "YourEmailAddress": "Il tuo indirizzo di posta elettronica",
    "HowMayWeHelpYou": "Come possiamo aiutarti?",
    "SendMessage": "Invia messaggio",
    "Success": "Successo",
    "WeWillReplyYou": "Abbiamo ricevuto il tuo messaggio e ti contatteremo a breve.",
    "GoHome": "Torna all'inizio",
    "CreateLiveDemo": "Crea demo live",
    "RegisterToTheNewsletter": "Registrati alla newsletter per ricevere informazioni su ABP.IO, comprese le nuove versioni ecc.",
    "EnterYourEmailOrLogin": "Inserisci il tuo indirizzo e-mail per creare la tua demo o <a href=\"{0}\"> Accedi </a> utilizzando il tuo account esistente.",
    "ApplicationTemplate": "Modello di applicazione",
    "ApplicationTemplateExplanation": "Il modello di avvio dell'applicazione viene utilizzato per creare una nuova applicazione web.",
    "EfCoreProvider": "Entity Framework (supporta SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\"> e altri </a>)",
    "AlreadyIncludedInTemplateModules": "I seguenti moduli sono già inclusi e configurati in questo modello:",
    "ApplicationTemplateArchitecture": "Questo modello di applicazione supporta anche un'architettura a più livelli in cui il livello dell'interfaccia utente, il livello API e il servizio di autenticazione sono fisicamente separati.",
    "SeeTheGuideOrGoToTheLiveDemo": "Consulta la guida per sviluppatori per informazioni tecniche su questo modello o vai alla demo live.",
    "DeveloperGuide": "Guida per sviluppatori",
    "ModuleTemplate": "Modello per modulo",
    "ModuleTemplateExplanation1": "Vuoi creare un modulo e riutilizzarlo in diverse applicazioni? Questo modello di avvio prepara tutto per iniziare a creare un <strong> modulo dell'applicazione </strong> riutilizzabile o un <strong> microservizio </strong>.",
    "ModuleTemplateExplanation2": "<p> Puoi supportare uno o più framework UI, uno o più provider di database per un singolo modulo. Il modello di avvio è configurato per eseguire e <strong> testare il modulo </strong> in un'applicazione minima oltre all'unità e all'infrastruttura di test di integrazione.</p><p> Consulta la guida per sviluppatori per informazioni tecniche su questo modello.</p>",
    "WithAllStyleOptions": "con tutte le opzioni di stile",
    "Demo": "Demo",
    "SeeAllModules": "Vedi tutti i moduli",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) è uno strumento a riga di comando per eseguire alcune operazioni comuni per soluzioni basate su ABP.",
    "ABPSuiteEasilyCURD": "ABP Suite è uno strumento che ti permette di creare facilmente pagine CRUD",
    "WeAreHereToHelp": "Siamo qui per <span class=\"zero-text\">Aiutarti</span>",
    "BrowseOrAskQuestion": "Puoi sfogliare i nostri argomenti della guida o cercare nelle domande frequenti oppure puoi farci una domanda utilizzando il <a href=\"{0}\" class=\"text-success\"> modulo di contatto </a>.",
    "SearchQuestionPlaceholder": "Cerca nelle domande frequenti",
    "WhatIsTheABPCommercial": "Cos'è ABP Commercial?",
    "WhatAreDifferencesThanAbpFramework": "Quali sono le differenze tra ABP Framework open source e ABP Commercial?",
    "ABPCommercialExplanation": "ABP Commercial è un insieme di moduli, strumenti, temi e servizi premium basati sul <a target=\"_blank\" href=\"{0}\"> framework ABP </a> open source. ABP Commercial è sviluppato e supportato dallo stesso team dietro il framework ABP.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p><a target=\"_blank\" href=\"{0}\"> ABP framework </a> è un framework di sviluppo di applicazioni compatibile con micro-servizi per ASP.NET Core modulare. Fornisce un'architettura completa e una solida infrastruttura per farti concentrare sul tuo codice aziendale piuttosto che ripetere te stesso per ogni nuovo progetto. Si basa sulle migliori pratiche di sviluppo software e su strumenti popolari che già conosci.</p><p> Il framework ABP è completamente gratuito, open source e guidato dalla comunità. Fornisce inoltre un tema gratuito e alcuni moduli predefiniti (ad es. Gestione delle identità e gestione dei tenant).</p>",
    "VisitTheFrameworkVSCommercialDocument": "Visita il seguente link, per ulteriori informazioni <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial aggiunge i seguenti vantaggi al framework ABP;",
    "Professional": "Professionale",
    "UIThemes": "Temi dell'interfaccia utente",
    "EnterpriseModules": "Pronto per le imprese, <a href=\"{0}\"> moduli applicativi </a> preconfigurati, ricchi di funzionalità (ad es. Gestione di Identity Server, gestione SaaS, gestione della lingua)",
    "ToolingToSupport": "Strumenti per supportare la produttività dello sviluppo (ad es.<a href=\"{0}\"> ABP Suite </a>)",
    "PremiumSupportLink": "<a href=\"{0}\" target=\"_blank\">Supporto </a> Premium",
    "WhatDoIDownloadABPCommercial": "Cosa devo scaricare quando acquisto ABP Commercial?",
    "CreateUnlimitedSolutions": "Dopo aver acquistato una licenza commerciale ABP, sarai in grado di creare soluzioni illimitate come descritto nel documento <a href=\"{0}\"> Guida introduttiva </a>.",
    "ABPCommercialSolutionExplanation": "Quando crei una nuova applicazione, ottieni una soluzione Visual Studio (un modello di avvio) in base alle tue preferenze. La soluzione scaricata ha moduli e temi commerciali già installati e configurati per te. Puoi rimuovere un modulo preinstallato o aggiungere un altro modulo, se lo desideri. Tutti i moduli e temi vengono usati come pacchetti NuGet/NPM per impostazione predefinita.",
    "StartDevelopWithTutorials": "La soluzione scaricata è ben progettata e documentata. Puoi iniziare a sviluppare il tuo codice aziendale basato su di esso seguendo <a href=\"{0}\"> i tutorial </a>",
    "TryTheCommercialDemo": "Puoi provare <a href=\"{0}\"> la demo </a> per vedere un'applicazione di esempio creata utilizzando il modello di avvio di ABP Commercial.",
    "HowManyProducts": "Quanti prodotti/soluzioni differenti posso costruire utilizzando ABP Commercial?",
    "HowManyProductsExplanation": "Non ci sono limiti per creare un progetto ABP. Puoi creare tutti i progetti che desideri, svilupparli e caricarli su server diversi.",
    "HowManyDevelopers": "Quanti sviluppatori possono lavorare su ABP Commercial?",
    "HowManyDevelopersExplanation": "Le licenze commerciali ABP sono per sviluppatore. Diversi tipi di licenza hanno diversi limiti per sviluppatori. Tuttavia, puoi aggiungere più sviluppatori a qualsiasi tipo di licenza ogni volta che ne hai bisogno. Consulta la pagina dei <a href=\"{0}\"> prezzi </a> per i tipi di licenza, i limiti per gli sviluppatori e i costi aggiuntivi per gli sviluppatori.",
    "ChangingLicenseType": "Posso cambiare il mio tipo di licenza in futuro?",
    "ChangingLicenseTypeExplanation": "Puoi sempre aggiungere nuovi sviluppatori con lo stesso tipo di licenza. Vedi anche \"Quanti sviluppatori possono lavorare su ABP Commercial?\". Puoi anche passare a una licenza superiore pagando la differenza di prezzo calcolata. Quando esegui l'aggiornamento a un piano di licenza superiore, ottieni i vantaggi del nuovo piano, ma l'aggiornamento della licenza non modifica la data di scadenza della licenza.",
    "LicenseExtendUpgradeDiff": "Qual è la differenza tra estensione della licenza e aggiornamento?",
    "LicenseExtendUpgradeDiffExplanation": "<strong> Estensione: </strong> estendendo/rinnovando la tua licenza, continuerai a ricevere supporto premium e a ricevere aggiornamenti importanti per moduli e temi. Inoltre, potrai continuare a creare nuovi progetti. E sarai ancora in grado di utilizzare ABP Suite che accelera il tuo sviluppo.<hr/><strong> Upgrade: </strong> aggiornando la tua licenza, promuoverai un piano di licenza superiore che ti consentirà di ottenere ulteriori vantaggi . Consulta la <a href=\"/pricing\"> tabella di confronto delle licenze </a> per verificare le differenze tra i piani di licenza.<strong> D'altra parte, quando esegui l'upgrade, la data di scadenza della licenza non cambierà! </strong> Per estendere la data di fine della licenza, è necessario estendere la licenza.",
    "LicenseRenewalCost": "Qual è il costo del rinnovo della licenza dopo 1 anno?",
    "LicenseRenewalCostExplanation": "La tariffa di rinnovo (estensione) di tutte le licenze perpetue ABP Commercial è {0} del prezzo di listino della licenza. Il prezzo di rinnovo della licenza Team standard è $ {1}, la licenza Business standard è $ {2} e la licenza Enterprise standard è $ {3}. Se sei già un cliente, <a href='{4}' target='_blank'> accedi al tuo account </a> per esaminare i prezzi di rinnovo disponibili.",
    "HowDoIRenewMyLicense": "Come rinnovo la mia licenza?",
    "HowDoIRenewMyLicenseExplanation": "Puoi rinnovare la licenza accedendo alla <a href='{0}' target='_blank'> pagina di gestione dell'organizzazione </a>. Per poter usufruire delle nostre tariffe scontate di rinnovo anticipato, assicurati di rinnovare prima della scadenza della licenza. Tuttavia, non preoccuparti di non sapere quando si chiude la tua opportunità di rinnovo anticipato. Riceverai 2 e-mail di promemoria prima della scadenza dell'abbonamento. Li invieremo a 30 giorni, 7 giorni prima della scadenza.",
    "IsSourceCodeIncluded": "La mia licenza include il codice sorgente dei moduli e dei temi commerciali?",
    "IsSourceCodeIncludedExplanation1": "Dipende dal tipo di licenza che hai acquistato:",
    "IsSourceCodeIncludedExplanation2": "<strong> Team </strong>: la soluzione utilizza i moduli e i temi come pacchetti NuGet e NPM. Non include il loro codice sorgente. In questo modo, puoi aggiornare facilmente questi moduli e temi ogni volta che è disponibile una nuova versione. Tuttavia, non è possibile ottenere il codice sorgente dei moduli e dei temi.",
    "IsSourceCodeIncludedExplanation3": "<strong> Business/Enterprise </strong>: in aggiunta alla licenza Team, puoi scaricare il codice sorgente di qualsiasi modulo o tema di cui hai bisogno. È anche possibile rimuovere i riferimenti al pacchetto NuGet/NPM per un particolare modulo e aggiungere il relativo codice sorgente direttamente alla soluzione per modificarlo completamente.",
    "IsSourceCodeIncludedExplanation4": "<p> Includere il codice sorgente di un modulo nella tua soluzione ti dà la massima libertà di personalizzare quel modulo. Tuttavia, non sarà possibile aggiornare automaticamente il modulo quando viene rilasciata una nuova versione.</p><p> Nessuna delle licenze include il codice sorgente di ABP Suite, che è uno strumento esterno che genera codice per te e assiste al tuo sviluppo.</p><p> Vedi <a href=\"{0}\"> la pagina dei prezzi </a> per altre differenze tra i tipi di licenza.</p>",
    "ChangingDevelopers": "Posso cambiare gli sviluppatori registrati della mia organizzazione in futuro?",
    "ChangingDevelopersExplanation": "Oltre ad aggiungere nuovi sviluppatori alla tua licenza, puoi anche Modifica gli sviluppatori esistenti (puoi rimuovere uno sviluppatore e aggiungerne uno nuovo alla stessa postazione) senza alcun costo aggiuntivo.",
    "WhatHappensWhenLicenseEnds": "Cosa succede al termine del periodo di licenza?",
    "WhatHappensWhenLicenseEndsExplanation1": "Il tipo di licenza ABP Commercial è <a href=\"{0}\" target=\"_blank\"> licenza perpetua </a>. Dopo la scadenza della licenza, puoi continuare a sviluppare il tuo progetto. E non sei obbligato a rinnovare la tua licenza. La tua licenza viene fornita con un anno di aggiornamenti e piano di supporto pronto all'uso. Per continuare a ricevere nuove funzionalità, miglioramenti delle prestazioni, correzioni di bug, supporto e continuare a utilizzare ABP Suite, assicurati di rinnovare il tuo piano ogni anno. Quando la tua licenza scade, non sarai in grado di ottenere più dei seguenti vantaggi;",
    "WhatHappensWhenLicenseEndsExplanation2": "Non è possibile creare nuove soluzioni utilizzando ABP Commercial, ma è possibile continuare a sviluppare le applicazioni esistenti per sempre.",
    "WhatHappensWhenLicenseEndsExplanation3": "Sarai in grado di ottenere aggiornamenti per i moduli e i temi nella tua versione MAJOR. Per esempio; se stai usando la v3.2.0 di un modulo, puoi comunque ottenere gli aggiornamenti per la v3.x.x (v3.3.0, v3.5.2... ecc.) di quel modulo. Ma non puoi ottenere aggiornamenti per la prossima versione principale (come v4.x, v5.x)",
    "WhatHappensWhenLicenseEndsExplanation4": "Non è possibile installare nuovi moduli e temi aggiunti alla piattaforma ABP Commercial al termine della licenza.",
    "WhatHappensWhenLicenseEndsExplanation5": "Non è possibile utilizzare ABP Suite.",
    "WhatHappensWhenLicenseEndsExplanation6": "Non puoi più ottenere l '<a href=\"{0}\"> assistenza premium </a>.",
    "WhatHappensWhenLicenseEndsExplanation7": "Puoi rinnovare l'abbonamento se desideri continuare a usufruire di questi vantaggi. C'è uno sconto del 20% quando rinnovi l'abbonamento.",
    "WhenShouldIRenewMyLicense": "Quando devo rinnovare la mia licenza?",
    "WhenShouldIRenewMyLicenseExplanation1": "Se rinnovi la licenza entro <strong> 1 mese </strong> dalla scadenza della licenza, verrà applicato uno sconto del 20% sul prezzo totale della licenza.",
    "WhenShouldIRenewMyLicenseExplanation2": "Se rinnovi la licenza dopo 1 mese dalla data di scadenza della licenza, il prezzo di rinnovo sarà lo stesso del prezzo di acquisto della licenza e non ci saranno sconti per il rinnovo.",
    "TrialPlan": "Hai un piano di prova?",
    "TrialPlanExplanation": "Per ora, ABP Commercial non ha un piano di prova. Per le licenze Team forniamo una garanzia di rimborso di 30 giorni. Puoi richiedere un rimborso solo nei primi 30 giorni. Per le licenze Business ed Enterprise, forniamo un rimborso del 60% in 30 giorni. Questo perché le licenze Business ed Enterprise includono il codice sorgente completo di tutti i moduli e i temi.",
    "DoYouAcceptBankWireTransfer": "Accettate bonifici bancari?",
    "DoYouAcceptBankWireTransferExplanation": "Sì, accettiamo bonifico bancario.<br/> Dopo aver inviato l'importo della licenza tramite bonifico bancario, inviaci la ricevuta e il tipo di licenza richiesto tramite e-mail.<br/> Informazioni sul nostro conto bancario internazionale:",
    "HowToUpgrade": "Come aggiornare le applicazioni esistenti quando è disponibile una nuova versione?",
    "HowToUpgradeExplanation1": "Quando crei una nuova applicazione utilizzando ABP Commercial, tutti i moduli e il tema vengono utilizzati come pacchetti NuGet e NPM. Quindi, puoi facilmente aggiornare i pacchetti quando è disponibile una nuova versione.",
    "HowToUpgradeExplanation2": "Oltre agli aggiornamenti NuGet/NPM standard, <a href=\"{0}\"> ABP CLI </a> fornisce un comando di aggiornamento che trova e aggiorna automaticamente tutti i pacchetti relativi a ABP nella soluzione.",
    "DatabaseSupport": "Quali sistemi di database sono supportati?",
    "DatabaseSupportExplanation": "Lo stesso ABP Framework è indipendente dal database e può funzionare con qualsiasi provider di database per sua natura. Consulta il <a href=\"{0}\" target=\"_blank\"> documento di accesso ai dati </a> per un elenco dei fornitori attualmente implementati.",
    "UISupport": "Quali framework dell'interfaccia utente sono supportati?",
    "Supported": "Supportato",
    "UISupportExplanation": "Lo stesso ABP Framework è indipendente dal framework dell'interfaccia utente e può funzionare con qualsiasi framework dell'interfaccia utente. Tuttavia, i modelli di avvio, le interfacce utente dei moduli e i temi non sono stati implementati per tutti i framework dell'interfaccia utente. Consulta il <a href=\"{0}\"> documento introduttivo </a> per l'elenco aggiornato delle opzioni dell'interfaccia utente.",
    "MicroserviceSupport": "Supporta l'architettura dei micro-servizi?",
    "MicroserviceSupportExplanation1": "Uno degli obiettivi principali del framework ABP è fornire un'infrastruttura conveniente per creare soluzioni di micro-servizi. Consulta il documento sull '<a href=\"{0}\"> architettura dei micro-servizi </a> per capire come aiuta a creare sistemi di micro-servizi.",
    "MicroserviceSupportExplanation2": "Tutti i moduli ABP Commercial sono progettati per supportare scenari di distribuzione di micro-servizi (con la propria API e database) seguendo il documento <a href=\"{0}\"> best practice per lo sviluppo di moduli </a>.",
    "MicroserviceSupportExplanation3": "Forniamo una <a href=\"{0}\"> soluzione demo di micro-servizi </a> di esempio che dimostra l'implementazione di un'architettura di micro-servizi per aiutarti a creare la tua soluzione.",
    "MicroserviceSupportExplanation4": "Quindi, la risposta breve è \"<strong> sì, supporta l'architettura di micro-servizi </strong>\".",
    "MicroserviceSupportExplanation5": "Tuttavia, un sistema di micro-servizi è una soluzione e ogni soluzione avrà requisiti diversi, topologia di rete, scenari di comunicazione, possibilità di autenticazione, decisioni di separazione/condivisione del database, configurazioni di runtime, integrazioni di sistemi di terze parti e molto altro.",
    "MicroserviceSupportExplanation6": "L'ABP Framework e l'ABP Commercial forniscono un'infrastruttura per scenari di micro-servizi, moduli compatibili con micro-servizi, esempi e documentazione per aiutarti a creare la tua soluzione. Ma non aspettarti di scaricare direttamente la soluzione dei tuoi sogni precostruita per te. Dovrai capirlo e riunire alcune parti in base alle tue esigenze.",
    "WhereCanIDownloadSourceCode": "Dove posso scaricare il codice sorgente?",
    "WhereCanIDownloadSourceCodeExplanation": "È possibile scaricare il codice sorgente di tutti i moduli ABP, pacchetti e temi Angular tramite ABP Suite o ABP CLI. Vedi <a href=\"{0}\"> Come scaricare il codice sorgente? </a>",
    "ComputerLimitation": "Quanti computer può accedere uno sviluppatore durante lo sviluppo di ABP?",
    "ComputerLimitationExplanation": "Autorizziamo specificamente <strong> {0} computer </strong> per singolo sviluppatore/con licenza. Ogni volta che è necessario che uno sviluppatore sviluppi prodotti ABP Commercial su una terza macchina, deve essere inviata un'e-mail a license@abp.io spiegando la situazione e quindi effettueremo l'allocazione appropriata nel nostro sistema.",
    "RefundPolicy": "Hai una politica di rimborso?",
    "RefundPolicyExplanation": "Puoi richiedere un rimborso entro <strong> 30 giorni </strong> dall'acquisto della licenza. I tipi di licenza Business ed Enterprise hanno l'opzione di download del codice sorgente, pertanto i rimborsi non sono disponibili per Business ed Enterprise (e qualsiasi licenza che includa il diritto di ricevere il codice sorgente). Inoltre, non vengono effettuati rimborsi per rinnovi e acquisti di seconde licenze.",
    "HowCanIRefundVat": "Come posso rimborsare l'IVA?",
    "HowCanIRefundVatExplanation1": "Se hai effettuato il pagamento utilizzando 2Checkout, puoi rimborsare l'IVA tramite il tuo account 2Checkout:",
    "HowCanIRefundVatExplanation2": "Accedi al tuo account <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\"> 2Checkout </a>",
    "HowCanIRefundVatExplanation3": "Trova l'ordine appropriato e premi \"Rimborsa IVA tardiva\" (inserisci il tuo numero di partita IVA)",
    "HowCanIGetMyInvoice": "Come posso ricevere la mia fattura?",
    "HowCanIGetMyInvoiceExplanation": "Esistono 2 gateway di pagamento per l'acquisto di una licenza: PayU e 2Checkout. Se acquisti la tua licenza tramite il gateway 2Checkout, invia la fattura in PDF al tuo indirizzo e-mail, vedi <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How-do-invoices-work\"> Fatturazione 2Checkout.</a> Se acquisti tramite il gateway PayU o tramite bonifico bancario, prepareremo e invieremo la tua fattura. Puoi richiedere la fattura dalla <a href=\"{0}\"> pagina di gestione dell'organizzazione.</a>",
    "Forum": "Forum",
    "SupportExplanation": "Le licenze commerciali di ABP forniscono un supporto forum premium da parte di un team composto dagli esperti di ABP Framework.",
    "PrivateTicket": "Ticket privato",
    "PrivateTicketExplanation": "Enterprise License include anche un supporto privato con e-mail e sistema di ticket.",
    "AbpSuiteExplanation1": "ABP Suite ti consente di creare pagine web in pochi minuti. È uno strumento .NET Core Global che può essere installato dalla riga di comando.",
    "AbpSuiteExplanation2": "Può creare una nuova soluzione ABP, generare pagine CRUD dal database al front-end. Per una panoramica tecnica, vedere <a href=\"{0}\"> il documento </a>",
    "FastEasy": "Veloce e facile",
    "AbpSuiteExplanation3": "ABP Suite ti consente di creare facilmente pagine CRUD. Devi solo definire la tua entità e le sue proprietà, lascia che il resto sia ABP Suite per te! ABP Suite genera tutto il codice necessario per la tua pagina CRUD in pochi secondi. Supporta le interfacce utente Angular, MVC e Blazor.",
    "RichOptions": "Opzioni ricche",
    "AbpSuiteExplanation4": "ABP Suite supporta più opzioni dell'interfaccia utente come <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\"> Razor Pages </a> e <a href=\"https://angular.io\">Angular </a>. Supporta anche più database come <a href=\"https://www.mongodb.com\"> MongoDB </a> e tutti i database supportati da <strong> EntityFramework Core </strong> (MS SQL Server, Oracle, MySql, PostgreSQL e <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\"> altro </a>).",
    "AbpSuiteExplanation5": "La cosa buona è che non devi preoccuparti di quelle opzioni. ABP Suite comprende il tipo di progetto e genera il codice per il progetto e inserisce il codice generato nella posizione corretta nel progetto.",
    "SourceCode": "Codice sorgente",
    "AbpSuiteExplanation6": "ABP Suite genera il codice sorgente per te! Non genera file magici per generare la pagina web. ABP Suite genera il codice sorgente per <strong> Entity, Repository, Application Service, Code First Migration, JavaScript/TypeScript e CSHTML/HTML </strong> e anche le interfacce necessarie. ABP Suite genera anche il codice in base alle <strong> Best Practices </strong> di sviluppo software, quindi non devi preoccuparti della qualità del codice generato.",
    "AbpSuiteExplanation7": "Dal momento che hai il codice sorgente dei blocchi costitutivi della pagina CRUD generata nei livelli di applicazione corretti, puoi facilmente Modifica il codice sorgente e inserire la tua logica personalizzata/aziendale nel codice generato.",
    "CrossPlatform": "Piattaforma multipla",
    "AbpSuiteExplanation8": "ABP Suite è costruito con .NET Core ed è multipiattaforma. E` un'applicazione web sul tuo computer locale. Puoi eseguirlo su <strong>Windows</strong>, <strong> Mac </strong> e <strong>Linux</strong>",
    "OtherFeatures": "Altre Funzionalità",
    "OtherFeatures1": "Aggiorna facilmente i pacchetti <strong>NuGet</strong> e <strong>NPM</strong> sulla tua soluzione.",
    "OtherFeatures2": "Rigenera le pagine già generate da zero.",
    "OtherFeatures3": "Crea nuove soluzioni",
    "ThanksForCreatingProject": "Grazie per aver creato il tuo progetto!",
    "HotToRunSolution": "Come eseguire la tua soluzione?",
    "HotToRunSolutionExplanation": "Vedere il documento introduttivo per apprendere come configurare ed eseguire la soluzione.",
    "GettingStarted": "Iniziare",
    "WebAppDevTutorial": "Tutorial per sviluppatori di App Web",
    "WebAppDevTutorialExplanation": "Vedere il documento tutorial sullo sviluppo di applicazioni Web per un esempio di sviluppo passo passo.",
    "Document": "Documento",
    "UsingABPSuiteToCURD": "Utilizzo di ABP Suite per la generazione di pagine CRUD e gli strumenti",
    "SeeABPSuiteDocument": "Vedere il documento ABP Suite per apprendere l'utilizzo di ABP Suite.",
    "AskQuestionsOnSupport": "Puoi porre domande sul supporto commerciale ABP.",
    "Documentation": "Documentazione",
    "SeeModulesDocument": "Vedere il documento dei moduli per un elenco di tutti i moduli commerciali(pro) e dei relativi documenti.",
    "Pricing": "Prezzi",
    "PricingExplanation": "Scegli le Funzionalità e le funzionalità di cui la tua azienda ha bisogno oggi. Esegui facilmente l'upgrade man mano che la tua attività cresce.",
    "Team": "Team",
    "Business": "Business",
    "Enterprise": "Enterprise",
    "Custom": "Personalizzato",
    "IncludedDeveloperLicenses": "Licenze per sviluppatori incluse",
    "CustomLicenceOrAdditionalServices": "Hai bisogno di una licenza personalizzata o di servizi aggiuntivi?",
    "CustomOrVolumeLicense": "Licenza personalizzata o multilicenza",
    "LiveTrainingSupport": "Formazione e supporto dal vivo",
    "AndMore": "e altro ancora",
    "AdditionalDeveloperLicense": "Licenza aggiuntiva per sviluppatori",
    "ProjectCount": "Conteggio del progetto",
    "AllProModules": "Tutti i moduli professionali",
    "AllProThemes": "Tutti i temi professionali",
    "AllProStartupTemplates": "Tutti i modelli di avvio professionali",
    "SourceCodeOfAllModules": "Codice sorgente di tutti i moduli",
    "SourceCodeOfAllThemes": "Codice sorgente di tutti i temi",
    "PerpetualLicense": "Licenza perpetua",
    "UnlimitedServerDeployment": "Distribuzione illimitata del server",
    "YearUpgrade": "1 anno di aggiornamento",
    "YearPremiumForumSupport": "1 anno di supporto forum premium",
    "ForumSupportIncidentCountYear": "Conteggio delle richieste di supporto del forum/anno",
    "PrivateTicketEmailSupport": "Ticket privato e supporto via e-mail",
    "BuyNow": "Acquista ora",
    "PayViaAmexCard": "Come posso pagare tramite la mia carta AMEX?",
    "PayViaAmexCardDescription": "Il gateway di pagamento predefinito \"Iyzico\" potrebbe rifiutare alcune carte di credito AMEX a causa delle misure di sicurezza. In questo caso, puoi pagare tramite il gateway di pagamento alternativo \"2Checkout\".",
    "ThankYou": "Grazie",
    "InvalidReCaptchaErrorMessage": "Si è verificato un errore durante la verifica di reCAPTCHA. Per favore riprova.",
    "CompanyName": "Nome Azienda",
    "YourCompanyName": "Il nome della tua azienda",
    "FirstName": "Nome",
    "LastName": "Cognome",
    "Optional": "Facoltativo",
    "YourFirstName": "Il tuo nome",
    "YourLastName": "Il tuo cognome",
    "SpecialOffer": "Offerta Speciale",
    "SpecialOfferMessage": "Fai presto! I prezzi sono validi per un periodo limitato.",
    "DiscountRequest": "Richiesta Sconto",
    "DiscountRequestDescribeCustomerQuestion": "Quale delle seguenti ti descrive?",
    "DiscountRequestStudentEmailMessage": "L'indirizzo email deve contenere 'edu'.",
    "DiscountRequestDeveloperCount": "Quanti sviluppatori ci sono?",
    "DiscountRequestDeveloperCountExceedMessage": "Non concediamo sconti per le aziende con più di {0} sviluppatori.",
    "DiscountRequestOrganizationName": "Nome Azienda/Organizzazione/Istituto Scolastico",
    "Website": "Sito web",
    "GithubUsername": "Nome utente GitHub",
    "PhoneNumber": "Numero Telefono",
    "Country": "Nazione",
    "DescribeABPCommercialUsage": "Descrivi il progetto che stai pianificando di sviluppare su ABP Commercial",
    "DiscountRequestCertifyInformationMessage": "Dichiaro che tutte le informazioni fornite corrispondono al vero e sono corrette",
    "DiscountRequestReceived": "Abbiamo ricevuto la tua richiesta di sconto.",
    "DiscountRequestStatusMessage": "Risponderemo dopo aver verificato le informazioni fornite.",
    "MVCOrRazorPages": "MVC (Razor Pages)",
    "Angular": "Angular",
    "Blazor": "Blazor",
    "New": "Nuovo",
    "MongoDB": "MongoDB",
    "EBookDDD": "E-Book Domain Driven Design",
    "PracticalGuideForImplementingDDD": "Questo libro è una guida pratica per implementare il Domain Driven Design con ABP Framework.",
    "IntroducingDDD": "Introduzione al Domain Driven Design",
    "DDDLayersAndCleanArchitecture": "DDD Strati e Architettura Pulita",
    "LayeringOfADotnetSolution": "Stratificazione di una Soluzione .NET",
    "ImplementingDDDBuildingBlocks": "Implementazione delle Fondamenta del DDD",
    "DomainVsApplicationLogic": "Logica di Dominio contro Logica Applicazione",
    "SamplesAndDiscussions": "Esempi e Discussioni",
    "Free": "Gratuito",
    "Download": "Download",
    "DDDEBook": "DDD E-book",
    "ImplementingDDD": "Implementazione Domain Driven Design",
    "DDDBookExplanation": "Una guida pratica per implementare il Domain Driven Design con ABP Framework.",
    "Overview": "Panoramica",
    "DDDBookPracticalGuide": "Questa a una guida pratica per implementare Domain Driven Design (DDD). Mentre i dettagli per l'implementazione sono basati sull'infrastruttura di ABP Framework, i concetti base, principi e modelli possono essere applicati a qualsiasi soluzione, anche se non è una soluzione .NET.",
    "TableOfContents": "Sommario",
    "IntroductionToImplementingDDD": "Introduzione all'Implementazione Domain Driven Design",
    "WhatIsDDD": "Cos'è il Domain Driven Design?",
    "Implementation": "Implementazione",
    "TheBigPicture": "Il Quadro Generale",
    "TheBuildingBlock": "Le Fondamenta",
    "ExampleUseCase": "Esempio d'uso",
    "DomainAndApplicationLogic": "Logica di Dominio e Logica Applicazione",
    "Author": "Autore",
    "PublishedOn": "Pubblicato il",
    "Page": "Pagina",
    "FreeEBook": "E-Book Gratuito",
    "EBookSignInForDownload": "Accedi per scaricare l'e-book",
    "SignIn": "Accedi",
    "Or": "O",
    "TellUsAboutYourself": "Dicci qualcosa di te",
    "Surname": "Cognome",
    "DoYouAgreePrivacyPolicy": "Acconsento ai <a href=\"/TermsConditions\">Termini e Condizioni<a/> ed alla <a href=\"/Privacy\">Politica Privacy</a>.",
    "VolosoftMarketingInformationMessage": "Vorrei informazioni, suggerimenti e offerte sulle Soluzioni per Aziende e Organizzazioni e altri prodotti e servizi Volosoft",
    "VolosoftSharingInformationMessage": "Vorrei che Volosoft condividesse le mie informazioni con partner selezionati in modo da poter ricevere informazioni rilevanti sui loro prodotti e servizi",
    "WeWillSendYouADownloadLink": "Un link per scaricare il libro e-book è stato spedito a {0}.<br/> Controlla nella posta in arrivo/indesiderata/spam!",
    "InvalidFormInputs": "Per favore, digita le informazioni valide specificate nel modulo",
    "DDDBookEmailBody": "Grazie. <br /> Per scaricare il tuo libro, <a href=\"{0}\">clicca qui</a>.",
    "FreeDDDEBook": "E-Book Gratuito DDD",
    "StartFree": "Inizia gratuitamente",
    "FreeTrial": "Prova Gratuita",
    "AcceptsMarketingCommunications": "Si desidero ricevere comunicazioni marketing riguardanti ABP Commercial",
    "PurposeOfUsage": "Proposta di utilizzo",
    "Industry": "Settore",
    "Choose": "- Scegli -",
    "CompanyOrganizationName": "Azienda/Nome organizzazione",
    "CompanySize": "Dimensioni Azienda",
    "Next": "Prossimo",
    "StartTrial": "Inizia la mia prova gratuita",
    "ContactUsIssues": "Contattaci per qualsiasi problema",
    "TrialActivatedWarning": "Caro {0}, un utente ha diritto di avere 1 solo periodo di prova gratuito. Hai già utilizzato il tuo periodo di prova.",
    "ActivationRequirement": "Ti manca un solo passo per iniziare il tuo periodo di prova gratuito.<br>Abbiamo inviato un'email a <b>{0}</b> per attivare il tuo account. Controlla la tua casella di posta e non dimenticare la cartella spam!",
    "SaveAndDownload": "Salva e Scarica",
    "CompanyNameValidationMessage": "Il nome dell'azienda è troppo lungo!",
    "AddressValidationMessage": "L'indirizzo è troppo lungo!",
    "TaxNoValidationMessage": "TAX/VAT (IVA) è troppo lungo!",
    "NotesValidationMessage": "Il campo note è troppo lungo!",
    "CheckYourBillingInfo": "Puoi creare una fattura solo una volta! Controlla i tuoi dati di fatturazione prima di creare una fattura.",
    "Volo.AbpIo.Commercial:030000": "Hai già utilizzato il periodo di prova.",
    "Volo.AbpIo.Commercial:030001": "Questo nome dell'organizzazione esiste già.",
    "StartYourFreeTrial": "Inizia la tua prova gratuita",
    "TrialLicenseModelInvalidErrorMessage": "Uno dei seguenti campi non è valido: nome del paese, dimensione dell'azienda, settore o scopo di utilizzo.",
    "Trial": "Processo",
    "Purchased": "Acquistato",
    "PurchaseLicense": "Acquista licenza",
    "PurchaseTrialLicenseMessage": "La data di scadenza della tua licenza è {0}. <br> Se desideri continuare a utilizzare i progetti che hai creato durante il periodo di prova gratuito, devi modificare le chiavi di licenza nei file <code>appsettings.secrets.json</code>. Ecco la tua chiave di licenza:",
    "TrialLicenseExpireMessage": "Stai utilizzando la licenza di prova e la tua licenza di prova scadrà il {0}.",
    "TryForFree": "Prova gratis",
    "TrialLicenseExpiredInfo": "Il periodo della tua licenza di prova è scaduto!",
    "CommercialNewsletterConfirmationMessage": "Accetto i <a href=\"https://commercial.abp.io/TermsConditions\">Termini e condizioni</a> e la <a href=\"https://commercial.abp.io/Privacy\">Informativa sulla privacy </a>."
  }
}