{
  "culture": "it",
  "texts": {
    "OrganizationManagement": "Gestione dell'organizzazione",
    "OrganizationList": "Elenco delle organizzazioni",
    "Volo.AbpIo.Commercial:010003": "Non sei il proprietario di questa organizzazione!",
    "OrganizationNotFoundMessage": "Nessuna organizzazione trovata!",
    "DeveloperCount": "Sviluppatori allocati/totali",
    "QuestionCount": "Domande rimanenti/totali",
    "Unlimited": "Illimitato",
    "Owners": "Proprietari",
    "Owner": "Proprietario",
    "AddMember": "Aggiungi membro",
    "AddNewOwner": "Aggiungi nuovo proprietario",
    "AddNewDeveloper": "Aggiungi nuovo sviluppatore",
    "UserName": "Nome utente",
    "Name": "Nome",
    "EmailAddress": "Indirizzo e-mail",
    "Developers": "Sviluppatori",
    "LicenseType": "Tipo di licenza",
    "Manage": "Gestire",
    "SetDefault": "Imposta come predefinito",
    "DefaultOrganization": "Predefinito",
    "StartDate": "Data d'inizio",
    "EndDate": "Data di fine",
    "Modules": "Moduli",
    "LicenseExtendMessage": "La data di fine della tua licenza è estesa a {0}",
    "LicenseUpgradeMessage": "La tua licenza è stata aggiornata a {0}",
    "LicenseExtendAdnUpgradeMessage": "La tua licenza è stata estesa fino al {0} e il tuo piano di licenza è stato aggiornato a {1}.",
    "LicenseAddDeveloperMessage": "{0} sviluppatori aggiunti alla tua licenza",
    "Volo.AbpIo.Commercial:010004": "Impossibile trovare l'utente specificato! L'utente deve essere già registrato.",
    "MyOrganizations": "Le mie organizzazioni",
    "ApiKey": "Chiave API",
    "UserNameNotFound": "Nessun utente con nome utente {0}",
    "SuccessfullyAddedToNewsletter": "Grazie per esserti iscritto alla nostra newsletter!",
    "MyProfile": "Il mio profilo",
    "EmailNotValid": "Si prega di inserire un indirizzo email valido.",
    "JoinOurMarketingNewsletter": "Iscriviti alla nostra newsletter di marketing",
    "WouldLikeToReceiveMarketingMaterials": "Vorrei ricevere materiale di marketing come offerte di prodotti e offerte speciali.",
    "StartUsingYourLicenseNow": "Inizia subito a usare la tua licenza!",
    "WelcomePage": "Pagina di benvenuto",
    "UnsubscriptionExpireEmail": "Annulla l'iscrizione alle e-mail di promemoria della data di scadenza della licenza",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Questa sottoscrizione e-mail contiene solo il promemoria della data di scadenza della licenza.",
    "UnsubscribeFromLicenseExpireEmails": "Se non desideri ricevere le e-mail sulla data di scadenza della licenza, puoi annullare l'iscrizione in qualsiasi momento lo desideri.",
    "Unsubscribe": "Annulla l'iscrizione",
    "NotOrganizationMember": "Non sei membro di nessuna organizzazione.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Iscrizione annullata con successo",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Non riceverai più email di promemoria della data di scadenza della licenza.",
    "IndexPageHeroSection": "<span class=\"first-line\"> Una completa </span><span class=\"second-line\"> piattaforma di sviluppo web </span><span class=\"third-line\"> integrata <img src=\"{0}\" width=\"110\" class=\"ml-1\" /> framework </span>",
    "AbpCommercialShortDescription": "ABP Commercial fornisce moduli applicativi predefiniti, strumenti per lo sviluppo rapido di applicazioni, temi dell'interfaccia utente professionale, supporto premium e altro ancora.",
    "LiveDemo": "Dimostrazione dal vivo",
    "LiveDemoLead": "<a href=\"{0}\">{1}</a> utilizzando il tuo account ABP, <a href=\"{2}\">{3}</a> a abp.io.<br/>O compilare il modulo sottostante per creare una demo live ora",
    "ThereIsAlreadyAnAccountWithTheGivenEmailAddress": "Esiste già un account con l'indirizzo email specificato: <b>{0}</b><br/> Puoi accedere con il tuo account per procedere.",
    "GetLicence": "Ottieni una licenza",
    "Application": "Applicazione",
    "StartupTemplates": "Modelli di avvio",
    "Startup": "Avviare",
    "Templates": "Modelli",
    "Developer": "Sviluppatore",
    "Tools": "Strumenti",
    "Premium": "Premium",
    "PremiumSupport": "Supporto Premium",
    "PremiumForumSupport": "Supporto Forum Premium",
    "UI": "Interfaccia Utente",
    "Themes": "Temi",
    "JoinOurNewsletter": "Iscriviti alla nostra newsletter",
    "Send": "Spedire",
    "WhatIsABPFramework": "COSA E` IL FRAMEWORK ABP?",
    "OpenSourceBaseFramework": "Framework di base open source",
    "ABPFrameworkExplanation": "<p class=\"lead\"> ABP Commercial si basa su ABP Framework, un framework per applicazioni web open source e guidato dalla comunità per ASP.NET Core.</p><p> ABP Framework fornisce un'eccellente infrastruttura per la scrittura gestibile ed estensibile e codice testabile con best practice.</p><p> Costruito e integrato in strumenti popolari che già conosci. Bassa curva di apprendimento, facile adattamento, sviluppo confortevole.</p>",
    "Modular": "Modulare",
    "MicroserviceCompatible": "Compatibile con microservizi",
    "DomainDrivenDesignInfrastructure": "Infrastruttura Domain Driven Design",
    "MultiTenancy": "Multi-Tenancy",
    "DistributedMessaging": "Messaggistica distribuita",
    "DynamicProxying": "Proxying dinamico",
    "BackgroundJobs": "Operazioni in background",
    "AuditLogging": "Registri di controllo",
    "BLOBStoring": "Archiviazione BLOB",
    "BundlingMinification": "Raggruppamento e minimizzazione",
    "AdvancedLocalization": "Localizzazione avanzata",
    "ManyMore": "Molti altri",
    "ExploreTheABPFramework": "Esplora il framework ABP",
    "WhyUseTheABPCommercial": "Perché utilizzare ABP Commercial?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\"> La creazione di applicazioni Web di livello aziendale può essere complessa e richiede tempo.</p><p> ABP Commercial offre l'infrastruttura di base perfetta necessaria per tutti i moderni ASP.NET Core di livello aziendale soluzioni basate. Dalla progettazione all'implementazione, l'intero ciclo di sviluppo è potenziato dalle funzionalità e dai moduli integrati di ABP.</p>",
    "StartupTemplatesShortDescription": "I modelli di avvio ti consentono di avviare rapidamente il tuo progetto in pochi secondi.",
    "UIFrameworksOptions": "Opzioni dei framework dell'interfaccia utente;",
    "DatabaseProviderOptions": "Opzioni del provider di database;",
    "PreBuiltApplicationModules": "Moduli applicativi predefiniti",
    "PreBuiltApplicationModulesShortDescription": "I requisiti delle applicazioni più comuni sono già stati sviluppati per te come moduli riutilizzabili.",
    "Account": "Account",
    "Blogging": "Blogging",
    "Identity": "Identità",
    "IdentityServer": "Identity Server",
    "Saas": "Saas",
    "LanguageManagement": "Gestione della lingua",
    "TextTemplateManagement": "Gestione dei modelli di testo",
    "See All Modules": "Vedi tutti i moduli",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "ABP Suite è uno strumento complementare all'ABP Commercial.",
    "AbpSuiteExplanation": "Ti consente di creare pagine web in pochi minuti. È uno strumento .NET Core Global che può essere installato dalla riga di comando. Può creare una nuova soluzione ABP, generare pagine CRUD dal database al front-end.",
    "Details": "Dettagli",
    "LeptonTheme": "Tema Lepton",
    "ProfessionalModernUIThemes": "Temi dell'interfaccia utente moderni e professionali",
    "LeptonThemeExplanation": "Lepton fornisce una gamma di temi di amministrazione Bootstrap che fungono da solida base per qualsiasi progetto che richieda cruscotto di amministrazione.",
    "DefaultTheme": "Tema predefinito",
    "MaterialTheme": "Tema Material",
    "Default2Theme": "Tema predefinito 2",
    "DarkTheme": "Tema scuro",
    "DarkBlueTheme": "Tema blu scuro",
    "LightTheme": "Tema chiaro",
    "ProudToWorkWith": "Orgoglioso di lavorare con",
    "OurConsumers": "Centinaia di aziende e sviluppatori in oltre 70 paesi in tutto il mondo si affidano a ABP Commercial.",
    "JoinOurConsumers": "Unisciti a loro e crea prodotti sorprendenti velocemente.",
    "AdditionalServicesExplanation": "Hai bisogno di servizi aggiuntivi o personalizzati? <strong> Noi e i nostri partner possiamo fornire; </strong>",
    "CustomProjectDevelopment": "Sviluppo di progetti personalizzati",
    "CustomProjectDevelopmentExplanation": "Sviluppatori dedicati per i tuoi progetti personalizzati.",
    "PortingExistingProjects": "Miigrazione di progetti esistenti",
    "PortingExistingProjectsExplanation": "Migrazione dei tuoi progetti legacy alla piattaforma ABP.",
    "LiveSupport": "Supporto dal vivo",
    "LiveSupportExplanation": "Opzione di supporto remoto dal vivo quando ne hai bisogno.",
    "Training": "Formazione",
    "TrainingExplanation": "Formazione dedicata per i tuoi sviluppatori.",
    "OnBoarding": "Affiancamento",
    "OnBoardingExplanation": "Aiuta a configurare i tuoi ambienti di sviluppo, CI e CD.",
    "PrioritizedTechnicalSupport": "Assistenza tecnica prioritaria",
    "PremiumSupportExplanation": "Oltre al grande supporto della comunità del framework ABP, il nostro team di supporto risponde alle domande tecniche e ai problemi degli utenti commerciali con alta priorità.",
    "SeeTheSupportOptions": "Vedi le opzioni di supporto",
    "Contact": "Contatto",
    "TellUsWhatYouNeed": "Dicci di cosa hai bisogno.",
    "YourMessage": "Il tuo messaggio",
    "YourFullName": "Il tuo nome completo",
    "FirstNameField": "Nome di battesimo",
    "LastNameField": "Cognome",
    "EmailField": "Indirizzo e-mail",
    "YourEmailAddress": "Il tuo indirizzo di posta elettronica",
    "ValidEmailAddressIsRequired": "È richiesto un indirizzo email valido.",
    "HowMayWeHelpYou": "Come possiamo aiutarti?",
    "SendMessage": "Invia messaggio",
    "Success": "Successo",
    "WeWillReplyYou": "Abbiamo ricevuto il tuo messaggio e ti contatteremo a breve.",
    "GoHome": "Torna all'inizio",
    "CreateLiveDemo": "Crea demo live",
    "CreateLiveDemoDescription": "Una volta inviato questo modulo, riceverai un'e-mail contenente il link alla tua demo.",
    "RegisterToTheNewsletter": "Registrati alla newsletter per ricevere informazioni su ABP.IO, comprese le nuove versioni ecc.",
    "EnterYourEmailOrLogin": "Inserisci il tuo indirizzo e-mail per creare la tua demo o <a href=\"{0}\"> Accedi </a> utilizzando il tuo account esistente.",
    "ApplicationTemplate": "Modello di applicazione",
    "ApplicationTemplateExplanation": "Il modello di avvio dell'applicazione viene utilizzato per creare una nuova applicazione web.",
    "EfCoreProvider": "Entity Framework (supporta SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\"> e altri </a>)",
    "AlreadyIncludedInTemplateModules": "I seguenti moduli sono già inclusi e configurati in questo modello:",
    "ApplicationTemplateArchitecture": "Questo modello di applicazione supporta anche un'architettura a più livelli in cui il livello dell'interfaccia utente, il livello API e il servizio di autenticazione sono fisicamente separati.",
    "SeeTheGuideOrGoToTheLiveDemo": "Consulta la guida per sviluppatori per informazioni tecniche su questo modello o vai alla demo live.",
    "DeveloperGuide": "Guida per sviluppatori",
    "ModuleTemplate": "Modello per modulo",
    "ModuleTemplateExplanation1": "Vuoi creare un modulo e riutilizzarlo in diverse applicazioni? Questo modello di avvio prepara tutto per iniziare a creare un <strong> modulo dell'applicazione </strong> riutilizzabile o un <strong> microservizio </strong>.",
    "ModuleTemplateExplanation2": "<p> Puoi supportare uno o più framework UI, uno o più provider di database per un singolo modulo. Il modello di avvio è configurato per eseguire e <strong> testare il modulo </strong> in un'applicazione minima oltre all'unità e all'infrastruttura di test di integrazione.</p><p> Consulta la guida per sviluppatori per informazioni tecniche su questo modello.</p>",
    "WithAllStyleOptions": "con tutte le opzioni di stile",
    "Demo": "Demo",
    "SeeAllModules": "Vedi tutti i moduli",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) è uno strumento a riga di comando per eseguire alcune operazioni comuni per soluzioni basate su ABP.",
    "ABPSuiteEasilyCURD": "ABP Suite è uno strumento che ti permette di creare facilmente pagine CRUD",
    "WeAreHereToHelp": "Siamo qui per <span class=\"zero-text\">Aiutarti</span>",
    "BrowseOrAskQuestion": "Puoi sfogliare i nostri argomenti della guida o cercare nelle domande frequenti oppure puoi farci una domanda utilizzando il <a href=\"{0}\" class=\"text-success\"> modulo di contatto </a>.",
    "SearchQuestionPlaceholder": "Cerca nelle domande frequenti",
    "WhatIsTheABPCommercial": "Cos'è ABP Commercial?",
    "WhatAreDifferencesThanAbpFramework": "Quali sono le differenze tra ABP Framework open source e ABP Commercial?",
    "AbpCommercialMetaTitle": "{0} | Commerciale ABP",
    "AbpCommercialMetaDescription": "Una piattaforma di sviluppo web completa su ABP Framework con moduli predefiniti, modelli di avvio, strumenti di sviluppo rapido, temi dell&#39;interfaccia utente professionali e supporto premium.",
    "ABPCommercialExplanation": "ABP Commercial è un insieme di moduli, strumenti, temi e servizi premium basati sul <a target=\"_blank\" href=\"{0}\"> framework ABP </a> open source. ABP Commercial è sviluppato e supportato dallo stesso team dietro il framework ABP.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p><a target=\"_blank\" href=\"{0}\"> ABP framework </a> è un framework di sviluppo di applicazioni compatibile con micro-servizi per ASP.NET Core modulare. Fornisce un'architettura completa e una solida infrastruttura per farti concentrare sul tuo codice aziendale piuttosto che ripetere te stesso per ogni nuovo progetto. Si basa sulle migliori pratiche di sviluppo software e su strumenti popolari che già conosci.</p><p> Il framework ABP è completamente gratuito, open source e guidato dalla comunità. Fornisce inoltre un tema gratuito e alcuni moduli predefiniti (ad es. Gestione delle identità e gestione dei tenant).</p>",
    "VisitTheFrameworkVSCommercialDocument": "Visita il seguente link, per ulteriori informazioni <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial aggiunge i seguenti vantaggi al framework ABP;",
    "Professional": "Professionale",
    "UIThemes": "Temi dell'interfaccia utente",
    "EnterpriseModules": "Pronto per le imprese, <a href=\"{0}\"> moduli applicativi </a> preconfigurati, ricchi di funzionalità (ad es. Gestione di Identity Server, gestione SaaS, gestione della lingua)",
    "ToolingToSupport": "Strumenti per supportare la produttività dello sviluppo (ad es.<a href=\"{0}\"> ABP Suite </a>)",
    "PremiumSupportLink": "<a href=\"{0}\" target=\"_blank\">Supporto </a> Premium",
    "WhatDoIDownloadABPCommercial": "Cosa devo scaricare quando acquisto ABP Commercial?",
    "CreateUnlimitedSolutions": "Dopo aver acquistato una licenza commerciale ABP, sarai in grado di creare soluzioni illimitate come descritto nel documento <a href=\"{0}\"> Guida introduttiva </a>.",
    "ABPCommercialSolutionExplanation": "Quando crei una nuova applicazione, ottieni una soluzione Visual Studio (un modello di avvio) in base alle tue preferenze. La soluzione scaricata ha moduli e temi commerciali già installati e configurati per te. Puoi rimuovere un modulo preinstallato o aggiungere un altro modulo, se lo desideri. Tutti i moduli e temi vengono usati come pacchetti NuGet/NPM per impostazione predefinita.",
    "StartDevelopWithTutorials": "La soluzione scaricata è ben progettata e documentata. Puoi iniziare a sviluppare il tuo codice aziendale basato su di esso seguendo <a href=\"{0}\"> i tutorial </a>",
    "TryTheCommercialDemo": "Puoi provare <a href=\"{0}\"> la demo </a> per vedere un'applicazione di esempio creata utilizzando il modello di avvio di ABP Commercial.",
    "HowManyProducts": "Quanti prodotti/soluzioni differenti posso costruire utilizzando ABP Commercial?",
    "HowManyProductsExplanation": "Non ci sono limiti per creare un progetto ABP. Puoi creare tutti i progetti che desideri, svilupparli e caricarli su server diversi.",
    "HowManyDevelopers": "Quanti sviluppatori possono lavorare su ABP Commercial?",
    "HowManyDevelopersExplanation": "Le licenze commerciali ABP sono per sviluppatore. Diversi tipi di licenza hanno diversi limiti per sviluppatori. Tuttavia, puoi aggiungere più sviluppatori a qualsiasi tipo di licenza ogni volta che ne hai bisogno. Consulta la pagina dei <a href=\"{0}\"> prezzi </a> per i tipi di licenza, i limiti per gli sviluppatori e i costi aggiuntivi per gli sviluppatori.",
    "ChangingLicenseType": "Posso cambiare il mio tipo di licenza in futuro?",
    "ChangingLicenseTypeExplanation": "Puoi sempre aggiungere nuovi sviluppatori con lo stesso tipo di licenza. Vedi anche \"Quanti sviluppatori possono lavorare su ABP Commercial?\". Puoi anche passare a una licenza superiore pagando la differenza di prezzo calcolata. Quando esegui l'aggiornamento a un piano di licenza superiore, ottieni i vantaggi del nuovo piano, ma l'aggiornamento della licenza non modifica la data di scadenza della licenza.",
    "LicenseExtendUpgradeDiff": "Qual è la differenza tra estensione della licenza e aggiornamento?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Estensione:</strong> estendendo/rinnovando la licenza, continuerai a ricevere il supporto premium e aggiornamenti maggiori o minori per moduli e temi. Inoltre, potrai continuare a creare nuovi progetti. E potrai comunque utilizzare ABP Suite, che accelera il tuo sviluppo. Quando estendi la licenza, viene aggiunto 1 anno alla data di scadenza della licenza.<hr/> <strong>Aggiornamento:</strong> aggiornando la tua licenza, verrai promosso a un piano di licenza superiore, che ti consentirà di ottenere ulteriori vantaggi. Controlla la <a href=\"/pricing\">tabella di confronto delle licenze</a> per vedere le differenze tra i piani di licenza. <strong>D&#39;altra parte, quando esegui l&#39;aggiornamento, la data di scadenza della licenza non cambierà!</strong> Per estendere la data di fine della licenza, è necessario estendere la licenza.",
    "LicenseRenewalCost": "Qual è il costo del rinnovo della licenza dopo 1 anno?",
    "LicenseRenewalCostExplanation": "Il prezzo di rinnovo (estensione) della Licenza Team standard è ${0}, la Licenza Business standard è ${1} e la Licenza Enterprise standard è ${2}. Se sei già un cliente, <a href='{3}' target='_blank'>accedi al tuo account</a> per rivedere i prezzi di rinnovo disponibili.",
    "HowDoIRenewMyLicense": "Come rinnovo la mia licenza?",
    "HowDoIRenewMyLicenseExplanation": "Puoi rinnovare la licenza accedendo alla <a href='{0}' target='_blank'> pagina di gestione dell'organizzazione </a>. Per poter usufruire delle nostre tariffe scontate di rinnovo anticipato, assicurati di rinnovare prima della scadenza della licenza. Tuttavia, non preoccuparti di non sapere quando si chiude la tua opportunità di rinnovo anticipato. Riceverai 2 e-mail di promemoria prima della scadenza dell'abbonamento. Li invieremo a 30 giorni, 7 giorni prima della scadenza.",
    "IsSourceCodeIncluded": "La mia licenza include il codice sorgente dei moduli e dei temi commerciali?",
    "IsSourceCodeIncludedExplanation1": "Dipende dal tipo di licenza che hai acquistato:",
    "IsSourceCodeIncludedExplanation2": "<strong> Team </strong>: la soluzione utilizza i moduli e i temi come pacchetti NuGet e NPM. Non include il loro codice sorgente. In questo modo, puoi aggiornare facilmente questi moduli e temi ogni volta che è disponibile una nuova versione. Tuttavia, non è possibile ottenere il codice sorgente dei moduli e dei temi.",
    "IsSourceCodeIncludedExplanation3": "<strong> Business/Enterprise </strong>: in aggiunta alla licenza Team, puoi scaricare il codice sorgente di qualsiasi modulo o tema di cui hai bisogno. È anche possibile rimuovere i riferimenti al pacchetto NuGet/NPM per un particolare modulo e aggiungere il relativo codice sorgente direttamente alla soluzione per modificarlo completamente.",
    "IsSourceCodeIncludedExplanation4": "<p> Includere il codice sorgente di un modulo nella tua soluzione ti dà la massima libertà di personalizzare quel modulo. Tuttavia, non sarà possibile aggiornare automaticamente il modulo quando viene rilasciata una nuova versione.</p><p> Nessuna delle licenze include il codice sorgente di ABP Suite, che è uno strumento esterno che genera codice per te e assiste al tuo sviluppo.</p><p> Vedi <a href=\"{0}\"> la pagina dei prezzi </a> per altre differenze tra i tipi di licenza.</p>",
    "ChangingDevelopers": "Posso cambiare gli sviluppatori registrati della mia organizzazione in futuro?",
    "ChangingDevelopersExplanation": "Oltre ad aggiungere nuovi sviluppatori alla tua licenza, puoi anche Modifica gli sviluppatori esistenti (puoi rimuovere uno sviluppatore e aggiungerne uno nuovo alla stessa postazione) senza alcun costo aggiuntivo.",
    "WhatHappensWhenLicenseEnds": "Cosa succede quando termina il periodo di licenza?",
    "WhatHappensWhenLicenseEndsExplanation1": "La licenza commerciale ABP è una <a href=\"{0}\" target=\"_blank\">licenza perpetua</a>. Dopo la scadenza della licenza, potete continuare a sviluppare il vostro progetto. Non siete obbligati a rinnovare la licenza. La licenza viene fornita con un piano di aggiornamento e supporto di un anno. Per continuare a ottenere nuove funzionalità, miglioramenti delle prestazioni, correzioni di bug, supporto e continuare a utilizzare ABP Suite, è necessario rinnovare la licenza. Quando la licenza scade;",
    "WhatHappensWhenLicenseEndsExplanation2": "Non è possibile creare nuove soluzioni utilizzando ABP Commercial, ma è possibile continuare a sviluppare le applicazioni esistenti per sempre.",
    "WhatHappensWhenLicenseEndsExplanation3": "Sarà possibile ottenere gli aggiornamenti per i moduli e i temi della propria versione MINOR (ad eccezione delle versioni RC o Preview). Ad esempio, se si utilizza la versione 3.2.0 di un modulo, è ancora possibile ottenere gli aggiornamenti per la versione 3.2.x (v3.2.1, v3.2.5... ecc.) di quel modulo. Ma non è possibile ottenere aggiornamenti per la versione maggiore o minore successiva (come v3.3.0, v3.3.3, 4.x.x... ecc.). Ad esempio, quando la vostra licenza è scaduta, l'ultima release era la v4.4.3 e in seguito sono state pubblicate sia la versione 4.4.4 che la versione 4.5.0, sarete in grado di accedere alla v4.4.X ma non alla v4.5.X.",
    "WhatHappensWhenLicenseEndsExplanation4": "Non è possibile installare nuovi moduli e temi aggiunti alla piattaforma ABP Commercial dopo la scadenza della licenza.",
    "WhatHappensWhenLicenseEndsExplanation5": "Non è possibile utilizzare la suite ABP.",
    "WhatHappensWhenLicenseEndsExplanation6": "Non è più possibile ottenere il <a href=\"{0}\">supporto premium</a>.",
    "WhatHappensWhenLicenseEndsExplanation7": "Puoi estendere (rinnovare) la tua licenza se desideri continuare a ottenere questi vantaggi. Se estendi la licenza entro <strong>{3} giorni</strong> dalla scadenza della licenza, verranno applicati i seguenti sconti: Licenza Team {0}; Licenza commerciale {1}; Licenza aziendale {2}.",
    "discountForYears": "{0}% di sconto per {1} anno/i",
    "WhatHappensWhenLicenseEndsExplanation8": "I progetti ABP che hai generato non vengono archiviati sui nostri server. Pertanto, è tua responsabilità conservare il codice sorgente scaricato. Quando la licenza scade, non è possibile ottenere il codice sorgente del progetto ABP generato.",
    "WhenShouldIRenewMyLicense": "Quando devo rinnovare la mia licenza?",
    "WhenShouldIRenewMyLicenseExplanation": "Se rinnovi la licenza entro <strong>{3} giorni</strong> dopo la scadenza della licenza, verranno applicati i seguenti sconti: Licenza Team {0} ; Licenza Business {1} ; Licenza Enterprise {2} . Se rinnovi la licenza <strong>{3} giorni</strong> dopo la data di scadenza della licenza, il prezzo di rinnovo sarà lo stesso del prezzo di acquisto della licenza e non ci saranno sconti sul rinnovo.",
    "TrialPlan": "Hai un piano di prova?",
    "TrialPlanExplanation": "Sì, per iniziare la prova gratuita, contatta <a href=\"mailto:marketing@volosoft.com?subject=ABP Commercial — Trial License Request\">marketing@volosoft.com</a> . Offriamo anche una garanzia di rimborso di 30 giorni per la licenza Team, senza fare domande! È possibile richiedere un rimborso completo entro i primi 30 giorni dall&#39;acquisto della licenza. Forniamo un rimborso del 60% entro 30 giorni per le licenze Business ed Enterprise. Questo perché le licenze Business ed Enterprise contengono il codice sorgente completo di tutti i moduli e temi.",
    "DoYouAcceptBankWireTransfer": "Accettate bonifici bancari?",
    "DoYouAcceptBankWireTransferExplanation": "Sì, accettiamo bonifico bancario.<br />Dopo aver inviato il canone tramite bonifico bancario, inviaci un'e-mail a accounting@abp.io con la ricevuta e il tipo di licenza richiesta. Le nostre informazioni sul conto bancario internazionale:",
    "HowToUpgrade": "Come aggiornare le applicazioni esistenti quando è disponibile una nuova versione?",
    "HowToUpgradeExplanation1": "Quando crei una nuova applicazione utilizzando ABP Commercial, tutti i moduli e il tema vengono utilizzati come pacchetti NuGet e NPM. Quindi, puoi facilmente aggiornare i pacchetti quando è disponibile una nuova versione.",
    "HowToUpgradeExplanation2": "Oltre agli aggiornamenti NuGet/NPM standard, <a href=\"{0}\"> ABP CLI </a> fornisce un comando di aggiornamento che trova e aggiorna automaticamente tutti i pacchetti relativi a ABP nella soluzione.",
    "DatabaseSupport": "Quali sistemi di database sono supportati?",
    "DatabaseSupportExplanation": "Lo stesso ABP Framework è indipendente dal database e può funzionare con qualsiasi provider di database per sua natura. Consulta il <a href=\"{0}\" target=\"_blank\"> documento di accesso ai dati </a> per un elenco dei fornitori attualmente implementati.",
    "UISupport": "Quali framework dell'interfaccia utente sono supportati?",
    "Supported": "Supportato",
    "UISupportExplanation": "Lo stesso ABP Framework è indipendente dal framework dell'interfaccia utente e può funzionare con qualsiasi framework dell'interfaccia utente. Tuttavia, i modelli di avvio, le interfacce utente dei moduli e i temi non sono stati implementati per tutti i framework dell'interfaccia utente. Consulta il <a href=\"{0}\"> documento introduttivo </a> per l'elenco aggiornato delle opzioni dell'interfaccia utente.",
    "MicroserviceSupport": "Supporta l'architettura dei micro-servizi?",
    "MicroserviceSupportExplanation1": "Uno degli obiettivi principali del framework ABP è fornire un'infrastruttura conveniente per creare soluzioni di micro-servizi. Consulta il documento sull '<a href=\"{0}\"> architettura dei micro-servizi </a> per capire come aiuta a creare sistemi di micro-servizi.",
    "MicroserviceSupportExplanation2": "Tutti i moduli ABP Commercial sono progettati per supportare scenari di distribuzione di micro-servizi (con la propria API e database) seguendo il documento <a href=\"{0}\"> best practice per lo sviluppo di moduli </a>.",
    "MicroserviceSupportExplanation3": "Forniamo una <a href=\"{0}\"> soluzione demo di micro-servizi </a> di esempio che dimostra l'implementazione di un'architettura di micro-servizi per aiutarti a creare la tua soluzione.",
    "MicroserviceSupportExplanation4": "Quindi, la risposta breve è \"<strong> sì, supporta l'architettura di micro-servizi </strong>\".",
    "MicroserviceSupportExplanation5": "Tuttavia, un sistema di micro-servizi è una soluzione e ogni soluzione avrà requisiti diversi, topologia di rete, scenari di comunicazione, possibilità di autenticazione, decisioni di separazione/condivisione del database, configurazioni di runtime, integrazioni di sistemi di terze parti e molto altro.",
    "MicroserviceSupportExplanation6": "L'ABP Framework e l'ABP Commercial forniscono un'infrastruttura per scenari di micro-servizi, moduli compatibili con micro-servizi, esempi e documentazione per aiutarti a creare la tua soluzione. Ma non aspettarti di scaricare direttamente la soluzione dei tuoi sogni precostruita per te. Dovrai capirlo e riunire alcune parti in base alle tue esigenze.",
    "WhereCanIDownloadSourceCode": "Dove posso scaricare il codice sorgente?",
    "WhereCanIDownloadSourceCodeExplanation": "È possibile scaricare il codice sorgente di tutti i moduli ABP, pacchetti e temi Angular tramite ABP Suite o ABP CLI. Vedi <a href=\"{0}\"> Come scaricare il codice sorgente? </a>",
    "ComputerLimitation": "Quanti computer può accedere uno sviluppatore durante lo sviluppo di ABP?",
    "ComputerLimitationExplanation": "Autorizziamo specificamente <strong> {0} computer </strong> per singolo sviluppatore/con licenza. Ogni volta che è necessario che uno sviluppatore sviluppi prodotti ABP Commercial su una terza macchina, deve essere inviata un'e-mail a license@abp.io spiegando la situazione e quindi effettueremo l'allocazione appropriata nel nostro sistema.",
    "RefundPolicy": "Hai una politica di rimborso?",
    "RefundPolicyExplanation": "Puoi richiedere un rimborso entro <strong> 30 giorni </strong> dall'acquisto della licenza. I tipi di licenza Business ed Enterprise hanno l'opzione di download del codice sorgente, pertanto i rimborsi non sono disponibili per Business ed Enterprise (e qualsiasi licenza che includa il diritto di ricevere il codice sorgente). Inoltre, non vengono effettuati rimborsi per rinnovi e acquisti di seconde licenze.",
    "HowCanIRefundVat": "Come posso rimborsare l'IVA?",
    "HowCanIRefundVatExplanation1": "Se hai effettuato il pagamento utilizzando 2Checkout, puoi rimborsare l'IVA tramite il tuo account 2Checkout:",
    "HowCanIRefundVatExplanation2": "Accedi al tuo account <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\"> 2Checkout </a>",
    "HowCanIRefundVatExplanation3": "Trova l'ordine appropriato e premi \"Rimborsa IVA tardiva\" (inserisci il tuo numero di partita IVA)",
    "HowCanIGetMyInvoice": "Come posso ricevere la mia fattura?",
    "HowCanIGetMyInvoiceExplanation": "Esistono 2 gateway di pagamento per l'acquisto di una licenza: PayU e 2Checkout. Se acquisti la tua licenza tramite il gateway 2Checkout, invia la fattura in PDF al tuo indirizzo e-mail, vedi <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How-do-invoices-work\"> Fatturazione 2Checkout.</a> Se acquisti tramite il gateway PayU o tramite bonifico bancario, prepareremo e invieremo la tua fattura. Puoi richiedere la fattura dalla <a href=\"{0}\"> pagina di gestione dell'organizzazione.</a>",
    "Forum": "Forum",
    "SupportExplanation": "Le licenze commerciali di ABP forniscono un supporto forum premium da parte di un team composto dagli esperti di ABP Framework.",
    "PrivateTicket": "Ticket privato",
    "PrivateTicketExplanation": "Enterprise License include anche un supporto privato con e-mail e sistema di ticket.",
    "AbpSuiteExplanation1": "ABP Suite ti consente di creare pagine web in pochi minuti. È uno strumento .NET Core Global che può essere installato dalla riga di comando.",
    "AbpSuiteExplanation2": "Può creare una nuova soluzione ABP, generare pagine CRUD dal database al front-end. Per una panoramica tecnica, vedere <a href=\"{0}\"> il documento </a>",
    "FastEasy": "Veloce e facile",
    "AbpSuiteExplanation3": "ABP Suite ti consente di creare facilmente pagine CRUD. Devi solo definire la tua entità e le sue proprietà, lascia che il resto sia ABP Suite per te! ABP Suite genera tutto il codice necessario per la tua pagina CRUD in pochi secondi. Supporta le interfacce utente Angular, MVC e Blazor.",
    "RichOptions": "Opzioni ricche",
    "AbpSuiteExplanation4": "ABP Suite supporta più opzioni dell'interfaccia utente come <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\"> Razor Pages </a> e <a href=\"https://angular.io\">Angular </a>. Supporta anche più database come <a href=\"https://www.mongodb.com\"> MongoDB </a> e tutti i database supportati da <strong> EntityFramework Core </strong> (MS SQL Server, Oracle, MySql, PostgreSQL e <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\"> altro </a>).",
    "AbpSuiteExplanation5": "La cosa buona è che non devi preoccuparti di quelle opzioni. ABP Suite comprende il tipo di progetto e genera il codice per il progetto e inserisce il codice generato nella posizione corretta nel progetto.",
    "SourceCode": "Codice sorgente",
    "AbpSuiteExplanation6": "ABP Suite genera il codice sorgente per te! Non genera file magici per generare la pagina web. ABP Suite genera il codice sorgente per <strong> Entity, Repository, Application Service, Code First Migration, JavaScript/TypeScript e CSHTML/HTML </strong> e anche le interfacce necessarie. ABP Suite genera anche il codice in base alle <strong> Best Practices </strong> di sviluppo software, quindi non devi preoccuparti della qualità del codice generato.",
    "AbpSuiteExplanation7": "Dal momento che hai il codice sorgente dei blocchi costitutivi della pagina CRUD generata nei livelli di applicazione corretti, puoi facilmente Modifica il codice sorgente e inserire la tua logica personalizzata/aziendale nel codice generato.",
    "CrossPlatform": "Piattaforma multipla",
    "AbpSuiteExplanation8": "ABP Suite è costruito con .NET Core ed è multipiattaforma. E` un'applicazione web sul tuo computer locale. Puoi eseguirlo su <strong>Windows</strong>, <strong> Mac </strong> e <strong>Linux</strong>",
    "OtherFeatures": "Altre Funzionalità",
    "OtherFeatures1": "Aggiorna facilmente i pacchetti <strong>NuGet</strong> e <strong>NPM</strong> sulla tua soluzione.",
    "OtherFeatures2": "Rigenera le pagine già generate da zero.",
    "OtherFeatures3": "Crea nuove soluzioni",
    "ThanksForCreatingProject": "Grazie per aver creato il tuo progetto!",
    "HotToRunSolution": "Come eseguire la tua soluzione?",
    "HotToRunSolutionExplanation": "Vedere il documento introduttivo per apprendere come configurare ed eseguire la soluzione.",
    "GettingStarted": "Iniziare",
    "WebAppDevTutorial": "Tutorial per sviluppatori di App Web",
    "WebAppDevTutorialExplanation": "Vedere il documento tutorial sullo sviluppo di applicazioni Web per un esempio di sviluppo passo passo.",
    "Document": "Documento",
    "UsingABPSuiteToCURD": "Utilizzo di ABP Suite per la generazione di pagine CRUD e gli strumenti",
    "SeeABPSuiteDocument": "Vedere il documento ABP Suite per apprendere l'utilizzo di ABP Suite.",
    "AskQuestionsOnSupport": "Puoi porre domande sul supporto commerciale ABP.",
    "Documentation": "Documentazione",
    "SeeModulesDocument": "Vedere il documento dei moduli per un elenco di tutti i moduli commerciali(pro) e dei relativi documenti.",
    "Pricing": "Prezzi",
    "PricingExplanation": "Scegli le Funzionalità e le funzionalità di cui la tua azienda ha bisogno oggi. Esegui facilmente l'upgrade man mano che la tua attività cresce.",
    "Team": "Team",
    "Business": "Business",
    "Enterprise": "Enterprise",
    "Custom": "Personalizzato",
    "IncludedDeveloperLicenses": "Licenze per sviluppatori incluse",
    "CustomLicenceOrAdditionalServices": "Hai bisogno di una licenza personalizzata o di servizi aggiuntivi?",
    "CustomOrVolumeLicense": "Licenza personalizzata o multilicenza",
    "LiveTrainingSupport": "Formazione e supporto dal vivo",
    "AndMore": "e altro ancora",
    "AdditionalDeveloperLicense": "Licenza aggiuntiva per sviluppatori",
    "ProjectCount": "Conteggio del progetto",
    "AllProModules": "Tutti i moduli professionali",
    "AllProThemes": "Tutti i temi professionali",
    "AllProStartupTemplates": "Tutti i modelli di avvio professionali",
    "SourceCodeOfAllModules": "Codice sorgente di tutti i moduli",
    "SourceCodeOfAllThemes": "Codice sorgente di tutti i temi",
    "PerpetualLicense": "Licenza perpetua",
    "UnlimitedServerDeployment": "Distribuzione illimitata del server",
    "YearUpgrade": "1 anno di aggiornamento",
    "YearPremiumForumSupport": "1 anno di supporto forum premium",
    "ForumSupportIncidentCountYear": "Conteggio delle richieste di supporto del forum/anno",
    "PrivateTicketEmailSupport": "Ticket privato e supporto via e-mail",
    "BuyNow": "Acquista ora",
    "PayViaAmexCard": "Come posso pagare tramite la mia carta AMEX?",
    "PayViaAmexCardDescription": "Il gateway di pagamento predefinito \"Iyzico\" potrebbe rifiutare alcune carte di credito AMEX a causa delle misure di sicurezza. In questo caso, puoi pagare tramite il gateway di pagamento alternativo \"2Checkout\".",
    "ThankYou": "Grazie",
    "InvalidReCaptchaErrorMessage": "Si è verificato un errore durante la verifica di reCAPTCHA. Per favore riprova.",
    "CompanyName": "Nome Azienda",
    "YourCompanyName": "Il nome della tua azienda",
    "FirstName": "Nome",
    "LastName": "Cognome",
    "Optional": "Facoltativo",
    "YourFirstName": "Il tuo nome",
    "YourLastName": "Il tuo cognome",
    "SpecialOffer": "Offerta Speciale",
    "SpecialOfferMessage": "Fai presto! I prezzi sono validi per un periodo limitato.",
    "DiscountRequest": "Richiesta Sconto",
    "DiscountRequestDescribeCustomerQuestion": "Quale delle seguenti ti descrive?",
    "DiscountRequestStudentEmailMessage": "L'indirizzo email deve contenere 'edu'.",
    "DiscountRequestDeveloperCount": "Quanti sviluppatori ci sono?",
    "DiscountRequestDeveloperCountExceedMessage": "Non concediamo sconti per le aziende con più di {0} sviluppatori.",
    "DiscountRequestOrganizationName": "Nome Azienda/Organizzazione/Istituto Scolastico",
    "Website": "Sito web",
    "GithubUsername": "Nome utente GitHub",
    "PhoneNumber": "Numero Telefono",
    "Country": "Nazione",
    "DescribeABPCommercialUsage": "Descrivi il progetto che stai pianificando di sviluppare su ABP Commercial",
    "DiscountRequestCertifyInformationMessage": "Dichiaro che tutte le informazioni fornite corrispondono al vero e sono corrette",
    "DiscountRequestReceived": "Abbiamo ricevuto la tua richiesta di sconto.",
    "DiscountRequestStatusMessage": "Risponderemo dopo aver verificato le informazioni fornite.",
    "MVCOrRazorPages": "MVC (Razor Pages)",
    "Angular": "Angular",
    "Blazor": "Blazor",
    "New": "Nuovo",
    "MongoDB": "MongoDB",
    "EBookDDD": "E-Book Domain Driven Design",
    "PracticalGuideForImplementingDDD": "Questo libro è una guida pratica per implementare il Domain Driven Design con ABP Framework.",
    "IntroducingDDD": "Introduzione al Domain Driven Design",
    "DDDLayersAndCleanArchitecture": "DDD Strati e Architettura Pulita",
    "LayeringOfADotnetSolution": "Stratificazione di una Soluzione .NET",
    "ImplementingDDDBuildingBlocks": "Implementazione delle Fondamenta del DDD",
    "DomainVsApplicationLogic": "Logica di Dominio contro Logica Applicazione",
    "SamplesAndDiscussions": "Esempi e Discussioni",
    "Free": "Gratuito",
    "Download": "Download",
    "DDDEBook": "DDD E-book",
    "ImplementingDDD": "Implementazione Domain Driven Design",
    "DDDBookExplanation": "Una guida pratica per implementare il Domain Driven Design con ABP Framework.",
    "Overview": "Panoramica",
    "DDDBookPracticalGuide": "Questa a una guida pratica per implementare Domain Driven Design (DDD). Mentre i dettagli per l'implementazione sono basati sull'infrastruttura di ABP Framework, i concetti base, principi e modelli possono essere applicati a qualsiasi soluzione, anche se non è una soluzione .NET.",
    "TableOfContents": "Sommario",
    "IntroductionToImplementingDDD": "Introduzione all'Implementazione Domain Driven Design",
    "WhatIsDDD": "Cos'è il Domain Driven Design?",
    "Implementation": "Implementazione",
    "TheBigPicture": "Il Quadro Generale",
    "TheBuildingBlock": "Le Fondamenta",
    "ExampleUseCase": "Esempio d'uso",
    "DomainAndApplicationLogic": "Logica di Dominio e Logica Applicazione",
    "Author": "Autore",
    "PublishedOn": "Pubblicato il",
    "Page": "Pagina",
    "FreeEBook": "E-Book Gratuito",
    "EBookSignInForDownload": "Accedi per scaricare l'e-book",
    "SignIn": "Accedi",
    "Or": "O",
    "TellUsAboutYourself": "Dicci qualcosa di te",
    "Surname": "Cognome",
    "DoYouAgreePrivacyPolicy": "Acconsento ai <a href=\"/TermsConditions\">Termini e Condizioni<a/> ed alla <a href=\"/Privacy\">Politica Privacy</a>.",
    "VolosoftMarketingInformationMessage": "Vorrei informazioni, suggerimenti e offerte sulle Soluzioni per Aziende e Organizzazioni e altri prodotti e servizi Volosoft",
    "VolosoftSharingInformationMessage": "Vorrei che Volosoft condividesse le mie informazioni con partner selezionati in modo da poter ricevere informazioni rilevanti sui loro prodotti e servizi",
    "WeWillSendYouADownloadLink": "Un link per scaricare il libro e-book è stato spedito a {0}.<br/> Controlla nella posta in arrivo/indesiderata/spam!",
    "InvalidFormInputs": "Per favore, digita le informazioni valide specificate nel modulo",
    "DDDBookEmailBody": "Grazie. <br /> Per scaricare il tuo libro, <a href=\"{0}\">clicca qui</a>.",
    "StartFree": "Inizia gratuitamente",
    "FreeTrial": "Prova Gratuita",
    "AcceptsMarketingCommunications": "Si desidero ricevere comunicazioni marketing riguardanti ABP Commercial",
    "PurposeOfUsage": "Proposta di utilizzo",
    "Choose": "- Scegli -",
    "CompanyOrganizationName": "Azienda/Nome organizzazione",
    "CompanySize": "Dimensioni Azienda",
    "Next": "Prossimo",
    "StartTrial": "Inizia la mia prova gratuita",
    "ContactUsQuestions": "Contattaci se hai domande",
    "TrialActivatedWarning": "Un utente ha diritto a un solo periodo di prova gratuito. Hai già utilizzato il periodo di prova.",
    "ActivationRequirement": "Ti manca solo un passo per iniziare la prova.<br> Dopo aver controllato le tue informazioni, attiveremo la tua licenza. Una volta attivata la licenza, invieremo un&#39;e-mail a <b>{0}</b> . Non preoccuparti, questo processo non richiederà molto tempo!",
    "SaveAndDownload": "Salva e Scarica",
    "CompanyNameValidationMessage": "Il nome dell'azienda è troppo lungo!",
    "AddressValidationMessage": "L'indirizzo è troppo lungo!",
    "TaxNoValidationMessage": "TAX/VAT (IVA) è troppo lungo!",
    "NotesValidationMessage": "Il campo note è troppo lungo!",
    "CheckYourBillingInfo": "Puoi creare una fattura solo una volta! Controlla i tuoi dati di fatturazione prima di creare una fattura.",
    "StartYourFreeTrial": "Inizia la tua prova gratuita",
    "TrialLicenseModelInvalidErrorMessage": "Uno dei seguenti campi non è valido: nome del paese, dimensione dell'azienda, settore o scopo di utilizzo.",
    "Trial": "Processo",
    "Purchased": "Acquistato",
    "PurchaseNow": "Acquista adesso",
    "PurchaseTrialLicenseMessage": "La data di scadenza della tua licenza è {0}. <br> Se desideri continuare a utilizzare i progetti che hai creato durante il periodo di prova gratuito, devi modificare le chiavi di licenza nei file <code>appsettings.secrets.json</code>. Ecco la tua chiave di licenza:",
    "TrialLicenseExpireMessage": "Stai utilizzando la licenza di prova e la tua licenza di prova scadrà il {0}.",
    "TryForFree": "Prova gratis",
    "TrialLicenseExpiredInfo": "Il periodo della tua licenza di prova è scaduto!",
    "DowngradeLicensePlan": "Posso passare a un piano di licenza inferiore in futuro?",
    "DowngradeLicensePlanExplanation": "Non è possibile effettuare il downgrade del piano di licenza esistente. È però possibile acquistare un nuovo piano di licenza inferiore e continuare lo sviluppo con la nuova licenza. Dopo aver acquistato una licenza inferiore, è sufficiente effettuare il login al nuovo piano di licenza tramite il comando ABP CLI: abp login <nome utente> -o <organizzazione> `.",
    "LicenseTransfer": "È possibile trasferire una licenza da uno sviluppatore a un altro?",
    "LicenseTransferExplanation": "Sì! Quando si acquista una licenza, si diventa il titolare della licenza e quindi si ha accesso alla pagina di gestione dell'organizzazione. Un'organizzazione ha ruoli di proprietario e di sviluppatore. I proprietari possono gestire i posti di sviluppatore e assegnare gli sviluppatori. Ogni sviluppatore assegnato accederà al sistema tramite il comando ABP CLI e avrà i permessi di sviluppo e di assistenza.",
    "UserOwnerDescription": "Il &quot;Proprietario&quot; dell&#39;organizzazione è l&#39;amministratore di questo account. Gestisce l&#39;organizzazione acquistando licenze e assegnando sviluppatori. Un &quot;Proprietario&quot; non può scrivere codice nei progetti commerciali ABP, non può scaricare i progetti di esempio ABP e non può porre domande sul sito Web di supporto. Se vuoi fare tutto questo, devi aggiungerti anche come sviluppatore.",
    "UserDeveloperDescription": "Gli &quot;sviluppatori&quot; possono scrivere codice nei progetti commerciali ABP, scaricare i progetti di esempio ABP e porre domande sul sito Web di supporto. D&#39;altra parte, gli &quot;Sviluppatori&quot; non possono gestire questa organizzazione.",
    "RemoveCurrentUserFromOrganizationWarningMessage": "Ti stai rimuovendo dalla tua stessa organizzazione. Non potrai più gestire questa organizzazione, confermi?",
    "RenewExistingOrganizationOrCreateNewOneMessage": "Puoi rinnovare la licenza della tua/e organizzazione/i facendo clic sui pulsanti &quot;Estendi ora&quot; di seguito e quindi estendere la data di scadenza della licenza di 1 anno. Se continui a effettuare il checkout, avrai una nuova organizzazione. Vuoi continuare con una nuova organizzazione?",
    "PurchaseTrialOrganizationOrCreateNewOneMessage": "Hai una licenza di prova. Per acquistare la licenza di prova, fai clic sul pulsante Acquista ora. Se continui a effettuare il checkout, avrai una nuova organizzazione. Vuoi continuare con una nuova organizzazione?",
    "ExtendNow": "Estendi ora",
    "CreateNewOrganization": "Crea una nuova organizzazione",
    "RenewLicenseEarly": "Se rinnovo la mia licenza in anticipo, avrò l'intero anno?",
    "RenewLicenseEarylExplanation": "Quando si rinnova la licenza prima della data di scadenza, viene aggiunto 1 anno alla data di scadenza della licenza. Ad esempio, se la licenza scade il {0}-06-06 e viene rinnovata il {0}-01-01, la nuova data di scadenza della licenza sarà {1}-06-06.",
    "OpenSourceWebApplication": "Applicazione web open source",
    "CompleteWebDevelopment": "Uno sviluppo web completo",
    "ABPFrameworkDescription": "ABP Framework è un&#39;infrastruttura completa per creare applicazioni web moderne seguendo le migliori pratiche e convenzioni di sviluppo software.",
    "CommunityDescription": "Condividi le tue esperienze con il Framework ABP!",
    "GetStarted": "Iniziare",
    "Views": "visualizzazioni",
    "LatestPosts": "ultimi post",
    "PreBuiltApplication": "Applicazione precostruita",
    "DatabaseProviders": "Fornitori di banche dati",
    "UIFrameworks": "Framework dell&#39;interfaccia utente",
    "UsefulLinks": "link utili",
    "Platform": "piattaforma",
    "CoolestCompaniesUseABPCommercial": "Le aziende più interessanti utilizzano già <span class=\"fw-bold\">ABP Commercial.</span>",
    "UserInterface": "Interfaccia utente",
    "APIGateway": "Gateway API",
    "Microservice": "Microservizio",
    "Database": "Banca dati",
    "Architecture": "Architettura",
    "MicroserviceArchitectureExplanation": "Si tratta di un&#39;architettura di soluzione completa composta da più applicazioni, gateway API, microservizi e database per creare una soluzione di microservizi scalabile con le tecnologie più recenti.",
    "BusinessLogic": "Logica di business",
    "DataAccessLayer": "Livello di accesso ai dati",
    "Monolith": "Monolito",
    "ModularArchitectureExplanation": "Questo modello di avvio fornisce un&#39;architettura di soluzione a più livelli, modulare e basata su DDD per creare una base di codice pulita e gestibile.",
    "SeeDetails": "Guarda i detagli",
    "SeeDocumentation": "Consulta la documentazione",
    "Bs5Compatible": "Tema professionale compatibile con Bootstrap 5, perfetto per il tuo sito Web di amministrazione.",
    "LeptonXTheme": "Tema LeptonX",
    "LeptonXDark": "LeptonX scuro",
    "LeptonXLight": "Luce LeptonX",
    "LeptonXSemiDark": "LeptonX semi-scuro",
    "BuiltOnBs5Library": "Costruito sulla libreria Bootstrap 5",
    "FullyCompatibleWithBs5": "Compatibile al 100% con la struttura HTML Bootstrap 5 e le classi CSS",
    "ResponsiveAndMobileCompatible": "Supporto RTL reattivo, compatibile con dispositivi mobili",
    "ProvidesStylesForDatatables": "Fornisce stili per Datatables",
    "MultipleLayoutOptions": "Molteplici opzioni di layout",
    "EasilyInstallAndUpgrade": "Installa e aggiorna facilmente",
    "SupportForum": "Forum di assistenza",
    "TrustedBy": "Affidabile da",
    "OurPricing": "I nostri <span class=\"gradient-commercial\">prezzi</span>",
    "Plans": "Piani",
    "NameSurname": "Nome cognome",
    "Unspecified": "Non specificato",
    "LicenceType": "Tipo di licenza",
    "LicenseDiscountWarning": "QUESTA PAGINA DI SCONTO UTILIZZA IL CODICE DI SCONTO PREDEFINITO E PER GLI SVILUPPATORI VOLOSOFT. I LINK DI ACQUISTO SOTTO NON FUNZIONANO.",
    "DiscountedLicenseExplanation": "Questi prezzi di licenza sono per piccole startup, singoli sviluppatori, studenti, organizzazioni e progetti senza scopo di lucro!",
    "General": "Generale",
    "License": "Licenza",
    "Development": "Sviluppo",
    "Payment": "Pagamento",
    "WatchExplainerVideo": "Incontriamoci! Guarda il video esplicativo",
    "LightDarkAndSemiDarkThemes": "Chiaro, scuro e semi-scuro",
    "LeptonXThemeExplanation": "Il tema Lepton può cambiare il tema in base alle impostazioni del sistema.",
    "PRO": "PRO",
    "WelcomeToABPCommercial": "Benvenuti in <span class=\"gradient-commercial\">ABP Commerciale!</span>",
    "YourAccountDetails": "Dettagli del tuo account",
    "OrganizationName": "Nome dell&#39;organizzazione",
    "AddDevelopers": "Aggiungi sviluppatori",
    "StartDevelopment": "Inizia lo sviluppo",
    "CreateAndRunApplicationUsingStartupTemplate": "Scopri come creare ed eseguire una nuova applicazione Web utilizzando il modello di avvio commerciale ABP.",
    "CommunityDescription2": "<span class=\"fw-6\">community.abp.io</span> è un luogo in cui le persone possono condividere articoli relativi all&#39;ABP. Cerca articoli, tutorial, esempi di codice, case study e incontra persone nella tua stessa corsia.",
    "UseABPSuiteExplanation": "Utilizza ABP Suite per scaricare il codice sorgente dei moduli e dei temi.",
    "ManageModulesWithSuite": "Puoi anche gestire i tuoi moduli ABP con Suite.",
    "LearnHowToInstallSuite": "Scopri come installare e utilizzare ABP Suite.",
    "SeeMore": "Vedi altro",
    "SeeLess": "Vedi di meno",
    "LayeredSolutionStructure": "Struttura della soluzione a strati",
    "LayeredSolutionStructureExplanation": "La soluzione è stratificata in base ai principi e ai modelli Domain Driven Design per isolare la logica aziendale dall&#39;infrastruttura e dalle integrazioni e per massimizzare la manutenibilità e la riusabilità del codice. ABP Framework fornisce già astrazioni, classi base e guide per implementare realmente DDD per la tua applicazione.",
    "MultipleUIOptions": "Molteplici opzioni dell&#39;interfaccia utente",
    "MultipleUIOptionsExplanation": "Adoriamo modi diversi di creare l&#39;interfaccia utente. Questa soluzione di avvio fornisce tre diverse opzioni del framework dell&#39;interfaccia utente per la tua applicazione aziendale.",
    "MultipleDatabaseOptions": "Opzioni multiple del database",
    "MultipleDatabaseOptionsExplanation": "Sono disponibili due opzioni per il provider di database (oltre a utilizzarle entrambe in un&#39;unica applicazione). Utilizza Entity Framework Core per lavorare con qualsiasi database relazionale e facoltativamente utilizza Dapper quando devi scrivere query di basso livello per prestazioni migliori. MongoDB è un&#39;altra opzione se devi utilizzare un database NoSQL basato su documenti. Sebbene questi provider siano ben integrati, astratti e preconfigurati, puoi effettivamente interagire con qualsiasi sistema di database utilizzabile con .NET.",
    "ModularArchitectureExplanation2": "La modularità è un cittadino di prima classe nella piattaforma ABP.IO. Tutte le funzionalità dell&#39;applicazione sono suddivise in moduli opzionali ben isolati. La soluzione di avvio viene già fornita con i <a href=\"/modules\" class=\"text-primary\">moduli ABP Commercial</a> fondamentali preinstallati. Puoi anche creare i tuoi moduli per costruire un sistema modulare per la tua applicazione.",
    "MultiTenancyForSaasBusiness": "Multi-tenancy per il tuo business SaaS",
    "MultiTenancyForSaasBusinessExplanation": "ABP Commercial fornisce un sistema multi-tenancy end-to-end completo per creare i vostri sistemi SaaS (Software-as-a-Service). Consente agli inquilini di condividere o avere i propri database con la creazione di database e il sistema di migrazione al volo.",
    "MicroserviceStartupSolution": "Soluzione di avvio di microservizi",
    "MicroserviceArchitectureExplanation2": "Puoi ottenerlo per il tuo prossimo sistema di microservizi per sfruttare la soluzione di base predefinita e l&#39;esperienza distillata.",
    "PreIntegratedTools": "Preintegrato con gli strumenti più diffusi",
    "PreIntegratedToolsExplanation": "La soluzione è già integrata negli strumenti e nelle tecnologie standard del settore, mentre puoi sempre modificarli e integrarli con i tuoi strumenti preferiti.",
    "SingleSignOnAuthenticationServer": "Server di autenticazione Single Sign-On",
    "SingleSignOnAuthenticationServerExplanation": "La soluzione dispone di un&#39;applicazione server di autenticazione utilizzata dalle altre applicazioni come server Single Sign-On con le funzionalità di gestione dell&#39;accesso API. Si basa su IdentityServer.",
    "WebAppsWithGateways": "2 app Web con 2 gateway API",
    "WebAppsWithGatewaysExplanation": "La soluzione contiene due applicazioni web, ciascuna dotata di un gateway API dedicato (pattern BFF - Backend For Frontend).",
    "BackOfficeApplication": "Applicazione di back-office",
    "BackOfficeApplicationExplanation": "L&#39;effettiva applicazione web del tuo sistema, con molteplici opzioni del framework dell&#39;interfaccia utente. Puoi creare qualsiasi tipo di applicazione aziendale.",
    "LandingWebsite": "Sito Web di atterraggio",
    "LandingWebsiteExplanation": "Un sito web pubblico/di destinazione generico che può essere utilizzato per diversi scopi, come presentare la tua azienda, vendere i tuoi prodotti, ecc.",
    "ABPFrameworkEBook": "e-book Padroneggiare il quadro ABP",
    "MasteringAbpFrameworkEBookDescription": "Incluso nella licenza commerciale ABP",
    "FullName": "Nome e cognome",
    "LicenseTypeNotCorrect": "Il tipo di licenza non è corretto!",
    "Trainings": "Corsi di formazione",
    "ChooseTrainingPlaceholder": "Scegli la formazione...",
    "DoYouNeedTrainings": "Hai bisogno di uno di questi corsi di formazione?",
    "DoYouNeedTraining": "Hai bisogno di formazione su {0}?",
    "GetInTouchUs": "Mettiti in contatto con noi",
    "ForMoreInformationClickHere": "Per maggiori informazioni, clicca <a href='{0}'>qui.</a>",
    "ForMoreInformationClickHereByClass": "<span class=\"{1}\">Per maggiori informazioni, clicca</span> <a href='{0}'>qui.</a>",
    "IsGetOnboardingTraining": "Ti piacerebbe ricevere una formazione onboarding e sullo sviluppo di applicazioni web?",
    "OnboardingWebApplicationDevelopmentTrainingMessage": "Per pianificare il tuo calendario di formazione, contatta {0} dopo aver creato l&#39;organizzazione",
    "CustomPurchaseMessage": "Per il passaggio successivo, fai clic su {0} per contattarci.",
    "Note": "Nota",
    "AdditionalNote": "Nota aggiuntiva",
    "OnboardingTrainingFaqTitle": "Avete un corso di formazione ABP per l'onboarding?",
    "OnboardingTrainingFaqExplanation": "Sì, abbiamo i servizi di formazione ABP per aiutarti a far partire rapidamente il tuo progetto ABP. Imparerai a conoscere ABP da un membro del core team ABP e otterrai le competenze per iniziare il tuo progetto ABP. Nella formazione onboarding, spiegheremo come configurare il tuo ambiente di sviluppo, installare gli strumenti richiesti, creare una pagina CRUD completamente funzionante. La formazione sarà in diretta e verrà utilizzata l'applicazione Zoom e siamo aperti all'utilizzo di altre piattaforme di riunioni online. La lingua della formazione sarà l'inglese. Puoi anche porre le tue domande sull'ABP durante le sessioni. Verrà pianificata una data e un orario convenienti per entrambe le parti. Per ulteriori informazioni, contattaci all'indirizzo <a href=\"mailto:info@abp.io\">info@abp.io</a>.",
    "AddBasket": "Aggiungi al carrello",
    "SendTrainingRequest": "Invia richiesta di formazione",
    "OnlyEnglishVersionOfThisDocumentIsTheRecentAndValid": "* La versione inglese di questo documento è la più aggiornata e prevarrà in qualsiasi controversia.",
    "Pricing_Page_Title": "Prezzi e piani",
    "Pricing_Page_Description": "Scegli le caratteristiche e le funzionalità di cui la tua azienda ha bisogno oggi. Acquista una licenza commerciale ABP e crea progetti illimitati.",
    "Pricing_Page_HurryUp": "Affrettarsi!",
    "Pricing_Page_BuyLicense": "Acquista una licenza a <strong>prezzi 2021</strong> fino al 16 gennaio!",
    "Pricing_Page_ValidForExistingCustomers": "Valido anche per clienti esistenti e rinnovi di licenza.",
    "Pricing_Page_Hint1": "Il prezzo della licenza include un certo numero di postazioni per sviluppatori. Se hai più sviluppatori, puoi sempre acquistare postazioni aggiuntive.",
    "Pricing_Page_Hint2": "Puoi acquistare più licenze per sviluppatori ora o in futuro. Le licenze sono basate sulla postazione, quindi puoi trasferire una postazione da uno sviluppatore a un altro.",
    "Pricing_Page_Hint3": "Puoi sviluppare un numero illimitato di prodotti diversi con la tua licenza.",
    "Pricing_Page_Hint4": "ABP Suite è uno strumento per assistere il tuo sviluppo per migliorare la tua produttività. Supporta la generazione di pagine CRUD e la creazione di nuovi progetti.",
    "Pricing_Page_Hint5": "Puoi utilizzare tutti i moduli predefiniti nelle tue applicazioni.",
    "Pricing_Page_Hint6": "Puoi utilizzare tutti i temi predefiniti nelle tue applicazioni.",
    "Pricing_Page_Hint7": "Un modello di avvio è una soluzione di Visual Studio che ti consente di avviare rapidamente il tuo progetto. Tutti i moduli fondamentali vengono aggiunti e preconfigurati per te.",
    "Pricing_Page_Hint8": "L&#39;e-book Mastering ABP Framework spiega come implementare soluzioni .NET con le migliori pratiche. È venduto su Amazon.com e puoi scaricare il libro gratuitamente con la tua licenza.",
    "Pricing_Page_Hint9": "Puoi scaricare il codice sorgente di qualsiasi modulo. Potresti voler aggiungere il codice sorgente alla tua soluzione per apportare modifiche radicali o semplicemente tenerlo per te per motivi di sicurezza.",
    "Pricing_Page_Hint10": "Le licenze sono per tutta la vita. Ciò significa che puoi continuare a sviluppare la tua applicazione per sempre. L&#39;accesso alla versione più recente e l&#39;ottenimento del supporto sono garantiti entro il periodo di licenza (1 anno a meno che non venga rinnovata).",
    "Pricing_Page_Hint11": "Nessuna restrizione sulla distribuzione! Puoi eseguire la distribuzione su tutti i server che desideri, inclusi i servizi cloud o on-premise.",
    "Pricing_Page_Hint12": "Puoi aggiornare i moduli, i temi e gli strumenti alla versione più recente entro il periodo di licenza attiva. Dopo la scadenza della licenza, è necessario rinnovarla per continuare a ricevere aggiornamenti per correzioni di bug, nuove funzionalità e miglioramenti.",
    "Pricing_Page_Hint13": "Puoi ottenere il supporto premium per un anno (puoi rinnovare la licenza per estenderlo).",
    "Pricing_Page_Hint14": "Le licenze Team e Business hanno un limite di numero di incidenti/domande. Se acquisti licenze sviluppatore aggiuntive, il limite degli incidenti aumenta di {0} (per la licenza Team) o di {1} (per la licenza Business) per sviluppatore.",
    "Pricing_Page_Hint15": "Solo la licenza Enterprise include il supporto privato. Puoi inviare un&#39;e-mail direttamente al team ABP o porre domande su support.abp.io con un&#39;opzione di biglietto privato. I biglietti privati non sono visibili al pubblico.",
    "Pricing_Page_Hint16": "Puoi scaricare il codice sorgente di tutti i temi ABP. Potresti voler aggiungere il codice sorgente alla tua soluzione per apportare modifiche radicali o semplicemente tenerlo per te per motivi di sicurezza.",
    "Pricing_Page_Testimonial_1": "ABP Commercial ha consentito a SC Ventures di fornire una piattaforma SaaS con database silo multi-tenant di livello bancario in 9 mesi per supportare il finanziamento della catena di fornitura di contabilità clienti/debiti di fatture di valore significativo da più ancoraggi integrati. La modularità di ABP ha consentito al team di consegnare in tempi record, superare tutti i VAPT e distribuire lo stack di microservizi containerizzati tramite CI/CD completo e pipeline in produzione.",
    "Pricing_Page_Testimonial_2": "Comprendiamo il valore dell&#39;utilizzo di ABP Commercial per ridurre il sovraccarico dei progetti di sviluppo personalizzati. Il team è in grado di unificare il modello di codice in diversi flussi di progetto. Vediamo più potenziale nel framework per creare nuove funzionalità più velocemente di prima. Confidiamo che vedremo costantemente il valore di sfruttare ABP Commercial.",
    "Pricing_Page_Testimonial_3": "Adoriamo l&#39;ABP. Non dobbiamo scrivere tutto da zero. Partiamo da funzionalità predefinite e ci concentriamo solo su ciò di cui abbiamo veramente bisogno da scrivere. Inoltre, ABP è ben progettato e il codice è di alta qualità con meno bug. Se dovessimo scrivere tutto ciò di cui abbiamo bisogno da soli, potremmo impiegarci anni. Un&#39;altra cosa che ci piace è che la nuova versione, la risoluzione dei problemi o il miglioramento escono molto presto ogni due settimane. Non aspettiamo troppo a lungo.",
    "Pricing_Page_Testimonial_4": "ABP Commercial è un prodotto fantastico che consiglierei. Prodotti commerciali da commercializzare per i nostri clienti in un&#39;unica piattaforma configurabile. Il salto inizia dal fatto che la struttura e gli strumenti forniti a qualsiasi squadra valgono ogni centesimo. ABP Commercial era la soluzione migliore per le nostre esigenze.",
    "Pricing_Page_Testimonial_5": "ABP Framework non è solo un framework, ma è anche una guida per lo sviluppo/gestione del progetto, poiché fornisce formazione su DDD, GenericRepository, DI, microservizi e modularità. Anche se non utilizzerai il framework stesso, puoi svilupparti con docs.abp.io che è preparato bene e professionalmente (OpenIddict, Redis, Quartz ecc.). Poiché molte cose sono precostruite, riduce significativamente i tempi di sviluppo del progetto (come pagina di accesso, gestione delle eccezioni, filtraggio dei dati, seeding, registrazione di controllo, localizzazione, controller API automatico ecc.). Come esempio tratto dalla nostra applicazione, ho utilizzato Local Event Bus per il controllo delle scorte. Quindi, sono in grado di gestire i movimenti degli ordini scrivendo stock handler. È meraviglioso non perdere tempo con CreationTime, CreatorId. Vengono riempiti automaticamente.",
    "Pricing_Page_Testimonial_6": "ABP Framework è un buon framework ma richiede tempo per comprendere i diversi livelli, classi e librerie che utilizza (in particolare ABP). Ho passato molto tempo a leggere il codice base, ma ABP Commercial ci ha fatto risparmiare tempo nella creazione delle entità speciali del progetto (AR) e del repository collegato a ciascuna di esse. Mi è piaciuto anche l&#39;approccio utilizzato in ABP è molto maturo; sappiamo che è basato su DDD e monolite.",
    "Pricing_Page_Testimonial_7": "Come startup, dobbiamo iterare rapidamente e dedicare il minimo tempo alle funzionalità standard e non fondamentali. \n I nostri ingegneri spaziano da ingegneri di grande esperienza a ingegneri junior e avevamo bisogno di una comprensione comune e di un modo per condividere conoscenze tecniche e di dominio, ABP ci ha permesso di farlo grazie alle loro ottime guide e documentazione. \n Ci sono cose di cui non dobbiamo preoccuparci poiché funzionano immediatamente con ABP. \n ABP ci ha aiutato a semplificare la prototipazione e lo sviluppo rapidi, in meno di 4 settimane dall&#39;inizio della funzionalità alla produzione. Con tutte le funzionalità premium incluse nella licenza, ABP ci ha fornito &quot;Startup in a Box&quot; dal punto di vista dell&#39;ingegneria del software.",
    "Pricing_Page_Testimonial_8": "Consiglierei ABP commerciale a tutti coloro che vogliono ampliare la gamma di prodotti a disposizione dei propri clienti. È fantastico quando è necessario utilizzare un ambiente aziendale distribuito (Angular, WPF, Win&amp;Linux). Oltre ai loro prodotti, amiamo il loro supporto, che rende il nostro lavoro più semplice e veloce. Sappiamo già di aver trovato un ottimo partner per il futuro che ci supporterà nell&#39;espansione della nostra attività.",
    "Pricing_Page_Testimonial_9": "Siamo un&#39;azienda di 2 dipendenti che opera nel settore da oltre 20 anni. \n In termini di esperienza con ABP Commercial, siamo stati contattati da un cliente che ci ha richiesto di sviluppare una nuova applicazione per le risorse umane in un ambiente moderno per sostituire la loro applicazione Access vecchia di 25 anni. Abbiamo deciso di passare da una soluzione desktop a una basata sul web. \n \n All&#39;epoca avevamo pochissima conoscenza delle applicazioni Web e di .NET, ma ci siamo imbattuti in ABP Commercial e, con l&#39;aiuto di ABP Framework, documentazione tecnica e ABP Suite, siamo stati in grado non solo di sviluppare l&#39;applicazione per le specifiche del cliente ma anche lavorare con successo in un ambiente .NET entro un anno.",
    "AbpBookDownloadArea_ClaimYourEBook": "Richiedi il tuo e-book <span class='gradient-framework'>Mastering ABP Framework</span>",
    "AddMemberModal_Warning_1": "Se il <strong>nome utente</strong> che stai tentando di aggiungere non esiste nel sistema, chiedi al membro del tuo team di registrarsi su <a href='{0}/Account/Register'>{0}</a> e di condividere con te il nome utente del suo account.",
    "MyOrganizations_Detail_WelcomeMessage": "Benvenuto nella tua organizzazione, {0}",
    "MyOrganizations_Detail_OrganizationManagement": "<span class=\"gradient-commercial\">Gestione</span> dell&#39;organizzazione",
    "OrganizationDisplayName": "Nome visualizzato dell&#39;organizzazione",
    "MyOrganizations_Detail_EditDisplayName": "Modifica nome visualizzato",
    "MyOrganizations_Detail_UpgradeYourLicense": "Aggiorna la tua licenza",
    "MyOrganizations_Detail_LicenseStartAndExpiryDate": "Data di inizio della licenza - Data di scadenza",
    "MyOrganizations_Detail_OwnerRightInfo": "Stai utilizzando {0} dei tuoi {1} diritti di proprietario.",
    "MyOrganizations_Detail_CopyApiKey": "Copia la chiave",
    "MyOrganizations_Detail_ApiKeyDescription": "La chiave API è il token dei pacchetti PRO ospitati su <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{1}.</a>",
    "MyOrganizations_Detail_YourPrivateNugetSource": "La tua origine NuGet privata è <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{0}</a>",
    "MyOrganizations_Detail_PrivateNugetSourceWarning": "Questo viene aggiunto automaticamente come feed a NuGet.Config nella soluzione ABP. Non condividere la tua chiave privata con utenti non autorizzati!",
    "MyOrganizations_Detail_DeveloperSeatInfo": "Stai utilizzando {0} delle tue {1} postazioni sviluppatore.",
    "NeedMoreSeatsForYourTeam": "Hai bisogno di più posti per la tua squadra?",
    "MyOrganizations_Detail_PricePerYear": "{0}/all&#39;anno",
    "MyOrganizations_Detail_PurchaseDeveloperSeats": "Acquista postazioni per sviluppatori",
    "Invoices": "Fatture",
    "RequestInvoice": "Richiedi fattura",
    "OrderNumber": "Numero d&#39;ordine",
    "Date": "Data",
    "Products": "Prodotti",
    "TotalPrice": "Prezzo totale",
    "ThereIsNoInvoice": "Non c&#39;è fattura",
    "MyOrganizations_Detail_PaymentProviderInfo": "Se hai acquistato la licenza tramite <i>{0}</i> gateway, verrà inviata la fattura in formato PDF al tuo indirizzo email, vedi <a href=\"{1}\" target=\"_blank\">Fatturazione {0}.</a>",
    "MyOrganizations_Detail_PayUInfo": "Se hai acquistato tramite il gateway <i>Iyzico</i> , fai clic sul pulsante &quot;Richiedi fattura&quot; e inserisci i dati di fatturazione.",
    "MyOrganizations_Detail_ConclusionInfo": "La tua richiesta di fattura verrà conclusa entro {0} giorni lavorativi.",
    "ExtendYourLicense": "Estendi la tua licenza <span class=\"text-primary\">{0}</span>",
    "Continue": "Continua",
    "PurchaseLicense": "Acquista {0} licenza",
    "DownloadInvoiceModal_DownloadInvoice": "Scarica Fattura",
    "DownloadInvoiceModal_SaveInformationOnlyOnce": "Puoi salvare i tuoi dati di fatturazione solo una volta.",
    "InvoiceModal_EnterCompanyName": "Inserisci il nome della tua azienda legale...",
    "InvoiceModal_EnterCompanyAddress": "Inserisci l&#39;indirizzo della tua azienda legale...",
    "InvoiceModal_EnterTaxNumber": "Inserisci il tuo codice fiscale/partita IVA se disponibile...",
    "RequestInvoiceModal_EnterNotes": "Inserisci il messaggio aggiuntivo relativo alla fattura...",
    "PrePayment_PayWithIyzico": "Pagherai con Iyzico",
    "ContinueToCheckout": "Continua alla cassa",
    "PrePayment_IyzicoRedirectionInfo": "Verrai reindirizzato a Iyzico Payment Gateway per completare il tuo acquisto in sicurezza.",
    "PrePayment_IyzicoAcceptVisaAndMasterCard": "Iyzico accetta Visa e MasterCard.",
    "Purchase": "Acquistare",
    "AcceptTermsAndConditions": "Ho letto, compreso e accetto l&#39; <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">informativa sulla privacy</a> , <a href=\"{1}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">i termini e le condizioni</a> e <a href=\"{2}\" target=\"_blank\" class=\"text-primary\">l&#39;EULA.</a>",
    "AcceptTermsAndConditionsWarningMessage": "Si prega di accettare l&#39;informativa sulla privacy e i termini e condizioni",
    "SelectGatewayToContinue": "Seleziona un gateway per continuare!",
    "GatewaySelection_SelectGateway": "Seleziona un gateway di pagamento",
    "GatewaySelection_RedirectionMessage": "Successivamente, verrai reindirizzato al sito web del gateway di pagamento selezionato per la transazione.",
    "PaymentSucceed_PaymentSuccessMessage": "Pagamento riuscito",
    "PaymentSucceed_ThanksForPurchase": "Grazie per il vostro acquisto!",
    "PaymentSucceed_CreateYourOrganization": "Crea la tua organizzazione",
    "PaymentSucceed_AddMeAsDeveloper": "Anch&#39;io sono uno sviluppatore, aggiungimi come sviluppatore alla mia organizzazione.",
    "PaymentSucceed_CreateOrganization": "Crea organizzazione",
    "PaymentSucceed_OrganizationDescription": "Un&#39;organizzazione è composta da sviluppatori e proprietari. Gli sviluppatori sono utenti che scrivono codice sul progetto ABP e trarranno vantaggio dal sito web <a href=\"{0}\" target=\"_blank\">di {1}</a> . I proprietari sono gli utenti che assegnano le postazioni degli sviluppatori e gestiscono le licenze.",
    "PaymentSucceed_ViewOrganization": "Clicca qui per vedere l&#39;organizzazione",
    "Purchase_TotalAnnualPrice": "TOTALE <small class=\"opacity-50\">(quota annua)</small>",
    "Purchase_TrainingPrice": "Prezzo della formazione",
    "Purchase_OnboardingTraining": "Formazione dal vivo sull&#39;onboarding e sullo sviluppo di applicazioni Web",
    "TotalDeveloperPrice": "Prezzo totale per gli sviluppatori",
    "Purchase_PricePerDeveloper": "<span>{0} {1}</span> per sviluppatore",
    "Purchase_IncludedDeveloperInfo": "{0} {1} incluso.",
    "Purchase_LicenseExtraDeveloperPurchaseMessage": "La <span class=\"fw-bold\">licenza {0}</span> include {1} sviluppatori. Puoi aggiungere ulteriori sviluppatori.",
    "StartupTemplates_Page_Title": "Modelli di avvio ABP",
    "StartupTemplates_Page_Description": "ABP Commercial ti consente di creare soluzioni con qualsiasi livello di complessità. Fornisce due principali soluzioni di avvio predefinite. Puoi selezionare quello più vicino alle tue esigenze e costruirci sopra la tua soluzione personalizzata.",
    "MicroserviceStartupSolutionForDotnet": "Soluzione di avvio di microservizi per .NET",
    "MonolithSolutionForDotnet": "Soluzione monolitica (modulare) per .NET",
    "TrainingDetailsHeaderInfo_TrainingHour": "{0} ora/e",
    "Trainings_Content": "Contenuto della formazione",
    "Trial_Page_StartYourFreeTrial": "Inizia la tua <span class=\"gradient-commercial\">prova gratuita</span>",
    "TrialLicenseFeatures": "Potrai beneficiare di tutte le funzionalità commerciali di ABP",
    "TrialPeriodDays": "Avrai una licenza Team per {0} giorni",
    "TrialForumSupportIncident": "Avrai {0} incidenti di supporto del forum",
    "Contact_Page_Title": "Contatto con il team di sviluppo ABP",
    "Contact_Page_Description": "Contatta il team di sviluppo ABP, se hai bisogno di aiuto o condividi i tuoi pensieri e opinioni! Il team di supporto ABP è pronto ad aiutare.",
    "Demo_Page_Title": "Crea una dimostrazione",
    "Demo_Page_Description": "Crea una demo gratuita per vedere un&#39;applicazione di esempio creata utilizzando il modello di avvio commerciale ABP. Non ripeterti per i requisiti applicativi comuni.",
    "Discounted_Page_Title": "Prezzo scontato",
    "Discounted_Page_Description": "Scegli le caratteristiche e le funzionalità di cui la tua azienda ha bisogno oggi. Acquista una licenza commerciale ABP e crea progetti illimitati",
    "Faq_Page_Title": "Domande frequenti (FAQ)",
    "Faq_Page_Description": "Avete domande? Cerca le domande più frequenti o facci una domanda utilizzando il modulo di contatto.",
    "Faq_Page_SwiftCode": "Codice SWIFT",
    "Faq_Page_BankName": "Nome della banca",
    "Faq_Page_AccountName": "Nome utente",
    "Faq_Page_AccountNumber": "Numero di conto",
    "Faq_Page_Currency": "Valuta",
    "Faq_Page_VatNumber": "Partita IVA",
    "Faq_Page_OtherCurrenciesInfo": "Per le altre valute, vedi <a href='{0}'>tutti i conti</a>",
    "ProjectCreatedSuccess_Page_Title": "Il tuo progetto è stato creato",
    "ProjectCreatedSuccess_Page_Description": "Il tuo progetto ABP è stato creato con successo!",
    "Suite_Page_Title": "Suite ABP",
    "Suite_Page_Description": "ABP Commercial fornisce strumenti di sviluppo rapido delle applicazioni per aumentare la produttività degli sviluppatori. ABP Suite ti consente di creare facilmente pagine CRUD.",
    "Themes_Page_Title": "Temi ABP",
    "Themes_Page_Description": "ABP Commercial offre molteplici temi dell&#39;interfaccia utente moderni e professionali. Crea una demo gratuita per avere una rapida visione di come appare l&#39;interfaccia utente.",
    "Tools_Page_Title": "Strumenti di sviluppo rapido di applicazioni",
    "Tools_Page_Description": "ABP Commercial fornisce strumenti di sviluppo rapido delle applicazioni per aumentare la produttività degli sviluppatori. ABP Suite ti consente di creare facilmente pagine CRUD.",
    "DeveloperPrice": "Prezzo sviluppatore",
    "AdditionalDeveloperPaymentInfoSection_AdditionalDevelopers": "{0} <small>sviluppatori</small>",
    "LicenseRemainingDays": "per <span>{0}</span> giorni",
    "ExtendPaymentInfoSection_Description": "Estendendo/rinnovando la tua licenza, continuerai a ricevere <a href=\"{0}\" target=\"_blank\">il supporto premium</a> . Potrai anche ottenere aggiornamenti maggiori o minori per moduli e temi. Potrai continuare a creare nuovi progetti. E sarai comunque in grado di utilizzare <a href=\"{1}\" target=\"_blank\">ABP Suite</a> che accelera il tuo sviluppo.",
    "LicenseRenewalPrice": "Prezzo rinnovo licenza",
    "LicensePrice": "Prezzo della licenza",
    "TrialLicensePaymentInfoSection_Description": "<strong>Acquista licenza:</strong> acquistando una licenza, continuerai a ricevere <a href=\"{0}\" target=\"_blank\" rel=\"noopener\">il supporto premium</a> . Potrai anche ottenere aggiornamenti maggiori o minori per moduli e temi. Potrai continuare a creare nuovi progetti. E sarai comunque in grado di utilizzare <a href=\"{1}\" target=\"_blank\" rel=\"noopener\">ABP Suite</a> che accelera il tuo sviluppo.<br> Consulta la <a href=\"{2}\" target=\"_blank\" rel=\"noopener\">tabella di confronto delle licenze</a> per verificare le differenze tra i tipi di licenza.",
    "SelectTargetLicense": "Seleziona Licenza di destinazione",
    "UpgradePaymentInfoSection_ExtendMyLicenseForOneYear": "Sì, proroga la data di scadenza della mia licenza di 1 anno.",
    "UpgradePaymentInfoSection_WantToExtendLicense": "Vuoi estendere la tua licenza per un altro anno?",
    "UpgradePaymentInfoSection_UpgradingWillNotExtendLicense": "L&#39;aggiornamento non estenderà la data di scadenza della licenza!",
    "UpgradePaymentInfoSection_LicenseUpgradeDescription": "Aggiornando la tua licenza, verrai promosso a un tipo di licenza superiore, che ti consentirà di ottenere ulteriori vantaggi. Consulta la <a href=\"/Pricing\" target=\"_blank\">tabella di confronto delle licenze</a> per verificare le differenze tra i tipi di licenza.",
    "Landing_Page_CustomerStories": "Storie di clienti",
    "Landing_Page_OurGreatCustomers": "I nostri grandi clienti",
    "Landing_Page_WebApplicationFramework": "Quadro dell&#39;applicazione Web",
    "Landing_Page_WebDevelopmentPlatform": "Piattaforma di sviluppo Web",
    "Landing_Page_CompleteWebDevelopmentPlatform": "Piattaforma di sviluppo Web completa",
    "Landing_Page_TryFreeDemo": "Prova la demo gratuita",
    "Landing_Page_StartingPointForWebApplications": "Il punto di partenza per le applicazioni Web basate su ASP.NET Core! Si basa sul Framework ABP per il miglior sviluppo web.",
    "Landing_Page_AbpProvidesSoftwareInfrastructure": "ABP Framework fornisce un&#39;infrastruttura software per sviluppare eccellenti applicazioni web con le migliori pratiche.",
    "Landing_Page_MicroserviceCompatibleArchitecture": "Architettura compatibile con microservizi",
    "Landing_Page_PreBuiltApplicationModulesAndThemes": "Moduli e temi applicativi precostruiti",
    "Landing_Page_MultiTenantArchitecture": "Architettura multi-tenant",
    "Landing_Page_MultiTenancyDescription": "Le applicazioni SaaS sono diventate semplici! Multi-tenancy integrato dal database all&#39;interfaccia utente.",
    "Landing_Page_DDDIntroduction": "Progettato e sviluppato sulla base di modelli e principi DDD. Fornisce un modello a più livelli per la tua applicazione.",
    "Landing_Page_CrossCuttingConcernsInfo": "Infrastruttura completa per autorizzazione, convalida, gestione delle eccezioni, memorizzazione nella cache, registrazione di controllo, gestione delle transazioni e altro ancora.",
    "Landing_Page_PreBuiltApplicationModules": "Moduli applicativi precostruiti che includono i requisiti delle applicazioni Web più comuni.",
    "Landing_Page_ChatModule": "Chiacchierata",
    "Landing_Page_DocsModule": "Documenti",
    "Landing_Page_FileManagementModule": "Gestione dei file",
    "Landing_Page_CustomerStory_1": "ABP Commercial ha consentito a SC Ventures di fornire una piattaforma SaaS con database silo multi-tenant di livello bancario in 9 mesi per supportare il finanziamento della catena di fornitura di contabilità clienti/debiti di fatture di valore significativo da più ancoraggi integrati. La modularità di ABP ha consentito al team di consegnare in tempi record, superare tutti i VAPT e distribuire lo stack di microservizi containerizzati tramite CI/CD completo e pipeline in produzione.",
    "Landing_Page_CustomerStory_2": "Comprendiamo il valore dell&#39;utilizzo di ABP Commercial per ridurre il sovraccarico dei progetti di sviluppo personalizzati. Il team può unificare il modello di codice in diversi flussi di progetto. Vediamo più potenziale nel framework per creare nuove funzionalità più velocemente di prima. Confidiamo che vedremo costantemente il valore di sfruttare ABP Commercial.",
    "Landing_Page_CustomerStory_3": "Adoriamo l&#39;ABP. Non dobbiamo scrivere tutto da zero. Partiamo da funzionalità predefinite e ci concentriamo solo su ciò di cui abbiamo veramente bisogno da scrivere. Inoltre, ABP è ben progettato e il codice è di alta qualità con meno bug. Se dovessimo scrivere tutto ciò di cui abbiamo bisogno da soli, potremmo impiegarci anni. Un&#39;altra cosa che ci piace è che la nuova versione, la risoluzione dei problemi o il miglioramento escono molto presto \n ogni due settimane. Non aspettiamo troppo a lungo.",
    "Landing_Page_CustomerStory_4": "ABP Commercial è un prodotto fantastico che consiglierei. Prodotti commerciali da commercializzare per i nostri clienti in un&#39;unica piattaforma configurabile. Il salto inizia dal fatto che la struttura e gli strumenti forniti a qualsiasi squadra valgono ogni centesimo. ABP Commercial era la soluzione migliore per le nostre esigenze.",
    "Landing_Page_AdditionalServices": "Licenza personalizzata o a volume, onboarding, formazione e supporto dal vivo, sviluppo di progetti personalizzati, porting di progetti esistenti e altro ancora...",
    "Landing_Page_IncludedDeveloperLicenses": "<strong>{0}</strong> licenze per sviluppatori incluse",
    "Landing_Page_SeeOnDemo": "Vedi su Demo",
    "Landing_Page_LeptonThemes": "Temi sui leptoni",
    "Landing_Page_AccountModuleDescription_1": "Questo modulo implementa il sistema di autenticazione per un&#39;applicazione;",
    "Landing_Page_AccountModuleDescription_2": "Fornisce una pagina <strong>di accesso</strong> con nome utente e password",
    "Landing_Page_AccountModuleDescription_3": "Fornisce una pagina <strong>di registrazione</strong> per creare un nuovo account.",
    "Landing_Page_AccountModuleDescription_4": "Fornisce una pagina <strong>per la password dimenticata</strong> per inviare un collegamento <strong>per la reimpostazione della password</strong> tramite e-mail.",
    "Landing_Page_AccountModuleDescription_5": "Fornisce funzionalità <strong>di conferma e-mail</strong> con l&#39;interfaccia utente.",
    "Landing_Page_AccountModuleDescription_6": "Implementa l&#39;autenticazione <strong>a due fattori</strong> (SMS ed e-mail).",
    "Landing_Page_AccountModuleDescription_7": "Implementa <strong>il blocco dell&#39;utente</strong> (blocca l&#39;account per il periodo di tempo impostato quando si verifica un certo numero di accessi non riusciti a causa di credenziali non valide entro un determinato intervallo di tempo).",
    "Landing_Page_AccountModuleDescription_8": "Implementa l&#39;interfaccia utente e la funzionalità del server di autenticazione <strong>di Identity Server</strong> .",
    "Landing_Page_AccountModuleDescription_9": "Consente di <strong>passare da un tenant all&#39;altro</strong> in un ambiente multi-tenant.",
    "Landing_Page_AccountModuleDescription_10": "Consente di modificare la <strong>lingua dell&#39;interfaccia utente</strong> dell&#39;applicazione.",
    "Landing_Page_AuditLoggingModuleDescription_1": "Questo modulo fornisce l&#39;interfaccia utente di reporting del registro di controllo per l&#39;infrastruttura di controllo. Consente di cercare, filtrare e mostrare le voci del registro di controllo e i registri delle modifiche delle entità.",
    "Landing_Page_AuditLoggingModuleDescription_2": "Una voce del registro di controllo è costituita da dati critici su ciascuna richiesta del client:",
    "Landing_Page_AuditLoggingModuleDescription_3": "URL, browser, indirizzo IP, nome cliente",
    "Landing_Page_AuditLoggingModuleDescription_4": "L&#39;utente",
    "Landing_Page_AuditLoggingModuleDescription_5": "Metodo HTTP, codice di stato restituito HTTP",
    "Landing_Page_AuditLoggingModuleDescription_6": "Successo/fallimento, dettagli sull&#39;eccezione se disponibili",
    "Landing_Page_AuditLoggingModuleDescription_7": "Richiedi la durata dell&#39;esecuzione",
    "Landing_Page_AuditLoggingModuleDescription_8": "Le entità sono state create, cancellate o aggiornate in questa richiesta (con proprietà modificate).",
    "Landing_Page_BloggingModuleDescription_1": "Questo modulo aggiunge un semplice blog alla tua domanda ABP;",
    "Landing_Page_BloggingModuleDescription_2": "Permette di creare più blog in un&#39;unica applicazione.",
    "Landing_Page_BloggingModuleDescription_3": "Supporta il formato Markdown.",
    "Landing_Page_BloggingModuleDescription_4": "Permette di scrivere un commento per un post.",
    "Landing_Page_BloggingModuleDescription_5": "Permette di assegnare tag ai post del blog.",
    "Landing_Page_BloggingModuleDescription_6": "Guarda il sito web <a href=\"blog.abp.io\">blog.abp.io</a> come esempio dal vivo del modulo di blogging.",
    "Landing_Page_ChatModuleDescription_1": "Questo modulo viene utilizzato per la messaggistica in tempo reale tra gli utenti nell&#39;applicazione.",
    "Landing_Page_ChatModuleDescription_2": "Messaggistica in tempo reale sulla pagina della chat.",
    "Landing_Page_ChatModuleDescription_3": "Cerca gli utenti nell&#39;applicazione per nuove conversazioni.",
    "Landing_Page_ChatModuleDescription_4": "Elenco dei contatti per le conversazioni recenti.",
    "Landing_Page_ChatModuleDescription_5": "Nuove notifiche di messaggi quando l&#39;utente sta guardando un&#39;altra pagina.",
    "Landing_Page_ChatModuleDescription_6": "Badge del conteggio totale dei messaggi non letti sull&#39;icona del menu.",
    "Landing_Page_ChatModuleDescription_7": "Conteggio dei messaggi non letti per ogni conversazione.",
    "Landing_Page_ChatModuleDescription_8": "Conversazioni pigre e caricate.",
    "Landing_Page_DocsModuleDescription_1": "Questo modulo viene utilizzato per creare siti Web di documentazione tecnica;",
    "Landing_Page_DocsModuleDescription_2": "<strong>Integrazione GitHub</strong> integrata: scrivi e gestisci direttamente i documenti su GitHub.",
    "Landing_Page_DocsModuleDescription_3": "Supporto <strong>del controllo delle versioni</strong> direttamente integrato nelle versioni GitHub.",
    "Landing_Page_DocsModuleDescription_4": "Supporta <strong>multilingue</strong> (con supporto fallback alla lingua predefinita).",
    "Landing_Page_DocsModuleDescription_5": "Supporta i formati <strong>Markdown</strong> e HTML.",
    "Landing_Page_DocsModuleDescription_6": "Fornisce una sezione <strong>di navigazione</strong> e una <strong>struttura</strong> .",
    "Landing_Page_DocsModuleDescription_7": "Permette di ospitare la documentazione <strong>di più progetti</strong> in un&#39;unica applicazione.",
    "Landing_Page_DocsModuleDescription_8": "Collegamenti al file su GitHub, in modo che chiunque possa contribuire facilmente facendo clic sul <strong>collegamento Modifica</strong> .",
    "Landing_Page_DocsModuleDescription_9": "Oltre all&#39;origine GitHub, consente di utilizzare semplicemente una cartella come origine della documentazione.",
    "Landing_Page_FileManagementModuleDescription_1": "Carica, scarica e organizza i file in una struttura di cartelle gerarchiche.",
    "Landing_Page_FileManagementModuleDescription_2": "Questo modulo viene utilizzato per caricare, scaricare e organizzare i file in una struttura di cartelle gerarchiche. È anche compatibile con il multi-tenant e puoi determinare il limite di dimensione totale per i tuoi tenant.",
    "Landing_Page_FileManagementModuleDescription_3": "Questo modulo è basato sul sistema <a href=\"https://docs.abp.io/en/abp/latest/Blob-Storing\">di archiviazione BLOB</a> , quindi può utilizzare diversi provider di archiviazione per archiviare il contenuto del file.",
    "Landing_Page_IdentityModuleDescription_1": "Questo modulo implementa il sistema Utente e Ruolo di un&#39;applicazione;",
    "Landing_Page_IdentityModuleDescription_2": "Basato sulla libreria <a href=\"https://docs.microsoft.com/en-us/aspnet/core/security/authentication/identity\">ASP.NET Core Identity di Microsoft</a> .",
    "Landing_Page_IdentityModuleDescription_3": "Gestire <strong>ruoli</strong> e <strong>utenti</strong> nel sistema. Un utente può avere <strong>più ruoli</strong> .",
    "Landing_Page_IdentityModuleDescription_4": "Imposta <strong>le autorizzazioni</strong> a livello di ruolo e utente.",
    "Landing_Page_IdentityModuleDescription_5": "Abilita/disabilita <strong>l&#39;autenticazione a due fattori</strong> e <strong>il blocco</strong> utente per utente.",
    "Landing_Page_IdentityModuleDescription_6": "Gestisci <strong>il profilo utente</strong> e <strong>la password</strong> di base.",
    "Landing_Page_IdentityModuleDescription_7": "Gestisci <strong>i tipi di attestazioni</strong> nel sistema, imposta attestazioni su ruoli e utenti.",
    "Landing_Page_IdentityModuleDescription_8": "Pagina di impostazione per gestire <strong>la complessità della password</strong> , l&#39;accesso dell&#39;utente, l&#39;account e il blocco.",
    "Landing_Page_IdentityModuleDescription_9": "Supporta l&#39;autenticazione <strong>LDAP</strong> .",
    "Landing_Page_IdentityModuleDescription_10": "Fornisce la verifica <strong>dell&#39;e-mail e del numero di telefono</strong> .",
    "Landing_Page_IdentityModuleDescription_11": "Supporta integrazioni di accesso social (Twitter, Facebook, GitHub ecc...).",
    "Landing_Page_IdentityModuleDescription_12": "Gestire <strong>le unità organizzative</strong> nel sistema.",
    "Landing_Page_PaymentModuleDescription_1": "Fornisce l&#39;integrazione per diversi gateway di pagamento.",
    "Landing_Page_PaymentModuleDescription_2": "Questo modulo fornisce l&#39;integrazione per i gateway di pagamento, così puoi ottenere facilmente il pagamento dai tuoi clienti.",
    "Landing_Page_PaymentModuleDescription_3": "Questo modulo supporta i seguenti gateway di pagamento",
    "Welcome_Page_UseSameCredentialForCommercialWebsites": "Utilizza le stesse credenziali sia per <a href=\"https://commercial.abp.io\" class=\"text-primary\">commercial.abp.io</a> che <a href=\"https://support.abp.io\" class=\"text-primary\">per support.abp.io</a> .",
    "WatchCrudPagesVideo": "Guarda il video &quot;Creazione di pagine CRUD con ABP Suite&quot;!",
    "WatchGeneratingFromDatabaseVideo": "Guarda il video &quot;ABP Suite: generazione di pagine CRUD da tabelle di database esistenti&quot;!",
    "WatchTakeCloserLookVideo": "Guarda il video &quot;Dai un&#39;occhiata più da vicino alla generazione del codice: ABP Suite&quot;!",
    "ConfirmedEmailAddressRequiredToStartTrial": "Dovresti avere un indirizzo email confermato per avviare una licenza di prova.",
    "EmailVerificationMailNotSent": "Impossibile inviare la posta di verifica dell&#39;e-mail.",
    "GetConfirmationEmail": "<a href=\"javascript:void(0);\" id=\"{0}\" class=\"text-decoration-underline\">Fai clic qui per ricevere un&#39;e-mail di verifica</a> se non l&#39;hai già ricevuta.",
    "WhichLicenseTypeYouAreInterestedIn": "A quale tipo di licenza sei interessato?",
    "DontTakeOurWordForIt": "Non crederci sulla parola...",
    "ReadAbpCommercialUsersWantYouToKnow": "Leggi cosa vogliono che tu sappia gli utenti ABP Commercial",
    "Testimonial_ShortDescription_1": "La modularità dell&#39;ABP ha consentito al team di consegnare in tempo.",
    "Testimonial_ShortDescription_2": "Crea nuove funzionalità più velocemente di prima.",
    "Testimonial_ShortDescription_3": "Partiamo da funzionalità predefinite e ci concentriamo solo su ciò di cui abbiamo veramente bisogno da scrivere.",
    "Testimonial_ShortDescription_4": "ABP Commercial era la soluzione migliore per le nostre esigenze.",
    "OnlineReviewersOnAbpCommercial": "Recensioni online su ABP Commercial",
    "SeeWhatToldAboutAbpCommercial": "Guarda cosa è stato detto su ABP Commercial e scrivi i tuoi pensieri se vuoi.",
    "BlazoriseLicense": "Dobbiamo acquistare la licenza di Blazorise?",
    "BlazoriseLicenseExplanation": "Abbiamo un accordo tra Volosoft e Megabit, con il quale la licenza di Blazorise viene fornita in bundle con i prodotti commerciali ABP, pertanto i nostri clienti non hanno bisogno di acquistare una licenza Blazorise aggiuntiva.",
    "ExtendPaymentInfoSection_DeveloperPrice": "{0}x sviluppatori aggiuntivi",
    "ExtendPaymentInfoSection_DiscountRate": "Sconto {0}%",
    "TotalNetPrice": "Prezzo netto totale",
    "EFCore": "Nucleo del framework delle entità",
    "All": "Tutto",
    "Mvc": "MVC",
    "DataBaseProvider": "Fornitore di dati",
    "UIFramework": "Struttura dell&#39;interfaccia utente",
    "LeptonXThemeForDashboard": "Tema LeptonX per la tua dashboard di amministrazione di",
    "AbpPlatform": "Piattaforma ABP",
    "YouDeserveGoodUXUI": "Ti meriti una buona interfaccia utente e una migliore UX. Il tema LeptonX di ABP è qui per servirlo.",
    "ViewLiveDemo": "Visualizza la demo del tema dal vivo",
    "GetLeptonX": "Ottieni LeptonX adesso",
    "SeeLeptonXDocumentation": "Vedi la documentazione di LeptonX",
    "SeeLeptonDocumentation": "Vedi la documentazione sui leptoni",
    "SimplifiedMenu": "Menù semplificato",
    "SimplifiedMenuDescription": "Puoi trovare facilmente la pagina che stai cercando filtrando il menu",
    "YourFavoritePages": "Le tue pagine preferite a portata di mano",
    "YourFavoritePagesDescription": "Aggiungi o rimuovi facilmente la pagina dai preferiti facendo clic sull&#39;icona a forma di stella nell&#39;angolo in alto a destra della pagina.",
    "BreadCrumbs": "breadcrumb per un passaggio senza interruzioni",
    "BreadCrumbsDescription": "Usando Breadcrumb, puoi passare alle pagine allo stesso livello con un clic, anche quando il menu di sinistra è chiuso, e funziona su tablet e dispositivi mobili responsive!",
    "YourMenu": "Il tuo menù come lo desideri",
    "YourMenuDescription": "Personalizza le icone direttamente cliccabili e le caselle a discesa nel menu utente come desideri. Il menu utente è completamente personalizzabile per le vostre esigenze",
    "RtlSupport": "Supporto RTL per la tua lingua",
    "RtlSupportDescription": "Il tema LeptonX supporta RTL per la tua lingua. Le opzioni della lingua si trovano nel menu delle impostazioni per poter cambiare la lingua.",
    "YourColors": "I tuoi colori nell&#39;interfaccia utente della dashboard di amministrazione",
    "YourColorsDescription": "Il tema LeptonX funziona in base alle preferenze del tuo sistema e dispone di opzioni per il tema chiaro del dashboard, il tema scuro del dashboard e il tema semi-scuro del dashboard.",
    "ArrangeContentWidth": "Organizza facilmente la larghezza dei tuoi contenuti",
    "ArrangeContentWidthDescription": "Modifica facilmente la larghezza dell&#39;area dei contenuti.",
    "LeptonXCompatibleWith": "Il tema LeptonX è compatibile con",
    "MobileResponsiveTemplate": "Modello reattivo per dispositivi mobili",
    "MobileResponsiveTemplateDescription1": "Accedi alla dashboard di amministrazione di LeptonX da qualsiasi dispositivo tu voglia.",
    "MobileResponsiveTemplateDescription2": "È progettato per poter essere utilizzato facilmente in ogni tuo dispositivo. È reattivo su dispositivi mobili e dimensioni di tablet.",
    "TopMenuLayoutOption": "Opzione di layout del menu principale",
    "TopMenuLayoutOptionDescription1": "Se desideri configurare il tuo sito web con la stessa dashboard di amministrazione, è possibile farlo con LeptonX Theme!",
    "TopMenuLayoutOptionDescription2": "Prova semplicemente il layout del menu principale di LeptonX per realizzarlo!",
    "EasilyCustomizable": "Facilmente personalizzabile per i colori del tuo marchio",
    "EasilyCustomizableDescription1": "Puoi personalizzare il tema LeptonX utilizzando solo poche variabili SCSS. Nessuna sostituzione, nessun caricamento CSS aggiuntivo!",
    "EasilyCustomizableDescription2": "Con LeptonX puoi organizzare la dashboard di amministrazione come preferisci.",
    "IndependentLayout": "Layout e area contenuti indipendenti",
    "IndependentLayoutDescription1": "L&#39;infrastruttura di layout di LeptonX è stata progettata completamente separata dal contenuto.",
    "IndependentLayoutDescription2": "Ciò significa che puoi progettare liberamente il tuo progetto con una struttura di contenuto diversa da Bootstrap, se lo desideri.",
    "MostUsedLibraries": "Librerie più utilizzate integrate con LeptonX",
    "MostUsedLibrariesDescription1": "LeptonX contiene le librerie più utilizzate. Ti consente di utilizzare librerie come ApexCharts, DataTables, DropZone, FullCalender, JSTree, Select2 e Toastr senza sforzo.",
    "MostUsedLibrariesDescription2": "LeptonX supporta anche le librerie MVC Angular e Blazor specifiche.",
    "CreateAndCustomize": "Crea e personalizza le pagine di cui hai bisogno in pochi secondi con le pagine personalizzate LeptonX",
    "CreateAndCustomizeDescription": "Utilizzando il tema LeptonX hai anche accesso a molte pagine HTML predefinite. Questi includono molte pagine come pagina di accesso, blog, domande frequenti, elenco di abbonamenti, fattura, prezzi e gestione dei file.",
    "LeptonThemeForAdmin": "Tema Lepton per la tua dashboard di amministrazione di",
    "LeptonThemeForAdminDescription": "Il tema Lepton è ancora disponibile e verrà mantenuto. Se desideri passare al tema LeptonX come utente del tema Lepton, puoi consultare la documentazione per sapere come fare.",
    "LeptonCompatibleWith": "Il tema Lepton è compatibile con",
    "BlackFridayDiscount": "Sconto Black Friday",
    "UpgradePaymentInfoSection_DeveloperPrice": "{0} per {1} sviluppatore/i aggiuntivo/i",
    "Upgrade": "Aggiornamento",
    "Renewal": "Rinnovo",
    "UpgradePaymentInfoSection_LicensePrice": "{0} licenza",
    "UpgradePaymentInfoSection_LicenseRenewalPrice": "Rinnovo licenza",
    "Total": "Totale",
    "SupportPolicyFaqTitle": "Qual è la vostra politica di assistenza?",
    "SupportPolicyFaqExplanation": "Supportiamo solo la versione principale attiva e quella precedente. Non garantiamo il rilascio di patch per la terza e la precedente versione principale. Ad esempio, se la versione attiva è la 7.0.0, rilasceremo patch sia per la 6.x.x che per la 7.x.x. Inoltre, forniamo supporto solo per i problemi relativi ad ABP Framework e ABP Commercial. Ciò significa che non viene fornito alcun supporto per le applicazioni di terze parti, i servizi cloud e altre librerie periferiche utilizzate dai prodotti ABP. Faremo tutto il possibile per fornire ai nostri clienti assistenza tecnica durante gli orari di lavoro ufficiali di Volosoft Bilisim A.S.. D'altra parte, non ci impegniamo a rispettare i tempi di risposta di un accordo sul livello di servizio (SLA), ma cercheremo di rispondere ai problemi tecnici il più rapidamente possibile entro i nostri orari di lavoro ufficiali. A meno che non venga stipulato un accordo speciale con il cliente, forniamo assistenza solo all'indirizzo https://support.abp.io. Disponiamo anche di un supporto privato via e-mail, disponibile solo per i titolari di licenza Enterprise.",
    "TotalDevelopers": "Totale {0} sviluppatore/i",
    "CustomPurchaseExplanation": "Su misura per le vostre esigenze specifiche",
    "WhereDidYouHearAboutUs": "Dove hai sentito parlare di noi?",
    "Twitter": "Twitter",
    "Facebook": "Facebook",
    "Youtube": "Youtube",
    "Google": "Google",
    "Github": "GitHub",
    "Friend": "Da un amico",
    "Other": "Altro",
    "WhereDidYouHearAboutUs_explain": "Specificare...",
    "DeletingMemberWarningMessage": "&quot;{0}&quot; verrà rimosso dall&#39;elenco degli sviluppatori. Se lo desideri, puoi assegnare questo posto vuoto a un altro sviluppatore in un secondo momento.",
    "AdditionalInfo": "Se le postazioni degli sviluppatori sono superiori ai tuoi requisiti, puoi ridurle. Puoi inviare un&#39;e-mail all&#39;indirizzo <a href=\"mailto:info@abp.io\">info@abp.io</a> per rimuovere alcune delle tue postazioni sviluppatore. La cancellazione delle postazioni sviluppatore non utilizzate ridurrà il costo di rinnovo della licenza. Se lo desideri, puoi riacquistare postazioni per sviluppatori aggiuntive entro il periodo di licenza attiva. Tieni presente che, poiché in questo pacchetto di licenze sono presenti {0} sviluppatori, non puoi ridurre questo numero.",
    "LinkExpiredErrorMessage": "Il collegamento a cui stai tentando di accedere è scaduto.",
    "ExpirationDate": "Data di scadenza",
    "SpringCampaignDiscount": "Sconto campagna primaverile",
    "WhyUseAbpIoPlatform": "Perché dovrei utilizzare la piattaforma ABP.IO invece di creare una nuova soluzione da zero?",
    "WhyUseAbpIoPlatformFaqExplanation": "Consulta <a href=\"/why-abp-io \">quella pagina</a> per una spiegazione dettagliata del motivo per cui l&#39;utilizzo della piattaforma ABP.IO presenta un vantaggio significativo rispetto al fare tutto da solo.",
    "EulaPageTitle": "Contratto di licenza con l&#39;utente finale (EULA)",
    "PrivacyPolicyPageTitle": "Informativa sulla privacy - Informativa sui cookie",
    "TermsConditionsPageTitle": "Termini e Condizioni",
    "TrainingsPageTitle": "Pacchetti formativi ABP",
    "ModulesPageTitle": "Moduli applicativi precostruiti ABP",
    "Volo.AbpIo.Commercial:040001": "La chiave di accesso API non è corretta.",
    "GetLepton": "Ottieni Lepton adesso",
    "MyOrganizations_Detail_LicenseStartDate": "Data di inizio della licenza",
    "MyOrganizations_Detail_LicenseExpiryDate": "Data di scadenza",
    "BlazoriseSupport": "Come posso ottenere la chiave di licenza Blazorise e il supporto dal team Blazorise?",
    "BlazoriseSupportExplanation": "Segui i passaggi seguenti per ottenere supporto dal team Blazorise e ottenere la chiave di licenza Blazorise:",
    "BlazoriseSupportExplanation1": "Registrati per un nuovo account su <a href=\"https://blazorise.com/support/register\">blazorise.com/support/register</a> con lo stesso indirizzo email del tuo account abp.io. Lasciare vuota la voce &quot;Chiave di licenza&quot;. <strong>Deve essere lo stesso indirizzo email del tuo account email su abp.io.</strong>",
    "BlazoriseSupportExplanation2": "Verifica il tuo indirizzo email controllando la tua casella di posta elettronica. Controlla la casella dello spam se non vedi un&#39;e-mail nella tua casella di posta!",
    "BlazoriseSupportExplanation3": "Accedi al sito Web di supporto Blazorise all&#39;indirizzo <a href=\"https://blazorise.com/support/login\">blazorise.com/support/login</a> .",
    "BlazoriseSupportExplanation4": "Se disponi di una licenza commerciale ABP attiva, avrai anche una licenza Blazorise PRO. Puoi ottenere la chiave di licenza Blazorise su <a href=\"https://blazorise.com/support/user/manage/license\">blazorise.com/support/user/manage/license</a> .",
    "BlazoriseSupportExplanation5": "Puoi pubblicare le tue domande sul sito Web di supporto e generare un token di prodotto per la tua applicazione.",
    "AbpLiveTrainingPackages": "Pacchetti di formazione dal vivo ABP",
    "Releases": "Rilasci",
    "ReleasesDescription": "Registri di rilascio di ABP Commercial.",
    "ReleaseDate": "Data di rilascio",
    "Labels": "Etichette",
    "PreRelease": "Pre-release",
    "AllTypes": "Tutti i tipi",
    "Enhancement": "Aumento",
    "Bug": "Insetto",
    "Feature": "Caratteristica",
    "AllUIs": "Tutte le interfacce utente",
    "MVC": "MVC",
    "BlazorServer": "Blazer Server",
    "MAUI": "MAUI",
    "HowItWorks_Page_Title": "Come funziona?",
    "HowItWorks_Page_Description": "ABP Framework estende la piattaforma .NET. Quindi, tutto ciò che puoi fare con una semplice soluzione .NET è già possibile con ABP Framework. Ciò rende facile iniziare con una curva di apprendimento bassa.",
    "HowItWorks_Description1": "ABP Framework estende la piattaforma .NET. Quindi, tutto ciò che puoi fare con una semplice soluzione .NET è già possibile con ABP Framework. Ciò rende facile iniziare con una curva di apprendimento bassa.",
    "HowItWorks_Description2": "Una volta che inizi ad apprendere e ad utilizzare le funzionalità di ABP Framework, sviluppare il tuo software sarà molto più divertente che mai.",
    "HowItWorks_Description3": "Questa pagina spiega sostanzialmente come utilizzare la piattaforma ABP.IO come sviluppatore .NET.",
    "CreateANewSolution": "Creare una nuova soluzione .NET",
    "CreateANewSolution_Description1": "Tutto inizia creando una nuova soluzione .NET integrata ABP.",
    "StartWithStartupTemplates": "Avvia uno dei <a href=\"/startup-templates\">modelli di soluzioni di avvio</a> predefiniti",
    "SimpleMonolithApplicationTemplate": "Modello semplice per l&#39;applicazione del monolite",
    "LayeredApplicationTemplate": "Modello di applicazione a più livelli",
    "MicroserviceSolutionTemplate": "Modello di soluzione di microservizi",
    "CreateEmptySolutionAndUseAbp": "Oppure crea una nuova soluzione .NET vuota e installa tu stesso <a href=\"https://abp.io/packages\" target=\"_blank\">i pacchetti</a> ABP NuGet e NPM.",
    "CreatingSolutionWithMultipleOptions": "Sono disponibili più opzioni di interfaccia utente e database durante la creazione di una nuova soluzione.",
    "UIFrameworkOptions": "Opzioni del quadro dell&#39;interfaccia utente",
    "DotnetSolutionWithoutDependency": "Ora hai una normale soluzione .NET nel tuo computer locale che non ha alcuna dipendenza da una piattaforma cloud o da un servizio esterno.",
    "CheckTheDocumentForDetails": "Puoi controllare il documento <a href=\"{0}\" target=\"_blank\">{1}</a> per i dettagli.",
    "UIAndDatabaseIndependent": "ABP può funzionare con qualsiasi interfaccia utente e qualsiasi provider di database supportato da .NET. \n Tuttavia, questi provider di interfaccia utente e database sono preintegrati e ben documentati.",
    "InstallAbpModules": "Installare i moduli ABP",
    "DevelopYourSolution": "Sviluppa la tua soluzione",
    "DeployAnywhere": "Distribuisci ovunque",
    "InstallAbpModule_Description1": "ABP è un framework di sviluppo di applicazioni modulare. I modelli di soluzioni di avvio vengono già forniti con i moduli essenziali installati. \n Ma ci sono più moduli applicativi che potresti voler utilizzare nella tua soluzione.",
    "InstallAbpModule_Description2": "Ogni modulo è costituito da alcuni pacchetti NuGet e NPM e dispone di un documento di installazione. <a href=\"/tools/suite\">ABP Suite</a> esegue la maggior parte del lavoro automaticamente, quindi tu configuri o ottimizzi manualmente il modulo in base alla sua documentazione.",
    "DevelopYourSolution_Description1": "L&#39;infrastruttura di ABP ti consente <b class=\"text-white\">di concentrarti sul tuo codice aziendale</b> automatizzando il lavoro ripetitivo e fornendo infrastrutture e <a href=\"https://abp.io/features\" target=\"_blank\">funzionalità</a> applicative predefinite.",
    "DevelopYourSolution_Description2": "Nel seguente blocco di codice puoi vedere come ABP Framework si integra perfettamente nel tuo codice e automatizza le attività ripetitive per te.",
    "DevelopYourSolution_Description3": "Anche in questo blocco di shortcode, ABP fa molte cose per te.",
    "DevelopYourSolution_Description4": "Fornisce classi base per applicare convenzioni, come <a href=\"https://docs.abp.io/en/abp/latest/Dependency-Injection\" target=\"_blank\">l&#39;inserimento delle dipendenze</a> \n . I servizi <a href=\"https://docs.abp.io/en/abp/latest/Repositories\" target=\"_blank\">di repository</a> generici \n forniscono un modo pratico \n per interagire con il database. <a href=\"https://docs.abp.io/en/abp/latest/Authorization\" target=\"_blank\">L&#39;autorizzazione</a> dichiarativa \n funziona con un sistema di autorizzazione ottimizzato.",
    "DevelopYourSolution_Description5": "ABP automatizza completamente <a href=\"https://docs.abp.io/en/abp/latest/Unit-Of-Work\" target=\"_blank\">l&#39;unità di lavoro</a> \n (per la connessione al database e la gestione delle transazioni), <a href=\"https://docs.abp.io/en/abp/latest/Exception-Handling\" target=\"_blank\">la gestione delle eccezioni</a> \n , <a href=\"https://docs.abp.io/en/abp/latest/Validation\" target=\"_blank\">la convalida</a> \n \n e <a href=\"https://docs.abp.io/en/abp/latest/Audit-Logging\" target=\"_blank\">la registrazione di controllo</a> . Fornisce molti altri elementi costitutivi per semplificare le attività di sviluppo quotidiane e concentrarsi sul proprio codice durante la creazione di applicazioni \n pronte per la produzione.",
    "DevelopYourSolution_Description6": "Puoi immaginare quanto quel blocco di codice possa essere lungo e complicato se lo facessi tutto manualmente.",
    "SuiteCrudGenerationInFewSeconds": "Oltre a codificare manualmente la tua soluzione, puoi creare pagine CRUD avanzate perfettamente funzionanti in pochi minuti utilizzando gli strumenti ABP Suite. Genera il codice nella tua soluzione, così puoi ottimizzarlo in base ai tuoi requisiti personalizzati.",
    "DeployAnywhere_Description1": "Alla fine, hai una soluzione .NET pura. Puoi distribuire la tua soluzione sul tuo server, su una piattaforma cloud, su Kubernetes o ovunque tu voglia. Puoi eseguire la distribuzione su tutti i server che desideri. ABP è uno strumento indipendente dall&#39;ambiente di distribuzione.",
    "ExpertiseAbpFramework": "Conoscere il quadro ABP",
    "ExpertiseAbpFramework_Description1": "Vuoi andare oltre le nozioni di base e acquisire esperienza con la piattaforma ABP.IO?",
    "FreeDownload": "Download gratuito",
    "Read": "Leggere",
    "HavingTrouble": "Avere problemi?",
    "HavingTrouble_Description1": "Hai problemi con lo sviluppo della tua soluzione? Siamo qui! Utilizza la piattaforma di supporto ABP \n o invia un&#39;e-mail per ottenere assistenza direttamente dai membri del team Core ABP Framework.",
    "WeAreHereToHelp_Description1": "Puoi sfogliare i nostri argomenti della guida o effettuare una ricerca nelle domande frequenti, \n oppure puoi farci una domanda utilizzando il modulo di contatto.",
    "OtherModules": "Altri moduli",
    "OtherModules_Description1": "Account, registrazione degli audit, chat, kit CMS, gestione dei file, moduli, GDPR, identità, gestione della lingua, pagamenti, Saas e altro...",
    "HowItWorks_DatabaseProviderOptions": "Opzioni del provider di database",
    "SeeFAQ": "Vedi le domande frequenti",
    "ReleaseLogs": "Registri di rilascio",
    "ReleaseLogs_Tag": "{0} registri di rilascio",
    "ReleaseLogs_Pr": "Richiesta pull n. {0} - {1}",
    "NoLabels": "Nessuna etichetta",
    "DoesTheSubscriptionRenewAutomatically": "L&#39;abbonamento si rinnova automaticamente?",
    "DoesTheSubscriptionRenewAutomaticallyExplanation": "L&#39;ABP Commercial non dispone di un modello di fatturazione con rinnovo automatico. Pertanto <strong>il tuo abbonamento non verrà rinnovato automaticamente</strong> alla fine del periodo di licenza. Se vuoi continuare ad usufruire dei vantaggi di ABP Commercial, devi rinnovarlo manualmente nella <a href=\"/my-organizations\">pagina di gestione dell&#39;organizzazione</a> . Se disponi di più organizzazioni, fai clic sul pulsante &quot;Gestisci&quot; presso l&#39;organizzazione in scadenza, quindi fai clic sul pulsante &quot;Estendi ora&quot; per rinnovare la licenza. Potresti anche dare un&#39;occhiata alla <a href=\"/faq#what-happens-when-license-ends\">sezione Cosa succede quando scade la mia licenza?</a> sezione.",
    "ExtraQuestionCreditsFaqTitle": "Posso acquistare crediti aggiuntivi per le domande di supporto?",
    "ExtraQuestionCreditsFaqExplanation": "Si, puoi. Per acquistare crediti per domande extra, invia un&#39;e-mail a <a href=\"mailto:info@abp.io\">info@abp.io</a> con il nome della tua organizzazione. Ecco il listino prezzi per i crediti di domanda extra:<ul><li> Pacchetto da 50 domande $ 999</li><li> Pacchetto da 25 domande $ 625</li><li> Pacchetto da 15 domande $ 450</li></ul>",
    "AlreadyBetaTester": "Hai già aderito al programma beta tester.",
    "AbpStudio": "Studio ABP",
    "AbpStudio_Description": "ABP Studio è ancora in fase di sviluppo. Puoi compilare il modulo sottostante per essere uno dei primi utenti.",
    "AbpStudio_Description1": "ABP Studio è <span class=\"text-highlight-white\">un&#39;applicazione desktop multipiattaforma</span> per sviluppatori ABP.",
    "AbpStudio_Description2": "È <span class=\"text-highlight-white\">ben integrato</span> nel framework ABP e mira a fornire un ambiente di sviluppo confortevole <span class=\"text-highlight-white\">automatizzando le cose, fornendo approfondimenti</span> sulla tua soluzione, rendendo molto più semplice <span class=\"text-highlight-white\">lo sviluppo, l&#39;esecuzione</span> e <span class=\"text-highlight-white\">la distribuzione</span> delle tue soluzioni.",
    "AbpStudio_ComingSoon": "Prossimamente <span class=\"opacity-50 ms-0 ms-md-3 d-block d-md-inline-block \">Data di rilascio della beta prevista: quarto trimestre del 2023.</span>",
    "AbpStudio_PlannedPreviewDate": "Data di rilascio dell&#39;anteprima prevista: quarto trimestre del 2023.",
    "BetaRequest": "Richiesta beta",
    "CreateNewSolutions": "Creare nuove soluzioni",
    "CreateNewSolutions_Description1": "Puoi creare facilmente da semplici applicazioni a soluzioni modulari monolitiche o di microservizi con molte opzioni. Ottieni una soluzione software di base completa e pronta per la produzione per la tua azienda.",
    "ArchitectYourSolutions": "Progetta le tue soluzioni",
    "ArchitectYourSolutions_Description1": "Costruisci più facilmente strutture di soluzioni monolite-modulari e di microservizi creando moduli o servizi e stabilendo relazioni tra loro. È inoltre possibile installare o disinstallare moduli applicativi predefiniti.",
    "ExploreYourSolution": "Esplora la tua soluzione",
    "ExploreYourSolution_Description1": "ABP Studio mostra una visualizzazione di alto livello dei componenti della soluzione e dei moduli da cui dipende la soluzione. Puoi esplorare entità, servizi, API HTTP e molto altro senza dover aprire la codebase.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze": "Esegui soluzioni multi-applicazione o microservizi in un batter d&#39;occhio",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description1": "Esegui uno, <span class=\"text-highlight-white\">più</span> o <span class=\"text-highlight-white\">tutti i servizi</span> con un solo clic. In questo modo è molto semplice arrestare un servizio, eseguirlo in Visual Studio per <span class=\"text-highlight-white\">testarlo</span> o <span class=\"text-highlight-white\">eseguire il debug</span> .",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description2": "Visualizza un elenco di servizi, visualizza <span class=\"text-highlight-white\">la richiesta HTTP in tempo reale</span> e <span class=\"text-highlight-white\">il conteggio delle eccezioni</span> per ciascun servizio.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description3": "Visualizza tutti i dettagli di tutte <span class=\"text-highlight-white\">le richieste HTTP</span> che arrivano a qualsiasi servizio.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description4": "Esplora <span class=\"text-highlight-white\">i dettagli delle eccezioni</span> in tempo reale in qualsiasi servizio, filtra e cerca facilmente.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description5": "Mostra i <span class=\"text-highlight-white\">registri dell&#39;applicazione</span> , filtra per livello di registro o cerca per testo.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description6": "<span class=\"text-highlight-white\">Sfoglia</span> l&#39;interfaccia utente della tua applicazione senza uscire dal solution runner.",
    "IntegrateToYourKubernetesCluster": "Integrazione nel tuo cluster Kubernetes",
    "IntegrateToYourKubernetesCluster_Description1": "<span class=\"text-highlight-white\">Connetti il tuo ambiente di sviluppo locale a un cluster Kubernetes locale o remoto</span> , dove il cluster esegue già la tua soluzione di microservizi.",
    "IntegrateToYourKubernetesCluster_Description2": "Accedi a qualsiasi servizio in Kubernetes con il nome del servizio come DNS, proprio come se fossero in esecuzione sul tuo computer locale.",
    "IntegrateToYourKubernetesCluster_Description3": "<span class=\"text-highlight-white\">Intercetta qualsiasi servizio</span> in quel cluster, quindi tutto il <span class=\"text-highlight-white\">traffico verso il servizio intercettato viene automaticamente reindirizzato al tuo servizio</span> in esecuzione sul tuo computer locale. Quando il tuo servizio deve utilizzare un servizio in Kubernetes, il traffico viene reindirizzato al cluster, proprio come il tuo servizio locale è in esecuzione all&#39;interno di Kubernetes.",
    "GetInformed": "Informati",
    "Studio_GetInformed_Description1": "Lascia le tue informazioni di contatto per <span class=\"text-highlight-white\">informarti</span> e <span class=\"text-highlight-white\">provarlo prima</span> quando ABP Studio sarà lanciato.",
    "Studio_GetInformed_Description2": "Data di rilascio dell&#39;anteprima prevista: terzo trimestre del 2023.",
    "ThankYou!": "Grazie!",
    "SendBetaRequest": "Invia richiesta beta",
    "YouJoinedTheBetaTesterProgram": "Ti sei iscritto al programma beta tester di ABP Studio.",
    "PricingExplanation2": "Garanzia di rimborso di 30 giorni: <a href=\"/faq#refund-policy\">scopri di più</a>",
    "MoneyBackGuaranteeText": "* Garanzia di rimborso di 30 giorni su tutte le licenze! Rimborso del 100% sulle licenze Team, rimborso del 60% sulle licenze Business ed Enterprise entro 30 giorni.",
    "MobileApplicationStartupTemplates": "Modelli di avvio di applicazioni mobili",
    "MobileApplicationStartupTemplates_Description1": "Modelli di avvio di applicazioni mobili integrati per le tue soluzioni commerciali ABP.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates": "Crea potenti applicazioni line-of-business utilizzando i modelli di avvio mobile ABP",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description1": "ABP Commercial fornisce due modelli di avvio di applicazioni mobili implementati con <span class=\"text-highlight\">React Native</span> e <span class=\"text-highlight\">.NET MAUI.</span> Quando crei la tua nuova soluzione basata su ABP, avrai anche applicazioni di avvio di base collegate alle tue API back-end.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description2": "L&#39;applicazione dispone di un ciclo di token di autenticazione predefinito, <span class=\"text-highlight\">supporto multilingue, supporto multi-tenancy, accesso, password dimenticata, gestione del profilo e una pagina di gestione degli utenti</span> . Puoi aggiungere la tua logica aziendale e personalizzarla in base alle tue esigenze.",
    "TwoFrameworkOptions": "Due opzioni quadro",
    "TwoFrameworkOptions_Description": "ABP fornisce modelli di avvio mobile sia <span class=\"text-highlight\">React Native</span> che <span class=\"text-highlight\">.NET MAUI</span> . In questo modo potrai scegliere quello più adatto alle tue esigenze. Entrambe le app riutilizzano il codice alla massima velocità tra le piattaforme iOS e Android.",
    "PreIntegratedToYourBackend": "Preintegrato nel tuo backend",
    "PreIntegratedToYourBackend_Description": "Le applicazioni ABP Mobile sono preintegrate nelle API di backend. Ottiene un token di autenticazione valido dal server ed effettua richieste autenticate.",
    "MultiLanguage": "Multi lingua",
    "MultiLanguage_Description": "Supporta già più di 10 lingue pronte all&#39;uso. Puoi anche aggiungere le lingue successive.",
    "Arabic": "Arabo",
    "Czech": "ceco",
    "English": "Inglese",
    "Hungarian": "ungherese",
    "Finnish": "finlandese",
    "French": "francese",
    "Hindi": "hindi",
    "Portuguese": "portoghese",
    "Italian": "Italiano",
    "Russian": "russo",
    "Slovak": "slovacco",
    "Turkish": "Turco",
    "EngageAndRetainYourCustomersWithABPMobileApps": "Coinvolgi e fidelizza i tuoi clienti con le app mobili ABP",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description1": "I tuoi clienti desiderano gestire i propri prodotti e abbonamenti ovunque e in qualsiasi momento. Ciò richiede alle organizzazioni di creare app mobili che consentano ai clienti di soddisfare le loro richieste in modo rapido e senza intoppi.",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description2": "Con le app ABP Mobile puoi creare app mobili native di alta qualità per Android e iOS... utilizzando un&#39;unica base di codice e senza compromettere la sicurezza, la qualità o la scalabilità.",
    "OneCodeBaseMultipleDevices": "Una codebase, più dispositivi",
    "OneCodeBaseMultipleDevices_Description": "Le applicazioni ABP Mobile sono multipiattaforma. Sono pronti per essere installati ed eseguiti su dispositivi iOS e Android e si adattano a diversi fattori di forma utilizzando un&#39;unica base di codice. Gli sviluppatori devono creare l&#39;interfaccia utente e il codice front-end solo una volta, non è necessario adattare il codice per ciascun dispositivo che desideri supportare.",
    "ComesWithTheSourceCode": "Viene fornito con il codice sorgente",
    "ComesWithTheSourceCode_Description": "Le app mobili vengono fornite con il codice sorgente. Personalizza facilmente l&#39;UX/UI delle tue app per soddisfare le linee guida sul branding.",
    "Purchase_OneYearPrice": "Prezzo 1 anno",
    "Purchase_DeveloperSeatCount": "Conteggio posti per sviluppatore",
    "Purchase_DevelopersAlreadyIncluded": "{0} sviluppatori già inclusi",
    "1Year": "1 anno",
    "{0}Years": "{0} anni",
    "1YearLicense": "Licenza di 1 anno",
    "{0}YearsLicense": "{0} anni di licenza",
    "1AdditionalDeveloper": "1 sviluppatore aggiuntivo",
    "{0}AdditionalDevelopers": "{0} sviluppatori aggiuntivi",
    "Discount": "Sconto ({0}%)",
    "Summary": "Riepilogo",
    "TrainingPack": "Pacchetto di formazione",
    "TrainingPackDiscount": "Sconto sul pacchetto formativo",
    "Purchase_OnboardingTraining_Description": "Questo pacchetto di formazione dal vivo è valido per una classe di 8 studenti e questo sconto è valido solo se acquistato con la nuova licenza. <a href=\"{0}\" class=\"text-white\">Saperne di più<i class=\"fa fa-external-link ms-1\"></i></a>",
    "Purchase_Save": "{0}% <span class=\"save ms-1\">di risparmio su {1} {2}</span>",
    "RemoveBasket": "Rimuovi dal carrello",
    "WhyABPIOPlatform?": "Perché <span class=\"gradient-commercial\">la piattaforma ABP.IO</span> ?",
    "DocumentAim": "Questo documento mira a rispondere alla grande domanda:",
    "DocumentAim_Description": "&quot;Perché dovresti utilizzare la piattaforma ABP.IO invece di creare una nuova soluzione da zero?&quot;",
    "DocumentAim_Description2": "Il documento presenta le sfide legate alla creazione di una soluzione software moderna e spiega come ABP affronta queste sfide.",
    "CreatingANewSolution": "Creazione di una nuova soluzione",
    "CreatingANewSolution_Description": "Quando devi avviare una nuova soluzione, ci sono molte domande che devi porti e dovresti dedicare molto tempo prima di iniziare a scrivere il tuo primo codice aziendale.",
    "CreatingAnEmptySolution": "Creazione di una soluzione vuota",
    "THEPROBLEM": "IL PROBLEMA",
    "CreatingAnEmptySolution_THEPROBLEM_Description": "Anche creare una soluzione quasi vuota è impegnativo;",
    "CreatingAnEmptySolution_THEPROBLEM_Description2": "Come organizzi la tua base di codice tra i progetti?",
    "CreatingAnEmptySolution_THEPROBLEM_Description3": "Cosa sono gli strati e come interagiscono?",
    "CreatingAnEmptySolution_THEPROBLEM_Description4": "Come si integra con librerie e sistemi di terze parti?",
    "CreatingAnEmptySolution_THEPROBLEM_Description5": "Come impostare i test automatizzati?",
    "ABPSOLUTION": "SOLUZIONE ABP",
    "CreatingAnEmptySolution_ABPSOLUTION_Description": "ABP fornisce una <a href=\"https://docs.abp.io/en/abp/latest/Startup-Templates/Application\" target=\"_blank\">soluzione di avvio</a> ben architettata, a più livelli e pronta per la produzione basata sui principi <a href=\"https://docs.abp.io/en/abp/latest/Domain-Driven-Design\" target=\"_blank\">di Domain Driven Design</a> . La soluzione include anche un&#39;unità preconfigurata e progetti <a href=\"https://docs.abp.io/en/abp/latest/Testing\" target=\"_blank\">di test</a> di integrazione per ciascun livello.",
    "CommonLibraries": "Biblioteche comuni",
    "CommonLibraries_THEPROBLEM_Description": "Quali librerie dovresti utilizzare per implementare i requisiti comuni? L&#39;ecosistema di sviluppo software è altamente dinamico, il che rende difficile tenere il passo con gli strumenti, le librerie, le tendenze e gli approcci più recenti.",
    "CommonLibraries_ABPSOLUTION_Description": "ABP preintegra nella soluzione librerie popolari, mature e aggiornate. Non è necessario perdere tempo a integrarli o a farli comunicare tra loro. Funzionano correttamente fuori dalla scatola.",
    "UITheme&Layout": "Tema e layout dell&#39;interfaccia utente",
    "UITheme&Layout_THEPROBLEM_Description": "Quando si affrontano i problemi dell&#39;interfaccia utente, emergono una serie di sfide. Questi includono la creazione delle basi per un kit di interfaccia utente reattivo, contemporaneo e adattabile con un aspetto coerente e una serie di funzionalità come menu di navigazione, intestazioni, barre degli strumenti, piè di pagina, widget e altro ancora.",
    "UITheme&Layout_THEPROBLEM_Description2": "Anche se opti per un tema predefinito, integrarlo perfettamente nel tuo progetto potrebbe richiedere giorni di sviluppo. Un ulteriore ostacolo risiede nell’aggiornamento di tali temi. Spesso, la struttura HTML/CSS del tema si intreccia con il codice dell&#39;interfaccia utente, rendendo complesse le future modifiche al tema o gli aggiornamenti. Questo intreccio di codice e progettazione complica la flessibilità di apportare modifiche su tutta la linea.",
    "UITheme&Layout_ABPSOLUTION_Description": "ABP Framework offre un sistema di temi distintivo che libera il codice dell&#39;interfaccia utente dai vincoli del tema. I temi esistono isolatamente, confezionati come pacchetti NuGet o NPM, rendendo l&#39;installazione o gli aggiornamenti dei temi una questione di minuti. Pur mantenendo la possibilità di sviluppare il tuo tema personalizzato o integrarne uno esistente, ABP Commercial presenta una raccolta di temi raffinati e contemporanei.",
    "UITheme&Layout_ABPSOLUTION_Description2": "Inoltre, ci sono fornitori di componenti dell&#39;interfaccia utente come Telerik e DevExpress. Tuttavia, questi fornitori forniscono principalmente singoli componenti, affidando a te l&#39;onere di stabilire il tuo sistema di layout. Quando lavori all&#39;interno di progetti basati su ABP, puoi incorporare facilmente queste librerie, in modo simile a come faresti in qualsiasi altro progetto.",
    "TestInfrastructure": "Testare l&#39;infrastruttura",
    "TestInfrastructure_THEPROBLEM_Description": "Stabilire un ambiente di test robusto è un’impresa che richiede tempo. Si tratta di impostare progetti di test dedicati all&#39;interno della soluzione, selezionare attentamente gli strumenti necessari, creare simulazioni di servizi e database, creare classi base essenziali e servizi di utilità per ridurre al minimo il codice ridondante nei test e affrontare varie attività correlate.",
    "TestInfrastructure_ABPSOLUTION_Description": "I modelli di avvio ABP arrivano pre-equipaggiati con progetti di test configurati, semplificando il processo per te. Ciò significa che fin dal primo giorno puoi iniziare a scrivere il codice del test unitario o di integrazione iniziale senza ritardi.",
    "CodingStandards&Training": "Standard di codifica e formazione",
    "CodingStandards&Training_THEPROBLEM_Description": "Dopo aver impostato la soluzione per lo sviluppo, di solito devi insegnare agli sviluppatori come funziona il sistema e come costruirlo utilizzando gli stessi metodi concordati. Anche se si fornisce loro una formazione, mantenere aggiornata la documentazione può essere difficile. Col passare del tempo, ogni sviluppatore potrebbe scrivere il codice a modo suo, facendo sì che le regole per la scrittura del codice diventino diverse l&#39;una dall&#39;altra.",
    "CodingStandards&Training_ABPSOLUTION_Description": "La soluzione ABP è già ben organizzata e presenta spiegazioni chiare. Tutorial e guide passo passo ti mostrano esattamente come lavorare su un progetto ABP.",
    "KeepingYourSolutionUpToDate": "Mantieni la tua soluzione aggiornata",
    "KeepingYourSolutionUpToDate_THEPROBLEM_Description": "Dopo aver iniziato lo sviluppo, devi tenere traccia delle nuove versioni delle librerie che utilizzi per aggiornamenti e patch.",
    "KeepingYourSolutionUpToDate_ABPSOLUTION_Description": "Aggiorniamo regolarmente tutti i pacchetti alle versioni più recenti e li testiamo prima del rilascio stabile. Quando aggiorni il framework ABP, tutte le sue dipendenze vengono aggiornate alla tecnologia edge.",
    "DRY": "Non ripeterti!",
    "DRY_Description": "La creazione di una soluzione di base richiede molto tempo e una buona esperienza architetturale. Tuttavia, questo è solo l’inizio! Quando inizi a sviluppare, probabilmente dovrai scrivere molto codice ripetitivo; sarebbe fantastico se tutto questo potesse essere gestito automaticamente.",
    "DRY_Description2": "ABP automatizza e semplifica il più possibile la ripetizione del codice seguendo la convenzione sul principio di configurazione. Tuttavia, non ti limita quando devi passare alla marcia manuale. Il controllo è sempre nelle tue mani.",
    "Authentication": "Autenticazione",
    "Authentication_THEPROBLEM_Description": "Single Sign On, integrazione Active Directory/LDAP, integrazione OpenIddict, accessi social, autenticazione a due fattori, password dimenticata/reimpostata, attivazione e-mail, registrazione di nuovi utenti, controllo della complessità della password, blocco dell&#39;account in caso di tentativi falliti, visualizzazione dei tentativi di accesso falliti... ecc. Sappiamo che tutti questi requisiti generici ti sono familiari. Non sei solo!",
    "Authentication_ABPSOLUTION_Description": "ABP Framework e la versione commerciale forniscono tutti questi elementi standard pre-implementati per te come modulo di account riutilizzabile. Devi solo abilitare e configurare ciò di cui hai bisogno.",
    "CrossCuttingConcerns": "Preoccupazioni trasversali",
    "CrossCuttingConcerns_THEPROBLEM_Description": "Le preoccupazioni trasversali rappresentano la logica ripetitiva fondamentale che dovrebbe essere implementata per ciascun caso d&#39;uso. Qualche esempio;",
    "CrossCuttingConcerns_THEPROBLEM_Description2": "Avvio delle transazioni, impegno in caso di successo e ripristino degli errori.",
    "CrossCuttingConcerns_THEPROBLEM_Description3": "Gestione e segnalazione delle eccezioni, restituzione di una risposta di errore adeguata ai client e gestione dei casi di errore sul lato client.",
    "CrossCuttingConcerns_THEPROBLEM_Description4": "Implementare l&#39;autorizzazione e la convalida, restituire risposte adeguate e gestirle dal lato client.",
    "CrossCuttingConcerns_ABPSOLUTION_Description": "ABP Framework automatizza o semplifica tutte le preoccupazioni trasversali comuni. Tu scrivi solo il codice che conta per la tua azienda e ABP gestisce il resto secondo le convenzioni.",
    "ArchitecturalInfrastructure": "Infrastrutture architettoniche",
    "ArchitecturalInfrastructure_THEPROBLEM_Description": "In genere è necessario creare un&#39;infrastruttura per implementare correttamente la propria architettura. Ad esempio, in genere si implementa il modello Repository. Si definiscono alcune classi base da semplificare e standardizzare per creare entità, servizi, controller e altri oggetti.",
    "ArchitecturalInfrastructure_ABPSOLUTION_Description": "ABP Framework fornisce tutto questo e altro ancora immediatamente. È maturo e ben documentato.",
    "EnterpriseApplicationRequirements": "Requisiti dell&#39;applicazione aziendale",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description": "Esistono molti requisiti che implementi ripetutamente in ogni applicazione aziendale;",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description2": "Sistema di permessi dettagliato e gestione dei permessi sull&#39;interfaccia utente in base a ruoli e utenti.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description3": "Scrittura di log di controllo e cronologie delle entità per tenere traccia di quando un utente modifica un record del database.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description4": "Rendi le tue entità eliminabili temporaneamente, in modo che vengano contrassegnate come eliminate invece di essere eliminate fisicamente dal database e filtrare automaticamente le entità eliminate nelle tue query.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description5": "Creazione di astrazioni e wrapper per utilizzare le tue API backend dal codice frontend.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description6": "Accodamento ed esecuzione di lavori in background.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description7": "Gestire più fusi orari in un sistema globale.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description8": "Condivisione della logica di validazione, localizzazione, autorizzazione tra server e client.",
    "EnterpriseApplicationRequirements_ABPSOLUTION_Description": "ABP fornisce un&#39;infrastruttura per implementare facilmente tali requisiti. Ancora una volta, non spendi il tuo tempo prezioso per reimplementare tutto questo ancora e ancora.",
    "GeneratingInitialCode&Tooling": "Generazione di codice e strumenti iniziali",
    "GeneratingInitialCode&Tooling_THEPROBLEM_Description": "Costruirai molte pagine simili in una tipica applicazione web. La maggior parte di essi eseguirà operazioni CRUD simili. È molto noioso e soggetto a errori creare ripetutamente tali pagine.",
    "GeneratingInitialCode&Tooling_ABPSOLUTION_Description": "<a href=\"/tools/suite\">ABP Suite</a> può generare una pagina CRUD full-stack per le tue entità in pochi secondi. Il codice generato è stratificato e pulito. Vengono implementati tutti i requisiti standard di convalida e autorizzazione. Inoltre, vengono generate classi di test unitari. Una volta ottenuta una pagina completamente funzionante, puoi modificarla in base alle tue esigenze aziendali.",
    "IntegratingTo3rdPartyLibrariesAndSystems": "Integrazione con librerie e sistemi di terze parti",
    "IntegratingTo3rdPartyLibrariesAndSystems_THEPROBLEM_Description": "La maggior parte delle librerie sono progettate di basso livello e in genere è necessario eseguire del lavoro per integrarle correttamente senza ripetere lo stesso codice di integrazione e configurazione ovunque nella soluzione. Si supponga, ad esempio, che sia necessario utilizzare RabbitMQ per implementare il bus di eventi distribuito. Tutto quello che vuoi fare è; inviare un messaggio a una coda e gestire i messaggi in arrivo. Ma è necessario comprendere i modelli di messaggistica, le code e i dettagli di scambio. Per scrivere codice efficiente, è necessario creare un pool per gestire connessioni, client e canali. È inoltre necessario gestire eccezioni, messaggi ACK, riconnessione a RabbitMQ in caso di errori e altro ancora.",
    "IntegratingTo3rdPartyLibrariesAndSystems_ABPSOLUTION_Description": "Ad esempio, l&#39;integrazione RabbitMQ Distributed Event Bus di ABP astrae tutti questi dettagli. Invii e ricevi messaggi senza trambusto. Hai bisogno di scrivere codice di basso livello? Nessun problema, puoi sempre farlo. ABP non ti limita quando devi utilizzare le funzionalità di basso livello della libreria che stai utilizzando.",
    "WhyNotBuildYourOwnFramework?": "Perché non costruire il tuo framework?",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description": "Tutta l&#39;infrastruttura, anche nel modo più semplice, richiede molto tempo per essere costruita, mantenuta e documentata. Diventa più grande nel tempo e diventa difficile mantenerlo nella soluzione. Separarli in un progetto riutilizzabile è il punto di partenza per costruire la propria struttura interna.",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description2": "Costruire, documentare, formare e mantenere una struttura interna è davvero difficile. Se non disponi di un team di framework esperto e dedicato, il tuo framework interno diventa rapidamente un codice legacy non documentato che nessuno può più comprendere e mantenere. D&#39;altra parte, questi framework sono generalmente sviluppati da uno o due sviluppatori nel team. E questi ragazzi stanno diventando un silo di conoscenza. È un bene per loro ma un male per l&#39;azienda perché sono l&#39;unico punto di fallimento del progetto <a href=\"https://en.wikipedia.org/wiki/Single_point_of_failure\">-SPOF-</a> . Una volta che lasciano l&#39;azienda, il progetto fallisce drasticamente.",
    "WhyNotBuildYourOwnFramework_ABPSOLUTION_Description": "ABP Framework è un framework applicativo guidato dalla comunità, ben documentato, maturo e generico. Un team di sviluppatori di grande esperienza sta lavorando duramente per mantenerlo aggiornato, facile da capire e comodo da usare. L&#39;utilizzo di un framework così stabile ti consente di concentrarti sul tuo codice aziendale e di ottenere aiuto con il framework da esperti ogni volta che ne hai bisogno.",
    "ArchitecturalInfrastructure_Description": "Le applicazioni SaaS, i sistemi modulari o i microservizi sono i modelli software aziendali più utilizzati. Costruire tali sistemi non richiede solo una buona conoscenza ed esperienza, ma richiede anche una solida infrastruttura software. Altrimenti, ti ritroverai a spendere un grande sforzo per supportare questi dettagli architettonici nella tua base di codice.",
    "Modularity": "Modularità",
    "Modularity_THEPROBLEM_Description": "Costruire un sistema veramente modulare non è facile! Tutti gli aspetti del sistema (database, entità, API, pagine/componenti dell&#39;interfaccia utente) possono essere suddivisi in moduli e ogni modulo può essere riutilizzabile senza altri. Il semplice ASP.NET Core non fornisce un&#39;architettura così modulare. Se ne hai bisogno, dovresti pensarci da zero.",
    "Modularity_ABPSOLUTION_Description": "Il Framework ABP nasce per essere una struttura modulare di sviluppo applicativo. Ogni funzionalità del framework è sviluppata per essere compatibile con la modularità. La documentazione e le guide spiegano come sviluppare moduli riutilizzabili in modo standard.",
    "SaaSMultiTenancy": "SaaS/multi-tenant",
    "SaaSMultiTenancy_THEPROBLEM_Description": "<a href=\"https://docs.abp.io/en/abp/latest/Multi-Tenancy\">La multi-tenancy</a> è un modo comune per implementare i sistemi SaaS. Tuttavia, l’implementazione di un’infrastruttura multi-tenant coerente può diventare complicata.",
    "SaaSMultiTenancy_ABPSOLUTION_Description": "ABP Framework fornisce un&#39;infrastruttura multi-tenant completa e la complessità astratta dal codice aziendale. Il codice dell&#39;applicazione sarà per lo più multi-tenant, mentre ABP Framework isolerà automaticamente il database, la cache e altri dettagli dei tenant gli uni dagli altri. Supporta database singolo, database per tenant e approcci ibridi. Configura correttamente le librerie come Microsoft Identity e OpenIddict, che normalmente non sono compatibili con multi-tenancy.",
    "Microservices": "Microservizi",
    "Microservices_THEPROBLEM_Description": "La creazione di un sistema di microservizi richiede molti dettagli dell&#39;infrastruttura: l&#39;autenticazione e l&#39;autorizzazione di applicazioni e microservizi e l&#39;implementazione di messaggistica asincrona e modelli di comunicazione sincroni (Rest/GRPC) tra i microservizi sono le questioni fondamentali.",
    "Microservices_ABPSOLUTION_Description": "Il framework ABP fornisce servizi, <a href=\"https://docs.abp.io/en/abp/latest/Microservice-Architecture\" target=\"_blank\">guide</a> ed esempi per aiutarti a implementare la tua soluzione di microservizi utilizzando gli strumenti standard del settore.",
    "Microservices_ABPSOLUTION_Description2": "ABP Commercial fa un ulteriore passo avanti e fornisce un <a href=\"https://docs.abp.io/en/commercial/latest/startup-templates/microservice/index\" target=\"_blank\">modello di avvio</a> completo per avviare la tua soluzione di microservizi.",
    "PreBuiltModules": "Moduli precostruiti",
    "PreBuiltModules_THEPROBLEM_Description": "Tutti noi abbiamo esigenze aziendali simili ma leggermente diverse. Tuttavia, dovremmo tutti reinventare la ruota poiché il codice di nessuno può funzionare direttamente nella nostra soluzione. Sono tutte parti integrate di una soluzione più ampia.",
    "PreBuiltModules_ABPSOLUTION_Description": "<a href=\"/modules\">I moduli</a> ABP Commercial forniscono molti moduli applicativi riutilizzabili come pagamento, chat, gestione dei file, reporting del registro di controllo... ecc. Tutti questi moduli sono facilmente installabili nella tua soluzione e funzionano direttamente. Aggiungiamo costantemente più moduli.",
    "PreBuiltModules_ABPSOLUTION_Description2": "Tutti i moduli sono progettati come personalizzabili per le vostre esigenze aziendali. Se hai bisogno di un controllo completo, puoi scaricare il codice sorgente completo di qualsiasi modulo e personalizzarlo completamente in base ai tuoi specifici requisiti aziendali.",
    "ABPCommunity": "Comunità ABP",
    "ABPCommunity_Description": "Infine, essere in una grande comunità in cui tutti seguono stili e principi di codifica simili e condividono un&#39;infrastruttura comune dà potere quando si hanno problemi o si ha bisogno di aiuto con le decisioni di progettazione. Poiché scriviamo il codice in modo simile, possiamo aiutarci a vicenda molto meglio. ABP è un progetto sostenuto dalla comunità con più di 10.000 stelle su GitHub.",
    "ABPCommunity_Description2": "È facile condividere codice o anche librerie riutilizzabili tra gli sviluppatori ABP. Uno snippet di codice che funziona per te funzionerà anche per gli altri. Sono disponibili numerosi esempi ed esercitazioni che puoi implementare direttamente per la tua applicazione.",
    "ABPCommunity_Description3": "Quando assumi uno sviluppatore che ha lavorato in precedenza con l&#39;architettura ABP, capirà immediatamente la tua soluzione e inizierà lo sviluppo in brevissimo tempo.",
    "WhyAbpIo_Page_Title": "Perché la piattaforma ABP.IO?",
    "AbpStudio_Page_Title": "Studio ABP",
    "CampaignInfo": "Acquista una nuova licenza o rinnova quella esistente e <span class=\"text-white\">ottieni altri 2 mesi</span> senza costi aggiuntivi! Questa offerta è valida per tutti i piani di licenza. Assicurati di sfruttare questa promozione a tempo limitato per espandere il tuo accesso a funzionalità premium e aggiornamenti.",
    "HurryUpLastDay": "Affrettarsi! Ultimo giorno: {0}",
    "CreatingCRUDPagesWithABPSuite": "Creazione di pagine CRUD con ABP Suite",
    "Testimonials": "Testimonianze",
    "MultipleYearDiscount": "Sconto per più anni",
    "CampaignDiscountText": "Sconto del Black Friday",
    "CampaignDiscountName": "Venerdì nero",
    "CampaignName:BlackFriday": "Venerdì nero"
  }
}