{
  "culture": "nl",
  "texts": {
    "OrganizationManagement": "Organisatie management",
    "OrganizationList": "Organisatie lijst",
    "Volo.AbpIo.Commercial:010003": "U bent geen eigenaar van deze organisatie!",
    "OrganizationNotFoundMessage": "Geen organisatie gevonden!",
    "DeveloperCount": "Toegewezen/totale ontwikkelaars",
    "QuestionCount": "Resterende/totale vragen",
    "Unlimited": "Onbeperkt",
    "Owners": "Eigenaren",
    "AddMember": "Lid toevoegen",
    "AddOwner": "Eigenaar toevoegen",
    "AddDeveloper": "Ontwikkelaar toevoegen",
    "UserName": "gebruikersnaam",
    "Name": "Naam",
    "EmailAddress": "E-mailadres",
    "Developers": "ontwikkelaars",
    "LicenseType": "Licentie type",
    "Manage": "Beheren",
    "StartDate": "Startdatum",
    "EndDate": "Einddatum",
    "Modules": "Modules",
    "LicenseExtendMessage": "De einddatum van uw licentie is verlengd tot {0}",
    "LicenseUpgradeMessage": "Uw licentie is geüpgraded naar {0}",
    "LicenseExtendAdnUpgradeMessage": "Uw licentie is verlengd tot {0} en uw licentieplan is geüpgraded naar {1}.",
    "LicenseAddDeveloperMessage": "{0} ontwikkelaars toegevoegd aan uw licentie",
    "Volo.AbpIo.Commercial:010004": "Kan de opgegeven gebruiker niet vinden! De gebruiker moet zich al hebben geregistreerd.",
    "MyOrganizations": "Mijn organisaties",
    "ApiKey": "API sleutel",
    "UserNameNotFound": "Er is geen gebruiker met gebruikersnaam {0}",
    "SuccessfullyAddedToNewsletter": "Bedankt voor het abonneren op onze nieuwsbrief!",
    "MyProfile": "Mijn profiel",
    "EmailNotValid": "Vul een geldig e-mailadres in.",
    "JoinOurMarketingNewsletter": "Schrijf je in voor onze marketingnieuwsbrief",
    "WouldLikeToReceiveMarketingMaterials": "Ik wil graag marketingmateriaal ontvangen, zoals productdeals en speciale aanbiedingen.",
    "StartUsingYourLicenseNow": "Begin nu met het gebruiken van uw licentie!",
    "WelcomePage": "Welkomstpagina",
    "UnsubscriptionExpireEmail": "Afmelden voor herinneringsmails voor de vervaldatum van de licentie",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Dit e-mailabonnement bevat alleen een herinnering aan de vervaldatum van uw licentie.",
    "UnsubscribeFromLicenseExpireEmails": "Als u geen e-mails over de vervaldatum van uw licentie wilt ontvangen, kunt u zich op elk gewenst moment uitschrijven.",
    "Unsubscribe": "Afmelden",
    "NotOrganizationMember": "U bent van geen enkele organisatie lid.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Uitgeschreven",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "U ontvangt geen herinneringsmails meer voor de vervaldatum van de licentie.",
    "IndexPageHeroSection": "<span class=\"first-line\">Een compleet</span><span class=\"second-line\"> webontwikkelingsplatform</span><span class=\"third-line\">ingebouwd <img src= \"{0}\" width=\"110\" class=\"ml-1\" /> raamwerk</span>",
    "AbpCommercialShortDescription": "ABP Commercial biedt kant-en-klare applicatiemodules, tooling voor snelle applicatieontwikkeling, professionele UI-thema's, premium ondersteuning en meer.",
    "LiveDemo": "Live demonstratie",
    "GetLicence": "Verkrijg een licentie",
    "Application": "Sollicitatie",
    "StartupTemplates": "Opstartsjablonen",
    "Startup": "Beginnen",
    "Templates": "Sjablonen",
    "Developer": "Ontwikkelaar",
    "Tools": "Gereedschap",
    "Premium": "Premie",
    "PremiumSupport": "Premium-ondersteuning",
    "PremiumForumSupport": "Premium Forum-ondersteuning",
    "UI": "gebruikersinterface",
    "Themes": "Thema's",
    "JoinOurNewsletter": "Schrijf je in op onze nieuwsbrief",
    "Send": "Versturen",
    "Learn": "Leren",
    "AdditionalServices": "Aanvullende diensten",
    "WhatIsABPFramework": "WAT IS HET ABP-KADER?",
    "OpenSourceBaseFramework": "Open source basisframework",
    "ABPFrameworkExplanation": "<p class=\"lead\">ABP Commercial is gebaseerd op het ABP Framework, een open source en community-gedreven webapplicatieframework voor ASP.NET Core.</p><p>ABP Framework biedt een uitstekende infrastructuur om onderhoudbaar en uitbreidbaar te schrijven en testbare code met best practices.</p><p>Gebouwd op en geïntegreerd in populaire tools die je al kent. Lage leercurve, gemakkelijke aanpassing, comfortabele ontwikkeling.</p>",
    "Modular": "Modulair",
    "MicroserviceCompatible": "Microservice-compatibel",
    "DomainDrivenDesignInfrastructure": "Domeingestuurde ontwerpinfrastructuur",
    "MultiTenancy": "Meerdere huurders",
    "DistributedMessaging": "Gedistribueerde berichten",
    "DynamicProxying": "Dynamische proxy",
    "BackgroundJobs": "Achtergrond banen",
    "AuditLogging": "Auditlogboekregistratie",
    "BLOBStoring": "BLOB-opslag",
    "BundlingMinification": "Bundeling & Minificatie",
    "AdvancedLocalization": "Geavanceerde lokalisatie",
    "ManyMore": "Veel meer",
    "ExploreTheABPFramework": "Verken het ABP-raamwerk",
    "WhyUseTheABPCommercial": "Waarom de ABP Commercial gebruiken?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\">Het bouwen van webapplicaties op ondernemingsniveau kan complex en tijdrovend zijn.</p><p>ABP Commercial biedt de perfecte basisinfrastructuur die nodig is voor alle moderne enterprise-grade ASP.NET Core gebaseerde oplossingen. Vanaf het ontwerp tot de implementatie wordt de hele ontwikkelingscyclus mogelijk gemaakt door de ingebouwde functies en modules van ABP.</p>",
    "StartupTemplatesShortDescription": "Met opstartsjablonen kunt u in een paar seconden aan de slag met uw project.",
    "UIFrameworksOptions": "Opties voor UI-frameworks;",
    "DatabaseProviderOptions": "Opties voor databaseproviders;",
    "PreBuiltApplicationModules": "Vooraf gebouwde applicatiemodules",
    "PreBuiltApplicationModulesShortDescription": "De meest voorkomende applicatie-eisen zijn al voor u ontwikkeld als herbruikbare modules.",
    "Account": "Rekening",
    "Blogging": "Bloggen",
    "Identity": "Identiteit",
    "IdentityServer": "Identiteitsserver",
    "Saas": "Saas",
    "LanguageManagement": "Taalbeheer",
    "TextTemplateManagement": "Beheer van tekstsjablonen",
    "See All Modules": "BekijkAlleModules",
    "ABPSuite": "ABP-suite",
    "AbpSuiteShortDescription": "ABP Suite is een aanvulling op de ABP Commercial.",
    "AbpSuiteExplanation": "Hiermee kunt u binnen enkele minuten webpagina's bouwen. Het is een .NET Core Global-tool die vanaf de opdrachtregel kan worden geïnstalleerd. Het kan een nieuwe ABP-oplossing maken, CRUD-pagina's genereren vanuit de database naar de front-end.",
    "Details": "Details",
    "LeptonTheme": "Lepton-thema",
    "ProfessionalModernUIThemes": "Professionele, moderne UI-thema's",
    "LeptonThemeExplanation": "Lepton biedt een scala aan Bootstrap-beheerthema's die dienen als een solide basis voor elk project waarvoor een beheerdersdashboard vereist is.",
    "DefaultTheme": "Standaard thema",
    "MaterialTheme": "Materieel thema",
    "Default2Theme": "Standaard 2 thema",
    "DarkTheme": "Donker thema",
    "DarkBlueTheme": "Donkerblauw thema",
    "LightTheme": "Licht thema",
    "ProudToWorkWith": "Trots om mee te werken",
    "OurConsumers": "Duizenden ondernemingen en ontwikkelaars in meer dan 70 landen wereldwijd vertrouwen op ABP Commercial.",
    "JoinOurConsumers": "Sluit je bij hen aan en bouw snel geweldige producten.",
    "AdditionalServicesExplanation": "Heeft u aanvullende of aangepaste diensten nodig? <strong>Wij en onze partners kunnen bieden;</strong>",
    "CustomProjectDevelopment": "Projectontwikkeling op maat",
    "CustomProjectDevelopmentExplanation": "Toegewijde ontwikkelaars voor uw projecten op maat.",
    "PortingExistingProjects": "Bestaande projecten overdragen",
    "PortingExistingProjectsExplanation": "Uw legacy projecten migreren naar het ABP platform.",
    "LiveSupport": "Live ondersteuning",
    "LiveSupportExplanation": "Live ondersteuning op afstand wanneer je het nodig hebt.",
    "Training": "Opleiding",
    "TrainingExplanation": "Toegewijde training voor uw ontwikkelaars.",
    "OnBoarding": "Onboarding",
    "OnBoardingExplanation": "Hulp bij het opzetten van uw ontwikkel-, CI- en CD-omgevingen.",
    "PrioritizedTechnicalSupport": "Geprioriteerde technische ondersteuning",
    "PremiumSupportExplanation": "Naast de geweldige community-ondersteuning van het ABP-framework, beantwoordt ons ondersteuningsteam technische vragen en problemen van de commerciële gebruikers met hoge prioriteit.",
    "SeeTheSupportOptions": "Zie de ondersteuningsopties",
    "Contact": "Contact",
    "TellUsWhatYouNeed": "Vertel ons wat je nodig hebt.",
    "YourMessage": "Uw bericht",
    "YourFullName": "Je volledige naam",
    "EmailField": "E-mailadres",
    "YourEmailAddress": "Jouw e-mailadres",
    "HowMayWeHelpYou": "Hoe kunnen we je helpen?",
    "SendMessage": "Bericht versturen",
    "Success": "Succes",
    "WeWillReplyYou": "We hebben uw bericht ontvangen en nemen spoedig contact met u op.",
    "GoHome": "Ga naar huis",
    "CreateLiveDemo": "Live demo maken",
    "RegisterToTheNewsletter": "Schrijf je in voor de nieuwsbrief om informatie over ABP.IO te ontvangen, inclusief nieuwe releases etc.",
    "EnterYourEmailOrLogin": "Voer uw e-mailadres in om uw demo te maken of <a href=\"{0}\">Log in</a> met uw bestaande account.",
    "ApplicationTemplate": "Toepassingssjabloon",
    "ApplicationTemplateExplanation": "Opstartsjabloon voor toepassingen wordt gebruikt om een nieuwe webtoepassing te maken.",
    "EfCoreProvider": "Entity Framework (ondersteunt SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\">en anderen</a>)",
    "AlreadyIncludedInTemplateModules": "De volgende modules zijn al opgenomen en geconfigureerd in deze sjabloon:",
    "ApplicationTemplateArchitecture": "Deze applicatiesjabloon ondersteunt ook een gelaagde architectuur waarbij de UI-laag, API-laag en de authenticatieservice fysiek gescheiden zijn.",
    "SeeTheGuideOrGoToTheLiveDemo": "Raadpleeg de handleiding voor ontwikkelaars voor technische informatie over deze sjabloon of ga naar de live demo.",
    "DeveloperGuide": "Handleiding voor ontwikkelaars",
    "ModuleTemplate": "Modulesjabloon",
    "ModuleTemplateExplanation1": "U wilt een module maken en deze in verschillende toepassingen hergebruiken? Deze opstartsjabloon bereidt alles voor om een herbruikbare <strong>toepassingsmodule</strong> of een <strong>microservice</strong> te maken.",
    "ModuleTemplateExplanation2": "<p>U kunt enkele of meerdere UI-frameworks, enkele of meerdere databaseproviders voor een enkele module ondersteunen. De opstartsjabloon is geconfigureerd om uw module uit te voeren en te <strong>testen</strong> in een minimale applicatie naast de unit- en integratietestinfrastructuur. </p> <p>Zie de handleiding voor ontwikkelaars voor technische informatie over deze sjabloon.</p>",
    "WithAllStyleOptions": "met alle stijlopties",
    "Demo": "Demo",
    "SeeAllModules": "Bekijk alle modules",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) is een opdrachtregelprogramma om een aantal veelvoorkomende bewerkingen uit te voeren voor op ABP gebaseerde oplossingen.",
    "ABPSuiteEasilyCURD": "ABP Suite is een tool waarmee u eenvoudig CRUD-pagina's kunt maken",
    "WeAreHereToHelp": "We zijn hier om <span class=\"zero-text\">Help</span>",
    "BrowseOrAskQuestion": "U kunt door onze Help-onderwerpen bladeren of zoeken in veelgestelde vragen, of u kunt ons een vraag stellen via het <a href=\"{0}\" class=\"text-success\">contactformulier</a>.",
    "SearchQuestionPlaceholder": "Zoeken in veelgestelde vragen",
    "WhatIsTheABPCommercial": "Wat is de ABP Commercial?",
    "WhatAreDifferencesThanAbpFramework": "Wat zijn de verschillen tussen het open source ABP Framework en de ABP Commercial?",
    "ABPCommercialExplanation": "ABP Commercial is een set premiummodules, tools, thema's en services die bovenop het open source <a target=\"_blank\" href=\"{0}\">ABP-framework</a> zijn gebouwd. ABP Commercial wordt ontwikkeld en ondersteund door hetzelfde team achter het ABP framework.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\">ABP-framework</a> is een modulair, themaeerbaar, microservice-compatibel applicatie-ontwikkelingsframework voor ASP.NET Core. Het biedt een complete architectuur en een sterke infrastructuur zodat u zich kunt concentreren op uw eigen bedrijfscode in plaats van uzelf te herhalen voor elk nieuw project. Het is gebaseerd op best practices voor softwareontwikkeling en populaire tools die u al kent. </p> <p> ABP-framework is volledig gratis, open source en community-gedreven. Het biedt ook een gratis thema en enkele vooraf gebouwde modules (bijvoorbeeld identiteitsbeheer en huurdersbeheer).</p>",
    "VisitTheFrameworkVSCommercialDocument": "Bezoek de volgende link voor meer informatie <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial voegt de volgende voordelen toe bovenop het ABP-raamwerk;",
    "Professional": "Professioneel",
    "UIThemes": "UI-thema's",
    "EnterpriseModules": "Bedrijfsklare, functierijke, vooraf gebouwde <a href=\"{0}\">toepassingsmodules</a> (bijv. Identity Server-beheer, SaaS-beheer, taalbeheer)",
    "ToolingToSupport": "Tooling om uw ontwikkelingsproductiviteit te ondersteunen (bijv. <a href=\"{0}\">ABP Suite</a>)",
    "PremiumSupportLink": "Premium <a href=\"{0}\" target=\"_blank\">ondersteuning</a>",
    "WhatDoIDownloadABPCommercial": "Wat download ik als ik de ABP Commercial aanschaf?",
    "CreateUnlimitedSolutions": "Zodra u een ABP Commercial-licentie aanschaft, kunt u onbeperkte oplossingen maken, zoals beschreven in het document <a href=\"{0}\">Aan de slag</a>.",
    "ABPCommercialSolutionExplanation": "Wanneer u een nieuwe toepassing maakt, krijgt u een Visual Studio-oplossing (een opstartsjabloon) op basis van uw voorkeuren. De gedownloade oplossing heeft commerciële modules en thema's die al voor u zijn geïnstalleerd en geconfigureerd. U kunt desgewenst een vooraf geïnstalleerde module verwijderen of een andere module toevoegen. Alle modules en thema's worden standaard gebruikt als NuGet/NPM-pakketten.",
    "StartDevelopWithTutorials": "De gedownloade oplossing is goed ontworpen en gedocumenteerd. U kunt beginnen met het ontwikkelen van uw eigen bedrijfscode op basis van <a href=\"{0}\">de tutorials</a>",
    "TryTheCommercialDemo": "U kunt <a href=\"{0}\">de demo</a> proberen om een voorbeeldtoepassing te zien die is gemaakt met behulp van de ABP Commercial-opstartsjabloon.",
    "HowManyProducts": "Hoeveel verschillende producten/oplossingen kan ik bouwen met de ABP Commercial?",
    "HowManyProductsExplanation": "Er is geen limiet voor het maken van een ABP-project. U kunt zoveel projecten maken als u wilt, ze ontwikkelen en uploaden naar verschillende servers.",
    "HowManyDevelopers": "Hoeveel developers kunnen aan de ABP Commercial werken?",
    "HowManyDevelopersExplanation": "ABP Commerciële licenties zijn per ontwikkelaar. Verschillende licentietypen hebben verschillende ontwikkelaarslimieten. U kunt echter op elk gewenst moment meer ontwikkelaars aan elk licentietype toevoegen. Bekijk de pagina <a href=\"{0}\">de prijzen</a> voor licentietypen, ontwikkelaarslimieten en extra ontwikkelaarskosten.",
    "ChangingLicenseType": "Kan ik mijn licentietype later upgraden?",
    "ChangingLicenseTypeExplanation": "U kunt upgraden naar een hogere licentie door het verschil binnen uw actieve licentieperiode te betalen. Wanneer u upgradet naar een hoger licentieplan, krijgt u de voordelen van het nieuwe plan, maar de licentie-upgrade verandert de vervaldatum van de licentie niet. Daarnaast kun je ook nieuwe developers seats toevoegen aan je bestaande licentie, zie \"Hoeveel developers kunnen aan de ABP Commercial werken?\"",
    "LicenseExtendUpgradeDiff": "Wat is het verschil tussen licentieverlenging en upgrade?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Verlengen:</strong> door uw licentie te verlengen/vernieuwen, blijft u premium ondersteuning krijgen en krijgt u belangrijke updates voor de modules en thema's. Bovendien kunt u doorgaan met het maken van nieuwe projecten. En u kunt nog steeds ABP Suite gebruiken, wat uw ontwikkeling versnelt.<hr/><strong>Upgraden:</strong> door uw licentie te upgraden, promoveert u naar een hoger licentieplan waarmee u extra voordelen kunt krijgen . Bekijk de <a href=\"/pricing\">licentievergelijkingstabel</a> om de verschillen tussen de licentieplannen te controleren.<strong>Aan de andere kant, wanneer u een upgrade uitvoert, verandert de vervaldatum van uw licentie niet!</strong >Om de einddatum van uw licentie te verlengen, moet u uw licentie verlengen.",
    "LicenseRenewalCost": "Wat zijn de kosten voor het verlengen van de licentie na 1 jaar?",
    "LicenseRenewalCostExplanation": "Het tarief voor catalogusverlenging van alle eeuwigdurende licenties van ABP Commercial is {0} van de licentieprijs van de licentie. De verlengingsprijs van de standaard Teamlicentie is ${1}, de standaard Business-licentie is ${2} en de standaard Enterprise-licentie is ${3}. Als u al klant bent, <a href='{4}' target='_blank'>log in op uw account</a> om de beschikbare verlengingsprijzen te bekijken.",
    "HowDoIRenewMyLicense": "Hoe verleng ik mijn licentie?",
    "HowDoIRenewMyLicenseExplanation": "U kunt uw licentie verlengen door naar de <a href='{0}' target='_blank'>organisatiebeheerpagina</a> te gaan. Om te profiteren van onze gereduceerde tarieven voor vroege verlenging, moet u ervoor zorgen dat u verlengt voordat uw licentie verloopt. U hoeft zich echter geen zorgen te maken dat u niet weet wanneer uw mogelijkheid tot vervroegde verlenging afloopt. Je ontvangt 3 herinneringsmails voordat je abonnement afloopt. We sturen ze 30 dagen, 7 dagen en 1 dag voor de vervaldatum.",
    "IsSourceCodeIncluded": "Bevat mijn licentie de broncode van de commerciële modules en thema's?",
    "IsSourceCodeIncludedExplanation1": "Afhankelijk van het licentietype dat u hebt aangeschaft:",
    "IsSourceCodeIncludedExplanation2": "<strong>Team</strong>: uw oplossing gebruikt de modules en de thema's als NuGet- en NPM-pakketten. Het bevat niet hun broncode. Op deze manier kunt u deze modules en thema's eenvoudig upgraden wanneer er een nieuwe versie beschikbaar is. U kunt echter niet de broncode van de modules en de thema's krijgen.",
    "IsSourceCodeIncludedExplanation3": "<strong>Business/Enterprise</strong>: naast de Team-licentie kunt u de broncode downloaden van elke module of elk thema dat u nodig hebt. U kunt zelfs de NuGet/NPM-pakketreferenties voor een bepaalde module verwijderen en de broncode rechtstreeks aan uw oplossing toevoegen om deze volledig te wijzigen.",
    "IsSourceCodeIncludedExplanation4": "<p>Het toevoegen van de broncode van een module aan uw oplossing geeft u de maximale vrijheid om die module aan te passen. Het is dan echter niet mogelijk om de module automatisch te upgraden wanneer een nieuwe versie wordt uitgebracht.</p><p>Geen van de licenties bevat de ABP Suite-broncode, een externe tool die code voor u genereert en assisteert voor uw ontwikkeling.</p><p>Zie <a href=\"{0}\">de pagina met prijzen</a> voor andere verschillen tussen de licentietypen.</p>",
    "ChangingDevelopers": "Kan ik de geregistreerde ontwikkelaars van mijn organisatie in de toekomst wijzigen?",
    "ChangingDevelopersExplanation": "Naast het toevoegen van nieuwe ontwikkelaars aan uw licentie, kunt u ook de bestaande ontwikkelaars wijzigen (u kunt een ontwikkelaar verwijderen en een nieuwe toevoegen aan dezelfde stoel) zonder extra kosten.",
    "WhatHappensWhenLicenseEnds": "Wat gebeurt er als mijn licentieperiode afloopt?",
    "WhatHappensWhenLicenseEndsExplanation1": "Het commerciële ABP-licentietype is <a href=\"{0}\" target=\"_blank\">permanente licentie</a>. Nadat uw licentie is verlopen, kunt u doorgaan met het ontwikkelen van uw project. En je bent niet verplicht om je rijbewijs te verlengen. Uw licentie wordt standaard geleverd met een jaarupdate en ondersteuningsplan. Om nieuwe functies, prestatieverbeteringen, bugfixes, ondersteuning te blijven krijgen en ABP Suite te blijven gebruiken, moet u uw licentie verlengen. Wanneer uw licentie verloopt, krijgt u niet de volgende voordelen;",
    "WhatHappensWhenLicenseEndsExplanation2": "Met de ABP Commercial kunt u geen nieuwe oplossingen creëren, maar u kunt wel eeuwig doorgaan met het doorontwikkelen van uw bestaande applicaties.",
    "WhatHappensWhenLicenseEndsExplanation3": "U kunt updates krijgen voor de modules en thema's binnen uw MAJOR-versie (behalve RC- of Preview-versies). Bijvoorbeeld; als je v3.2.0 van een module gebruikt, kun je nog steeds updates krijgen voor v3.x.x (v3.3.0, v3.5.2... etc.) van die module. Maar u kunt geen updates krijgen voor de volgende hoofdversie (zoals v4.x, v5.x). Toen uw licentie bijvoorbeeld verliep, was de nieuwste release v4.4.3 en de nieuwste preview-versie v5.0.0-rc.2, hebt u toegang tot v4.X.X, maar hebt u geen toegang tot v5.X.X.",
    "WhatHappensWhenLicenseEndsExplanation4": "U kunt geen nieuwe modules en thema's installeren die zijn toegevoegd aan het ABP Commercieel platform nadat uw licentie is afgelopen.",
    "WhatHappensWhenLicenseEndsExplanation5": "U kunt geen gebruik maken van de ABP Suite.",
    "WhatHappensWhenLicenseEndsExplanation6": "U kunt geen <a href=\"{0}\">premium ondersteuning</a> meer krijgen.",
    "WhatHappensWhenLicenseEndsExplanation7": "U kunt uw licentie verlengen (vernieuwen) als u van deze voordelen wilt blijven genieten. Als u uw licentie verlengt binnen <strong>1 maand</strong> nadat uw licentie is verlopen, worden de volgende kortingen toegepast: Teamlicentie {0}% korting, Zakelijke licentie {1}% korting, Enterprise-licentie {2}% korting .",
    "WhenShouldIRenewMyLicense": "Wanneer moet ik mijn licentie verlengen?",
    "WhenShouldIRenewMyLicenseExplanation": "Als u uw licentie verlengt binnen <strong>1 maand</strong> nadat uw licentie is verlopen, worden de volgende kortingen toegepast: Teamlicentie {0}% korting, Zakelijke licentie {1}% korting, Enterprise-licentie {2}% korting . Als u uw licentie <strong>1 maand</strong> na de vervaldatum van uw licentie verlengt, is de verlengingsprijs gelijk aan de aankoopprijs van de licentie en wordt er geen korting op uw verlenging gegeven.",
    "TrialPlan": "Heb je een proefplan?",
    "TrialPlanExplanation": "Voorlopig heeft ABP Commercial geen proefabonnement. Voor de Team-licenties bieden we 30 dagen geld-terug-garantie. U kunt de eerste 30 dagen gewoon een terugbetaling aanvragen. Voor de Business- en Enterprise-licenties bieden we 60% restitutie in 30 dagen. Dit komt doordat Business en Enterprise licenties de volledige broncode van alle modules en thema's bevatten.",
    "DoYouAcceptBankWireTransfer": "Accepteert u bankoverschrijvingen?",
    "DoYouAcceptBankWireTransferExplanation": "Ja, we accepteren bankoverschrijvingen.<br />Nadat u de licentievergoeding via bankoverschrijving heeft verzonden, stuurt u een e-mail naar accounting@abp.io met uw kwitantie en het type licentie dat u heeft aangevraagd. Onze internationale bankrekeninggegevens:",
    "HowToUpgrade": "Hoe kan ik bestaande applicaties upgraden wanneer er een nieuwe versie beschikbaar is?",
    "HowToUpgradeExplanation1": "Wanneer je een nieuwe applicatie maakt met ABP Commercial, worden alle modules en het thema gebruikt als NuGet- en NPM-pakketten. U kunt de pakketten dus eenvoudig upgraden wanneer er een nieuwe versie beschikbaar is.",
    "HowToUpgradeExplanation2": "Naast de standaard NuGet/NPM-upgrades, biedt <a href=\"{0}\">ABP CLI</a> een update-opdracht die automatisch alle ABP-gerelateerde pakketten in uw oplossing vindt en opwaardeert.",
    "DatabaseSupport": "Welke databasesystemen worden ondersteund?",
    "DatabaseSupportExplanation": "ABP Framework zelf is database-agnostisch en kan van nature met elke databaseprovider werken. Zie <a href=\"{0}\" target=\"_blank\">het document voor gegevenstoegang</a> voor een lijst met momenteel geïmplementeerde providers.",
    "UISupport": "Welke UI-frameworks worden ondersteund?",
    "Supported": "Ondersteund",
    "UISupportExplanation": "ABP Framework zelf is UI-framework-agnostisch en kan met elk UI-framework werken. Opstartsjablonen, module-UI's en thema's zijn echter niet voor alle UI-frameworks geïmplementeerd. Zie <a href=\"{0}\">het document 'Aan de slag'</a> voor de up-to-date lijst met UI-opties.",
    "MicroserviceSupport": "Ondersteunt het de microservice-architectuur?",
    "MicroserviceSupportExplanation1": "Een van de belangrijkste doelen van het ABP-raamwerk is het bieden van een gemakkelijke infrastructuur om microserviceoplossingen te creëren. Bekijk het document <a href=\"{0}\">microservice-architectuur</a> om te begrijpen hoe het helpt bij het maken van microservicesystemen.",
    "MicroserviceSupportExplanation2": "Alle ABP Commercial-modules zijn ontworpen om implementatiescenario's voor microservices te ondersteunen (met een eigen API en database) door het document <a href=\"{0}\">best practices voor moduleontwikkeling</a> te volgen.",
    "MicroserviceSupportExplanation3": "We bieden een voorbeeld van een <a href=\"{0}\">demo-oplossing voor microservices</a> die een implementatie van een microservicearchitectuur demonstreert om u te helpen uw eigen oplossing te maken.",
    "MicroserviceSupportExplanation4": "Het korte antwoord is dus \"<strong>ja, het ondersteunt microservice-architectuur</strong>\".",
    "MicroserviceSupportExplanation5": "Een microservicesysteem is echter een oplossing en elke oplossing heeft andere vereisten, netwerktopologie, communicatiescenario's, authenticatiemogelijkheden, beslissingen over het scheiden/delen van databases, runtime-configuraties, systeemintegraties van derden en nog veel meer.",
    "MicroserviceSupportExplanation6": "Het ABP Framework en de ABP Commercial bieden infrastructuur voor microservicescenario's, microservicecompatibele modules, voorbeelden en documentatie om u te helpen uw eigen oplossing te bouwen. Maar verwacht niet direct uw droomoplossing te downloaden die voor u is gebouwd. U moet het begrijpen en enkele onderdelen samenbrengen op basis van uw vereisten.",
    "WhereCanIDownloadSourceCode": "Waar kan ik de broncode downloaden?",
    "WhereCanIDownloadSourceCodeExplanation": "U kunt de broncode van alle ABP-modules, Angular-pakketten en thema's downloaden via ABP Suite of ABP CLI. Zie <a href=\"{0}\">Hoe de broncode te downloaden?</a>",
    "ComputerLimitation": "Op hoeveel computers kan een ontwikkelaar inloggen bij het ontwikkelen van ABP?",
    "ComputerLimitationExplanation": "We staan specifiek <strong>{0} computers</strong> toe per individuele/gelicentieerde ontwikkelaar. Wanneer een ontwikkelaar ABP Commercial-producten op een derde machine moet ontwikkelen, moet er een e-mail worden gestuurd naar license@abp.io waarin de situatie wordt uitgelegd en we zullen dan de juiste toewijzing in ons systeem maken.",
    "RefundPolicy": "Heeft u een restitutiepolis?",
    "RefundPolicyExplanation": "U kunt binnen <strong>30 dagen</strong> na aankoop van uw licentie een teruggave aanvragen. De Business- en Enterprise-licentietypen hebben een downloadoptie voor broncode, daarom zijn restituties niet beschikbaar voor de Business en Enterprise (en eventuele licenties die het recht bevatten om broncode te ontvangen). Bovendien worden er geen terugbetalingen gedaan voor verlengingen en tweede licentieaankopen.",
    "HowCanIRefundVat": "Hoe kan ik btw terugvragen?",
    "HowCanIRefundVatExplanation1": "Als je de betaling hebt gedaan met 2Checkout, kun je btw terugbetalen via je 2Checkout-account:",
    "HowCanIRefundVatExplanation2": "Log in op uw <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\">2Checkout</a>-account",
    "HowCanIRefundVatExplanation3": "Zoek de juiste bestelling en druk op \"Te laat betaalde btw terugbetalen\" (voer uw btw-nummer in)",
    "HowCanIGetMyInvoice": "Hoe kan ik mijn factuur krijgen?",
    "HowCanIGetMyInvoiceExplanation": "Er zijn 2 betalingsgateways voor het aanschaffen van een licentie: Iyzico en 2Checkout. Als u uw licentie aanschaft via de 2Checkout-gateway, stuurt deze de PDF-factuur naar uw e-mailadres, zie <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How- do-invoices-work\">2Checkout-facturering.</a> Als u koopt via de Iyzico-gateway, met een aangepaste aankooplink of via bankoverschrijving, zullen we uw factuur voorbereiden en verzenden. U kunt uw factuur opvragen of downloaden vanaf de <a href=\"{0}\">organisatiebeheerpagina</a>. Controleer voordat u contact met ons opneemt voor de factuur uw organisatiebeheerpagina!",
    "Forum": "Forum",
    "SupportExplanation": "ABP Commerciële licenties biedt een premium forum ondersteuning door een team bestaande uit de ABP Framework experts.",
    "PrivateTicket": "Privé Ticket",
    "PrivateTicketExplanation": "Enterprise License omvat ook een privéondersteuning met e-mail- en ticketsysteem.",
    "AbpSuiteExplanation1": "Met ABP Suite bouwt u webpagina's in een kwestie van minuten. Het is een .NET Core Global-tool die vanaf de opdrachtregel kan worden geïnstalleerd.",
    "AbpSuiteExplanation2": "Het kan een nieuwe ABP-oplossing maken, CRUD-pagina's genereren vanuit de database naar de front-end. Voor technisch overzicht zie <a href=\"{0}\">het document</a>",
    "FastEasy": "Snel en gemakkelijk",
    "AbpSuiteExplanation3": "Met ABP Suite kunt u eenvoudig CRUD-pagina's maken. U hoeft alleen uw entiteit en haar eigenschappen te definiëren, laat de rest voor u aan ABP Suite! ABP Suite genereert binnen enkele seconden alle benodigde code voor uw CRUD-pagina. Het ondersteunt Angular, MVC en Blazor gebruikersinterfaces.",
    "RichOptions": "Rijke opties",
    "AbpSuiteExplanation4": "ABP Suite ondersteunt meerdere UI-opties zoals <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\">Razor Pages</a> en <a href=\"https:/ /angular.io\">Angular</a>.Het ondersteunt ook meerdere databases zoals <a href=\"https://www.mongodb.com\">MongoDB</a> en alle databases die worden ondersteund door <strong>EntityFramework Core< /strong> (MS SQL Server, Oracle, MySql, PostgreSQL en <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\">meer </a>).",
    "AbpSuiteExplanation5": "Het mooie is dat je je geen zorgen hoeft te maken over die opties. ABP Suite begrijpt uw projecttype en genereert de code voor uw project en plaatst de gegenereerde code op de juiste plaats in uw project.",
    "SourceCode": "Broncode",
    "AbpSuiteExplanation6": "ABP Suite genereert de broncode voor u! Het genereert geen magische bestanden om de webpagina te genereren. ABP Suite genereert de broncode voor <strong>Entity, Repository, Application Service, Code First Migration, JavaScript/TypeScript en CSHTML/HTML</strong> en ook de benodigde interfaces. ABP Suite genereert de code ook volgens <strong>Best Practices</strong> van softwareontwikkeling, zodat u zich geen zorgen hoeft te maken over de kwaliteit van de gegenereerde code.",
    "AbpSuiteExplanation7": "Aangezien u de broncode van bouwstenen van de gegenereerde CRUD-pagina in de juiste applicatielagen hebt, kunt u de broncode eenvoudig wijzigen en uw aangepaste/bedrijfslogica in de gegenereerde code injecteren.",
    "CrossPlatform": "Cross-platform",
    "AbpSuiteExplanation8": "ABP Suite is gebouwd met .NET Core en is platformonafhankelijk. Het draait als een webtoepassing op uw lokale computer. U kunt het uitvoeren op <strong>Windows</strong>, <strong>Mac</strong> en <strong>Linux</strong>",
    "OtherFeatures": "Andere mogelijkheden",
    "OtherFeatures1": "Werkt eenvoudig <strong>NuGet</strong>- en <strong>NPM</strong>-pakketten op uw oplossing bij.",
    "OtherFeatures2": "Herstelt reeds gegenereerde pagina's helemaal opnieuw.",
    "OtherFeatures3": "Creëert nieuwe oplossingen",
    "ThanksForCreatingProject": "Bedankt voor het maken van uw project!",
    "HotToRunSolution": "Hoe voer je je oplossing uit?",
    "HotToRunSolutionExplanation": "Zie het document Aan de slag om te leren hoe u uw oplossing configureert en uitvoert.",
    "GettingStarted": "Beginnen",
    "WebAppDevTutorial": "Web App Dev Tutorial",
    "WebAppDevTutorialExplanation": "Zie het zelfstudiedocument voor de ontwikkeling van webtoepassingen voor een stapsgewijze ontwikkelingsvoorbeeld.",
    "Document": "Document",
    "UsingABPSuiteToCURD": "ABP Suite gebruiken voor CRUD Page Generation & Tooling",
    "SeeABPSuiteDocument": "Zie het ABP Suite-document om het gebruik van ABP Suite te leren.",
    "AskQuestionsOnSupport": "U kunt vragen stellen over ABP Commerciële Ondersteuning.",
    "Documentation": "Documentatie",
    "SeeModulesDocument": "Zie modules document voor een lijst van alle commerciële(pro) modules en hun documenten.",
    "Pricing": "Prijzen",
    "PricingExplanation": "Kies de functies en functionaliteit die uw bedrijf vandaag nodig heeft. Upgrade eenvoudig naarmate uw bedrijf groeit.",
    "Team": "Team",
    "Business": "Bedrijf",
    "Enterprise": "Onderneming",
    "Custom": "Aangepast",
    "IncludedDeveloperLicenses": "Inbegrepen ontwikkelaarslicenties",
    "CustomLicenceOrAdditionalServices": "Licentie op maat of aanvullende diensten nodig?",
    "CustomOrVolumeLicense": "Aangepaste of volumelicentie",
    "LiveTrainingSupport": "Live training & ondersteuning",
    "AndMore": "en meer",
    "AdditionalDeveloperLicense": "Aanvullende ontwikkelaarslicentie",
    "ProjectCount": "Aantal projecten",
    "AllProModules": "Alle pro-modules",
    "AllProThemes": "Alle professionele thema's",
    "AllProStartupTemplates": "Alle professionele opstartsjablonen",
    "SourceCodeOfAllModules": "Broncode van alle modules",
    "SourceCodeOfAllThemes": "Broncode van alle thema's",
    "PerpetualLicense": "Eeuwigdurende vergunning",
    "UnlimitedServerDeployment": "Onbeperkte serverimplementatie",
    "YearUpgrade": "1 jaar upgrade",
    "YearPremiumForumSupport": "1 jaar premium forumondersteuning",
    "ForumSupportIncidentCountYear": "Aantal incidenten/jaar voor forumondersteuning",
    "PrivateTicketEmailSupport": "Privé ticket & e-mailondersteuning",
    "BuyNow": "Nu kopen",
    "PayViaAmexCard": "Hoe kan ik betalen met mijn AMEX-kaart?",
    "PayViaAmexCardDescription": "De standaard betalingsgateway 'Iyzico' kan sommige AMEX-creditcards weigeren vanwege de veiligheidsmaatregelen. In dit geval kunt u betalen via de alternatieve betalingsgateway '2Checkout'.",
    "ThankYou": "Bedankt",
    "InvalidReCaptchaErrorMessage": "Er is een fout opgetreden bij het verifiëren van reCAPTCHA. Probeer het opnieuw.",
    "CompanyName": "Bedrijfsnaam",
    "YourCompanyName": "Je bedrijfsnaam",
    "FirstName": "Voornaam",
    "LastName": "Achternaam",
    "Optional": "Optioneel",
    "YourFirstName": "Jouw voornaam",
    "YourLastName": "Je achternaam",
    "SpecialOffer": "Speciale aanbieding",
    "SpecialOfferMessage": "Schiet op! Prijzen zijn voor een beperkte tijd geldig.",
    "DiscountRequest": "Kortingsverzoek",
    "DiscountRequestDescribeCustomerQuestion": "Welke van de volgende beschrijft jou?",
    "DiscountRequestStudentEmailMessage": "E-mailadres moet 'edu' bevatten.",
    "DiscountRequestDeveloperCount": "Hoeveel ontwikkelaars ben jij?",
    "DiscountRequestDeveloperCountExceedMessage": "We bieden geen licentie met korting aan bedrijven met meer dan {0} ontwikkelaars.",
    "DiscountRequestOrganizationName": "Naam bedrijf/organisatie/school",
    "Website": "Website",
    "GithubUsername": "GitHub-gebruikersnaam",
    "PhoneNumber": "Telefoonnummer",
    "Country": "Land",
    "DescribeABPCommercialUsage": "Beschrijf het project dat u wilt ontwikkelen op basis van APB Commercial",
    "DiscountRequestCertifyInformationMessage": "Ik verklaar dat alle informatie waar en correct is.",
    "DiscountRequestReceived": "We hebben je kortingsverzoek ontvangen.",
    "DiscountRequestStatusMessage": "We zullen op u reageren nadat we de door u verstrekte informatie hebben gecontroleerd.",
    "MVCOrRazorPages": "MVC (scheermespagina's)",
    "Angular": "hoekig",
    "Blazor": "Blazor",
    "New": "Nieuw",
    "MongoDB": "MongoDB",
    "EBookDDD": "Domeingestuurd ontwerp voor e-books",
    "PracticalGuideForImplementingDDD": "Dit boek is een praktische handleiding voor het implementeren van het Domain Driven Design met het ABP Framework.",
    "IntroducingDDD": "Introductie van domeingestuurd ontwerp",
    "DDDLayersAndCleanArchitecture": "DDD-lagen en schone architectuur",
    "LayeringOfADotnetSolution": "Gelaagdheid van een .NET-oplossing",
    "ImplementingDDDBuildingBlocks": "DDD-bouwstenen implementeren",
    "DomainVsApplicationLogic": "Domeinlogica versus toepassingslogica",
    "SamplesAndDiscussions": "Voorbeelden en discussies",
    "Free": "Vrij",
    "Download": "Downloaden",
    "DDDEBook": "DDD E-book",
    "ImplementingDDD": "Domeingestuurd ontwerp implementeren",
    "DDDBookExplanation": "Een praktische handleiding voor het implementeren van het Domain Driven Design met het ABP Framework.",
    "Overview": "Overzicht",
    "DDDBookPracticalGuide": "Dit is een praktische handleiding voor het implementeren van het Domain Driven Design (DDD). Hoewel de implementatiedetails afhankelijk zijn van de ABP Framework-infrastructuur, zijn kernconcepten, principes en patronen van toepassing op elk soort oplossing, zelfs als het geen .NET-oplossing is.",
    "TableOfContents": "Inhoudsopgave",
    "IntroductionToImplementingDDD": "Inleiding tot het implementeren van domeingestuurd ontwerp",
    "WhatIsDDD": "Wat is Domain Driven Design?",
    "Implementation": "Implementatie",
    "TheBigPicture": "Het grote plaatje",
    "TheBuildingBlock": "De bouwsteen",
    "ExampleUseCase": "Voorbeeld use-case",
    "DomainAndApplicationLogic": "Domeinlogica en toepassingslogica",
    "Author": "Auteur",
    "PublishedOn": "gepubliceerd op",
    "Page": "Bladzijde",
    "FreeEBook": "Gratis e-boek",
    "EBookSignInForDownload": "Om het e-book te downloaden, logt u in",
    "SignIn": "Inloggen",
    "Or": "Of",
    "TellUsAboutYourself": "Vertel ons iets over jezelf",
    "Surname": "Achternaam",
    "DoYouAgreePrivacyPolicy": "Ik ga akkoord met de <a href=\"/TermsConditions\">Algemene voorwaarden<a/> en het <a href=\"/Privacy\">Privacybeleid</a>.",
    "VolosoftMarketingInformationMessage": "Ik wil graag informatie, tips en aanbiedingen over oplossingen voor bedrijven en organisaties en andere producten en diensten van Volosoft.",
    "VolosoftSharingInformationMessage": "Ik wil graag dat Volosoft mijn informatie deelt met geselecteerde partners zodat ik relevante informatie over hun producten en diensten kan ontvangen.",
    "WeWillSendYouADownloadLink": "Een link om het e-book te downloaden is verzonden naar {0}.<br/> Controleer uw inbox/junk/spam!",
    "InvalidFormInputs": "Typ de geldige informatie die op het formulier is gespecificeerd.",
    "DDDBookEmailBody": "Bedankt. <br /> <a href=\"{0}\">klik hier</a> om uw boek te downloaden.",
    "FreeDDDEBook": "Gratis DDD e-boek",
    "StartFree": "Begin gratis",
    "FreeTrial": "Gratis proefversie",
    "AcceptsMarketingCommunications": " Ja, ik wil graag ABP Commerciële marketingcommunicatie ontvangen.",
    "PurposeOfUsage": "Gebruiksdoel",
    "Industry": "Industrie",
    "Choose": "- Kiezen -",
    "CompanyOrganizationName": "bedrijfs/organisatie naam",
    "CompanySize": "Bedrijfsomvang",
    "Next": "Volgende",
    "StartTrial": "Start mijn gratis proefperiode",
    "ContactUsIssues": "Neem contact met ons op als je problemen hebt!",
    "TrialActivatedWarning": "Beste {0}, een gebruiker heeft recht op slechts één gratis proefperiode. Je hebt je proefperiode al gebruikt.",
    "ActivationRequirement": "U bent nog maar één stap verwijderd van het starten van uw gratis proefperiode.<br>We hebben een e-mail gestuurd naar <b>{0}</b> om uw account te activeren. Controleer uw inbox/ongewenste/spamboxen!",
    "SaveAndDownload": "Opslaan en downloaden",
    "CompanyNameValidationMessage": "Bedrijfsnaam is te lang!",
    "AddressValidationMessage": "Adres is te lang!",
    "TaxNoValidationMessage": "BELASTING/BTW Nee is te lang!",
    "NotesValidationMessage": "Opmerkingenveld is te lang!",
    "CheckYourBillingInfo": "U kunt uw factuur maar één keer aanmaken! Controleer uw factuurgegevens voordat u uw factuur maakt.",
    "Volo.AbpIo.Commercial:030000": "Je hebt je proefperiode al gebruikt.",
    "Volo.AbpIo.Commercial:030001": "Deze organisatienaam bestaat al.",
    "StartYourFreeTrial": "Start je gratis proefperiode",
    "TrialLicenseModelInvalidErrorMessage": "Een van de volgende velden is ongeldig: Landnaam, Bedrijfsgrootte, Industrie of Gebruiksdoel.",
    "Trial": "Proces",
    "Purchased": "Gekocht",
    "PurchaseLicense": "Licentie kopen",
    "PurchaseTrialLicenseMessage": "De vervaldatum van uw licentie is {0}. <br> Als je de projecten die je tijdens je gratis proefperiode hebt gemaakt wilt blijven gebruiken, moet je de licentiesleutels in je <code>appsettings.secrets.json</code>-bestanden wijzigen. Hier is uw licentiesleutel:",
    "TrialLicenseExpireMessage": "U gebruikt de proeflicentie en uw proeflicentie verloopt op {0}.",
    "TryForFree": "Probeer gratis",
    "TrialLicenseExpiredInfo": "Uw proeflicentieperiode is verlopen!",
    "CommercialNewsletterConfirmationMessage": "Ik ga akkoord met de <a href=\"https://commercial.abp.io/TermsConditions\">Algemene voorwaarden</a> en het <a href=\"https://commercial.abp.io/Privacy\">Privacybeleid </a>."
  }
}