{
  "culture": "nl",
  "texts": {
    "OrganizationManagement": "Organisatie management",
    "OrganizationList": "Organisatie lijst",
    "Volo.AbpIo.Commercial:010003": "U bent geen eigenaar van deze organisatie!",
    "OrganizationNotFoundMessage": "Geen organisatie gevonden!",
    "DeveloperCount": "Toegewezen/totale ontwikkelaars",
    "QuestionCount": "Resterende/totale vragen",
    "Unlimited": "Onbeperkt",
    "Owners": "Eigenaren",
    "Owner": "Eigenaar",
    "AddMember": "Lid toevoegen",
    "AddNewOwner": "Nieuwe eigenaar toevoegen",
    "AddNewDeveloper": "Nieuwe ontwikkelaar toevoegen",
    "UserName": "gebruikersnaam",
    "Name": "Naam",
    "EmailAddress": "E-mailadres",
    "Developers": "ontwikkelaars",
    "LicenseType": "Licentie type",
    "Manage": "Beheren",
    "SetDefault": "Instellen als standaard",
    "DefaultOrganization": "Standaard",
    "StartDate": "Startdatum",
    "EndDate": "Einddatum",
    "Modules": "Modules",
    "LicenseExtendMessage": "De einddatum van uw licentie is verlengd tot {0}",
    "LicenseUpgradeMessage": "Uw licentie is geüpgraded naar {0}",
    "LicenseExtendAdnUpgradeMessage": "Uw licentie is verlengd tot {0} en uw licentieplan is geüpgraded naar {1}.",
    "LicenseAddDeveloperMessage": "{0} ontwikkelaars toegevoegd aan uw licentie",
    "Volo.AbpIo.Commercial:010004": "Kan de opgegeven gebruiker niet vinden! De gebruiker moet zich al hebben geregistreerd.",
    "MyOrganizations": "Mijn organisaties",
    "ApiKey": "API sleutel",
    "UserNameNotFound": "Er is geen gebruiker met gebruikersnaam {0}",
    "SuccessfullyAddedToNewsletter": "Bedankt voor het abonneren op onze nieuwsbrief!",
    "MyProfile": "Mijn profiel",
    "EmailNotValid": "Vul een geldig e-mailadres in.",
    "JoinOurMarketingNewsletter": "Schrijf je in voor onze marketingnieuwsbrief",
    "WouldLikeToReceiveMarketingMaterials": "Ik wil graag marketingmateriaal ontvangen, zoals productdeals en speciale aanbiedingen.",
    "StartUsingYourLicenseNow": "Begin nu met het gebruiken van uw licentie!",
    "WelcomePage": "Welkomstpagina",
    "UnsubscriptionExpireEmail": "Afmelden voor herinneringsmails voor de vervaldatum van de licentie",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Dit e-mailabonnement bevat alleen een herinnering aan de vervaldatum van uw licentie.",
    "UnsubscribeFromLicenseExpireEmails": "Als u geen e-mails over de vervaldatum van uw licentie wilt ontvangen, kunt u zich op elk gewenst moment uitschrijven.",
    "Unsubscribe": "Afmelden",
    "NotOrganizationMember": "U bent van geen enkele organisatie lid.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Uitgeschreven",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "U ontvangt geen herinneringsmails meer voor de vervaldatum van de licentie.",
    "IndexPageHeroSection": "<span class=\"first-line\">Een compleet</span><span class=\"second-line\"> webontwikkelingsplatform</span><span class=\"third-line\">ingebouwd <img src= \"{0}\" width=\"110\" class=\"ml-1\" /> raamwerk</span>",
    "AbpCommercialShortDescription": "ABP Commercial biedt kant-en-klare applicatiemodules, tooling voor snelle applicatieontwikkeling, professionele UI-thema's, premium ondersteuning en meer.",
    "LiveDemo": "Live demonstratie",
    "LiveDemoLead": "<a href=\"{0}\">{1}</a> met behulp van uw ABP-account, <a href=\"{2}\">{3}</a> naar abp.io.<br/>Of vul het onderstaande formulier in om nu een live demo te maken",
    "ThereIsAlreadyAnAccountWithTheGivenEmailAddress": "Er is al een account met het opgegeven e-mailadres: <b>{0}</b><br/> U kunt inloggen met uw account om door te gaan.",
    "GetLicence": "Verkrijg een licentie",
    "Application": "Sollicitatie",
    "StartupTemplates": "Opstartsjablonen",
    "Startup": "Beginnen",
    "Templates": "Sjablonen",
    "Developer": "Ontwikkelaar",
    "Tools": "Gereedschap",
    "Premium": "Premie",
    "PremiumSupport": "Premium-ondersteuning",
    "PremiumForumSupport": "Premium Forum-ondersteuning",
    "UI": "gebruikersinterface",
    "Themes": "Thema's",
    "JoinOurNewsletter": "Schrijf je in op onze nieuwsbrief",
    "Send": "Versturen",
    "WhatIsABPFramework": "WAT IS HET ABP-KADER?",
    "OpenSourceBaseFramework": "Open source basisframework",
    "ABPFrameworkExplanation": "<p class=\"lead\">ABP Commercial is gebaseerd op het ABP Framework, een open source en community-gedreven webapplicatieframework voor ASP.NET Core.</p><p>ABP Framework biedt een uitstekende infrastructuur om onderhoudbaar en uitbreidbaar te schrijven en testbare code met best practices.</p><p>Gebouwd op en geïntegreerd in populaire tools die je al kent. Lage leercurve, gemakkelijke aanpassing, comfortabele ontwikkeling.</p>",
    "Modular": "Modulair",
    "MicroserviceCompatible": "Microservice-compatibel",
    "DomainDrivenDesignInfrastructure": "Domeingestuurde ontwerpinfrastructuur",
    "MultiTenancy": "Meerdere huurders",
    "DistributedMessaging": "Gedistribueerde berichten",
    "DynamicProxying": "Dynamische proxy",
    "BackgroundJobs": "Achtergrond banen",
    "AuditLogging": "Auditlogboekregistratie",
    "BLOBStoring": "BLOB-opslag",
    "BundlingMinification": "Bundeling & Minificatie",
    "AdvancedLocalization": "Geavanceerde lokalisatie",
    "ManyMore": "Veel meer",
    "ExploreTheABPFramework": "Verken het ABP-raamwerk",
    "WhyUseTheABPCommercial": "Waarom de ABP Commercial gebruiken?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\">Het bouwen van webapplicaties op ondernemingsniveau kan complex en tijdrovend zijn.</p><p>ABP Commercial biedt de perfecte basisinfrastructuur die nodig is voor alle moderne enterprise-grade ASP.NET Core gebaseerde oplossingen. Vanaf het ontwerp tot de implementatie wordt de hele ontwikkelingscyclus mogelijk gemaakt door de ingebouwde functies en modules van ABP.</p>",
    "StartupTemplatesShortDescription": "Met opstartsjablonen kunt u in een paar seconden aan de slag met uw project.",
    "UIFrameworksOptions": "Opties voor UI-frameworks;",
    "DatabaseProviderOptions": "Opties voor databaseproviders;",
    "PreBuiltApplicationModules": "Vooraf gebouwde applicatiemodules",
    "PreBuiltApplicationModulesShortDescription": "De meest voorkomende applicatie-eisen zijn al voor u ontwikkeld als herbruikbare modules.",
    "Account": "Rekening",
    "Blogging": "Bloggen",
    "Identity": "Identiteit",
    "IdentityServer": "Identiteitsserver",
    "Saas": "Saas",
    "LanguageManagement": "Taalbeheer",
    "TextTemplateManagement": "Beheer van tekstsjablonen",
    "See All Modules": "BekijkAlleModules",
    "ABPSuite": "ABP-suite",
    "AbpSuiteShortDescription": "ABP Suite is een aanvulling op de ABP Commercial.",
    "AbpSuiteExplanation": "Hiermee kunt u binnen enkele minuten webpagina's bouwen. Het is een .NET Core Global-tool die vanaf de opdrachtregel kan worden geïnstalleerd. Het kan een nieuwe ABP-oplossing maken, CRUD-pagina's genereren vanuit de database naar de front-end.",
    "Details": "Details",
    "LeptonTheme": "Lepton-thema",
    "ProfessionalModernUIThemes": "Professionele, moderne UI-thema's",
    "LeptonThemeExplanation": "Lepton biedt een scala aan Bootstrap-beheerthema's die dienen als een solide basis voor elk project waarvoor een beheerdersdashboard vereist is.",
    "DefaultTheme": "Standaard thema",
    "MaterialTheme": "Materieel thema",
    "Default2Theme": "Standaard 2 thema",
    "DarkTheme": "Donker thema",
    "DarkBlueTheme": "Donkerblauw thema",
    "LightTheme": "Licht thema",
    "ProudToWorkWith": "Trots om mee te werken",
    "OurConsumers": "Duizenden ondernemingen en ontwikkelaars in meer dan 70 landen wereldwijd vertrouwen op ABP Commercial.",
    "JoinOurConsumers": "Sluit je bij hen aan en bouw snel geweldige producten.",
    "AdditionalServicesExplanation": "Heeft u aanvullende of aangepaste diensten nodig? <strong>Wij en onze partners kunnen bieden;</strong>",
    "CustomProjectDevelopment": "Projectontwikkeling op maat",
    "CustomProjectDevelopmentExplanation": "Toegewijde ontwikkelaars voor uw projecten op maat.",
    "PortingExistingProjects": "Bestaande projecten overdragen",
    "PortingExistingProjectsExplanation": "Uw legacy projecten migreren naar het ABP platform.",
    "LiveSupport": "Live ondersteuning",
    "LiveSupportExplanation": "Live ondersteuning op afstand wanneer je het nodig hebt.",
    "Training": "Opleiding",
    "TrainingExplanation": "Toegewijde training voor uw ontwikkelaars.",
    "OnBoarding": "Onboarding",
    "OnBoardingExplanation": "Hulp bij het opzetten van uw ontwikkel-, CI- en CD-omgevingen.",
    "PrioritizedTechnicalSupport": "Geprioriteerde technische ondersteuning",
    "PremiumSupportExplanation": "Naast de geweldige community-ondersteuning van het ABP-framework, beantwoordt ons ondersteuningsteam technische vragen en problemen van de commerciële gebruikers met hoge prioriteit.",
    "SeeTheSupportOptions": "Zie de ondersteuningsopties",
    "Contact": "Contact",
    "TellUsWhatYouNeed": "Vertel ons wat je nodig hebt.",
    "YourMessage": "Uw bericht",
    "YourFullName": "Je volledige naam",
    "FirstNameField": "Voornaam",
    "LastNameField": "Achternaam",
    "EmailField": "E-mailadres",
    "YourEmailAddress": "Jouw e-mailadres",
    "ValidEmailAddressIsRequired": "Een geldig e-mailadres is vereist.",
    "HowMayWeHelpYou": "Hoe kunnen we je helpen?",
    "SendMessage": "Bericht versturen",
    "Success": "Succes",
    "WeWillReplyYou": "We hebben uw bericht ontvangen en nemen spoedig contact met u op.",
    "GoHome": "Ga naar huis",
    "CreateLiveDemo": "Live demo maken",
    "CreateLiveDemoDescription": "Zodra u dit formulier indient, ontvangt u een e-mail met uw demolink.",
    "RegisterToTheNewsletter": "Schrijf je in voor de nieuwsbrief om informatie over ABP.IO te ontvangen, inclusief nieuwe releases etc.",
    "EnterYourEmailOrLogin": "Voer uw e-mailadres in om uw demo te maken of <a href=\"{0}\">Log in</a> met uw bestaande account.",
    "ApplicationTemplate": "Toepassingssjabloon",
    "ApplicationTemplateExplanation": "Opstartsjabloon voor toepassingen wordt gebruikt om een nieuwe webtoepassing te maken.",
    "EfCoreProvider": "Entity Framework (ondersteunt SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\">en anderen</a>)",
    "AlreadyIncludedInTemplateModules": "De volgende modules zijn al opgenomen en geconfigureerd in deze sjabloon:",
    "ApplicationTemplateArchitecture": "Deze applicatiesjabloon ondersteunt ook een gelaagde architectuur waarbij de UI-laag, API-laag en de authenticatieservice fysiek gescheiden zijn.",
    "SeeTheGuideOrGoToTheLiveDemo": "Raadpleeg de handleiding voor ontwikkelaars voor technische informatie over deze sjabloon of ga naar de live demo.",
    "DeveloperGuide": "Handleiding voor ontwikkelaars",
    "ModuleTemplate": "Modulesjabloon",
    "ModuleTemplateExplanation1": "U wilt een module maken en deze in verschillende toepassingen hergebruiken? Deze opstartsjabloon bereidt alles voor om een herbruikbare <strong>toepassingsmodule</strong> of een <strong>microservice</strong> te maken.",
    "ModuleTemplateExplanation2": "<p>U kunt enkele of meerdere UI-frameworks, enkele of meerdere databaseproviders voor een enkele module ondersteunen. De opstartsjabloon is geconfigureerd om uw module uit te voeren en te <strong>testen</strong> in een minimale applicatie naast de unit- en integratietestinfrastructuur. </p> <p>Zie de handleiding voor ontwikkelaars voor technische informatie over deze sjabloon.</p>",
    "WithAllStyleOptions": "met alle stijlopties",
    "Demo": "Demo",
    "SeeAllModules": "Bekijk alle modules",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) is een opdrachtregelprogramma om een aantal veelvoorkomende bewerkingen uit te voeren voor op ABP gebaseerde oplossingen.",
    "ABPSuiteEasilyCURD": "ABP Suite is een tool waarmee u eenvoudig CRUD-pagina's kunt maken",
    "WeAreHereToHelp": "We zijn hier om <span class=\"zero-text\">Help</span>",
    "BrowseOrAskQuestion": "U kunt door onze Help-onderwerpen bladeren of zoeken in veelgestelde vragen, of u kunt ons een vraag stellen via het <a href=\"{0}\" class=\"text-success\">contactformulier</a>.",
    "SearchQuestionPlaceholder": "Zoeken in veelgestelde vragen",
    "WhatIsTheABPCommercial": "Wat is de ABP Commercial?",
    "WhatAreDifferencesThanAbpFramework": "Wat zijn de verschillen tussen het open source ABP Framework en de ABP Commercial?",
    "AbpCommercialMetaTitle": "{0} | ABP Commercieel",
    "AbpCommercialMetaDescription": "Een uitgebreid webontwikkelingsplatform op ABP Framework met vooraf gebouwde modules, opstartsjablonen, snelle ontwikkelingstools, professionele UI-thema&#39;s en premium ondersteuning.",
    "ABPCommercialExplanation": "ABP Commercial is een set premiummodules, tools, thema's en services die bovenop het open source <a target=\"_blank\" href=\"{0}\">ABP-framework</a> zijn gebouwd. ABP Commercial wordt ontwikkeld en ondersteund door hetzelfde team achter het ABP framework.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\">ABP-framework</a> is een modulair, themaeerbaar, microservice-compatibel applicatie-ontwikkelingsframework voor ASP.NET Core. Het biedt een complete architectuur en een sterke infrastructuur zodat u zich kunt concentreren op uw eigen bedrijfscode in plaats van uzelf te herhalen voor elk nieuw project. Het is gebaseerd op best practices voor softwareontwikkeling en populaire tools die u al kent. </p> <p> ABP-framework is volledig gratis, open source en community-gedreven. Het biedt ook een gratis thema en enkele vooraf gebouwde modules (bijvoorbeeld identiteitsbeheer en huurdersbeheer).</p>",
    "VisitTheFrameworkVSCommercialDocument": "Bezoek de volgende link voor meer informatie <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial voegt de volgende voordelen toe bovenop het ABP-raamwerk;",
    "Professional": "Professioneel",
    "UIThemes": "UI-thema's",
    "EnterpriseModules": "Bedrijfsklare, functierijke, vooraf gebouwde <a href=\"{0}\">toepassingsmodules</a> (bijv. Identity Server-beheer, SaaS-beheer, taalbeheer)",
    "ToolingToSupport": "Tooling om uw ontwikkelingsproductiviteit te ondersteunen (bijv. <a href=\"{0}\">ABP Suite</a>)",
    "PremiumSupportLink": "Premium <a href=\"{0}\" target=\"_blank\">ondersteuning</a>",
    "WhatDoIDownloadABPCommercial": "Wat download ik als ik de ABP Commercial aanschaf?",
    "CreateUnlimitedSolutions": "Zodra u een ABP Commercial-licentie aanschaft, kunt u onbeperkte oplossingen maken, zoals beschreven in het document <a href=\"{0}\">Aan de slag</a>.",
    "ABPCommercialSolutionExplanation": "Wanneer u een nieuwe toepassing maakt, krijgt u een Visual Studio-oplossing (een opstartsjabloon) op basis van uw voorkeuren. De gedownloade oplossing heeft commerciële modules en thema's die al voor u zijn geïnstalleerd en geconfigureerd. U kunt desgewenst een vooraf geïnstalleerde module verwijderen of een andere module toevoegen. Alle modules en thema's worden standaard gebruikt als NuGet/NPM-pakketten.",
    "StartDevelopWithTutorials": "De gedownloade oplossing is goed ontworpen en gedocumenteerd. U kunt beginnen met het ontwikkelen van uw eigen bedrijfscode op basis van <a href=\"{0}\">de tutorials</a>",
    "TryTheCommercialDemo": "U kunt <a href=\"{0}\">de demo</a> proberen om een voorbeeldtoepassing te zien die is gemaakt met behulp van de ABP Commercial-opstartsjabloon.",
    "HowManyProducts": "Hoeveel verschillende producten/oplossingen kan ik bouwen met de ABP Commercial?",
    "HowManyProductsExplanation": "Er is geen limiet voor het maken van een ABP-project. U kunt zoveel projecten maken als u wilt, ze ontwikkelen en uploaden naar verschillende servers.",
    "HowManyDevelopers": "Hoeveel developers kunnen aan de ABP Commercial werken?",
    "HowManyDevelopersExplanation": "ABP Commerciële licenties zijn per ontwikkelaar. Verschillende licentietypen hebben verschillende ontwikkelaarslimieten. U kunt echter op elk gewenst moment meer ontwikkelaars aan elk licentietype toevoegen. Bekijk de pagina <a href=\"{0}\">de prijzen</a> voor licentietypen, ontwikkelaarslimieten en extra ontwikkelaarskosten.",
    "ChangingLicenseType": "Kan ik mijn licentietype later upgraden?",
    "ChangingLicenseTypeExplanation": "U kunt upgraden naar een hogere licentie door het verschil binnen uw actieve licentieperiode te betalen. Wanneer u upgradet naar een hoger licentieplan, krijgt u de voordelen van het nieuwe plan, maar de licentie-upgrade verandert de vervaldatum van de licentie niet. Daarnaast kun je ook nieuwe developers seats toevoegen aan je bestaande licentie, zie \"Hoeveel developers kunnen aan de ABP Commercial werken?\"",
    "LicenseExtendUpgradeDiff": "Wat is het verschil tussen licentieverlenging en upgrade?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Verlengen:</strong> Door uw licentie te verlengen/vernieuwen, blijft u premium ondersteuning krijgen en krijgt u grote of kleine updates voor de modules en thema&#39;s. Bovendien kun je doorgaan met het creëren van nieuwe projecten. En je kunt nog steeds gebruik maken van ABP Suite, wat je ontwikkeling versnelt. Wanneer u uw licentie verlengt, wordt er 1 jaar toegevoegd aan de vervaldatum van uw licentie.<hr/> <strong>Upgraden:</strong> Door uw licentie te upgraden, wordt u gepromoveerd naar een hoger licentieplan, waardoor u extra voordelen kunt krijgen. Bekijk de <a href=\"/pricing\">licentievergelijkingstabel</a> om de verschillen tussen de licentieplannen te zien. <strong>Aan de andere kant, als u upgradet, verandert de vervaldatum van uw licentie niet!</strong> Om de einddatum van uw licentie te verlengen, moet u uw licentie verlengen.",
    "LicenseRenewalCost": "Wat zijn de kosten voor het verlengen van de licentie na 1 jaar?",
    "LicenseRenewalCostExplanation": "De prijs voor het verlengen (verlengen) van de standaard Teamlicentie is ${0}, de standaard Business-licentie is ${1} en de standaard Enterprise-licentie is ${2}. Als u al klant bent, <a href='{3}' target='_blank'>log in op uw account</a> om de huidige verlengingsprijzen te bekijken.",
    "HowDoIRenewMyLicense": "Hoe verleng ik mijn licentie?",
    "HowDoIRenewMyLicenseExplanation": "U kunt uw licentie verlengen door naar de <a href='{0}' target='_blank'>organisatiebeheerpagina</a> te gaan. Om te profiteren van onze gereduceerde tarieven voor vroege verlenging, moet u ervoor zorgen dat u verlengt voordat uw licentie verloopt. U hoeft zich echter geen zorgen te maken dat u niet weet wanneer uw mogelijkheid tot vervroegde verlenging afloopt. Je ontvangt 3 herinneringsmails voordat je abonnement afloopt. We sturen ze 30 dagen, 7 dagen en 1 dag voor de vervaldatum.",
    "IsSourceCodeIncluded": "Bevat mijn licentie de broncode van de commerciële modules en thema's?",
    "IsSourceCodeIncludedExplanation1": "Afhankelijk van het licentietype dat u hebt aangeschaft:",
    "IsSourceCodeIncludedExplanation2": "<strong>Team</strong>: uw oplossing gebruikt de modules en de thema's als NuGet- en NPM-pakketten. Het bevat niet hun broncode. Op deze manier kunt u deze modules en thema's eenvoudig upgraden wanneer er een nieuwe versie beschikbaar is. U kunt echter niet de broncode van de modules en de thema's krijgen.",
    "IsSourceCodeIncludedExplanation3": "<strong>Business/Enterprise</strong>: naast de Team-licentie kunt u de broncode downloaden van elke module of elk thema dat u nodig hebt. U kunt zelfs de NuGet/NPM-pakketreferenties voor een bepaalde module verwijderen en de broncode rechtstreeks aan uw oplossing toevoegen om deze volledig te wijzigen.",
    "IsSourceCodeIncludedExplanation4": "<p>Het toevoegen van de broncode van een module aan uw oplossing geeft u de maximale vrijheid om die module aan te passen. Het is dan echter niet mogelijk om de module automatisch te upgraden wanneer een nieuwe versie wordt uitgebracht.</p><p>Geen van de licenties bevat de ABP Suite-broncode, een externe tool die code voor u genereert en assisteert voor uw ontwikkeling.</p><p>Zie <a href=\"{0}\">de pagina met prijzen</a> voor andere verschillen tussen de licentietypen.</p>",
    "ChangingDevelopers": "Kan ik de geregistreerde ontwikkelaars van mijn organisatie in de toekomst wijzigen?",
    "ChangingDevelopersExplanation": "Naast het toevoegen van nieuwe ontwikkelaars aan uw licentie, kunt u ook de bestaande ontwikkelaars wijzigen (u kunt een ontwikkelaar verwijderen en een nieuwe toevoegen aan dezelfde stoel) zonder extra kosten.",
    "WhatHappensWhenLicenseEnds": "Wat gebeurt er als mijn licentieperiode afloopt?",
    "WhatHappensWhenLicenseEndsExplanation1": "De commerciële licentie van ABP is een <a href=\"{0}\" target=\"_blank\">eeuwigdurende licentie</a> . Nadat uw licentie is verlopen, kunt u doorgaan met de ontwikkeling van uw project. En u bent niet verplicht uw licentie te verlengen. Uw licentie wordt standaard geleverd met een update- en ondersteuningsplan voor één jaar. Om nieuwe functies, prestatieverbeteringen, bugfixes en ondersteuning te blijven ontvangen en ABP Suite te blijven gebruiken, moet u uw licentie verlengen. Wanneer uw licentie verloopt;",
    "WhatHappensWhenLicenseEndsExplanation2": "Met de ABP Commercial kunt u geen nieuwe oplossingen creëren, maar u kunt uw bestaande applicaties wel eeuwig blijven doorontwikkelen.",
    "WhatHappensWhenLicenseEndsExplanation3": "U kunt updates krijgen voor de modules en thema&#39;s binnen uw MINOR-versie (behalve RC- of Preview-versies). Als u bijvoorbeeld v3.2.0 van een module gebruikt, kunt u nog steeds updates krijgen voor v3.2.x (v3.2.1, v3.2.5... enz.) van die module. Maar u kunt geen updates krijgen voor de volgende grote of secundaire versie (zoals v3.3.0, v3.3.3, 4.xx, enz.). Toen uw licentie bijvoorbeeld verliep, was de laatste release v4.4.3, en later werd zowel de versie 4.4.4 als de versie 4.5.0 gepubliceerd. U zou toegang kunnen krijgen tot versie 4.4.X, maar dat zou niet zo zijn. toegang tot v4.5.X.",
    "WhatHappensWhenLicenseEndsExplanation4": "U kunt geen nieuwe modules en thema&#39;s installeren die aan het ABP Commercial-platform zijn toegevoegd nadat uw licentie is afgelopen.",
    "WhatHappensWhenLicenseEndsExplanation5": "U kunt geen gebruik maken van de ABP Suite.",
    "WhatHappensWhenLicenseEndsExplanation6": "U kunt de <a href=\"{0}\">premiumondersteuning</a> niet meer krijgen.",
    "WhatHappensWhenLicenseEndsExplanation7": "U kunt uw licentie verlengen (hernieuwen) als u van deze voordelen wilt blijven profiteren. Als u uw licentie verlengt binnen <strong>{3} dagen</strong> nadat uw licentie is verlopen, worden de volgende kortingen toegepast: Teamlicentie {0}; Bedrijfslicentie {1}; Enterprise-licentie {2}.",
    "discountForYears": "{0}% korting voor {1} jaar/jaren",
    "WhatHappensWhenLicenseEndsExplanation8": "De door u gegenereerde ABP-projecten worden niet op onze servers opgeslagen. Daarom is het uw verantwoordelijkheid om de broncode die u downloadt te behouden. Wanneer uw licentie verloopt, kunt u de gegenereerde ABP-projectbroncode niet meer verkrijgen.",
    "WhenShouldIRenewMyLicense": "Wanneer moet ik mijn licentie verlengen?",
    "WhenShouldIRenewMyLicenseExplanation": "Als u uw licentie verlengt binnen <strong>{3} dagen</strong> nadat uw licentie is verlopen, worden de volgende kortingen toegepast: Teamlicentie {0}% korting, Zakelijke licentie {1}% korting, Enterprise-licentie {2}% korting . Als u uw licentie <strong>{3} dagen</strong> na de vervaldatum van uw licentie verlengt, is de verlengingsprijs gelijk aan de aankoopprijs van de licentie en wordt er geen korting op uw verlenging gegeven.",
    "TrialPlan": "Heb je een proefplan?",
    "TrialPlanExplanation": "Ja, neem contact op <a href=\"mailto:marketing@volosoft.com?subject=ABP Commercial — Trial License Request\">met marketing@volosoft.com</a> om uw gratis proefperiode te starten. We bieden ook een geld-terug-garantie van 30 dagen voor de teamlicentie, zonder vragen te stellen! U kunt binnen de eerste 30 dagen na aankoop van de licentie een volledige terugbetaling aanvragen. We bieden een terugbetaling van 60% binnen 30 dagen voor Business- en Enterprise-licenties. Dit komt omdat de Business- en Enterprise-licenties de volledige broncode van alle modules en thema&#39;s bevatten.",
    "DoYouAcceptBankWireTransfer": "Accepteert u bankoverschrijvingen?",
    "DoYouAcceptBankWireTransferExplanation": "Ja, we accepteren bankoverschrijvingen.<br />Nadat u de licentievergoeding via bankoverschrijving heeft verzonden, stuurt u een e-mail naar accounting@abp.io met uw kwitantie en het type licentie dat u heeft aangevraagd. Onze internationale bankrekeninggegevens:",
    "HowToUpgrade": "Hoe kan ik bestaande applicaties upgraden wanneer er een nieuwe versie beschikbaar is?",
    "HowToUpgradeExplanation1": "Wanneer je een nieuwe applicatie maakt met ABP Commercial, worden alle modules en het thema gebruikt als NuGet- en NPM-pakketten. U kunt de pakketten dus eenvoudig upgraden wanneer er een nieuwe versie beschikbaar is.",
    "HowToUpgradeExplanation2": "Naast de standaard NuGet/NPM-upgrades, biedt <a href=\"{0}\">ABP CLI</a> een update-opdracht die automatisch alle ABP-gerelateerde pakketten in uw oplossing vindt en opwaardeert.",
    "DatabaseSupport": "Welke databasesystemen worden ondersteund?",
    "DatabaseSupportExplanation": "ABP Framework zelf is database-agnostisch en kan van nature met elke databaseprovider werken. Zie <a href=\"{0}\" target=\"_blank\">het document voor gegevenstoegang</a> voor een lijst met momenteel geïmplementeerde providers.",
    "UISupport": "Welke UI-frameworks worden ondersteund?",
    "Supported": "Ondersteund",
    "UISupportExplanation": "ABP Framework zelf is UI-framework-agnostisch en kan met elk UI-framework werken. Opstartsjablonen, module-UI's en thema's zijn echter niet voor alle UI-frameworks geïmplementeerd. Zie <a href=\"{0}\">het document 'Aan de slag'</a> voor de up-to-date lijst met UI-opties.",
    "MicroserviceSupport": "Ondersteunt het de microservice-architectuur?",
    "MicroserviceSupportExplanation1": "Een van de belangrijkste doelen van het ABP-raamwerk is het bieden van een gemakkelijke infrastructuur om microserviceoplossingen te creëren. Bekijk het document <a href=\"{0}\">microservice-architectuur</a> om te begrijpen hoe het helpt bij het maken van microservicesystemen.",
    "MicroserviceSupportExplanation2": "Alle ABP Commercial-modules zijn ontworpen om implementatiescenario's voor microservices te ondersteunen (met een eigen API en database) door het document <a href=\"{0}\">best practices voor moduleontwikkeling</a> te volgen.",
    "MicroserviceSupportExplanation3": "We bieden een voorbeeld van een <a href=\"{0}\">demo-oplossing voor microservices</a> die een implementatie van een microservicearchitectuur demonstreert om u te helpen uw eigen oplossing te maken.",
    "MicroserviceSupportExplanation4": "Het korte antwoord is dus \"<strong>ja, het ondersteunt microservice-architectuur</strong>\".",
    "MicroserviceSupportExplanation5": "Een microservicesysteem is echter een oplossing en elke oplossing heeft andere vereisten, netwerktopologie, communicatiescenario's, authenticatiemogelijkheden, beslissingen over het scheiden/delen van databases, runtime-configuraties, systeemintegraties van derden en nog veel meer.",
    "MicroserviceSupportExplanation6": "Het ABP Framework en de ABP Commercial bieden infrastructuur voor microservicescenario's, microservicecompatibele modules, voorbeelden en documentatie om u te helpen uw eigen oplossing te bouwen. Maar verwacht niet direct uw droomoplossing te downloaden die voor u is gebouwd. U moet het begrijpen en enkele onderdelen samenbrengen op basis van uw vereisten.",
    "WhereCanIDownloadSourceCode": "Waar kan ik de broncode downloaden?",
    "WhereCanIDownloadSourceCodeExplanation": "U kunt de broncode van alle ABP-modules, Angular-pakketten en thema's downloaden via ABP Suite of ABP CLI. Zie <a href=\"{0}\">Hoe de broncode te downloaden?</a>",
    "ComputerLimitation": "Op hoeveel computers kan een ontwikkelaar inloggen bij het ontwikkelen van ABP?",
    "ComputerLimitationExplanation": "We staan specifiek <strong>{0} computers</strong> toe per individuele/gelicentieerde ontwikkelaar. Wanneer een ontwikkelaar ABP Commercial-producten op een derde machine moet ontwikkelen, moet er een e-mail worden gestuurd naar license@abp.io waarin de situatie wordt uitgelegd en we zullen dan de juiste toewijzing in ons systeem maken.",
    "RefundPolicy": "Heeft u een restitutiepolis?",
    "RefundPolicyExplanation": "U kunt binnen <strong>30 dagen</strong> na aankoop van uw licentie een teruggave aanvragen. De Business- en Enterprise-licentietypen hebben een downloadoptie voor broncode, daarom zijn restituties niet beschikbaar voor de Business en Enterprise (en eventuele licenties die het recht bevatten om broncode te ontvangen). Bovendien worden er geen terugbetalingen gedaan voor verlengingen en tweede licentieaankopen.",
    "HowCanIRefundVat": "Hoe kan ik btw terugvragen?",
    "HowCanIRefundVatExplanation1": "Als je de betaling hebt gedaan met 2Checkout, kun je btw terugbetalen via je 2Checkout-account:",
    "HowCanIRefundVatExplanation2": "Log in op uw <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\">2Checkout</a>-account",
    "HowCanIRefundVatExplanation3": "Zoek de juiste bestelling en druk op \"Te laat betaalde btw terugbetalen\" (voer uw btw-nummer in)",
    "HowCanIGetMyInvoice": "Hoe kan ik mijn factuur krijgen?",
    "HowCanIGetMyInvoiceExplanation": "Er zijn 2 betalingsgateways voor het aanschaffen van een licentie: Iyzico en 2Checkout. Als u uw licentie aanschaft via de 2Checkout-gateway, stuurt deze de PDF-factuur naar uw e-mailadres, zie <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How- do-invoices-work\">2Checkout-facturering.</a> Als u koopt via de Iyzico-gateway, met een aangepaste aankooplink of via bankoverschrijving, zullen we uw factuur voorbereiden en verzenden. U kunt uw factuur opvragen of downloaden vanaf de <a href=\"{0}\">organisatiebeheerpagina</a>. Controleer voordat u contact met ons opneemt voor de factuur uw organisatiebeheerpagina!",
    "Forum": "Forum",
    "SupportExplanation": "ABP Commerciële licenties biedt een premium forum ondersteuning door een team bestaande uit de ABP Framework experts.",
    "PrivateTicket": "Privé Ticket",
    "PrivateTicketExplanation": "Enterprise License omvat ook een privéondersteuning met e-mail- en ticketsysteem.",
    "AbpSuiteExplanation1": "Met ABP Suite bouwt u webpagina's in een kwestie van minuten. Het is een .NET Core Global-tool die vanaf de opdrachtregel kan worden geïnstalleerd.",
    "AbpSuiteExplanation2": "Het kan een nieuwe ABP-oplossing maken, CRUD-pagina's genereren vanuit de database naar de front-end. Voor technisch overzicht zie <a href=\"{0}\">het document</a>",
    "FastEasy": "Snel en gemakkelijk",
    "AbpSuiteExplanation3": "Met ABP Suite kunt u eenvoudig CRUD-pagina's maken. U hoeft alleen uw entiteit en haar eigenschappen te definiëren, laat de rest voor u aan ABP Suite! ABP Suite genereert binnen enkele seconden alle benodigde code voor uw CRUD-pagina. Het ondersteunt Angular, MVC en Blazor gebruikersinterfaces.",
    "RichOptions": "Rijke opties",
    "AbpSuiteExplanation4": "ABP Suite ondersteunt meerdere UI-opties zoals <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\">Razor Pages</a> en <a href=\"https:/ /angular.io\">Angular</a>.Het ondersteunt ook meerdere databases zoals <a href=\"https://www.mongodb.com\">MongoDB</a> en alle databases die worden ondersteund door <strong>EntityFramework Core< /strong> (MS SQL Server, Oracle, MySql, PostgreSQL en <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\">meer </a>).",
    "AbpSuiteExplanation5": "Het mooie is dat je je geen zorgen hoeft te maken over die opties. ABP Suite begrijpt uw projecttype en genereert de code voor uw project en plaatst de gegenereerde code op de juiste plaats in uw project.",
    "SourceCode": "Broncode",
    "AbpSuiteExplanation6": "ABP Suite genereert de broncode voor u! Het genereert geen magische bestanden om de webpagina te genereren. ABP Suite genereert de broncode voor <strong>Entity, Repository, Application Service, Code First Migration, JavaScript/TypeScript en CSHTML/HTML</strong> en ook de benodigde interfaces. ABP Suite genereert de code ook volgens <strong>Best Practices</strong> van softwareontwikkeling, zodat u zich geen zorgen hoeft te maken over de kwaliteit van de gegenereerde code.",
    "AbpSuiteExplanation7": "Aangezien u de broncode van bouwstenen van de gegenereerde CRUD-pagina in de juiste applicatielagen hebt, kunt u de broncode eenvoudig wijzigen en uw aangepaste/bedrijfslogica in de gegenereerde code injecteren.",
    "CrossPlatform": "Cross-platform",
    "AbpSuiteExplanation8": "ABP Suite is gebouwd met .NET Core en is platformonafhankelijk. Het draait als een webtoepassing op uw lokale computer. U kunt het uitvoeren op <strong>Windows</strong>, <strong>Mac</strong> en <strong>Linux</strong>",
    "OtherFeatures": "Andere mogelijkheden",
    "OtherFeatures1": "Werkt eenvoudig <strong>NuGet</strong>- en <strong>NPM</strong>-pakketten op uw oplossing bij.",
    "OtherFeatures2": "Herstelt reeds gegenereerde pagina's helemaal opnieuw.",
    "OtherFeatures3": "Creëert nieuwe oplossingen",
    "ThanksForCreatingProject": "Bedankt voor het maken van uw project!",
    "HotToRunSolution": "Hoe voer je je oplossing uit?",
    "HotToRunSolutionExplanation": "Zie het document Aan de slag om te leren hoe u uw oplossing configureert en uitvoert.",
    "GettingStarted": "Beginnen",
    "WebAppDevTutorial": "Web App Dev Tutorial",
    "WebAppDevTutorialExplanation": "Zie het zelfstudiedocument voor de ontwikkeling van webtoepassingen voor een stapsgewijze ontwikkelingsvoorbeeld.",
    "Document": "Document",
    "UsingABPSuiteToCURD": "ABP Suite gebruiken voor CRUD Page Generation & Tooling",
    "SeeABPSuiteDocument": "Zie het ABP Suite-document om het gebruik van ABP Suite te leren.",
    "AskQuestionsOnSupport": "U kunt vragen stellen over ABP Commerciële Ondersteuning.",
    "Documentation": "Documentatie",
    "SeeModulesDocument": "Zie modules document voor een lijst van alle commerciële(pro) modules en hun documenten.",
    "Pricing": "Prijzen",
    "PricingExplanation": "Kies de functies en functionaliteit die uw bedrijf vandaag nodig heeft. Upgrade eenvoudig naarmate uw bedrijf groeit.",
    "Team": "Team",
    "Business": "Bedrijf",
    "Enterprise": "Onderneming",
    "Custom": "Aangepast",
    "IncludedDeveloperLicenses": "Inbegrepen ontwikkelaarslicenties",
    "CustomLicenceOrAdditionalServices": "Licentie op maat of aanvullende diensten nodig?",
    "CustomOrVolumeLicense": "Aangepaste of volumelicentie",
    "LiveTrainingSupport": "Live training & ondersteuning",
    "AndMore": "en meer",
    "AdditionalDeveloperLicense": "Aanvullende ontwikkelaarslicentie",
    "ProjectCount": "Aantal projecten",
    "AllProModules": "Alle pro-modules",
    "AllProThemes": "Alle professionele thema's",
    "AllProStartupTemplates": "Alle professionele opstartsjablonen",
    "SourceCodeOfAllModules": "Broncode van alle modules",
    "SourceCodeOfAllThemes": "Broncode van alle thema's",
    "PerpetualLicense": "Eeuwigdurende vergunning",
    "UnlimitedServerDeployment": "Onbeperkte serverimplementatie",
    "YearUpgrade": "1 jaar upgrade",
    "YearPremiumForumSupport": "1 jaar premium forumondersteuning",
    "ForumSupportIncidentCountYear": "Aantal incidenten/jaar voor forumondersteuning",
    "PrivateTicketEmailSupport": "Privé ticket & e-mailondersteuning",
    "BuyNow": "Nu kopen",
    "PayViaAmexCard": "Hoe kan ik betalen met mijn AMEX-kaart?",
    "PayViaAmexCardDescription": "De standaard betalingsgateway 'Iyzico' kan sommige AMEX-creditcards weigeren vanwege de veiligheidsmaatregelen. In dit geval kunt u betalen via de alternatieve betalingsgateway '2Checkout'.",
    "ThankYou": "Bedankt",
    "InvalidReCaptchaErrorMessage": "Er is een fout opgetreden bij het verifiëren van reCAPTCHA. Probeer het opnieuw.",
    "CompanyName": "Bedrijfsnaam",
    "YourCompanyName": "Je bedrijfsnaam",
    "FirstName": "Voornaam",
    "LastName": "Achternaam",
    "Optional": "Optioneel",
    "YourFirstName": "Jouw voornaam",
    "YourLastName": "Je achternaam",
    "SpecialOffer": "Speciale aanbieding",
    "SpecialOfferMessage": "Schiet op! Prijzen zijn voor een beperkte tijd geldig.",
    "DiscountRequest": "Kortingsverzoek",
    "DiscountRequestDescribeCustomerQuestion": "Welke van de volgende beschrijft jou?",
    "DiscountRequestStudentEmailMessage": "E-mailadres moet 'edu' bevatten.",
    "DiscountRequestDeveloperCount": "Hoeveel ontwikkelaars ben jij?",
    "DiscountRequestDeveloperCountExceedMessage": "We bieden geen licentie met korting aan bedrijven met meer dan {0} ontwikkelaars.",
    "DiscountRequestOrganizationName": "Naam bedrijf/organisatie/school",
    "Website": "Website",
    "GithubUsername": "GitHub-gebruikersnaam",
    "PhoneNumber": "Telefoonnummer",
    "Country": "Land",
    "DescribeABPCommercialUsage": "Beschrijf het project dat u wilt ontwikkelen op basis van APB Commercial",
    "DiscountRequestCertifyInformationMessage": "Ik verklaar dat alle informatie waar en correct is.",
    "DiscountRequestReceived": "We hebben je kortingsverzoek ontvangen.",
    "DiscountRequestStatusMessage": "We zullen op u reageren nadat we de door u verstrekte informatie hebben gecontroleerd.",
    "MVCOrRazorPages": "MVC (scheermespagina's)",
    "Angular": "hoekig",
    "Blazor": "Blazor",
    "New": "Nieuw",
    "MongoDB": "MongoDB",
    "EBookDDD": "Domeingestuurd ontwerp voor e-books",
    "PracticalGuideForImplementingDDD": "Dit boek is een praktische handleiding voor het implementeren van het Domain Driven Design met het ABP Framework.",
    "IntroducingDDD": "Introductie van domeingestuurd ontwerp",
    "DDDLayersAndCleanArchitecture": "DDD-lagen en schone architectuur",
    "LayeringOfADotnetSolution": "Gelaagdheid van een .NET-oplossing",
    "ImplementingDDDBuildingBlocks": "DDD-bouwstenen implementeren",
    "DomainVsApplicationLogic": "Domeinlogica versus toepassingslogica",
    "SamplesAndDiscussions": "Voorbeelden en discussies",
    "Free": "Vrij",
    "Download": "Downloaden",
    "DDDEBook": "DDD E-book",
    "ImplementingDDD": "Domeingestuurd ontwerp implementeren",
    "DDDBookExplanation": "Een praktische handleiding voor het implementeren van het Domain Driven Design met het ABP Framework.",
    "Overview": "Overzicht",
    "DDDBookPracticalGuide": "Dit is een praktische handleiding voor het implementeren van het Domain Driven Design (DDD). Hoewel de implementatiedetails afhankelijk zijn van de ABP Framework-infrastructuur, zijn kernconcepten, principes en patronen van toepassing op elk soort oplossing, zelfs als het geen .NET-oplossing is.",
    "TableOfContents": "Inhoudsopgave",
    "IntroductionToImplementingDDD": "Inleiding tot het implementeren van domeingestuurd ontwerp",
    "WhatIsDDD": "Wat is Domain Driven Design?",
    "Implementation": "Implementatie",
    "TheBigPicture": "Het grote plaatje",
    "TheBuildingBlock": "De bouwsteen",
    "ExampleUseCase": "Voorbeeld use-case",
    "DomainAndApplicationLogic": "Domeinlogica en toepassingslogica",
    "Author": "Auteur",
    "PublishedOn": "gepubliceerd op",
    "Page": "Bladzijde",
    "FreeEBook": "Gratis e-boek",
    "EBookSignInForDownload": "Om het e-book te downloaden, logt u in",
    "SignIn": "Inloggen",
    "Or": "Of",
    "TellUsAboutYourself": "Vertel ons iets over jezelf",
    "Surname": "Achternaam",
    "DoYouAgreePrivacyPolicy": "Ik ga akkoord met de <a href=\"/TermsConditions\">Algemene voorwaarden<a/> en het <a href=\"/Privacy\">Privacybeleid</a>.",
    "VolosoftMarketingInformationMessage": "Ik wil graag informatie, tips en aanbiedingen over oplossingen voor bedrijven en organisaties en andere producten en diensten van Volosoft.",
    "VolosoftSharingInformationMessage": "Ik wil graag dat Volosoft mijn informatie deelt met geselecteerde partners zodat ik relevante informatie over hun producten en diensten kan ontvangen.",
    "WeWillSendYouADownloadLink": "Een link om het e-book te downloaden is verzonden naar {0}.<br/> Controleer uw inbox/junk/spam!",
    "InvalidFormInputs": "Typ de geldige informatie die op het formulier is gespecificeerd.",
    "DDDBookEmailBody": "Bedankt. <br /> <a href=\"{0}\">klik hier</a> om uw boek te downloaden.",
    "StartFree": "Begin gratis",
    "FreeTrial": "Gratis proefversie",
    "AcceptsMarketingCommunications": " Ja, ik wil graag ABP Commerciële marketingcommunicatie ontvangen.",
    "PurposeOfUsage": "Gebruiksdoel",
    "Choose": "- Kiezen -",
    "CompanyOrganizationName": "bedrijfs/organisatie naam",
    "CompanySize": "Bedrijfsomvang",
    "Next": "Volgende",
    "StartTrial": "Start mijn gratis proefperiode",
    "ContactUsQuestions": "Neem contact met ons op als u vragen heeft",
    "TrialActivatedWarning": "Een gebruiker heeft recht op slechts 1 gratis proefperiode. Je hebt je proefperiode al gebruikt.",
    "ActivationRequirement": "U bent nog één stap verwijderd van het starten van uw proefperiode.<br> Na controle van uw gegevens activeren wij uw licentie. Zodra uw licentie is geactiveerd, sturen we een e-mail naar <b>{0}</b> . Maak je geen zorgen, dit proces zal niet lang duren!",
    "SaveAndDownload": "Opslaan en downloaden",
    "CompanyNameValidationMessage": "Bedrijfsnaam is te lang!",
    "AddressValidationMessage": "Adres is te lang!",
    "TaxNoValidationMessage": "BELASTING/BTW Nee is te lang!",
    "NotesValidationMessage": "Opmerkingenveld is te lang!",
    "CheckYourBillingInfo": "U kunt uw factuur maar één keer aanmaken! Controleer uw factuurgegevens voordat u uw factuur maakt.",
    "StartYourFreeTrial": "Start je gratis proefperiode",
    "TrialLicenseModelInvalidErrorMessage": "Een van de volgende velden is ongeldig: Landnaam, Bedrijfsgrootte, Industrie of Gebruiksdoel.",
    "Trial": "Proces",
    "Purchased": "Gekocht",
    "PurchaseNow": "Koop nu",
    "PurchaseTrialLicenseMessage": "De vervaldatum van uw licentie is {0}. <br> Als je de projecten die je tijdens je gratis proefperiode hebt gemaakt wilt blijven gebruiken, moet je de licentiesleutels in je <code>appsettings.secrets.json</code>-bestanden wijzigen. Hier is uw licentiesleutel:",
    "TrialLicenseExpireMessage": "U gebruikt de proeflicentie en uw proeflicentie verloopt op {0}.",
    "TryForFree": "Probeer gratis",
    "TrialLicenseExpiredInfo": "Uw proeflicentieperiode is verlopen!",
    "DowngradeLicensePlan": "Kan ik in de toekomst downgraden naar een lager licentieplan?",
    "DowngradeLicensePlanExplanation": "U kunt uw bestaande licentieplan niet downgraden. Maar u kunt een nieuw, lager licentieplan aanschaffen en uw ontwikkeling voortzetten op de nieuwe licentie. Nadat u een lagere licentie heeft aangeschaft, hoeft u alleen maar in te loggen op uw nieuwe licentieplan via het ABP CLI-commando: ` abp login<username> -O<organization> `.",
    "LicenseTransfer": "Kan een licentie van de ene ontwikkelaar naar de andere worden overgedragen?",
    "LicenseTransferExplanation": "Ja! Wanneer u een licentie aanschaft, wordt u licentiehouder en heeft u toegang tot de organisatiebeheerpagina. Een organisatie heeft de rollen van eigenaar en ontwikkelaar. Eigenaren kunnen de ontwikkelaarslicenties beheren en ontwikkelaars toewijzen. Elke toegewezen ontwikkelaar logt via de ABP CLI-opdracht in op het systeem en beschikt over ontwikkelings- en ondersteuningsrechten.",
    "UserOwnerDescription": "De &#39;Eigenaar&#39; van de organisatie is de beheerder van dit account. Hij/zij stuurt de organisatie aan door licenties aan te schaffen en ontwikkelaars toe te wijzen. Een &#39;Owner&#39; kan geen code schrijven in de ABP Commercial-projecten, kan de ABP-voorbeeldprojecten niet downloaden en kan geen vragen stellen op de supportwebsite. Als je dit allemaal wilt doen, moet je jezelf ook als ontwikkelaar toevoegen.",
    "UserDeveloperDescription": "De &#39;Developers&#39; kunnen code schrijven in de ABP Commercial-projecten, de ABP-voorbeeldprojecten downloaden en vragen stellen op de supportwebsite. Aan de andere kant kunnen de &#39;Ontwikkelaars&#39; deze organisatie niet beheren.",
    "RemoveCurrentUserFromOrganizationWarningMessage": "U verwijdert uzelf uit uw eigen organisatie. U kunt deze organisatie niet langer beheren, bevestigt u dit?",
    "RenewExistingOrganizationOrCreateNewOneMessage": "U kunt de licentie van uw organisatie(s) verlengen door op de onderstaande knop(pen) &quot;Nu verlengen&quot; te klikken en zo kunt u de vervaldatum van de licentie met 1 jaar verlengen. Als u doorgaat met afrekenen, heeft u een nieuwe organisatie. Wilt u verder met een nieuwe organisatie?",
    "PurchaseTrialOrganizationOrCreateNewOneMessage": "U beschikt over een proeflicentie. Om uw proeflicentie te kopen, klikt u op de knop Nu kopen. Als u doorgaat met afrekenen, heeft u een nieuwe organisatie. Wilt u verder met een nieuwe organisatie?",
    "ExtendNow": "Verleng nu",
    "CreateNewOrganization": "Creëer een nieuwe organisatie",
    "RenewLicenseEarly": "Als ik mijn licentie vroegtijdig verleng, krijg ik dan het volledige jaar?",
    "RenewLicenseEarylExplanation": "Wanneer u uw licentie verlengt vóór de vervaldatum van uw licentie, wordt 1 jaar toegevoegd aan de vervaldatum van uw licentie. Als uw licentie bijvoorbeeld verloopt op {0}-06-06 en u deze verlengt op {0}-01-01, wordt de vervaldatum van uw nieuwe licentie {1}-06-06.",
    "OpenSourceWebApplication": "Open source webapplicatie",
    "CompleteWebDevelopment": "Een complete webontwikkeling",
    "ABPFrameworkDescription": "ABP Framework is een complete infrastructuur om moderne webapplicaties te creëren door de best practices van softwareontwikkeling en conventies te volgen.",
    "CommunityDescription": "Deel jouw ervaringen met het ABP Framework!",
    "GetStarted": "Begin",
    "Views": "keer bekeken",
    "LatestPosts": "Laatste berichten",
    "PreBuiltApplication": "Voorgebouwde applicatie",
    "DatabaseProviders": "Databaseproviders",
    "UIFrameworks": "UI-frameworks",
    "UsefulLinks": "handige links",
    "Platform": "Platform",
    "CoolestCompaniesUseABPCommercial": "De coolste bedrijven maken al gebruik van <span class=\"fw-bold\">ABP Commercial.</span>",
    "UserInterface": "Gebruikersomgeving",
    "APIGateway": "API-gateway",
    "Microservice": "Microservice",
    "Database": "Database",
    "Architecture": "Architectuur",
    "MicroserviceArchitectureExplanation": "Dit is een complete oplossingsarchitectuur die bestaat uit meerdere applicaties, API-gateways, microservices en databases om een schaalbare microservice-oplossing te bouwen met de nieuwste technologieën.",
    "BusinessLogic": "Bedrijfslogica",
    "DataAccessLayer": "Gegevenstoegangslaag",
    "Monolith": "Monoliet",
    "ModularArchitectureExplanation": "Deze opstartsjabloon biedt een gelaagde, modulaire en op DDD gebaseerde oplossingsarchitectuur om een schone en onderhoudbare codebasis te bouwen.",
    "SeeDetails": "Zie de details",
    "SeeDocumentation": "Bekijk de documentatie",
    "Bs5Compatible": "Bootstrap 5-compatibel professioneel thema, perfect voor uw beheerderswebsite.",
    "LeptonXTheme": "LeptonX-thema",
    "LeptonXDark": "LeptonX Donker",
    "LeptonXLight": "LeptonX-licht",
    "LeptonXSemiDark": "LeptonX Halfdonker",
    "BuiltOnBs5Library": "Gebouwd op Bootstrap 5-bibliotheek",
    "FullyCompatibleWithBs5": "100% compatibel met Bootstrap 5 HTML-structuur en CSS-klassen",
    "ResponsiveAndMobileCompatible": "Responsieve, mobiel-compatibele RTL-ondersteuning",
    "ProvidesStylesForDatatables": "Biedt stijlen voor gegevenstabellen",
    "MultipleLayoutOptions": "Meerdere lay-outopties",
    "EasilyInstallAndUpgrade": "Gemakkelijk installeren en upgraden",
    "SupportForum": "Helpforum",
    "TrustedBy": "Vertrouwd door",
    "OurPricing": "Onze <span class=\"gradient-commercial\">prijzen</span>",
    "Plans": "Plannen",
    "NameSurname": "Voornaam Achternaam",
    "Unspecified": "Niet gespecificeerd",
    "LicenceType": "Licentietype",
    "LicenseDiscountWarning": "DEZE KORTINGSPAGINA GEBRUIKT DE STANDAARD KORTINGSCODE EN VOOR VOLOSOFT-ONTWIKKELAARS. AANKOOPLINKS HIERONDER WERKEN NIET.",
    "DiscountedLicenseExplanation": "Deze licentieprijzen zijn voor kleine startups, individuele ontwikkelaars, studenten, non-profit organisaties en projecten!",
    "General": "Algemeen",
    "License": "Licentie",
    "Development": "Ontwikkeling",
    "Payment": "Betaling",
    "WatchExplainerVideo": "Laten we afspreken! Bekijk de uitlegvideo",
    "LightDarkAndSemiDarkThemes": "Licht, donker en halfdonker",
    "LeptonXThemeExplanation": "Lepton Theme kan uw thema wijzigen volgens uw systeeminstellingen.",
    "PRO": "PRO",
    "WelcomeToABPCommercial": "Welkom bij <span class=\"gradient-commercial\">ABP Commercieel!</span>",
    "YourAccountDetails": "Uw accountgegevens",
    "OrganizationName": "organisatie naam",
    "AddDevelopers": "Ontwikkelaars toevoegen",
    "StartDevelopment": "Ontwikkeling starten",
    "CreateAndRunApplicationUsingStartupTemplate": "Leer hoe u een nieuwe webapplicatie kunt maken en uitvoeren met behulp van de opstartsjabloon van ABP Commercial.",
    "CommunityDescription2": "<span class=\"fw-6\">community.abp.io</span> is een plek waar mensen ABP-gerelateerde artikelen kunnen delen. Zoek naar artikelen, tutorials, codevoorbeelden, casestudy&#39;s en ontmoet mensen in dezelfde straat als jij.",
    "UseABPSuiteExplanation": "Gebruik ABP Suite om de broncode van de modules en thema&#39;s te downloaden.",
    "ManageModulesWithSuite": "Ook kunt u uw ABP-modules beheren met Suite.",
    "LearnHowToInstallSuite": "Leer hoe u ABP Suite installeert en gebruikt.",
    "SeeMore": "Bekijk meer",
    "SeeLess": "Zie Minder",
    "LayeredSolutionStructure": "Gelaagde oplossingsstructuur",
    "LayeredSolutionStructureExplanation": "De oplossing is gelaagd op basis van Domain Driven Design-principes en -patronen om uw bedrijfslogica te isoleren van de infrastructuur en integraties en om de onderhoudbaarheid en herbruikbaarheid van code te maximaliseren. ABP Framework biedt al abstracties, basisklassen en handleidingen om DDD echt voor uw toepassing te implementeren.",
    "MultipleUIOptions": "Meerdere UI-opties",
    "MultipleUIOptionsExplanation": "We houden van verschillende manieren om de gebruikersinterface te creëren. Deze opstartoplossing biedt drie verschillende UI-frameworkopties voor uw bedrijfstoepassing.",
    "MultipleDatabaseOptions": "Meerdere databaseopties",
    "MultipleDatabaseOptionsExplanation": "U heeft twee databaseprovideropties (naast het gebruik van beide in één toepassing). Gebruik Entity Framework Core om met elke relationele database te werken en gebruik optioneel Dapper wanneer u query&#39;s op laag niveau moet schrijven voor betere prestaties. MongoDB is een andere optie als u een op documenten gebaseerde NoSQL-database moet gebruiken. Hoewel deze providers goed geïntegreerd, geabstraheerd en vooraf geconfigureerd zijn, kunt u daadwerkelijk communiceren met elk databasesysteem dat u met .NET kunt gebruiken.",
    "ModularArchitectureExplanation2": "Modulariteit is een eersteklasburger op het ABP.IO-platform. Alle applicatiefunctionaliteiten zijn opgesplitst in goed geïsoleerde optionele modules. De startup-oplossing wordt al geleverd met de fundamentele <a href=\"/modules\" class=\"text-primary\">ABP Commercial-modules</a> vooraf geïnstalleerd. U kunt ook uw eigen modules maken om een modulair systeem voor uw eigen toepassing te bouwen.",
    "MultiTenancyForSaasBusiness": "Multi-Tenancy voor uw SaaS-bedrijf",
    "MultiTenancyForSaasBusinessExplanation": "ABP Commercial biedt een compleet, end-to-end multi-tenancy-systeem om uw SaaS-systemen (Software-as-a-Service) te creëren. Het stelt de huurders in staat om hun eigen databases te delen of te gebruiken met een on-the-fly systeem voor het maken en migreren van databases.",
    "MicroserviceStartupSolution": "Microservice-opstartoplossing",
    "MicroserviceArchitectureExplanation2": "U kunt het aanschaffen voor uw volgende microservicesysteem, zodat u kunt profiteren van de kant-en-klare basisoplossing en gedestilleerde ervaring.",
    "PreIntegratedTools": "Vooraf geïntegreerd in populaire tools",
    "PreIntegratedToolsExplanation": "De oplossing is al geïntegreerd in de industriestandaard tools en technologieën, terwijl u deze altijd kunt wijzigen en integreren met uw favoriete tools.",
    "SingleSignOnAuthenticationServer": "Authenticatieserver voor eenmalige aanmelding",
    "SingleSignOnAuthenticationServerExplanation": "De oplossing beschikt over een authenticatieserverapplicatie die door de andere applicaties wordt gebruikt als een single sign-on-server met de API-toegangsbeheerfuncties. Het is gebaseerd op de IdentityServer.",
    "WebAppsWithGateways": "2 Web-app met 2 API-gateways",
    "WebAppsWithGatewaysExplanation": "De oplossing bevat twee webapplicaties, elk met een speciale API-gateway (BFF - Backend For Frontend-patroon).",
    "BackOfficeApplication": "Backoffice-applicatie",
    "BackOfficeApplicationExplanation": "De daadwerkelijke webapplicatie van uw systeem, met meerdere UI-frameworkopties. U kunt elk type bedrijfstoepassing maken.",
    "LandingWebsite": "Landingswebsite",
    "LandingWebsiteExplanation": "Een generieke landings-/publieke website die voor verschillende doeleinden kan worden gebruikt, zoals het introduceren van uw bedrijf, het verkopen van uw producten, enz.",
    "ABPFrameworkEBook": "E-book Mastering ABP Framework",
    "MasteringAbpFrameworkEBookDescription": "Inbegrepen in uw commerciële ABP-licentie",
    "FullName": "Voor-en achternaam",
    "LicenseTypeNotCorrect": "Het licentietype is niet correct!",
    "Trainings": "Trainingen",
    "ChooseTrainingPlaceholder": "Kies de opleiding...",
    "DoYouNeedTrainings": "Heeft u behoefte aan een van deze trainingen?",
    "DoYouNeedTraining": "Heeft u {0} training nodig?",
    "GetInTouchUs": "Neem contact op met ons",
    "ForMoreInformationClickHere": "Voor meer informatie, klik <a href='{0}'>hier.</a>",
    "ForMoreInformationClickHereByClass": "<span class=\"{1}\">Voor meer informatie, klik</span> <a href='{0}'>hier.</a>",
    "IsGetOnboardingTraining": "Wilt u een onboarding- en webapplicatie-ontwikkelingstraining volgen?",
    "OnboardingWebApplicationDevelopmentTrainingMessage": "Neem contact op met {0} nadat u de organisatie heeft gemaakt om uw trainingskalender te plannen",
    "CustomPurchaseMessage": "Voor de volgende stap klikt u op {0} om contact met ons op te nemen.",
    "Note": "Opmerking",
    "AdditionalNote": "Aanvullende opmerking",
    "OnboardingTrainingFaqTitle": "Heeft u een ABP-onboardingopleiding gevolgd?",
    "OnboardingTrainingFaqExplanation": "Ja, we hebben ABP Training Services om u te helpen uw ABP-project snel van start te laten gaan. U leert over ABP van een ABP-kernteamlid en u krijgt de vaardigheden om aan uw ABP-project te beginnen. In de onboardingtraining leggen we uit hoe u uw ontwikkelomgeving inricht, de benodigde tools installeert en een volledig functionele CRUD-pagina maakt. De training zal live zijn en er zal gebruik worden gemaakt van de Zoom-applicatie, we staan open voor het gebruik van andere online vergaderplatforms. De voertaal van de training zal Engels zijn. Tijdens de sessies kunt u ook uw vragen over ABP stellen. Er wordt voor beide partijen een geschikte tijd en datum gepland. Neem voor meer informatie contact met ons op via <a href=\"mailto:info@abp.io\">info@abp.io</a> .",
    "AddBasket": "Voeg toe aan winkelwagen",
    "SendTrainingRequest": "Trainingsverzoek verzenden",
    "OnlyEnglishVersionOfThisDocumentIsTheRecentAndValid": "* De Engelse versie van dit document is de meest actuele en bij eventuele geschillen prevaleert de Engelse versie.",
    "Pricing_Page_Title": "Prijzen en abonnementen",
    "Pricing_Page_Description": "Kies de functies en functionaliteit die uw bedrijf vandaag de dag nodig heeft. Koop een commerciële licentie van ABP en creëer een onbeperkt aantal projecten.",
    "Pricing_Page_HurryUp": "Haast je!",
    "Pricing_Page_BuyLicense": "Koop tot 16 januari een licentie tegen <strong>prijzen van 2021</strong> !",
    "Pricing_Page_ValidForExistingCustomers": "Ook geldig voor bestaande klanten en licentieverlengingen.",
    "Pricing_Page_Hint1": "De licentieprijs omvat een bepaald aantal ontwikkelaarsstoelen. Als u meer ontwikkelaars heeft, kunt u altijd extra licenties kopen.",
    "Pricing_Page_Hint2": "U kunt nu of in de toekomst meer ontwikkelaarslicenties aanschaffen. Licenties zijn licenties gebaseerd op een licentie, dus u kunt een licentie overdragen van de ene ontwikkelaar naar de andere.",
    "Pricing_Page_Hint3": "Met uw licentie kunt u een onbeperkt aantal verschillende producten ontwikkelen.",
    "Pricing_Page_Hint4": "ABP Suite is een hulpmiddel om u te helpen ontwikkelen en uw productiviteit te verbeteren. Het ondersteunt het genereren van CRUD-pagina&#39;s en het maken van nieuwe projecten.",
    "Pricing_Page_Hint5": "U kunt alle vooraf gebouwde modules in uw applicaties gebruiken.",
    "Pricing_Page_Hint6": "U kunt alle vooraf gebouwde thema&#39;s in uw toepassingen gebruiken.",
    "Pricing_Page_Hint7": "Een opstartsjabloon is een Visual Studio-oplossing waarmee u uw project een vliegende start kunt geven. Alle fundamentele modules worden voor u toegevoegd en vooraf geconfigureerd.",
    "Pricing_Page_Hint8": "Het e-book Mastering ABP Framework legt uit hoe u .NET-oplossingen kunt implementeren met best practices. Het wordt verkocht op Amazon.com en u kunt het boek gratis downloaden met uw licentie.",
    "Pricing_Page_Hint9": "U kunt de broncode van elke module downloaden. Mogelijk wilt u de broncode aan uw oplossing toevoegen om radicale wijzigingen aan te brengen of deze om veiligheidsredenen gewoon voor uzelf houden.",
    "Pricing_Page_Hint10": "Licenties zijn voor het leven. Dat betekent dat u uw applicatie voor altijd kunt blijven ontwikkelen. Toegang tot de nieuwste versie en ondersteuning worden verleend binnen de licentieperiode (1 jaar, tenzij u deze verlengt).",
    "Pricing_Page_Hint11": "Geen beperkingen op de inzet! U kunt implementeren op zoveel servers als u wilt, inclusief de cloudservices of op locatie.",
    "Pricing_Page_Hint12": "U kunt de modules, thema&#39;s en tools binnen uw actieve licentieperiode updaten naar de nieuwste versie. Nadat uw licentie is verlopen, moet u deze verlengen om updates voor bugfixes, nieuwe functies en verbeteringen te blijven ontvangen.",
    "Pricing_Page_Hint13": "U kunt de premium-ondersteuning voor één jaar krijgen (u kunt uw licentie verlengen om deze te verlengen).",
    "Pricing_Page_Hint14": "Team- en bedrijfslicenties hebben een limiet voor het aantal incidenten/vragen. Als u extra ontwikkelaarslicenties koopt, wordt uw incidentlimiet verhoogd met {0} (voor de teamlicentie) of {1} (voor de zakelijke licentie) per ontwikkelaar.",
    "Pricing_Page_Hint15": "Alleen Enterprise-licentie omvat privéondersteuning. U kunt rechtstreeks een e-mail sturen naar het ABP-team of vragen stellen op support.abp.io met een privéticketoptie. De privétickets zijn niet zichtbaar voor het publiek.",
    "Pricing_Page_Hint16": "Van alle ABP-thema&#39;s kunt u de broncode downloaden. Mogelijk wilt u de broncode aan uw oplossing toevoegen om radicale wijzigingen aan te brengen of deze om veiligheidsredenen gewoon voor uzelf houden.",
    "Pricing_Page_Testimonial_1": "ABP Commercial heeft SC Ventures in staat gesteld om binnen negen maanden een multi-tenant silo-database SaaS-platform van bankkwaliteit te leveren ter ondersteuning van de debiteuren/crediteuren supply chain-financiering van facturen met een grote waarde vanuit meerdere geïntegreerde ankers. De modulariteit van ABP maakte het voor het team mogelijk om in recordtijd te leveren, aan alle VAPT-eisen te voldoen en de gecontaineriseerde microservices-stack via volledige CI/CD en pijplijnen in productie te zetten.",
    "Pricing_Page_Testimonial_2": "Wij zien de waarde van het gebruik van ABP Commercial om de overhead van ontwikkelingsprojecten op maat te verminderen. Het team is in staat om het codepatroon in verschillende projectstromen te verenigen. We zien meer potentieel in het raamwerk om nieuwe functies sneller dan voorheen te bouwen. We vertrouwen erop dat we voortdurend de waarde zullen zien van het benutten van ABP Commercial.",
    "Pricing_Page_Testimonial_3": "Wij houden van ABP. We hoeven niet alles vanaf nul te schrijven. We vertrekken van kant-en-klare functies en concentreren ons alleen op wat we echt moeten schrijven. Bovendien is ABP goed ontworpen en is de code van hoge kwaliteit met minder bugs. Als we alles wat we nodig hadden zelf moesten schrijven, zouden we er misschien jaren mee bezig zijn. Nog iets dat we leuk vinden, is dat de nieuwe versie, probleemoplossing of verbetering zeer binnenkort om de week uitkomt. Wij wachten niet te lang.",
    "Pricing_Page_Testimonial_4": "ABP Commercial is een fantastisch product dat ik kan aanbevelen. Commerciële producten die voor onze klanten op de markt worden gebracht in één configureerbaar platform. De sprong begint dat het raamwerk en de tools die elk team biedt, elke cent waard zijn. ABP Commercial paste het beste bij onze wensen.",
    "Pricing_Page_Testimonial_5": "ABP Framework is niet alleen een raamwerk, maar ook een leidraad voor projectontwikkeling/-management, omdat het DDD-, GenericRepository-, DI-, Microservice- en Modularity-trainingen biedt. Ook als je het framework zelf niet gaat gebruiken, kun je jezelf ontwikkelen met docs.abp.io wat goed en professioneel is voorbereid (OpenIddict, Redis, Quartz etc.). Omdat veel dingen vooraf zijn gebouwd, verkort het de projectontwikkelingstijd aanzienlijk (zoals inlogpagina, afhandeling van uitzonderingen, gegevensfiltering, seeden, auditlogboekregistratie, lokalisatie, automatische API-controller enz.). Als voorbeeld uit onze applicatie heb ik Local Event Bus gebruikt voor voorraadbeheer. Ik kan dus orderbewegingen beheren door voorraadbeheer te schrijven. Het is geweldig om geen tijd te verliezen voor CreationTime, CreatorId. Ze worden automatisch gevuld.",
    "Pricing_Page_Testimonial_6": "ABP Framework is een goed raamwerk, maar het heeft tijd nodig om de verschillende lagen, klassen en bibliotheken die het gebruikt (vooral ABP) te begrijpen. Ik heb veel tijd besteed aan het lezen van de codebasis, maar ABP Commercial heeft ons tijd bespaard bij het creëren van de speciale projectentiteiten (AR) en de repository die aan elk daarvan is gekoppeld. Ik vond het ook leuk dat de aanpak van ABP erg volwassen is; we weten dat het gebaseerd is op DDD en monoliet.",
    "Pricing_Page_Testimonial_7": "Als startup moeten we snel itereren en minimale tijd besteden aan standaard- en niet-kernfuncties. \n Onze ingenieurs variëren van zeer ervaren tot junior ingenieurs, en we hadden behoefte aan een gemeenschappelijk begrip en een manier om technische en domeinkennis te delen. ABP stelde ons in staat dit te doen dankzij hun geweldige handleidingen en documentatie. \n Er zijn dingen waar we ons geen zorgen over hoefden te maken, omdat ze met ABP kant-en-klaar werken. \n ABP heeft ons geholpen bij het stroomlijnen van rapid prototyping en ontwikkeling, in minder dan vier weken vanaf het begin van de functie tot aan de productie. Met al zijn premiumfuncties inbegrepen in de licentie, heeft ABP ons &quot;Startup in a Box&quot; gegeven op het gebied van software-engineering.",
    "Pricing_Page_Testimonial_8": "Ik zou ABP Commercial aanbevelen aan iedereen die het productassortiment voor zijn klanten wil uitbreiden. Het is fantastisch als je een gedistribueerde bedrijfsomgeving (Angular, WPF, Win&amp;Linux) moet gebruiken. Naast hun producten houden we ook van hun ondersteuning, waardoor ons werk sneller en gemakkelijker wordt. We weten al dat we een geweldige partner voor de toekomst hebben gevonden die ons zal ondersteunen bij het uitbreiden van ons bedrijf.",
    "Pricing_Page_Testimonial_9": "Wij zijn een bedrijf met 2 medewerkers dat al ruim 20 jaar bestaat. \n Naar aanleiding van onze ervaring met ABP Commercial werden we benaderd door een klant die ons vroeg een nieuwe HR-applicatie te ontwikkelen in een moderne omgeving ter vervanging van hun 25 jaar oude Access-applicatie. We besloten om over te stappen van een desktopoplossing naar een webgebaseerde oplossing. \n \n We hadden destijds heel weinig kennis van webapplicaties en .NET, maar we kwamen ABP Commercial tegen en met behulp van ABP Framework, technische documentatie en ABP Suite konden we de applicatie niet alleen ontwikkelen de specificaties van de klant maar ook binnen een jaar succesvol werken binnen een .NET-omgeving.",
    "AbpBookDownloadArea_ClaimYourEBook": "Claim uw <span class='gradient-framework'>Mastering ABP Framework</span> e-book",
    "AddMemberModal_Warning_1": "Als de <strong>gebruikersnaam</strong> die u probeert toe te voegen niet in het systeem bestaat, vraag dan uw teamlid om zich te registreren op <a href='{0}/Account/Register'>{0}</a> en de gebruikersnaam van zijn/haar account met u te delen.",
    "MyOrganizations_Detail_WelcomeMessage": "Welkom bij uw organisatie, {0}",
    "MyOrganizations_Detail_OrganizationManagement": "Organisatie <span class=\"gradient-commercial\">management</span>",
    "OrganizationDisplayName": "Weergavenaam organisatie",
    "MyOrganizations_Detail_EditDisplayName": "Weergavenaam bewerken",
    "MyOrganizations_Detail_UpgradeYourLicense": "Upgrade uw licentie",
    "MyOrganizations_Detail_LicenseStartAndExpiryDate": "Startdatum licentie - Vervaldatum",
    "MyOrganizations_Detail_OwnerRightInfo": "U maakt gebruik van {0} van uw {1} eigenaarsrechten.",
    "MyOrganizations_Detail_CopyApiKey": "Kopieer de sleutel",
    "MyOrganizations_Detail_ApiKeyDescription": "De API-sleutel is het token van PRO-pakketten die worden gehost op <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{1}.</a>",
    "MyOrganizations_Detail_YourPrivateNugetSource": "Uw privé NuGet-bron is <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{0}</a>",
    "MyOrganizations_Detail_PrivateNugetSourceWarning": "Dit wordt automatisch als feed toegevoegd aan uw NuGet.Config in uw ABP-oplossing. Deel uw privésleutel niet met ongeautoriseerde gebruikers!",
    "MyOrganizations_Detail_DeveloperSeatInfo": "U gebruikt {0} van uw {1} ontwikkelaarslicenties.",
    "NeedMoreSeatsForYourTeam": "Heeft u meer plaatsen nodig voor uw team?",
    "MyOrganizations_Detail_PricePerYear": "{0}/per jaar",
    "MyOrganizations_Detail_PurchaseDeveloperSeats": "Koop ontwikkelaarsstoelen",
    "Invoices": "Facturen",
    "RequestInvoice": "Factuur aanvragen",
    "OrderNumber": "Bestellingsnummer",
    "Date": "Datum",
    "Products": "Producten",
    "TotalPrice": "Totale prijs",
    "ThereIsNoInvoice": "Er is geen factuur",
    "MyOrganizations_Detail_PaymentProviderInfo": "Als u uw licentie via de <i>{0}</i> -gateway heeft aangeschaft, wordt de pdf-factuur naar uw e-mailadres verzonden, zie <a href=\"{1}\" target=\"_blank\">{0}-facturering.</a>",
    "MyOrganizations_Detail_PayUInfo": "Als u via de <i>Iyzico-</i> gateway heeft gekocht, klikt u op de knop &quot;Factuur aanvragen&quot; en vult u de factuurgegevens in.",
    "MyOrganizations_Detail_ConclusionInfo": "Uw factuuraanvraag wordt binnen {0} werkdagen afgerond.",
    "ExtendYourLicense": "Verleng uw <span class=\"text-primary\">{0}</span> -licentie",
    "Continue": "Doorgaan",
    "PurchaseLicense": "Koop {0} licentie",
    "DownloadInvoiceModal_DownloadInvoice": "Factuur downloaden",
    "DownloadInvoiceModal_SaveInformationOnlyOnce": "U kunt uw factuurgegevens slechts één keer opslaan.",
    "InvoiceModal_EnterCompanyName": "Voer uw wettelijke bedrijfsnaam in...",
    "InvoiceModal_EnterCompanyAddress": "Voer uw wettelijke bedrijfsadres in...",
    "InvoiceModal_EnterTaxNumber": "Vul uw BTW/BTW-nummer in, indien beschikbaar...",
    "RequestInvoiceModal_EnterNotes": "Vul uw extra bericht over uw factuur in...",
    "PrePayment_PayWithIyzico": "U betaalt met Iyzico",
    "ContinueToCheckout": "Ga verder naar afrekenen",
    "PrePayment_IyzicoRedirectionInfo": "U wordt doorgestuurd naar Iyzico Payment Gateway om uw aankoop veilig af te ronden.",
    "PrePayment_IyzicoAcceptVisaAndMasterCard": "Iyzico accepteert Visa en MasterCard.",
    "Purchase": "Aankoop",
    "AcceptTermsAndConditions": "Ik heb het <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">privacybeleid</a> , <a href=\"{1}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">de algemene voorwaarden</a> en <a href=\"{2}\" target=\"_blank\" class=\"text-primary\">de EULA gelezen, begrepen en geaccepteerd.</a>",
    "AcceptTermsAndConditionsWarningMessage": "Accepteer het privacybeleid en de algemene voorwaarden",
    "SelectGatewayToContinue": "Selecteer een gateway om door te gaan!",
    "GatewaySelection_SelectGateway": "Selecteer een betalingsgateway",
    "GatewaySelection_RedirectionMessage": "Vervolgens wordt u doorgestuurd naar de website van de geselecteerde betalingsgateway voor de transactie.",
    "PaymentSucceed_PaymentSuccessMessage": "betaling gelukt",
    "PaymentSucceed_ThanksForPurchase": "dank voor uw aankoop!",
    "PaymentSucceed_CreateYourOrganization": "Creëer uw organisatie",
    "PaymentSucceed_AddMeAsDeveloper": "Ik ben ook een ontwikkelaar, voeg mij als ontwikkelaar toe aan mijn organisatie.",
    "PaymentSucceed_CreateOrganization": "Organisatie creëren",
    "PaymentSucceed_OrganizationDescription": "Een organisatie bestaat uit ontwikkelaars en eigenaren. De ontwikkelaars zijn gebruikers die code schrijven voor het ABP-project en zullen profiteren van de <a href=\"{0}\" target=\"_blank\">{1}</a> -website. De eigenaren zijn gebruikers die ontwikkelaarslicenties toewijzen en licenties beheren.",
    "PaymentSucceed_ViewOrganization": "Klik hier om de organisatie te bekijken",
    "Purchase_TotalAnnualPrice": "TOTAAL <small class=\"opacity-50\">(jaarlijkse vergoeding)</small>",
    "Purchase_TrainingPrice": "Opleidingsprijs",
    "Purchase_OnboardingTraining": "Onboarding en ontwikkeling van webapplicaties Live training",
    "TotalDeveloperPrice": "Totale ontwikkelaarsprijs",
    "Purchase_PricePerDeveloper": "<span>{0} {1}</span> per ontwikkelaar",
    "Purchase_IncludedDeveloperInfo": "{0} {1} inbegrepen.",
    "Purchase_LicenseExtraDeveloperPurchaseMessage": "De <span class=\"fw-bold\">{0}-licentie</span> omvat {1} ontwikkelaars. U kunt extra ontwikkelaars toevoegen.",
    "StartupTemplates_Page_Title": "ABP-opstartsjablonen",
    "StartupTemplates_Page_Description": "Met ABP Commercial kunt u oplossingen bouwen met elk niveau van complexiteit. Het biedt twee belangrijke vooraf gebouwde opstartoplossingen. U kunt degene selecteren die het beste bij uw vereisten past en er uw eigen oplossing op maat bovenop bouwen.",
    "MicroserviceStartupSolutionForDotnet": "Microservice-opstartoplossing voor .NET",
    "MonolithSolutionForDotnet": "Monolith (modulaire) oplossing voor .NET",
    "TrainingDetailsHeaderInfo_TrainingHour": "{0} uur(en)",
    "Trainings_Content": "Inhoud van de opleiding",
    "Trial_Page_StartYourFreeTrial": "Start uw <span class=\"gradient-commercial\">gratis proefperiode</span>",
    "TrialLicenseFeatures": "U profiteert van alle commerciële functionaliteiten van ABP",
    "TrialPeriodDays": "U beschikt over een teamlicentie van {0} dagen",
    "TrialForumSupportIncident": "Je hebt {0} forumondersteuningsincidenten",
    "Contact_Page_Title": "Contact met ABP Ontwikkelteam",
    "Contact_Page_Description": "Neem contact op met het ABP Ontwikkelingsteam als u hulp nodig heeft of als u uw gedachten en meningen wilt delen! Het ABP Supportteam staat klaar om u te helpen.",
    "Demo_Page_Title": "Maak een demo",
    "Demo_Page_Description": "Maak een gratis demo om een voorbeeldapplicatie te zien die is gemaakt met de opstartsjabloon van ABP Commercial. Herhaal uzelf niet voor algemene toepassingsvereisten.",
    "Discounted_Page_Title": "Gereduceerde prijzen",
    "Discounted_Page_Description": "Kies de functies en functionaliteit die uw bedrijf vandaag de dag nodig heeft. Koop een commerciële licentie van ABP en creëer een onbeperkt aantal projecten",
    "Faq_Page_Title": "Veelgestelde vragen (FAQ)",
    "Faq_Page_Description": "Heb je nog vragen? Zoek naar veelgestelde vragen of stel ons een vraag via het contactformulier.",
    "Faq_Page_SwiftCode": "Swift code",
    "Faq_Page_BankName": "Banknaam",
    "Faq_Page_AccountName": "Accountnaam",
    "Faq_Page_AccountNumber": "Rekeningnummer",
    "Faq_Page_Currency": "Munteenheid",
    "Faq_Page_VatNumber": "btw-nummer",
    "Faq_Page_OtherCurrenciesInfo": "Voor andere valuta, zie <a href='{0}'>alle rekeningen</a>",
    "ProjectCreatedSuccess_Page_Title": "Uw project gemaakt",
    "ProjectCreatedSuccess_Page_Description": "Uw ABP-project is succesvol aangemaakt!",
    "Suite_Page_Title": "ABP-suite",
    "Suite_Page_Description": "ABP Commercial biedt snelle applicatieontwikkelingstools om de productiviteit van ontwikkelaars te verhogen. Met ABP Suite kunt u eenvoudig CRUD-pagina&#39;s maken.",
    "Themes_Page_Title": "ABP-thema&#39;s",
    "Themes_Page_Description": "ABP Commercial biedt meerdere professionele, moderne UI-thema&#39;s. Maak een gratis demo om snel te zien hoe de gebruikersinterface eruit ziet.",
    "Tools_Page_Title": "Hulpmiddelen voor snelle applicatieontwikkeling",
    "Tools_Page_Description": "ABP Commercial biedt snelle applicatieontwikkelingstools om de productiviteit van ontwikkelaars te verhogen. Met ABP Suite kunt u eenvoudig CRUD-pagina&#39;s maken.",
    "DeveloperPrice": "Ontwikkelaarsprijs",
    "AdditionalDeveloperPaymentInfoSection_AdditionalDevelopers": "{0} <small>ontwikkelaars</small>",
    "LicenseRemainingDays": "gedurende <span>{0}</span> dagen",
    "ExtendPaymentInfoSection_Description": "Door uw licentie te verlengen/vernieuwen, blijft u <a href=\"{0}\" target=\"_blank\">premiumondersteuning</a> krijgen. U kunt ook grote of kleine updates voor modules en thema&#39;s krijgen. Je kunt doorgaan met het maken van nieuwe projecten. En u kunt nog steeds gebruik maken van <a href=\"{1}\" target=\"_blank\">ABP Suite</a> , wat uw ontwikkeling versnelt.",
    "LicenseRenewalPrice": "Prijs voor licentieverlenging",
    "LicensePrice": "Licentieprijs",
    "TrialLicensePaymentInfoSection_Description": "<strong>Licentie kopen:</strong> Door een licentie te kopen, blijft u <a href=\"{0}\" target=\"_blank\" rel=\"noopener\">premiumondersteuning</a> krijgen. U kunt ook grote of kleine updates voor modules en thema&#39;s krijgen. Je kunt doorgaan met het maken van nieuwe projecten. En u kunt nog steeds gebruik maken van <a href=\"{1}\" target=\"_blank\" rel=\"noopener\">ABP Suite</a> , wat uw ontwikkeling versnelt.<br> Zie de <a href=\"{2}\" target=\"_blank\" rel=\"noopener\">licentievergelijkingstabel</a> om de verschillen tussen de licentietypen te controleren.",
    "SelectTargetLicense": "Selecteer Doellicentie",
    "UpgradePaymentInfoSection_ExtendMyLicenseForOneYear": "Ja, verleng de vervaldatum van mijn licentie met 1 jaar.",
    "UpgradePaymentInfoSection_WantToExtendLicense": "Wilt u uw licentie met nog 1 jaar verlengen?",
    "UpgradePaymentInfoSection_UpgradingWillNotExtendLicense": "Door te upgraden wordt de vervaldatum van uw licentie niet verlengd!",
    "UpgradePaymentInfoSection_LicenseUpgradeDescription": "Door uw licentie te upgraden, wordt u gepromoveerd naar een hoger licentietype, waardoor u extra voordelen kunt krijgen. Zie de <a href=\"/Pricing\" target=\"_blank\">licentievergelijkingstabel</a> om de verschillen tussen de licentietypen te controleren.",
    "Landing_Page_CustomerStories": "Klantverhalen",
    "Landing_Page_OurGreatCustomers": "Onze geweldige klanten",
    "Landing_Page_WebApplicationFramework": "Raamwerk voor webapplicaties",
    "Landing_Page_WebDevelopmentPlatform": "Webontwikkelingsplatform",
    "Landing_Page_CompleteWebDevelopmentPlatform": "Compleet webontwikkelingsplatform",
    "Landing_Page_TryFreeDemo": "Probeer de gratis demo",
    "Landing_Page_StartingPointForWebApplications": "Het startpunt voor op ASP.NET Core gebaseerde webapplicaties! Het is gebaseerd op het ABP Framework voor de beste webontwikkeling.",
    "Landing_Page_AbpProvidesSoftwareInfrastructure": "ABP Framework biedt een software-infrastructuur om uitstekende webapplicaties met best practices te ontwikkelen.",
    "Landing_Page_MicroserviceCompatibleArchitecture": "Microservice-compatibele architectuur",
    "Landing_Page_PreBuiltApplicationModulesAndThemes": "Vooraf gebouwde applicatiemodules en thema&#39;s",
    "Landing_Page_MultiTenantArchitecture": "Architectuur voor meerdere huurders",
    "Landing_Page_MultiTenancyDescription": "SaaS-applicaties gemakkelijk gemaakt! Geïntegreerde multi-tenancy van database tot UI.",
    "Landing_Page_DDDIntroduction": "Ontworpen en ontwikkeld op basis van DDD-patronen en -principes. Biedt een gelaagd model voor uw toepassing.",
    "Landing_Page_CrossCuttingConcernsInfo": "Volledige infrastructuur voor autorisatie, validatie, afhandeling van uitzonderingen, caching, auditregistratie, transactiebeheer en meer.",
    "Landing_Page_PreBuiltApplicationModules": "Vooraf gebouwde applicatiemodules die de meest voorkomende webapplicatievereisten omvatten.",
    "Landing_Page_ChatModule": "Chatten",
    "Landing_Page_DocsModule": "Documenten",
    "Landing_Page_FileManagementModule": "Bestandsbeheer",
    "Landing_Page_CustomerStory_1": "ABP Commercial heeft SC Ventures in staat gesteld om binnen negen maanden een multi-tenant silo-database SaaS-platform van bankkwaliteit te leveren ter ondersteuning van de debiteuren/crediteuren supply chain-financiering van facturen met een grote waarde vanuit meerdere geïntegreerde ankers. De modulariteit van ABP maakte het voor het team mogelijk om in recordtijd te leveren, aan alle VAPT-eisen te voldoen en de gecontaineriseerde microservices-stack via volledige CI/CD en pijplijnen in productie te zetten.",
    "Landing_Page_CustomerStory_2": "Wij zien de waarde van het gebruik van ABP Commercial om de overhead van ontwikkelingsprojecten op maat te verminderen. Het team kan het codepatroon in verschillende projectstromen verenigen. We zien meer potentieel in het raamwerk om nieuwe functies sneller dan voorheen te bouwen. We vertrouwen erop dat we voortdurend de waarde zullen zien van het inzetten van ABP Commercial.",
    "Landing_Page_CustomerStory_3": "Wij houden van ABP. We hoeven niet alles vanaf nul te schrijven. We vertrekken van kant-en-klare functies en concentreren ons alleen op wat we echt moeten schrijven. Bovendien is ABP goed ontworpen en is de code van hoge kwaliteit met minder bugs. Als we alles wat we nodig hadden zelf moesten schrijven, zouden we er misschien jaren mee bezig zijn. Nog een ding dat we leuk vinden is dat de nieuwe versie, of de oplossing van problemen, of de verbetering zeer binnenkort om de week uit \n komt. Wij wachten niet te lang.",
    "Landing_Page_CustomerStory_4": "ABP Commercial is een fantastisch product dat ik kan aanbevelen. Commerciële producten die voor onze klanten op de markt worden gebracht in één configureerbaar platform. De sprong begint dat het raamwerk en de tools die elk team biedt, elke cent waard zijn. ABP Commercial paste het beste bij onze wensen.",
    "Landing_Page_AdditionalServices": "Aangepaste of volumelicentie, onboarding, live training en ondersteuning, projectontwikkeling op maat, bestaande projecten overzetten en meer...",
    "Landing_Page_IncludedDeveloperLicenses": "Inclusief <strong>{0}</strong> ontwikkelaarslicenties",
    "Landing_Page_SeeOnDemo": "Zie op demo",
    "Landing_Page_LeptonThemes": "LeptonThema&#39;s",
    "Landing_Page_AccountModuleDescription_1": "Deze module implementeert het authenticatiesysteem voor een applicatie;",
    "Landing_Page_AccountModuleDescription_2": "Biedt een <strong>inlogpagina</strong> met de gebruikersnaam en het wachtwoord",
    "Landing_Page_AccountModuleDescription_3": "Biedt een <strong>registratiepagina</strong> om een nieuw account aan te maken.",
    "Landing_Page_AccountModuleDescription_4": "Biedt een pagina <strong>voor vergeten wachtwoord</strong> waarmee u een link <strong>voor het opnieuw instellen van uw wachtwoord</strong> als e-mail kunt verzenden.",
    "Landing_Page_AccountModuleDescription_5": "Biedt functionaliteit <strong>voor e-mailbevestiging</strong> met gebruikersinterface.",
    "Landing_Page_AccountModuleDescription_6": "Implementeert <strong>tweefactorauthenticatie</strong> (SMS en e-mail).",
    "Landing_Page_AccountModuleDescription_7": "Implementeert <strong>gebruikersblokkering</strong> (vergrendelt het account voor de ingestelde tijd wanneer een bepaald aantal mislukte aanmeldingen plaatsvindt vanwege ongeldige inloggegevens binnen een bepaald tijdsinterval).",
    "Landing_Page_AccountModuleDescription_8": "Implementeert de gebruikersinterface en functionaliteit van <strong>de Identity Server-</strong> authenticatieserver.",
    "Landing_Page_AccountModuleDescription_9": "Maakt het mogelijk om <strong>tussen tenants te schakelen</strong> in een omgeving met meerdere tenants.",
    "Landing_Page_AccountModuleDescription_10": "Maakt het mogelijk om de <strong>UI-taal</strong> van de applicatie te wijzigen.",
    "Landing_Page_AuditLoggingModuleDescription_1": "Deze module biedt de gebruikersinterface voor auditlogboekrapportage voor de auditinfrastructuur. Maakt het zoeken, filteren en tonen van auditlogboekvermeldingen en entiteitswijzigingslogboeken mogelijk.",
    "Landing_Page_AuditLoggingModuleDescription_2": "Een auditlogboekvermelding bestaat uit kritieke gegevens over elk clientverzoek:",
    "Landing_Page_AuditLoggingModuleDescription_3": "URL, browser, IP-adres, klantnaam",
    "Landing_Page_AuditLoggingModuleDescription_4": "De gebruiker",
    "Landing_Page_AuditLoggingModuleDescription_5": "HTTP-methode, HTTP-retourstatuscode",
    "Landing_Page_AuditLoggingModuleDescription_6": "Geslaagd/mislukt, uitzonderingsdetails indien beschikbaar",
    "Landing_Page_AuditLoggingModuleDescription_7": "Uitvoeringsduur van verzoek",
    "Landing_Page_AuditLoggingModuleDescription_8": "In dit verzoek zijn de entiteiten aangemaakt, verwijderd of bijgewerkt (met gewijzigde eigenschappen).",
    "Landing_Page_BloggingModuleDescription_1": "Deze module voegt een eenvoudige blog toe aan uw ABP-aanvraag;",
    "Landing_Page_BloggingModuleDescription_2": "Maakt het mogelijk om meerdere blogs in één applicatie te maken.",
    "Landing_Page_BloggingModuleDescription_3": "Ondersteunt het Markdown-formaat.",
    "Landing_Page_BloggingModuleDescription_4": "Maakt het mogelijk commentaar te schrijven op een bericht.",
    "Landing_Page_BloggingModuleDescription_5": "Maakt het mogelijk tags aan de blogposts toe te wijzen.",
    "Landing_Page_BloggingModuleDescription_6": "Zie de website <a href=\"blog.abp.io\">blog.abp.io</a> als een live voorbeeld van de blogmodule.",
    "Landing_Page_ChatModuleDescription_1": "Deze module wordt gebruikt voor realtime berichtenuitwisseling tussen gebruikers in de applicatie.",
    "Landing_Page_ChatModuleDescription_2": "Realtime berichtenuitwisseling op de chatpagina.",
    "Landing_Page_ChatModuleDescription_3": "Zoek gebruikers in de applicatie naar nieuwe gesprekken.",
    "Landing_Page_ChatModuleDescription_4": "Contactlijst voor recente gesprekken.",
    "Landing_Page_ChatModuleDescription_5": "Nieuwe berichtmeldingen wanneer de gebruiker naar een andere pagina kijkt.",
    "Landing_Page_ChatModuleDescription_6": "Badge voor het totaal aantal ongelezen berichten op het menupictogram.",
    "Landing_Page_ChatModuleDescription_7": "Aantal ongelezen berichten voor elk gesprek.",
    "Landing_Page_ChatModuleDescription_8": "Luie geladen gesprekken.",
    "Landing_Page_DocsModuleDescription_1": "Deze module wordt gebruikt om technische documentatiewebsites te maken;",
    "Landing_Page_DocsModuleDescription_2": "Ingebouwde <strong>GitHub-integratie</strong> : schrijf en beheer documenten rechtstreeks op GitHub.",
    "Landing_Page_DocsModuleDescription_3": "Ondersteuning <strong>voor versiebeheer</strong> is rechtstreeks geïntegreerd in GitHub-releases.",
    "Landing_Page_DocsModuleDescription_4": "Ondersteunt <strong>meerdere talen</strong> (met fallback-ondersteuning voor de standaardtaal).",
    "Landing_Page_DocsModuleDescription_5": "Ondersteunt de <strong>Markdown-</strong> en HTML-formaten.",
    "Landing_Page_DocsModuleDescription_6": "Biedt een <strong>navigatie-</strong> en een <strong>overzichtsgedeelte</strong> .",
    "Landing_Page_DocsModuleDescription_7": "Maakt het mogelijk om <strong>meerdere</strong> projectdocumentatie in één enkele applicatie te hosten.",
    "Landing_Page_DocsModuleDescription_8": "Links naar het bestand op GitHub, zodat iedereen eenvoudig een bijdrage kan leveren door op de <strong>link Bewerken</strong> te klikken.",
    "Landing_Page_DocsModuleDescription_9": "Hiermee kunt u naast de GitHub-bron eenvoudigweg een map als documentatiebron gebruiken.",
    "Landing_Page_FileManagementModuleDescription_1": "Upload, download en organiseer bestanden in een hiërarchische mappenstructuur.",
    "Landing_Page_FileManagementModuleDescription_2": "Deze module wordt gebruikt voor het uploaden, downloaden en ordenen van bestanden in een hiërarchische mappenstructuur. Het is ook compatibel met multi-tenancy en u kunt de totale maximale grootte voor uw huurders bepalen.",
    "Landing_Page_FileManagementModuleDescription_3": "Deze module is gebaseerd op het <a href=\"https://docs.abp.io/en/abp/latest/Blob-Storing\">BLOB Storing-</a> systeem, zodat het verschillende opslagproviders kan gebruiken om de bestandsinhoud op te slaan.",
    "Landing_Page_IdentityModuleDescription_1": "Deze module implementeert het gebruikers- en rollensysteem van een applicatie;",
    "Landing_Page_IdentityModuleDescription_2": "Gebouwd op de <a href=\"https://docs.microsoft.com/en-us/aspnet/core/security/authentication/identity\">ASP.NET Core Identity-bibliotheek van Microsoft</a> .",
    "Landing_Page_IdentityModuleDescription_3": "Beheer <strong>rollen</strong> en <strong>gebruikers</strong> in het systeem. Een gebruiker mag <strong>meerdere rollen</strong> hebben.",
    "Landing_Page_IdentityModuleDescription_4": "Stel <strong>machtigingen</strong> in op rol- en gebruikersniveau.",
    "Landing_Page_IdentityModuleDescription_5": "Schakel <strong>tweefactorauthenticatie</strong> en <strong>gebruikersblokkering</strong> per gebruiker in/uit.",
    "Landing_Page_IdentityModuleDescription_6": "Beheer het <strong>basisgebruikersprofiel</strong> en <strong>wachtwoord</strong> .",
    "Landing_Page_IdentityModuleDescription_7": "Beheer <strong>claimtypen</strong> in het systeem, stel claims in op rollen en gebruikers.",
    "Landing_Page_IdentityModuleDescription_8": "Instellingspagina voor het beheren <strong>van de complexiteit van wachtwoorden</strong> , inloggen van gebruikers, account en uitsluiting.",
    "Landing_Page_IdentityModuleDescription_9": "Ondersteunt <strong>LDAP-</strong> authenticatie.",
    "Landing_Page_IdentityModuleDescription_10": "Biedt <strong>e-mail- en telefoonnummerverificatie</strong> .",
    "Landing_Page_IdentityModuleDescription_11": "Ondersteunt sociale login-integraties (Twitter, Facebook, GitHub enz...).",
    "Landing_Page_IdentityModuleDescription_12": "Beheer <strong>organisatie-eenheden</strong> in het systeem.",
    "Landing_Page_PaymentModuleDescription_1": "Biedt integratie voor verschillende betalingsgateways.",
    "Landing_Page_PaymentModuleDescription_2": "Deze module biedt integratie voor betalingsgateways, zodat u eenvoudig betalingen van uw klanten kunt ontvangen.",
    "Landing_Page_PaymentModuleDescription_3": "Deze module ondersteunt de volgende betalingsgateways",
    "Welcome_Page_UseSameCredentialForCommercialWebsites": "Gebruik dezelfde inloggegevens voor zowel <a href=\"https://commercial.abp.io\" class=\"text-primary\">commercial.abp.io</a> als <a href=\"https://support.abp.io\" class=\"text-primary\">support.abp.io</a> .",
    "WatchCrudPagesVideo": "Bekijk de video &#39;CRUD-pagina&#39;s maken met ABP Suite&#39;!",
    "WatchGeneratingFromDatabaseVideo": "Bekijk de video &#39;ABP Suite: CRUD-pagina&#39;s genereren uit bestaande databasetabellen&#39;!",
    "WatchTakeCloserLookVideo": "Bekijk de video &quot;De codegeneratie eens nader bekijken: ABP Suite&quot;!",
    "ConfirmedEmailAddressRequiredToStartTrial": "U heeft een bevestigd e-mailadres nodig om een proeflicentie te kunnen starten.",
    "EmailVerificationMailNotSent": "E-mailverificatiemail kon niet worden verzonden.",
    "GetConfirmationEmail": "<a href=\"javascript:void(0);\" id=\"{0}\" class=\"text-decoration-underline\">Klik hier om een verificatie-e-mail te ontvangen</a> als u deze nog niet eerder heeft ontvangen.",
    "WhichLicenseTypeYouAreInterestedIn": "In welk licentietype bent u geïnteresseerd?",
    "DontTakeOurWordForIt": "Geloof ons niet op ons woord...",
    "ReadAbpCommercialUsersWantYouToKnow": "Lees wat gebruikers van ABP Commercial u willen laten weten",
    "Testimonial_ShortDescription_1": "De modulariteit van ABP maakte het mogelijk dat het team op tijd kon leveren.",
    "Testimonial_ShortDescription_2": "Bouw nieuwe functies sneller dan voorheen.",
    "Testimonial_ShortDescription_3": "We vertrekken van kant-en-klare functies en concentreren ons alleen op wat we echt moeten schrijven.",
    "Testimonial_ShortDescription_4": "ABP Commercial paste het beste bij onze wensen.",
    "OnlineReviewersOnAbpCommercial": "Online recensies over ABP Commercial",
    "SeeWhatToldAboutAbpCommercial": "Bekijk wat er over ABP Commercial is verteld en schrijf eventueel uw mening op.",
    "BlazoriseLicense": "Moeten we een Blazorise-licentie kopen?",
    "BlazoriseLicenseExplanation": "We hebben een overeenkomst tussen Volosoft en Megabit, met deze overeenkomst wordt de Blazorise-licentie gebundeld met ABP Commercial-producten, daarom hoeven onze klanten geen extra Blazorise-licentie aan te schaffen.",
    "ExtendPaymentInfoSection_DeveloperPrice": "{0}x extra ontwikkelaar(s)",
    "ExtendPaymentInfoSection_DiscountRate": "Korting {0}%",
    "TotalNetPrice": "Totale nettoprijs",
    "EFCore": "Kern van het entiteitsframework",
    "All": "Alle",
    "Mvc": "MVC",
    "DataBaseProvider": "Data provider",
    "UIFramework": "UI-framework",
    "LeptonXThemeForDashboard": "LeptonX-thema voor uw beheerdersdashboard van",
    "AbpPlatform": "ABP-platform",
    "YouDeserveGoodUXUI": "Je verdient een goede gebruikersinterface en een betere UX. LeptonX Theme van ABP is hier om het te dienen.",
    "ViewLiveDemo": "Bekijk live themademo",
    "GetLeptonX": "Koop nu LeptonX",
    "SeeLeptonXDocumentation": "Zie LeptonX-documentatie",
    "SeeLeptonDocumentation": "Zie Lepton-documentatie",
    "SimplifiedMenu": "Vereenvoudigd menu",
    "SimplifiedMenuDescription": "Door het menu te filteren, kunt u eenvoudig de pagina vinden die u zoekt",
    "YourFavoritePages": "Uw favoriete pagina&#39;s binnen handbereik",
    "YourFavoritePagesDescription": "Voeg eenvoudig de pagina toe aan of verwijder deze uit favorieten door op het sterpictogram in de rechterbovenhoek van de pagina te klikken.",
    "BreadCrumbs": "Broodkruimel voor naadloos schakelen",
    "BreadCrumbsDescription": "Met Breadcrumb kun je met één klik naar de pagina&#39;s op hetzelfde niveau schakelen, zelfs als het linkermenu gesloten is, en het werkt op tablet en mobiel responsive!",
    "YourMenu": "Uw menu zoals u dat wenst",
    "YourMenuDescription": "Pas de direct klikbare pictogrammen en vervolgkeuzelijsten in het gebruikersmenu naar wens aan. Het gebruikersmenu is volledig aanpasbaar aan uw behoeften",
    "RtlSupport": "RTL-ondersteuning voor uw taal",
    "RtlSupportDescription": "LeptonX Theme ondersteunt RTL voor uw taal. De taalopties bevinden zich in het instellingenmenu, zodat u de taal kunt wijzigen.",
    "YourColors": "Uw kleuren in de gebruikersinterface van uw beheerdersdashboard",
    "YourColorsDescription": "Het LeptonX-thema werkt volgens uw systeemvoorkeuren en heeft dashboardlichtthema, dashboard donker thema en dashboard halfdonker thema-opties.",
    "ArrangeContentWidth": "Regel eenvoudig de breedte van uw inhoud",
    "ArrangeContentWidthDescription": "Wijzig eenvoudig de breedte van uw inhoudsgebied.",
    "LeptonXCompatibleWith": "LeptonX-thema is compatibel met",
    "MobileResponsiveTemplate": "Mobiel responsieve sjabloon",
    "MobileResponsiveTemplateDescription1": "Krijg toegang tot uw LeptonX-beheerdersdashboard vanaf elk gewenst apparaat.",
    "MobileResponsiveTemplateDescription2": "Het is zo ontworpen dat u het eenvoudig op elk apparaat van u kunt gebruiken. Het is responsief op mobiele apparaten en tabletformaten.",
    "TopMenuLayoutOption": "Optie voor lay-out van het bovenste menu",
    "TopMenuLayoutOptionDescription1": "Als u uw website met hetzelfde beheerdersdashboard wilt instellen, is dat mogelijk met LeptonX Theme!",
    "TopMenuLayoutOptionDescription2": "Probeer gewoon de lay-out van het LeptonX-bovenmenu om het te laten gebeuren!",
    "EasilyCustomizable": "Gemakkelijk aanpasbaar aan uw merkkleuren",
    "EasilyCustomizableDescription1": "U kunt het LeptonX-thema aanpassen met slechts een paar SCSS-variabelen. Geen overschrijving, geen extra CSS-belasting!",
    "EasilyCustomizableDescription2": "Met LeptonX kunt u uw admin dashboard inrichten zoals u dat wilt.",
    "IndependentLayout": "Onafhankelijke lay-out en inhoudsgebied",
    "IndependentLayoutDescription1": "De lay-outinfrastructuur van LeptonX is volledig los van de inhoud ontworpen.",
    "IndependentLayoutDescription2": "Dit betekent dat u uw project vrijelijk kunt ontwerpen met een andere inhoudsstructuur dan Bootstrap als u dat wilt.",
    "MostUsedLibraries": "Meest gebruikte bibliotheken geïntegreerd met LeptonX",
    "MostUsedLibrariesDescription1": "LeptonX bevat uw meest gebruikte bibliotheken. Hiermee kunt u moeiteloos bibliotheken zoals ApexCharts, DataTables, DropZone, FullCalender, JSTree, Select2 en Toastr gebruiken.",
    "MostUsedLibrariesDescription2": "LeptonX ondersteunt ook MVC Angular en Blazor-specifieke bibliotheken.",
    "CreateAndCustomize": "Creëer en pas de pagina&#39;s die u nodig heeft binnen enkele seconden aan met de aangepaste LeptonX-pagina&#39;s",
    "CreateAndCustomizeDescription": "Door het LeptonX-thema te gebruiken, heeft u ook toegang tot veel vooraf gemaakte HTML-pagina&#39;s. Deze omvatten veel pagina&#39;s zoals inlogpagina, blog, FAQ, abonnementslijst, factuur, prijzen en bestandsbeheer.",
    "LeptonThemeForAdmin": "Lepton-thema voor uw beheerdersdashboard door",
    "LeptonThemeForAdminDescription": "Het Lepton-thema is nog steeds beschikbaar en zal worden gehandhaafd. Als u als Lepton Theme-gebruiker wilt overstappen naar LeptonX Theme, kunt u de documentatie raadplegen voor meer informatie.",
    "LeptonCompatibleWith": "Lepton-thema is compatibel met",
    "BlackFridayDiscount": "Black Friday korting",
    "UpgradePaymentInfoSection_DeveloperPrice": "{0} voor {1} extra ontwikkelaar(s)",
    "Upgrade": "Upgrade",
    "Renewal": "Vernieuwing",
    "UpgradePaymentInfoSection_LicensePrice": "{0} licentie",
    "UpgradePaymentInfoSection_LicenseRenewalPrice": "Rijbewijs vernieuwing",
    "Total": "Totaal",
    "SupportPolicyFaqTitle": "Wat is uw ondersteuningsbeleid?",
    "SupportPolicyFaqExplanation": "We ondersteunen alleen de actieve en de vorige hoofdversie. We garanderen geen patch-release voor de 3e en oudere hoofdversies. Als de actieve versie bijvoorbeeld 7.0.0 is, brengen we patchreleases uit voor zowel 6.xx als 7.xx. Daarnaast bieden we alleen ondersteuning voor ABP Framework en ABP Commercial gerelateerde problemen. Dat betekent dat er geen ondersteuning wordt gegeven voor de applicaties van derden, clouddiensten en andere randbibliotheken die door ABP-producten worden gebruikt. We zullen commercieel redelijke inspanningen leveren om onze klanten technische ondersteuning te bieden tijdens de officiële kantooruren van Volosoft Bilisim AS. Aan de andere kant verbinden wij ons niet aan een responstijd op serviceniveau (SLA), maar proberen wij zo snel mogelijk op de technische problemen te reageren binnen onze officiële werkuren. Tenzij er een speciale afspraak is gemaakt met de klant, bieden wij alleen ondersteuning op https://support.abp.io. We hebben ook privé-e-mailondersteuning, die alleen beschikbaar is voor houders van een Enterprise-licentie.",
    "TotalDevelopers": "Totaal {0} ontwikkelaar(s)",
    "CustomPurchaseExplanation": "Afgestemd op uw specifieke behoeften",
    "WhereDidYouHearAboutUs": "Waar heb je over ons gehoord?",
    "Twitter": "Twitteren",
    "Facebook": "Facebook",
    "Youtube": "YouTube",
    "Google": "Googlen",
    "Github": "GitHub",
    "Friend": "Van een vriend",
    "Other": "Ander",
    "WhereDidYouHearAboutUs_explain": "Specificeer...",
    "DeletingMemberWarningMessage": "&quot;{0}&quot; wordt verwijderd uit de ontwikkelaarslijst. Als je wilt, kun je deze lege plek later aan een andere ontwikkelaar toewijzen.",
    "AdditionalInfo": "Als het aantal ontwikkelaarsstoelen boven uw vereisten ligt, kunt u deze verlagen. U kunt een e-mail sturen naar <a href=\"mailto:info@abp.io\">info@abp.io</a> om enkele van uw ontwikkelaarslicenties te verwijderen. Door ongebruikte ontwikkelaarslicenties vrij te maken, worden de kosten voor licentieverlenging verlaagd. Als u wilt, kunt u binnen uw actieve licentieperiode extra ontwikkelaarslicenties opnieuw aanschaffen. Houd er rekening mee dat, aangezien er {0} ontwikkelaars in dit licentiepakket zitten, u dit aantal niet kunt verlagen.",
    "LinkExpiredErrorMessage": "De link die u probeert te openen is verlopen.",
    "ExpirationDate": "uiterste houdbaarheidsdatum",
    "SpringCampaignDiscount": "Korting voorjaarscampagne",
    "WhyUseAbpIoPlatform": "Waarom zou ik het ABP.IO Platform gebruiken in plaats van een geheel nieuwe oplossing te creëren?",
    "WhyUseAbpIoPlatformFaqExplanation": "Zie <a href=\"/why-abp-io \">die pagina</a> voor een gedetailleerde uitleg waarom het gebruik van het ABP.IO Platform een aanzienlijk voordeel heeft ten opzichte van alles zelf doen.",
    "EulaPageTitle": "Licentieovereenkomst voor eindgebruikers (EULA)",
    "PrivacyPolicyPageTitle": "Privacybeleid - Cookiebeleid",
    "TermsConditionsPageTitle": "Voorwaarden",
    "TrainingsPageTitle": "ABP-trainingspakketten",
    "ModulesPageTitle": "Voorgebouwde applicatiemodules van ABP",
    "Volo.AbpIo.Commercial:040001": "API-toegangssleutel is onjuist.",
    "GetLepton": "Koop nu Lepton",
    "MyOrganizations_Detail_LicenseStartDate": "Startdatum licentie",
    "MyOrganizations_Detail_LicenseExpiryDate": "Vervaldatum",
    "BlazoriseSupport": "Hoe krijg ik de Blazorise-licentiesleutel en ondersteuning van het Blazorise-team?",
    "BlazoriseSupportExplanation": "Volg de onderstaande stappen om ondersteuning te krijgen van het Blazorise-team en uw Blazorise-licentiesleutel te verkrijgen:",
    "BlazoriseSupportExplanation1": "Meld u aan voor een nieuw account op <a href=\"https://blazorise.com/support/register\">blazorise.com/support/register</a> met hetzelfde e-mailadres als uw abp.io-account. Laat de vermelding &quot;Licentiesleutel&quot; leeg. <strong>Het moet hetzelfde e-mailadres zijn als uw e-mailaccount op abp.io.</strong>",
    "BlazoriseSupportExplanation2": "Controleer uw e-mailadres door uw e-mailbox te controleren. Controleer uw spambox als u geen e-mail in uw inbox ziet!",
    "BlazoriseSupportExplanation3": "Log in op de Blazorise-ondersteuningswebsite op <a href=\"https://blazorise.com/support/login\">blazorise.com/support/login</a> .",
    "BlazoriseSupportExplanation4": "Als u een actieve ABP Commercial-licentie heeft, beschikt u ook over een Blazorise PRO-licentie. U kunt uw Blazorise-licentiesleutel verkrijgen op <a href=\"https://blazorise.com/support/user/manage/license\">blazorise.com/support/user/manage/license</a> .",
    "BlazoriseSupportExplanation5": "U kunt uw vragen op de ondersteuningswebsite plaatsen en een producttoken voor uw toepassing genereren.",
    "AbpLiveTrainingPackages": "ABP Live Trainingspakketten",
    "Releases": "Releases",
    "ReleasesDescription": "Release logs van ABP Commercial.",
    "ReleaseDate": "Datum van publicatie",
    "Labels": "Etiketten",
    "PreRelease": "Pre-release",
    "AllTypes": "Alle typen",
    "Enhancement": "Verbetering",
    "Bug": "Beestje",
    "Feature": "Functie",
    "AllUIs": "Alle gebruikersinterfaces",
    "MVC": "MVC",
    "BlazorServer": "Blazor-server",
    "MAUI": "MAUI",
    "HowItWorks_Page_Title": "Hoe het werkt?",
    "HowItWorks_Page_Description": "ABP Framework breidt het .NET-platform uit. Alles wat u kunt doen met een eenvoudige .NET-oplossing is dus al mogelijk met het ABP Framework. Dat maakt het gemakkelijk om met een lage leercurve aan de slag te gaan.",
    "HowItWorks_Description1": "ABP Framework breidt het .NET-platform uit. Alles wat u kunt doen met een eenvoudige .NET-oplossing is dus al mogelijk met het ABP Framework. Dat maakt het gemakkelijk om met een lage leercurve aan de slag te gaan.",
    "HowItWorks_Description2": "Zodra u de ABP Framework-functies begint te leren en gebruiken, zal het ontwikkelen van uw software veel leuker dan ooit zijn.",
    "HowItWorks_Description3": "Op deze pagina wordt in grote lijnen uitgelegd hoe u als .NET-ontwikkelaar het ABP.IO Platform gebruikt.",
    "CreateANewSolution": "Maak een nieuwe .NET-oplossing",
    "CreateANewSolution_Description1": "Alles begint met het creëren van een nieuwe, geïntegreerde .NET-oplossing van ABP.",
    "StartWithStartupTemplates": "Start een van de vooraf gebouwde <a href=\"/startup-templates\">sjablonen voor opstartoplossingen</a>",
    "SimpleMonolithApplicationTemplate": "Eenvoudig monoliettoepassingssjabloon",
    "LayeredApplicationTemplate": "Gelaagde applicatiesjabloon",
    "MicroserviceSolutionTemplate": "Sjabloon voor microservice-oplossingen",
    "CreateEmptySolutionAndUseAbp": "Of maak een nieuwe lege .NET-oplossing en installeer zelf ABP NuGet- &amp; NPM- <a href=\"https://abp.io/packages\" target=\"_blank\">pakketten</a> .",
    "CreatingSolutionWithMultipleOptions": "Er zijn meerdere gebruikersinterface- en database-opties bij het maken van een nieuwe oplossing.",
    "UIFrameworkOptions": "UI-frameworkopties",
    "DotnetSolutionWithoutDependency": "Nu beschikt u over een reguliere .NET-oplossing op uw lokale computer die niet afhankelijk is van een cloudplatform of externe service.",
    "CheckTheDocumentForDetails": "U kunt het document <a href=\"{0}\" target=\"_blank\">{1}</a> raadplegen voor meer informatie.",
    "UIAndDatabaseIndependent": "ABP kan werken met elke gebruikersinterface en elke databaseprovider die door .NET wordt ondersteund. \n Deze UI- en databaseproviders zijn echter vooraf geïntegreerd en goed gedocumenteerd.",
    "InstallAbpModules": "Installeer ABP-modules",
    "DevelopYourSolution": "Ontwikkel uw oplossing",
    "DeployAnywhere": "Overal implementeren",
    "InstallAbpModule_Description1": "ABP is een modulair raamwerk voor applicatieontwikkeling. Sjablonen voor opstartoplossingen worden al geleverd met de essentiële modules geïnstalleerd. \n Maar er zijn nog meer applicatiemodules die u mogelijk in uw oplossing wilt gebruiken.",
    "InstallAbpModule_Description2": "Elke module bestaat uit enkele NuGet- en NPM-pakketten en heeft een installatiedocument. <a href=\"/tools/suite\">ABP Suite</a> doet het meeste werk automatisch, waarna u de module handmatig configureert of afstemt op basis van de documentatie.",
    "DevelopYourSolution_Description1": "De infrastructuur van ABP zorgt ervoor dat u <b class=\"text-white\">zich kunt concentreren op uw eigen bedrijfscode</b> door het repetitieve werk te automatiseren en vooraf gebouwde infrastructuur- en <a href=\"https://abp.io/features\" target=\"_blank\">applicatiefuncties</a> te bieden.",
    "DevelopYourSolution_Description2": "In het volgende codeblok ziet u hoe het ABP Framework naadloos in uw code integreert en de repetitieve taken voor u automatiseert.",
    "DevelopYourSolution_Description3": "Zelfs in dit shortcodeblok doet ABP veel dingen voor u.",
    "DevelopYourSolution_Description4": "Het biedt basisklassen om conventies toe te passen, zoals \n <a href=\"https://docs.abp.io/en/abp/latest/Dependency-Injection\" target=\"_blank\">dependency injection</a> . Generieke \n <a href=\"https://docs.abp.io/en/abp/latest/Repositories\" target=\"_blank\">repositoryservices</a> bieden een handige \n manier om met de database te communiceren. Declaratieve \n <a href=\"https://docs.abp.io/en/abp/latest/Authorization\" target=\"_blank\">autorisatie</a> werkt met een verfijnd machtigingssysteem.",
    "DevelopYourSolution_Description5": "ABP automatiseert de \n <a href=\"https://docs.abp.io/en/abp/latest/Unit-Of-Work\" target=\"_blank\">werkeenheid</a> (voor databaseverbinding en transactiebeheer), \n <a href=\"https://docs.abp.io/en/abp/latest/Exception-Handling\" target=\"_blank\">uitzonderingsafhandeling</a> , \n <a href=\"https://docs.abp.io/en/abp/latest/Validation\" target=\"_blank\">validatie</a> \n en <a href=\"https://docs.abp.io/en/abp/latest/Audit-Logging\" target=\"_blank\">auditlogging</a> volledig. Het biedt nog veel meer bouwstenen om uw dagelijkse ontwikkelingstaken te vereenvoudigen en u te concentreren op uw eigen code terwijl u productieklare \n applicaties maakt.",
    "DevelopYourSolution_Description6": "Je kunt je voorstellen hoeveel dat codeblok lang en ingewikkeld kan zijn als je het allemaal handmatig zou doen.",
    "SuiteCrudGenerationInFewSeconds": "Naast het handmatig coderen van uw oplossing, kunt u in een paar minuten volledig werkende geavanceerde CRUD-pagina&#39;s maken met behulp van de ABP Suite-tooling. Het genereert de code in uw oplossing, zodat u deze kunt verfijnen op basis van uw aangepaste vereisten.",
    "DeployAnywhere_Description1": "Uiteindelijk beschikt u over een pure .NET-oplossing. U kunt uw oplossing implementeren op uw eigen server, op een cloudplatform, op Kubernetes of waar u maar wilt. U kunt op zoveel servers implementeren als u wilt. ABP is een agnostisch hulpmiddel voor de implementatieomgeving.",
    "ExpertiseAbpFramework": "Expertise in het ABP-raamwerk",
    "ExpertiseAbpFramework_Description1": "Wil je verder gaan dan de basis en expertise opdoen met het ABP.IO Platform?",
    "FreeDownload": "Gratis download",
    "Read": "Lezen",
    "HavingTrouble": "Problemen hebben?",
    "HavingTrouble_Description1": "Heeft u problemen met het ontwikkelen van uw oplossing? We zijn hier! Gebruik het ABP-ondersteuningsplatform \n of stuur een e-mail om rechtstreeks hulp te krijgen van de Core ABP Framework-teamleden.",
    "WeAreHereToHelp_Description1": "U kunt door onze helponderwerpen bladeren of zoeken in de veelgestelde vragen, \n of u kunt ons een vraag stellen via het contactformulier.",
    "OtherModules": "Andere modules",
    "OtherModules_Description1": "Account, auditregistratie, chat, CMS-kit, bestandsbeheer, formulieren, AVG, identiteit, taalbeheer, betaling, Saas en meer...",
    "HowItWorks_DatabaseProviderOptions": "Opties voor databaseproviders",
    "SeeFAQ": "Zie Veelgestelde vragen",
    "ReleaseLogs": "Logboeken vrijgeven",
    "ReleaseLogs_Tag": "{0} Releaselogboeken",
    "ReleaseLogs_Pr": "Pull-verzoek #{0} - {1}",
    "NoLabels": "Geen etiketten",
    "DoesTheSubscriptionRenewAutomatically": "Wordt het abonnement automatisch verlengd?",
    "DoesTheSubscriptionRenewAutomaticallyExplanation": "De ABP Commercial heeft geen factureringsmodel voor automatische verlenging. <strong>Uw abonnement wordt daarom niet automatisch verlengd</strong> aan het einde van uw licentieperiode. Als u van de voordelen van ABP Commercial wilt blijven profiteren, dient u deze handmatig te verlengen op de <a href=\"/my-organizations\">organisatiebeheerpagina</a> . Als u meerdere organisaties heeft, klikt u op de knop &quot;Beheren&quot; bij uw aflopende organisatie en vervolgens op de knop &quot;Nu verlengen&quot; om uw licentie te verlengen. Misschien wilt u ook eens kijken naar <a href=\"/faq#what-happens-when-license-ends\">Wat gebeurt er als mijn licentie eindigt?</a> sectie.",
    "ExtraQuestionCreditsFaqTitle": "Kan ik extra ondersteuningsvragencredits kopen?",
    "ExtraQuestionCreditsFaqExplanation": "Ja, dat kan. Om extra vraagcredits te kopen, stuurt u een e-mail naar <a href=\"mailto:info@abp.io\">info@abp.io</a> met de naam van uw organisatie. Hier vindt u de prijslijst voor de extra vraagpunten:<ul><li> Pakket met 50 vragen $ 999</li><li> Pakket met 25 vragen $ 625</li><li> Pakket met 15 vragen $ 450</li></ul>",
    "AlreadyBetaTester": "U heeft al deelgenomen aan het bètatesterprogramma.",
    "AbpStudio": "ABP Studio",
    "AbpStudio_Description": "ABP Studio is nog in ontwikkeling. U kunt onderstaand formulier invullen om een van de eerste gebruikers te zijn.",
    "AbpStudio_Description1": "ABP Studio is een <span class=\"text-highlight-white\">platformonafhankelijke desktopapplicatie</span> voor ABP-ontwikkelaars.",
    "AbpStudio_Description2": "Het is <span class=\"text-highlight-white\">goed geïntegreerd</span> in het ABP Framework en heeft tot doel u een comfortabele ontwikkelomgeving te bieden door <span class=\"text-highlight-white\">zaken te automatiseren, inzichten te verschaffen</span> over uw oplossing, waardoor <span class=\"text-highlight-white\">het ontwikkelen, uitvoeren</span> en <span class=\"text-highlight-white\">implementeren</span> van uw oplossingen veel eenvoudiger wordt.",
    "AbpStudio_ComingSoon": "Binnenkort beschikbaar <span class=\"opacity-50 ms-0 ms-md-3 d-block d-md-inline-block \">Geplande bèta-releasedatum: Q4 van 2023.</span>",
    "AbpStudio_PlannedPreviewDate": "Geplande preview-releasedatum: Q4 van 2023.",
    "BetaRequest": "Bètaverzoek",
    "CreateNewSolutions": "Creëer nieuwe oplossingen",
    "CreateNewSolutions_Description1": "U kunt eenvoudig van eenvoudige toepassingen tot modulaire monoliet- of microservice-oplossingen creëren met veel opties. U krijgt een volledige productieklare basissoftwareoplossing voor uw bedrijf.",
    "ArchitectYourSolutions": "Architect uw oplossingen",
    "ArchitectYourSolutions_Description1": "Bouw monoliet-modulaire en microservice-oplossingsstructuren eenvoudiger door modules of services te creëren en relaties daartussen tot stand te brengen. U kunt vooraf gebouwde applicatiemodules ook installeren of verwijderen.",
    "ExploreYourSolution": "Ontdek uw oplossing",
    "ExploreYourSolution_Description1": "ABP Studio toont een overzicht op hoog niveau van de componenten in uw oplossing en de modules waarvan uw oplossing afhankelijk is. U kunt entiteiten, services, HTTP API&#39;s en nog veel meer verkennen zonder dat u uw codebase hoeft te openen.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze": "Voer multi-applicatie- of microservice-oplossingen in een handomdraai uit",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description1": "Voer één, <span class=\"text-highlight-white\">meerdere</span> of <span class=\"text-highlight-white\">alle services</span> uit met één klik. Op deze manier is het heel eenvoudig om een service te stoppen, deze in Visual Studio uit te voeren om te <span class=\"text-highlight-white\">testen</span> of <span class=\"text-highlight-white\">fouten op te sporen</span> .",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description2": "Bekijk een lijst met services, bekijk <span class=\"text-highlight-white\">realtime HTTP-verzoeken</span> en <span class=\"text-highlight-white\">uitzonderingsaantallen</span> voor elke service.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description3": "Bekijk alle details van alle <span class=\"text-highlight-white\">HTTP-verzoeken</span> die naar een service komen.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description4": "Ontdek <span class=\"text-highlight-white\">uitzonderingsdetails</span> in realtime in elke service, filter en zoek eenvoudig.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description5": "Toon de <span class=\"text-highlight-white\">applicatielogboeken</span> , filter op logniveau of zoek op tekst.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description6": "<span class=\"text-highlight-white\">Blader door</span> de gebruikersinterface van uw toepassing zonder de oplossingsrunner te verlaten.",
    "IntegrateToYourKubernetesCluster": "Integreer met uw Kubernetes-cluster",
    "IntegrateToYourKubernetesCluster_Description1": "<span class=\"text-highlight-white\">Verbind uw lokale ontwikkelomgeving met een lokaal of extern Kubernetes-cluster</span> , waar dat cluster al uw microservice-oplossing uitvoert.",
    "IntegrateToYourKubernetesCluster_Description2": "Krijg toegang tot elke service in Kubernetes met de servicenaam als DNS, net zoals ze op uw lokale computer worden uitgevoerd.",
    "IntegrateToYourKubernetesCluster_Description3": "<span class=\"text-highlight-white\">Onderschep elke service</span> in dat cluster, zodat al het <span class=\"text-highlight-white\">verkeer naar de onderschepte service automatisch wordt omgeleid naar uw service</span> die op uw lokale computer wordt uitgevoerd. Wanneer uw service een service in Kubernetes moet gebruiken, wordt het verkeer teruggeleid naar het cluster, net zoals uw lokale service binnen Kubernetes draait.",
    "GetInformed": "Laat u informeren",
    "Studio_GetInformed_Description1": "Laat je contactgegevens achter om <span class=\"text-highlight-white\">op de hoogte te blijven</span> en <span class=\"text-highlight-white\">probeer het eerst</span> als ABP Studio gelanceerd is.",
    "Studio_GetInformed_Description2": "Geplande preview-releasedatum: Q3 van 2023.",
    "ThankYou!": "Bedankt!",
    "SendBetaRequest": "Bètaverzoek verzenden",
    "YouJoinedTheBetaTesterProgram": "U heeft zich aangemeld voor het bètatestprogramma van ABP Studio.",
    "PricingExplanation2": "30 dagen geld-terug-garantie — <a href=\"/faq#refund-policy\">Meer informatie</a>",
    "MoneyBackGuaranteeText": "* 30 dagen geld-terug-garantie op alle licenties! 100% restitutie op Team, 60% restitutie op Business- en Enterprise-licenties binnen 30 dagen.",
    "MobileApplicationStartupTemplates": "Opstartsjablonen voor mobiele applicaties",
    "MobileApplicationStartupTemplates_Description1": "Geïntegreerde opstartsjablonen voor mobiele applicaties voor uw ABP Commercial-oplossingen.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates": "Creëer krachtige brancheapplicaties met behulp van ABP Mobile Startup-sjablonen",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description1": "ABP Commercial biedt twee opstartsjablonen voor mobiele applicaties, geïmplementeerd met <span class=\"text-highlight\">React Native</span> en <span class=\"text-highlight\">.NET MAUI.</span> Wanneer u uw nieuwe op ABP gebaseerde oplossing maakt, beschikt u ook over basisopstarttoepassingen die zijn verbonden met uw backend-API&#39;s.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description2": "De applicatie beschikt over een vooraf gebouwde authenticatietokencyclus, <span class=\"text-highlight\">meertalige ondersteuning, ondersteuning voor meerdere huurders, inloggen, wachtwoord vergeten, profielbeheer en een gebruikersbeheerpagina</span> . U kunt uw eigen bedrijfslogica toevoegen en deze aanpassen aan uw vereisten.",
    "TwoFrameworkOptions": "Twee raamwerkopties",
    "TwoFrameworkOptions_Description": "ABP biedt zowel <span class=\"text-highlight\">React Native</span> als <span class=\"text-highlight\">.NET MAUI</span> mobiele opstartsjablonen. Op deze manier kunt u degene kiezen die het beste bij uw behoeften past. Beide apps hergebruiken code in het hoogste tempo tussen iOS- en Android-platforms.",
    "PreIntegratedToYourBackend": "Vooraf geïntegreerd in uw backend",
    "PreIntegratedToYourBackend_Description": "ABP Mobile-applicaties zijn vooraf geïntegreerd in uw backend-API&#39;s. Het krijgt een geldig authenticatietoken van de server en doet geverifieerde verzoeken.",
    "MultiLanguage": "Meertalig",
    "MultiLanguage_Description": "Het ondersteunt al meer dan 10 talen uit de doos. U kunt ook volgende talen toevoegen.",
    "Arabic": "Arabisch",
    "Czech": "Tsjechisch",
    "English": "Engels",
    "Hungarian": "Hongaars",
    "Finnish": "Fins",
    "French": "Frans",
    "Hindi": "Hindi",
    "Portuguese": "Portugees",
    "Italian": "Italiaans",
    "Russian": "Russisch",
    "Slovak": "Slowaaks",
    "Turkish": "Turks",
    "EngageAndRetainYourCustomersWithABPMobileApps": "Betrek en behoud uw klanten met ABP Mobile Apps",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description1": "Uw klanten willen hun producten en abonnementen altijd en overal beheren. Dat vereist dat organisaties mobiele apps maken waarmee klanten snel en naadloos aan hun verzoeken kunnen voldoen.",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description2": "Met ABP Mobile apps kunt u native mobiele apps van hoge kwaliteit maken voor Android en iOS... Met behulp van één enkele codebase en zonder concessies te doen aan de beveiliging, kwaliteit of schaalbaarheid.",
    "OneCodeBaseMultipleDevices": "Eén codebasis Meerdere apparaten",
    "OneCodeBaseMultipleDevices_Description": "ABP Mobiele applicaties zijn platformonafhankelijk. Ze zijn klaar om te worden geïnstalleerd en uitgevoerd op iOS- en Android-apparaten, en passen zich aan verschillende vormfactoren aan met behulp van één enkele codebasis. Ontwikkelaars hoeven de gebruikersinterface en front-endcode slechts één keer aan te maken, het is niet nodig om de code aan te passen voor elk apparaat dat u wilt ondersteunen.",
    "ComesWithTheSourceCode": "Wordt geleverd met de broncode",
    "ComesWithTheSourceCode_Description": "De mobiele apps worden voorzien van de broncode. Pas eenvoudig de UX/UI van uw apps aan om aan de brandingrichtlijnen te voldoen.",
    "Purchase_OneYearPrice": "1 jaar prijs",
    "Purchase_DeveloperSeatCount": "Aantal ontwikkelaarsstoelen",
    "Purchase_DevelopersAlreadyIncluded": "{0} ontwikkelaars zijn al opgenomen",
    "1Year": "1 jaar",
    "{0}Years": "{0} jaar",
    "1YearLicense": "1 jaar licentie",
    "{0}YearsLicense": "{0} Jaarlicentie",
    "1AdditionalDeveloper": "1 extra ontwikkelaar",
    "{0}AdditionalDevelopers": "{0} Extra ontwikkelaars",
    "Discount": "Korting ({0}%)",
    "Summary": "Samenvatting",
    "TrainingPack": "Trainingspakket",
    "TrainingPackDiscount": "Korting op trainingspakketten",
    "Purchase_OnboardingTraining_Description": "Dit live trainingspakket is geldig voor een klas van 8 studenten en deze korting is alleen geldig bij aankoop met de nieuwe licentie. <a href=\"{0}\" class=\"text-white\">Kom meer te weten<i class=\"fa fa-external-link ms-1\"></i></a>",
    "Purchase_Save": "{0}% <span class=\"save ms-1\">Bespaar {1} {2}</span>",
    "RemoveBasket": "Uit mandje halen",
    "WhyABPIOPlatform?": "Waarom <span class=\"gradient-commercial\">ABP.IO-platform</span> ?",
    "DocumentAim": "Dit document is bedoeld om de grote vraag te beantwoorden:",
    "DocumentAim_Description": "&quot;Waarom zou je het ABP.IO Platform gebruiken in plaats van een geheel nieuwe oplossing te creëren?&quot;",
    "DocumentAim_Description2": "Het document introduceert de uitdagingen die gepaard gaan met het bouwen van een moderne softwareoplossing en legt uit hoe ABP deze uitdagingen aanpakt.",
    "CreatingANewSolution": "Een nieuwe oplossing creëren",
    "CreatingANewSolution_Description": "Wanneer u met een nieuwe oplossing moet beginnen, moet u uzelf veel vragen stellen en moet u veel tijd besteden voordat u begint met het schrijven van uw allereerste bedrijfscode.",
    "CreatingAnEmptySolution": "Een lege oplossing creëren",
    "THEPROBLEM": "HET PROBLEEM",
    "CreatingAnEmptySolution_THEPROBLEM_Description": "Zelfs het creëren van een bijna lege oplossing is een uitdaging;",
    "CreatingAnEmptySolution_THEPROBLEM_Description2": "Hoe organiseert u uw codebase over projecten heen?",
    "CreatingAnEmptySolution_THEPROBLEM_Description3": "Wat zijn de lagen en hoe werken ze met elkaar samen?",
    "CreatingAnEmptySolution_THEPROBLEM_Description4": "Hoe integreert u met bibliotheek en systemen van derden?",
    "CreatingAnEmptySolution_THEPROBLEM_Description5": "Hoe stel ik de geautomatiseerde tests in?",
    "ABPSOLUTION": "ABP-OPLOSSING",
    "CreatingAnEmptySolution_ABPSOLUTION_Description": "ABP biedt een goed ontworpen, gelaagde en productieklare <a href=\"https://docs.abp.io/en/abp/latest/Startup-Templates/Application\" target=\"_blank\">startup-oplossing</a> op basis van de <a href=\"https://docs.abp.io/en/abp/latest/Domain-Driven-Design\" target=\"_blank\">Domain Driven Design-</a> principes. De oplossing omvat ook een vooraf geconfigureerde unit en <a href=\"https://docs.abp.io/en/abp/latest/Testing\" target=\"_blank\">integratietestprojecten</a> voor elke laag.",
    "CommonLibraries": "Gemeenschappelijke bibliotheken",
    "CommonLibraries_THEPROBLEM_Description": "Welke bibliotheken moet u gebruiken om algemene vereisten te implementeren? Het ecosysteem voor softwareontwikkeling is zeer dynamisch, waardoor het een uitdaging is om op de hoogte te blijven van de nieuwste tools, bibliotheken, trends en benaderingen.",
    "CommonLibraries_ABPSOLUTION_Description": "ABP integreert populaire, volwassen en up-to-date bibliotheken vooraf in de oplossing. U hoeft geen tijd te besteden aan het integreren ervan of het met elkaar laten communiceren. Ze werken naar behoren out-of-the-box.",
    "UITheme&Layout": "UI-thema en lay-out",
    "UITheme&Layout_THEPROBLEM_Description": "Bij het aanpakken van UI-problemen komt een reeks uitdagingen naar voren. Deze omvatten onder meer het leggen van de basis voor een responsieve, eigentijdse en aanpasbare UI-kit met een consistent uiterlijk en een groot aantal functies zoals navigatiemenu&#39;s, kopteksten, werkbalken, voetteksten, widgets en meer.",
    "UITheme&Layout_THEPROBLEM_Description2": "Zelfs als u kiest voor een vooraf ontworpen thema, kan de naadloze integratie ervan in uw project dagen van ontwikkeling vergen. Een extra hindernis ligt bij het upgraden van dergelijke thema’s. Vaak raakt de HTML/CSS-structuur van het thema verweven met uw UI-code, waardoor toekomstige themawijzigingen of upgrades ingewikkelde taken worden. Deze verwevenheid van code en ontwerp bemoeilijkt de flexibiliteit bij het maken van aanpassingen langs de lijn.",
    "UITheme&Layout_ABPSOLUTION_Description": "ABP Framework biedt een onderscheidend themasysteem dat uw UI-code bevrijdt van themabeperkingen. Thema&#39;s bestaan afzonderlijk, verpakt als NuGet- of NPM-pakketten, waardoor de installatie of upgrades van thema&#39;s een kwestie van minuten zijn. Terwijl u de mogelijkheid behoudt om uw eigen thema te ontwikkelen of een bestaand thema te integreren, presenteert ABP Commercial een verzameling gepolijste en eigentijdse thema&#39;s.",
    "UITheme&Layout_ABPSOLUTION_Description2": "Daarnaast zijn er aanbieders van UI-componenten zoals Telerik en DevExpress. Deze aanbieders leveren echter voornamelijk individuele componenten, waardoor het aan u ligt om uw lay-outsysteem op te zetten. Wanneer u binnen ABP-gebaseerde projecten werkt, kunt u deze bibliotheken naadloos integreren, net zoals u dat in elk ander project zou doen.",
    "TestInfrastructure": "Testinfrastructuur",
    "TestInfrastructure_THEPROBLEM_Description": "Het opzetten van een robuuste testomgeving is een tijdrovende onderneming. Het omvat het opzetten van speciale testprojecten binnen uw oplossing, het zorgvuldig selecteren van de benodigde tools, het maken van service- en database-mocks, het maken van essentiële basisklassen en hulpprogramma&#39;s om overtollige code bij tests te minimaliseren, en het aanpakken van verschillende gerelateerde taken.",
    "TestInfrastructure_ABPSOLUTION_Description": "ABP Startup-sjablonen zijn vooraf uitgerust met geconfigureerde testprojecten, waardoor het proces voor u wordt gestroomlijnd. Dit betekent dat u vanaf dag één direct kunt beginnen met het schrijven van uw eerste unit- of integratietestcode.",
    "CodingStandards&Training": "Codeerstandaarden en training",
    "CodingStandards&Training_THEPROBLEM_Description": "Nadat je de oplossing voor ontwikkeling hebt opgezet, moet je de ontwikkelaars meestal leren hoe het systeem werkt en hoe je het kunt bouwen met behulp van dezelfde overeengekomen methoden. Zelfs als u ze training geeft, kan het lastig zijn om de documentatie up-to-date te houden. Naarmate de tijd verstrijkt, kan elke ontwikkelaar op zijn eigen manier code schrijven, waardoor de regels voor het schrijven van code van elkaar gaan verschillen.",
    "CodingStandards&Training_ABPSOLUTION_Description": "De oplossing van ABP is alvast overzichtelijk en voorzien van duidelijke uitleg. Stapsgewijze tutorials en handleidingen laten u precies zien hoe u aan een ABP-project werkt.",
    "KeepingYourSolutionUpToDate": "Uw oplossing up-to-date houden",
    "KeepingYourSolutionUpToDate_THEPROBLEM_Description": "Nadat u met uw ontwikkeling bent begonnen, moet u de nieuwe versies bijhouden van de bibliotheken die u gebruikt voor upgrades en patches.",
    "KeepingYourSolutionUpToDate_ABPSOLUTION_Description": "We updaten alle pakketten regelmatig naar de nieuwste versies en testen ze vóór de stabiele release. Wanneer u het ABP Framework bijwerkt, worden al zijn afhankelijkheden geüpgraded naar edge-technologie.",
    "DRY": "Herhaal jezelf niet!",
    "DRY_Description": "Het creëren van een basisoplossing kost veel tijd en vereist goede architectonische ervaring. Dit is echter nog maar het begin! Als u begint met ontwikkelen, zult u waarschijnlijk veel repetitieve code moeten schrijven; Het zou geweldig zijn als dit allemaal automatisch zou kunnen worden afgehandeld.",
    "DRY_Description2": "ABP automatiseert en vereenvoudigt het herhalen van code zoveel mogelijk door het conventie-over-configuratieprincipe te volgen. Het beperkt u echter niet wanneer u moet overschakelen naar een handmatige versnelling. De controle ligt altijd in jouw handen.",
    "Authentication": "Authenticatie",
    "Authentication_THEPROBLEM_Description": "Single Sign On, Active Directory / LDAP-integratie, OpenIddict-integratie, sociale logins, tweefactorauthenticatie, wachtwoord vergeten/opnieuw instellen, e-mailactivering, registratie van nieuwe gebruikers, controle van wachtwoordcomplexiteit, account vergrendelen bij mislukte pogingen, mislukte inlogpogingen tonen... etc. We weten dat al deze algemene vereisten u bekend zijn. Je bent niet alleen!",
    "Authentication_ABPSOLUTION_Description": "ABP Framework en de commerciële versie bieden al deze standaardzaken vooraf voor u geïmplementeerd als een herbruikbare accountmodule. U schakelt gewoon in en configureert wat u nodig heeft.",
    "CrossCuttingConcerns": "Transversale zorgen",
    "CrossCuttingConcerns_THEPROBLEM_Description": "Transversale zorgen zijn de fundamentele herhalende logica die voor elke gebruikscasus moet worden geïmplementeerd. Een paar voorbeelden;",
    "CrossCuttingConcerns_THEPROBLEM_Description2": "Transacties starten, succes beloven en fouten terugdraaien.",
    "CrossCuttingConcerns_THEPROBLEM_Description3": "Het afhandelen en rapporteren van uitzonderingen, het retourneren van een correcte foutreactie naar de clients en het afhandelen van foutgevallen aan de clientzijde.",
    "CrossCuttingConcerns_THEPROBLEM_Description4": "Het implementeren van autorisatie en validatie, het retourneren van de juiste antwoorden en het afhandelen hiervan aan de klantzijde.",
    "CrossCuttingConcerns_ABPSOLUTION_Description": "ABP Framework automatiseert of vereenvoudigt alle algemene transversale problemen. U schrijft alleen code die voor uw bedrijf van belang is, en ABP handelt de rest volgens conventies af.",
    "ArchitecturalInfrastructure": "Architecturale infrastructuur",
    "ArchitecturalInfrastructure_THEPROBLEM_Description": "Normaal gesproken moet u infrastructuur bouwen om uw architectuur correct te implementeren. U implementeert bijvoorbeeld doorgaans het Repository-patroon. U definieert enkele basisklassen om te vereenvoudigen en te standaardiseren om entiteiten, services, controllers en andere objecten te creëren.",
    "ArchitecturalInfrastructure_ABPSOLUTION_Description": "ABP Framework biedt dit alles en nog veel meer out-of-the-box. Het is volwassen en goed gedocumenteerd.",
    "EnterpriseApplicationRequirements": "Vereisten voor zakelijke toepassingen",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description": "Er zijn veel vereisten die u herhaaldelijk in elke bedrijfstoepassing implementeert;",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description2": "Gedetailleerd machtigingssysteem en beheer van machtigingen op de gebruikersinterface op basis van rollen en gebruikers.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description3": "Het schrijven van auditlogboeken en entiteitsgeschiedenissen om bij te houden wanneer een gebruiker een databaserecord wijzigt.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description4": "Zorg ervoor dat uw entiteiten voorlopig worden verwijderd, zodat ze worden gemarkeerd als verwijderd in plaats van fysiek uit de database te worden verwijderd, en verwijder automatisch verwijderde entiteiten op uw zoekopdrachten.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description5": "Het maken van abstracties en wrappers om uw backend-API&#39;s te gebruiken vanuit de frontend-code.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description6": "Achtergrondtaken in de wachtrij plaatsen en uitvoeren.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description7": "Omgaan met meerdere tijdzones in een mondiaal systeem.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description8": "Het delen van validatie, lokalisatie en autorisatielogica tussen server en client.",
    "EnterpriseApplicationRequirements_ABPSOLUTION_Description": "ABP biedt een infrastructuur om dergelijke vereisten eenvoudig te implementeren. Nogmaals, u besteedt uw kostbare tijd niet aan het steeds opnieuw implementeren van al deze zaken.",
    "GeneratingInitialCode&Tooling": "Het genereren van initiële code en tooling",
    "GeneratingInitialCode&Tooling_THEPROBLEM_Description": "Je bouwt veel vergelijkbare pagina&#39;s in een typische webapplicatie. De meeste van hen zullen vergelijkbare CRUD-bewerkingen uitvoeren. Het is erg vervelend en ook foutgevoelig om herhaaldelijk dergelijke pagina&#39;s te maken.",
    "GeneratingInitialCode&Tooling_ABPSOLUTION_Description": "<a href=\"/tools/suite\">ABP Suite</a> kan binnen enkele seconden een full-stack CRUD-pagina voor uw entiteiten genereren. De gegenereerde code is gelaagd en schoon. Alle standaard validatie- en autorisatievereisten zijn geïmplementeerd. Bovendien worden er unit-testklassen gegenereerd. Zodra u een volledig actieve pagina heeft, kunt u deze aanpassen aan uw zakelijke vereisten.",
    "IntegratingTo3rdPartyLibrariesAndSystems": "Integratie met bibliotheken en systemen van derden",
    "IntegratingTo3rdPartyLibrariesAndSystems_THEPROBLEM_Description": "De meeste bibliotheken zijn ontworpen op een laag niveau en u moet doorgaans wat werk doen om ze goed te integreren zonder overal in uw oplossing dezelfde integratie- en configuratiecode te herhalen. Stel dat u RabbitMQ moet gebruiken om uw gedistribueerde gebeurtenisbus te implementeren. Het enige wat je wilt doen is; een bericht naar een wachtrij sturen en de binnenkomende berichten afhandelen. Maar u moet berichtpatronen, wachtrijen en uitwisselingsdetails begrijpen. Om efficiënte code te schrijven, moet u een pool creëren om verbindingen, clients en kanalen te beheren. Je moet ook omgaan met uitzonderingen, ACK-berichten, opnieuw verbinding maken met RabbitMQ bij fouten en meer.",
    "IntegratingTo3rdPartyLibrariesAndSystems_ABPSOLUTION_Description": "De RabbitMQ Distributed Event Bus-integratie van ABP vat bijvoorbeeld al deze details samen. Je verzendt en ontvangt berichten zonder de drukte. Moet u code op laag niveau schrijven? Geen probleem, dat kan altijd. ABP beperkt u niet wanneer u functies op laag niveau moet gebruiken van de bibliotheek die u gebruikt.",
    "WhyNotBuildYourOwnFramework?": "Waarom bouwt u niet uw eigen raamwerk?",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description": "Het bouwen, onderhouden en documenteren van de hele infrastructuur kost, zelfs op de eenvoudigste manier, veel tijd. Het wordt in de loop van de tijd groter en het wordt moeilijk om het in uw oplossing te behouden. Het scheiden hiervan in een herbruikbaar project is het startpunt voor het bouwen van uw eigen interne raamwerk.",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description2": "Het opbouwen, documenteren, trainen en onderhouden van een intern raamwerk is erg moeilijk. Als u niet over een ervaren, toegewijd raamwerkteam beschikt, wordt uw interne raamwerk snel een ongedocumenteerde oude code die niemand meer kan begrijpen en onderhouden. Aan de andere kant worden deze raamwerken over het algemeen ontwikkeld door een of twee ontwikkelaars in het team. En deze kerels worden een kennissilo. Het is goed voor hen, maar slecht voor het bedrijf, omdat zij het enige punt van mislukking van het project zijn <a href=\"https://en.wikipedia.org/wiki/Single_point_of_failure\">-SPOF-</a> . Zodra ze het bedrijf verlaten, gaat het project dramatisch ten onder.",
    "WhyNotBuildYourOwnFramework_ABPSOLUTION_Description": "ABP Framework is een gemeenschapsgestuurd, goed gedocumenteerd, volwassen en generiek applicatieframework. Een team van zeer ervaren ontwikkelaars werkt er hard aan om het up-to-date, gemakkelijk te begrijpen en comfortabel in gebruik te houden. Door zo’n stabiel raamwerk te gebruiken, kunt u zich concentreren op uw eigen bedrijfscode en krijgt u hulp met het raamwerk van experts wanneer u die nodig heeft.",
    "ArchitecturalInfrastructure_Description": "SaaS-applicaties, modulaire of microservicesystemen zijn de meest gebruikte bedrijfssoftwaremodellen. Het bouwen van dergelijke systemen vereist niet alleen een goed begrip en ervaring, maar vereist ook een sterke software-infrastructuur. Anders zult u merken dat u veel moeite moet doen om deze architectonische details in uw codebase te ondersteunen.",
    "Modularity": "Modulariteit",
    "Modularity_THEPROBLEM_Description": "Een echt modulair systeem bouwen is niet eenvoudig! Alle aspecten van het systeem (database, entiteiten, API&#39;s, UI-pagina&#39;s/componenten) kunnen worden opgesplitst in modules, en elke module kan zonder andere herbruikbaar zijn. De gewone ASP.NET Core biedt niet zo&#39;n modulaire architectuur. Als je het nodig hebt, moet je er helemaal opnieuw over nadenken.",
    "Modularity_ABPSOLUTION_Description": "Het ABP Framework is geboren als een modulaire applicatieontwikkelingsstructuur. Elke functie in het raamwerk is ontwikkeld om compatibel te zijn met modulariteit. Documentatie en handleidingen leggen uit hoe u op een standaard manier herbruikbare modules kunt ontwikkelen.",
    "SaaSMultiTenancy": "SaaS/Multi-Tenancy",
    "SaaSMultiTenancy_THEPROBLEM_Description": "<a href=\"https://docs.abp.io/en/abp/latest/Multi-Tenancy\">Multi-Tenancy</a> is een veelgebruikte manier om SaaS-systemen te implementeren. Het implementeren van een consistente multi-tenant infrastructuur kan echter ingewikkeld worden.",
    "SaaSMultiTenancy_ABPSOLUTION_Description": "ABP Framework biedt een complete multi-tenant infrastructuur en abstracte complexiteit uit uw bedrijfscode. Uw applicatiecode zal grotendeels multi-tenancy-bewust zijn, terwijl het ABP Framework automatisch de database, cache en andere details van de tenants van elkaar isoleert. Het ondersteunt een enkele database, database per tenant en hybride benaderingen. Het configureert op de juiste manier de bibliotheken zoals Microsoft Identity en OpenIddict, die normaal gesproken niet compatibel zijn met meerdere huurders.",
    "Microservices": "Microdiensten",
    "Microservices_THEPROBLEM_Description": "Het bouwen van een microservicesysteem vereist veel infrastructuurdetails: het authenticeren en autoriseren van applicaties en microservices en het implementeren van asynchrone berichtenuitwisseling en synchrone (Rest/GRPC) communicatiepatronen tussen microservices zijn de meest fundamentele kwesties.",
    "Microservices_ABPSOLUTION_Description": "Het ABP Framework biedt services, <a href=\"https://docs.abp.io/en/abp/latest/Microservice-Architecture\" target=\"_blank\">handleidingen</a> en voorbeelden om u te helpen uw microservice-oplossing te implementeren met behulp van de industriestandaardtools.",
    "Microservices_ABPSOLUTION_Description2": "ABP Commercial gaat zelfs nog een stap verder en biedt een compleet <a href=\"https://docs.abp.io/en/commercial/latest/startup-templates/microservice/index\" target=\"_blank\">startup-template</a> om uw microservice-oplossing een vliegende start te geven.",
    "PreBuiltModules": "Voorgebouwde modules",
    "PreBuiltModules_THEPROBLEM_Description": "We hebben allemaal vergelijkbare, maar enigszins verschillende zakelijke vereisten. We moeten echter allemaal het wiel opnieuw uitvinden, aangezien niemands code direct in onze oplossing kan werken. Het zijn allemaal ingebedde onderdelen van een grotere oplossing.",
    "PreBuiltModules_ABPSOLUTION_Description": "ABP Commercial- <a href=\"/modules\">modules</a> bieden veel herbruikbare applicatiemodules zoals betaling, chat, bestandsbeheer, auditlograpportage... etc. Al deze modules zijn eenvoudig in uw oplossing te installeren en werken direct. We voegen voortdurend meer modules toe.",
    "PreBuiltModules_ABPSOLUTION_Description2": "Alle modules zijn zo ontworpen dat ze kunnen worden aangepast aan uw zakelijke vereisten. Als u volledige controle nodig heeft, kunt u de volledige broncode van elke module downloaden en deze volledig aanpassen op basis van uw specifieke zakelijke vereisten.",
    "ABPCommunity": "ABP-gemeenschap",
    "ABPCommunity_Description": "Ten slotte geeft het feit dat je deel uitmaakt van een grote gemeenschap waar iedereen vergelijkbare codeerstijlen en -principes volgt en een gemeenschappelijke infrastructuur deelt, kracht als je problemen hebt of hulp nodig hebt bij ontwerpbeslissingen. Omdat we op dezelfde manier code schrijven, kunnen we elkaar veel beter helpen. ABP is een door de gemeenschap gesteund project met meer dan 10.000 sterren op GitHub.",
    "ABPCommunity_Description2": "Het is gemakkelijk om code of zelfs herbruikbare bibliotheken te delen tussen ABP-ontwikkelaars. Een codefragment dat voor u werkt, werkt ook voor anderen. Er zijn veel voorbeelden en tutorials die u direct voor uw toepassing kunt implementeren.",
    "ABPCommunity_Description3": "Wanneer u een ontwikkelaar inhuurt die eerder met de ABP-architectuur heeft gewerkt, begrijpt hij uw oplossing onmiddellijk en start hij binnen zeer korte tijd met de ontwikkeling.",
    "WhyAbpIo_Page_Title": "Waarom ABP.IO-platform?",
    "AbpStudio_Page_Title": "ABP Studio",
    "CampaignInfo": "Koop een nieuwe licentie of verleng uw bestaande licentie en <span class=\"text-white\">krijg 2 maanden extra,</span> zonder extra kosten! Deze aanbieding is geldig voor alle licentieplannen. Zorg ervoor dat u profiteert van deze tijdelijke promotie om uw toegang tot premiumfuncties en upgrades uit te breiden.",
    "HurryUpLastDay": "Haast je! Laatste dag: {0}",
    "CreatingCRUDPagesWithABPSuite": "CRUD-pagina&#39;s maken met ABP Suite",
    "Testimonials": "Getuigenissen",
    "MultipleYearDiscount": "Meerjarige korting",
    "CampaignDiscountText": "Black Friday-korting",
    "CampaignDiscountName": "Zwarte vrijdag",
    "CampaignName:BlackFriday": "Zwarte vrijdag"
  }
}