{
  "culture": "pl-PL",
  "texts": {
    "OrganizationManagement": "Zarządzanie organizacją",
    "OrganizationList": "Lista organizacji",
    "Volo.AbpIo.Commercial:010003": "Nie jesteś właścicielem tej organizacji!",
    "OrganizationNotFoundMessage": "Nie znaleziono organizacji!",
    "DeveloperCount": "Programiści przydzieleni/ogółem",
    "QuestionCount": "Pozostałe/wszystkie pytania",
    "Unlimited": "Nieograniczony",
    "Owners": "Właściciele",
    "AddMember": "Dodaj członka",
    "AddOwner": "Dodaj właściciela",
    "AddDeveloper": "Dodaj programistę",
    "UserName": "Nazwa użytkownika",
    "Name": "Nazwa",
    "EmailAddress": "Adres e-mail",
    "Developers": "Deweloperzy",
    "LicenseType": "Rodzaj licencji",
    "Manage": "Zarządzać",
    "StartDate": "Data rozpoczęcia",
    "EndDate": "Data końcowa",
    "Modules": "Moduły",
    "LicenseExtendMessage": "Data zakończenia Twojej licencji została przedłużona do {0}",
    "LicenseUpgradeMessage": "Twoja licencja została uaktualniona do {0}",
    "LicenseExtendAdnUpgradeMessage": "Twoja licencja została przedłużona do {0}, a plan licencji został uaktualniony do {1}.",
    "LicenseAddDeveloperMessage": "{0} programistów dodanych do Twojej licencji",
    "Volo.AbpIo.Commercial:010004": "Nie można znaleźć podanego użytkownika! Użytkownik musi być już zarejestrowany.",
    "MyOrganizations": "Moje organizacje",
    "ApiKey": "Klucz API",
    "UserNameNotFound": "Brak użytkownika o nazwie użytkownika {0}",
    "SuccessfullyAddedToNewsletter": "Dziękujemy za zapisanie się do naszego newslettera!",
    "MyProfile": "Mój profil",
    "EmailNotValid": "Proszę wpisać aktualny adres e-mail.",
    "JoinOurMarketingNewsletter": "Dołącz do naszego newslettera marketingowego",
    "WouldLikeToReceiveMarketingMaterials": "Chcę otrzymywać materiały marketingowe, takie jak oferty produktów i oferty specjalne.",
    "StartUsingYourLicenseNow": "Zacznij korzystać z licencji już teraz!",
    "WelcomePage": "Strona powitalna",
    "UnsubscriptionExpireEmail": "Anuluj subskrypcję e-maili z przypomnieniem o dacie wygaśnięcia licencji",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Ta subskrypcja e-mail zawiera tylko przypomnienie o dacie wygaśnięcia licencji.",
    "UnsubscribeFromLicenseExpireEmails": "Jeśli nie chcesz otrzymywać wiadomości e-mail o dacie wygaśnięcia licencji, możesz zrezygnować z subskrypcji w dowolnym momencie.",
    "Unsubscribe": "Anuluj subskrypcję",
    "NotOrganizationMember": "Nie jesteś członkiem żadnej organizacji.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Pomyślnie anulowano subskrypcję",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Nie będziesz już otrzymywać wiadomości e-mail z przypomnieniem o dacie wygaśnięcia licencji.",
    "IndexPageHeroSection": "<span class=\"first-line\">A complete</span><span class=\"second-line\"> web development platform</span><span class=\"third-line\">built-on <img src=\"{0}\" width=\"110\" class=\"ml-1\" /> framework</span>",
    "AbpCommercialShortDescription": "ABP Commercial zapewnia gotowe moduły aplikacji, narzędzia do szybkiego tworzenia aplikacji, profesjonalne motywy interfejsu użytkownika, wsparcie premium i nie tylko.",
    "LiveDemo": "Demo na żywo",
    "GetLicence": "Uzyskaj licencję",
    "Application": "Podanie",
    "StartupTemplates": "Szablony startowe",
    "Startup": "Uruchomienie",
    "Templates": "Szablony",
    "Developer": "Deweloper",
    "Tools": "Narzędzia",
    "Premium": "Premia",
    "PremiumSupport": "Wsparcie Premium",
    "PremiumForumSupport": "Wsparcie forum Premium",
    "UI": "interfejs użytkownika",
    "Themes": "Motywy",
    "JoinOurNewsletter": "Dołącz do naszego newslettera",
    "Send": "Wysłać",
    "Learn": "Uczyć się",
    "AdditionalServices": "Dodatkowe usługi",
    "WhatIsABPFramework": "CO TO JEST RAMA ABP?",
    "OpenSourceBaseFramework": "Podstawowa platforma open source",
    "ABPFrameworkExplanation": "<p class=\"lead\">ABP Commercial jest oparty na ABP Framework, platformie aplikacji internetowych typu open source i opartej na społeczności dla ASP.NET Core.</p><p>ABP Framework zapewnia doskonałą infrastrukturę do pisania, którą można konserwować i rozszerzać i testowalny kod z najlepszymi praktykami.</p><p>Wbudowany i zintegrowany z popularnymi narzędziami, które już znasz. Niska krzywa uczenia się, łatwa adaptacja, komfortowy rozwój.</p>",
    "Modular": "Modułowy",
    "MicroserviceCompatible": "Kompatybilny z mikroserwisami",
    "DomainDrivenDesignInfrastructure": "Infrastruktura projektowa oparta na domenie",
    "MultiTenancy": "Wielu najemców",
    "DistributedMessaging": "Wiadomości rozproszone",
    "DynamicProxying": "Dynamiczne proxy",
    "BackgroundJobs": "Praca w tle",
    "AuditLogging": "Rejestrowanie audytów",
    "BLOBStoring": "Przechowywanie BLOB",
    "BundlingMinification": "Grupowanie i minifikacja",
    "AdvancedLocalization": "Zaawansowana lokalizacja",
    "ManyMore": "Wiele więcej",
    "ExploreTheABPFramework": "Poznaj ramy ABP",
    "WhyUseTheABPCommercial": "Dlaczego warto korzystać z reklamy ABP?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\">Tworzenie aplikacji internetowych klasy korporacyjnej może być złożone i czasochłonne.</p><p>ABP Commercial oferuje idealną infrastrukturę podstawową niezbędną dla wszystkich nowoczesnych ASP.NET Core klasy korporacyjnej oparte na rozwiązaniach. Od projektu do wdrożenia cały cykl rozwoju jest wspierany przez wbudowane funkcje i moduły ABP.</p>",
    "StartupTemplatesShortDescription": "Szablony startowe pozwalają błyskawicznie rozpocząć projekt w kilka sekund.",
    "UIFrameworksOptions": "opcje ram interfejsu użytkownika;",
    "DatabaseProviderOptions": "Opcje dostawcy bazy danych;",
    "PreBuiltApplicationModules": "Gotowe moduły aplikacji",
    "PreBuiltApplicationModulesShortDescription": "Większość typowych wymagań dotyczących aplikacji została już opracowana dla Ciebie jako moduły wielokrotnego użytku.",
    "Account": "Konto",
    "Blogging": "Blogowanie",
    "Identity": "Tożsamość",
    "IdentityServer": "Serwer tożsamości",
    "Saas": "Saas",
    "LanguageManagement": "Zarządzanie językiem",
    "TextTemplateManagement": "Zarządzanie szablonami tekstu",
    "See All Modules": "Zobacz wszystkie moduły",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "ABP Suite jest narzędziem uzupełniającym do ABP Commercial.",
    "AbpSuiteExplanation": "Umożliwia tworzenie stron internetowych w ciągu kilku minut. Jest to narzędzie .NET Core Global, które można zainstalować z wiersza poleceń. Może tworzyć nowe rozwiązanie ABP, generować strony CRUD z bazy danych do front-endu.",
    "Details": "Detale",
    "LeptonTheme": "Motyw Lepton",
    "ProfessionalModernUIThemes": "Profesjonalne, nowoczesne motywy interfejsu użytkownika",
    "LeptonThemeExplanation": "Lepton zapewnia gamę motywów administracyjnych Bootstrap, które służą jako solidna podstawa dla każdego projektu wymagającego pulpitu administracyjnego.",
    "DefaultTheme": "Domyślny motyw",
    "MaterialTheme": "Motyw materiału",
    "Default2Theme": "Domyślny motyw 2",
    "DarkTheme": "Ciemny schemat",
    "DarkBlueTheme": "Ciemnoniebieski motyw",
    "LightTheme": "Jasny motyw",
    "ProudToWorkWith": "Dumni ze współpracy",
    "OurConsumers": "Tysiące przedsiębiorstw i deweloperów w ponad 70 krajach na całym świecie polega na ABP Commercial.",
    "JoinOurConsumers": "Dołącz do nich i szybko buduj niesamowite produkty.",
    "AdditionalServicesExplanation": "Potrzebujesz usług dodatkowych lub niestandardowych? <strong>My i nasi partnerzy możemy zapewnić;</strong>",
    "CustomProjectDevelopment": "Rozwój projektów niestandardowych",
    "CustomProjectDevelopmentExplanation": "Dedykowani programiści do Twoich niestandardowych projektów.",
    "PortingExistingProjects": "Przenoszenie istniejących projektów",
    "PortingExistingProjectsExplanation": "Migracja dotychczasowych projektów na platformę ABP.",
    "LiveSupport": "Wsparcie na żywo",
    "LiveSupportExplanation": "Opcja zdalnej pomocy na żywo, kiedy jej potrzebujesz.",
    "Training": "Szkolenie",
    "TrainingExplanation": "Dedykowane szkolenie dla Twoich programistów.",
    "OnBoarding": "Proces wdrażania do firmy nowego pracownika",
    "OnBoardingExplanation": "Pomoc w konfiguracji środowisk programistycznych, CI i CD.",
    "PrioritizedTechnicalSupport": "Priorytetowe wsparcie techniczne",
    "PremiumSupportExplanation": "Poza wspaniałym wsparciem społeczności ABP, nasz zespół wsparcia odpowiada na pytania techniczne i problemy użytkowników komercyjnych o wysokim priorytecie.",
    "SeeTheSupportOptions": "Zobacz opcje pomocy technicznej",
    "Contact": "Kontakt",
    "TellUsWhatYouNeed": "Powiedz nam, czego potrzebujesz.",
    "YourMessage": "Twoja wiadomość",
    "YourFullName": "Twoje pełne imię",
    "EmailField": "Adres e-mail",
    "YourEmailAddress": "Twój adres email",
    "HowMayWeHelpYou": "Jak możemy Ci pomóc?",
    "SendMessage": "Wyślij wiadomość",
    "Success": "Powodzenie",
    "WeWillReplyYou": "Otrzymaliśmy Twoją wiadomość i wkrótce się z Tobą skontaktujemy.",
    "GoHome": "Idź do domu",
    "CreateLiveDemo": "Utwórz demo na żywo",
    "RegisterToTheNewsletter": "Zarejestruj się do newslettera, aby otrzymywać informacje dotyczące ABP.IO, w tym nowości itp.",
    "EnterYourEmailOrLogin": "Wprowadź swój adres e-mail, aby utworzyć demo lub <a href=\"{0}\">Zaloguj się</a> przy użyciu istniejącego konta.",
    "ApplicationTemplate": "Szablon aplikacji",
    "ApplicationTemplateExplanation": "Szablon startowy aplikacji służy do tworzenia nowej aplikacji internetowej.",
    "EfCoreProvider": "Entity Framework (obsługuje SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\">i inne</a>)",
    "AlreadyIncludedInTemplateModules": "W tym szablonie są już uwzględnione i skonfigurowane następujące moduły:",
    "ApplicationTemplateArchitecture": "Ten szablon aplikacji obsługuje również architekturę warstwową, w której warstwa interfejsu użytkownika, warstwa interfejsu API i usługa uwierzytelniania są fizycznie oddzielone.",
    "SeeTheGuideOrGoToTheLiveDemo": "Zapoznaj się z przewodnikiem dla programistów, aby uzyskać informacje techniczne o tym szablonie lub przejdź do demonstracji na żywo.",
    "DeveloperGuide": "Przewodnik dla programistów",
    "ModuleTemplate": "Szablon modułu",
    "ModuleTemplateExplanation1": "Chcesz stworzyć moduł i używać go ponownie w różnych aplikacjach? Ten szablon startowy przygotowuje wszystko do rozpoczęcia tworzenia <strong>modułu aplikacji</strong> wielokrotnego użytku lub <strong>mikroserwisu</strong>.",
    "ModuleTemplateExplanation2": "<p>Możesz obsługiwać jeden lub wiele struktur interfejsu użytkownika, jednego lub wielu dostawców baz danych dla jednego modułu. Szablon startowy jest skonfigurowany do uruchamiania i <strong>testowania Twojego modułu</strong> w minimalnej aplikacji oprócz infrastruktury testów jednostkowych i integracyjnych. </p> <p>Zapoznaj się z przewodnikiem programisty, aby uzyskać informacje techniczne na temat tego szablonu.</p>",
    "WithAllStyleOptions": "ze wszystkimi opcjami stylu",
    "Demo": "Próbny",
    "SeeAllModules": "Zobacz wszystkie moduły",
    "ABPCLIExplanation": "ABP CLI (Interfejs wiersza poleceń) to narzędzie wiersza poleceń do wykonywania niektórych typowych operacji dla rozwiązań opartych na ABP.",
    "ABPSuiteEasilyCURD": "ABP Suite to narzędzie, które pozwala łatwo tworzyć strony CRUD",
    "WeAreHereToHelp": "Jesteśmy tutaj, aby <span class=\"zero-text\">pomoc</span>",
    "BrowseOrAskQuestion": "Możesz przeglądać nasze tematy pomocy lub przeszukiwać często zadawane pytania albo możesz zadać nam pytanie, korzystając z <a href=\"{0}\" class=\"text-success\">formularza kontaktowego</a>.",
    "SearchQuestionPlaceholder": "Szukaj w często zadawanych pytaniach",
    "WhatIsTheABPCommercial": "Co to jest reklama ABP?",
    "WhatAreDifferencesThanAbpFramework": "Jakie są różnice między Open Source ABP Framework a ABP Commercial?",
    "ABPCommercialExplanation": "ABP Commercial to zestaw modułów, narzędzi, motywów i usług premium zbudowanych na bazie <a target=\"_blank\" href=\"{0}\">szkieletu ABP</a> o otwartym kodzie źródłowym. ABP Commercial jest rozwijany i wspierany przez ten sam zespół odpowiedzialny za framework ABP.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\">Struktura ABP</a> to modułowa, oparta na motywach, zgodna z mikrousługami platforma do tworzenia aplikacji dla ASP.NET Core. Zapewnia kompletną architekturę i silną infrastrukturę, dzięki czemu możesz skupić się na własnym kodzie biznesowym, zamiast powtarzać się przy każdym nowym projekcie. Opiera się na najlepszych praktykach tworzenia oprogramowania i popularnych narzędziach, które już znasz. </p> <p> Framework ABP jest całkowicie darmowy, open source i oparty na społeczności. Zapewnia również darmowy motyw i kilka gotowych modułów (np. Zarządzanie tożsamością i zarządzanie najemcami).</p>",
    "VisitTheFrameworkVSCommercialDocument": "Odwiedź poniższy link, aby uzyskać więcej informacji <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial dodaje następujące korzyści do ram ABP;",
    "Professional": "Profesjonalny",
    "UIThemes": "Motywy interfejsu użytkownika",
    "EnterpriseModules": "Gotowe dla przedsiębiorstw, bogate w funkcje, wstępnie wbudowane <a href=\"{0}\">moduły aplikacji</a> (np. zarządzanie serwerem tożsamości, zarządzanie SaaS, zarządzanie językiem)",
    "ToolingToSupport": "Narzędzia wspierające Twoją produktywność programistyczną (np. <a href=\"{0}\">ABP Suite</a>)",
    "PremiumSupportLink": "<a href=\"{0}\" target=\"_blank\">wsparcie premium</a>",
    "WhatDoIDownloadABPCommercial": "Co mogę pobrać, kupując reklamę ABP?",
    "CreateUnlimitedSolutions": "Po zakupie licencji komercyjnej ABP będziesz mógł tworzyć nieograniczone rozwiązania, jak opisano w dokumencie <a href=\"{0}\">Pierwsze kroki</a>.",
    "ABPCommercialSolutionExplanation": "Podczas tworzenia nowej aplikacji otrzymujesz rozwiązanie Visual Studio (szablon startowy) na podstawie Twoich preferencji. Pobrane rozwiązanie zawiera już zainstalowane i skonfigurowane komercyjne moduły i motywy. Możesz usunąć wstępnie zainstalowany moduł lub dodać inny moduł, jeśli chcesz. Wszystkie moduły i motywy są domyślnie używane jako pakiety NuGet/NPM.",
    "StartDevelopWithTutorials": "Pobrane rozwiązanie jest dobrze zaprojektowane i udokumentowane. Możesz zacząć tworzyć własny kod biznesowy na jego podstawie, postępując zgodnie z <a href=\"{0}\">samouczkami</a>",
    "TryTheCommercialDemo": "Możesz wypróbować <a href=\"{0}\">demo</a>, aby zobaczyć przykładową aplikację utworzoną przy użyciu szablonu startowego ABP Commercial.",
    "HowManyProducts": "Ile różnych produktów/rozwiązań mogę zbudować za pomocą ABP Commercial?",
    "HowManyProductsExplanation": "Nie ma ograniczeń co do tworzenia projektu ABP. Możesz stworzyć tyle projektów, ile chcesz, rozwijać i przesyłać je na różne serwery.",
    "HowManyDevelopers": "Ilu programistów może pracować nad reklamą ABP?",
    "HowManyDevelopersExplanation": "Licencje komercyjne ABP dotyczą jednego dewelopera. Różne typy licencji mają różne ograniczenia programistyczne. Możesz jednak dodać więcej programistów do dowolnego typu licencji, kiedy tylko zajdzie taka potrzeba. Zobacz stronę <a href=\"{0}\">ceny</a>, aby poznać typy licencji, limity programistów i dodatkowe koszty programistów.",
    "ChangingLicenseType": "Czy mogę uaktualnić swój typ licencji później?",
    "ChangingLicenseTypeExplanation": "Możesz uaktualnić do wyższej licencji, płacąc różnicę w okresie aktywnej licencji. Po uaktualnieniu do wyższego planu licencji uzyskujesz korzyści z nowego planu, ale uaktualnienie licencji nie zmienia daty wygaśnięcia licencji. Poza tym możesz również dodać nowe stanowiska programisty do istniejącej licencji, zobacz „Ilu programistów może pracować nad komercyjnym ABP?”",
    "LicenseExtendUpgradeDiff": "Jaka jest różnica między rozszerzeniem licencji a aktualizacją?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Przedłużanie:</strong> przedłużając/odnawiając licencję, będziesz nadal otrzymywać wsparcie premium i ważne aktualizacje modułów i motywów. Poza tym będziesz mógł kontynuować tworzenie nowych projektów. I nadal będziesz mógł korzystać z pakietu ABP Suite, który przyspieszy Twój rozwój.<hr/><strong>Aktualizacja:</strong> Uaktualniając swoją licencję, awansujesz do wyższego planu licencyjnego, który pozwoli Ci uzyskać dodatkowe korzyści . Zobacz <a href=\"/pricing\">tablicę porównawczą licencji</a>, aby sprawdzić różnice między planami licencyjnymi.<strong>Z drugiej strony po uaktualnieniu data wygaśnięcia licencji nie ulegnie zmianie!</strong >Aby przedłużyć datę zakończenia licencji, musisz przedłużyć swoją licencję.",
    "LicenseRenewalCost": "Jaki jest koszt odnowienia licencji po 1 roku?",
    "LicenseRenewalCostExplanation": "Stawka odnawiania (przedłużania) wszystkich komercyjnych licencji wieczystych ABP wynosi {0} ceny katalogowej licencji. Cena odnowienia standardowej licencji zespołowej wynosi {1} USD, standardowej licencji biznesowej {2} USD, a standardowej Licencji Enterprise {3} USD. Jeśli jesteś już klientem, <a href='{4}' target='_blank'>zaloguj się na swoje konto</a>, aby sprawdzić dostępne ceny odnowienia.",
    "HowDoIRenewMyLicense": "Jak odnowić licencję?",
    "HowDoIRenewMyLicenseExplanation": "Możesz odnowić licencję, przechodząc na <a href='{0}' target='_blank'>stronę zarządzania organizacją</a>. Aby skorzystać z naszych obniżonych stawek za wcześniejsze odnowienie, pamiętaj o odnowieniu przed wygaśnięciem licencji. Nie martw się jednak, że nie wiesz, kiedy kończy się Twoja szansa na wczesne odnowienie. Otrzymasz 3 e-maile z przypomnieniem przed wygaśnięciem subskrypcji. Wyślemy je na 30 dni, 7 dni i 1 dzień przed wygaśnięciem.",
    "IsSourceCodeIncluded": "Czy moja licencja zawiera kod źródłowy modułów i motywów komercyjnych?",
    "IsSourceCodeIncludedExplanation1": "Zależy od typu zakupionej licencji:",
    "IsSourceCodeIncludedExplanation2": "<strong>Zespół</strong>: Twoje rozwiązanie używa modułów i motywów jako pakietów NuGet i NPM. Nie zawiera ich kodu źródłowego. W ten sposób możesz łatwo aktualizować te moduły i motywy, gdy tylko dostępna jest nowa wersja. Nie możesz jednak uzyskać kodu źródłowego modułów i motywów.",
    "IsSourceCodeIncludedExplanation3": "<strong>Business/Enterprise</strong>: oprócz licencji zespołowej możesz pobrać kod źródłowy dowolnego modułu lub motywu, którego potrzebujesz. Możesz nawet usunąć odwołania do pakietu NuGet/NPM dla określonego modułu i dodać jego kod źródłowy bezpośrednio do rozwiązania, aby w pełni go zmienić.",
    "IsSourceCodeIncludedExplanation4": "<p>Dołączenie kodu źródłowego modułu do rozwiązania zapewnia maksymalną swobodę dostosowywania tego modułu. Jednak wtedy nie będzie możliwe automatyczne uaktualnienie modułu po wydaniu nowej wersji.</p><p>Żadna z licencji nie zawiera kodu źródłowego ABP Suite, który jest zewnętrznym narzędziem, które generuje kod dla Ciebie i pomaga do swojego rozwoju.</p><p>Zobacz <a href=\"{0}\">stronę cen</a>, aby poznać inne różnice między typami licencji.</p>",
    "ChangingDevelopers": "Czy mogę w przyszłości zmienić zarejestrowanych programistów mojej organizacji?",
    "ChangingDevelopersExplanation": "Oprócz dodawania nowych programistów do swojej licencji możesz również zmieniać istniejących programistów (możesz usunąć programistę i dodać nowego do tego samego stanowiska) bez żadnych dodatkowych kosztów.",
    "WhatHappensWhenLicenseEnds": "Co się stanie, gdy skończy się mój okres licencji?",
    "WhatHappensWhenLicenseEndsExplanation1": "Typ licencji komercyjnej ABP to <a href=\"{0}\" target=\"_blank\">licencja wieczysta</a>. Po wygaśnięciu licencji możesz kontynuować rozwijanie swojego projektu. I nie musisz odnawiać swojej licencji. Twoja licencja jest dostarczana z rocznym planem aktualizacji i pomocy technicznej zaraz po wyjęciu z pudełka. Aby nadal otrzymywać nowe funkcje, ulepszenia wydajności, poprawki błędów, wsparcie i nadal korzystać z pakietu ABP Suite, pamiętaj o odnawianiu swojego planu co roku. Po wygaśnięciu licencji nie będziesz mógł uzyskać więcej z następujących korzyści;",
    "WhatHappensWhenLicenseEndsExplanation2": "Nie możesz tworzyć nowych rozwiązań za pomocą ABP Commercial, ale możesz dalej rozwijać swoje istniejące aplikacje w nieskończoność.",
    "WhatHappensWhenLicenseEndsExplanation3": "Będziesz mógł otrzymywać aktualizacje modułów i motywów w swojej GŁÓWNEJ wersji. Na przykład; jeśli używasz v3.2.0 modułu, nadal możesz otrzymywać aktualizacje dla v3.x.x (v3.3.0, v3.5.2... itd.) tego modułu. Ale nie możesz pobrać aktualizacji dla następnej głównej wersji (takiej jak v4.x, v5.x)",
    "WhatHappensWhenLicenseEndsExplanation4": "Nie możesz instalować nowych modułów i motywów dodanych do platformy ABP Commercial po wygaśnięciu licencji.",
    "WhatHappensWhenLicenseEndsExplanation5": "Nie możesz korzystać z pakietu ABP.",
    "WhatHappensWhenLicenseEndsExplanation6": "Nie możesz już uzyskać <a href=\"{0}\">pomocy premium</a>.",
    "WhatHappensWhenLicenseEndsExplanation7": "Możesz odnowić swoją subskrypcję, jeśli chcesz nadal korzystać z tych korzyści. Jeśli odnowisz subskrypcję w ciągu 1 miesiąca po wygaśnięciu licencji, zostanie zastosowana zniżka 20%.",
    "WhenShouldIRenewMyLicense": "Kiedy powinienem odnowić licencję?",
    "WhenShouldIRenewMyLicenseExplanation1": "Jeśli odnowisz licencję w ciągu <strong>1 miesiąca</strong> po wygaśnięciu licencji, zostanie zastosowana zniżka w wysokości 20%.",
    "WhenShouldIRenewMyLicenseExplanation2": "Jeśli odnowisz licencję po upływie 1 miesiąca od daty wygaśnięcia licencji, cena odnowienia będzie taka sama jak cena zakupu licencji i nie będzie rabatu za odnowienie.",
    "TrialPlan": "Czy masz plan próbny?",
    "TrialPlanExplanation": "Na razie ABP Commercial nie ma planu próbnego. W przypadku licencji Team zapewniamy 30-dniową gwarancję zwrotu pieniędzy. Możesz po prostu poprosić o zwrot pieniędzy w ciągu pierwszych 30 dni. W przypadku licencji Business i Enterprise zapewniamy zwrot 60% w ciągu 30 dni. Dzieje się tak, ponieważ licencje Business i Enterprise zawierają pełny kod źródłowy wszystkich modułów i motywów.",
    "DoYouAcceptBankWireTransfer": "Czy akceptujesz przelew bankowy?",
    "DoYouAcceptBankWireTransferExplanation": "Tak, akceptujemy przelew bankowy.<br />Po wysłaniu opłaty licencyjnej przelewem bankowym wyślij nam e-mail na adres info@abp.io z potwierdzeniem odbioru i rodzajem żądanej licencji. Informacje o naszych międzynarodowych kontach bankowych:",
    "HowToUpgrade": "Jak zaktualizować istniejące aplikacje, gdy dostępna jest nowa wersja?",
    "HowToUpgradeExplanation1": "Podczas tworzenia nowej aplikacji przy użyciu ABP Commercial wszystkie moduły i motyw są używane jako pakiety NuGet i NPM. Możesz więc łatwo zaktualizować pakiety, gdy dostępna będzie nowa wersja.",
    "HowToUpgradeExplanation2": "Oprócz standardowych uaktualnień NuGet/NPM <a href=\"{0}\">ABP CLI</a> udostępnia polecenie aktualizacji, które automatycznie wyszukuje i uaktualnia wszystkie pakiety powiązane z ABP w Twoim rozwiązaniu.",
    "DatabaseSupport": "Jakie systemy baz danych są obsługiwane?",
    "DatabaseSupportExplanation": "ABP Framework sam w sobie jest niezależny od bazy danych i może współpracować z dowolnym dostawcą bazy danych ze względu na swoją naturę. Zobacz <a href=\"{0}\" target=\"_blank\">dokument dostępu do danych</a>, aby zobaczyć listę aktualnie wdrożonych dostawców.",
    "UISupport": "Jakie frameworki interfejsu użytkownika są obsługiwane?",
    "Supported": "Utrzymany",
    "UISupportExplanation": "ABP Framework sam w sobie jest niezależny od frameworka UI i może współpracować z dowolnym frameworkiem UI. Jednak szablony startowe, interfejsy użytkownika modułów i motywy nie zostały zaimplementowane dla wszystkich frameworków interfejsu użytkownika. Zobacz <a href=\"{0}\">dokument wprowadzający</a>, aby uzyskać aktualną listę opcji interfejsu użytkownika.",
    "MicroserviceSupport": "Czy wspiera architekturę mikroserwisów?",
    "MicroserviceSupportExplanation1": "Jednym z głównych celów ram ABP jest zapewnienie wygodnej infrastruktury do tworzenia rozwiązań mikrousługowych. Zapoznaj się z dokumentem <a href=\"{0}\">architektura mikrousług</a>, aby dowiedzieć się, jak pomaga tworzyć systemy mikrousług.",
    "MicroserviceSupportExplanation2": "Wszystkie moduły komercyjne ABP są zaprojektowane do obsługi scenariuszy wdrażania mikrousług (z własnym interfejsem API i bazą danych) zgodnie z dokumentem <a href=\"{0}\">najlepsze praktyki tworzenia modułów</a>.",
    "MicroserviceSupportExplanation3": "Udostępniamy przykładowe <a href=\"{0}\">rozwiązanie demonstracyjne mikrousług</a>, które demonstruje implementację architektury mikrousług, aby pomóc Ci stworzyć własne rozwiązanie.",
    "MicroserviceSupportExplanation4": "Krótka odpowiedź brzmi więc „<strong>tak, obsługuje architekturę mikrousług</strong>”.",
    "MicroserviceSupportExplanation5": "Jednak system mikrousług jest rozwiązaniem, a każde rozwiązanie będzie miało inne wymagania, topologię sieci, scenariusze komunikacji, możliwości uwierzytelniania, decyzje o separacji/udostępnianiu baz danych, konfiguracje środowiska uruchomieniowego, integracje z systemami innych firm i wiele innych.",
    "MicroserviceSupportExplanation6": "ABP Framework i ABP Commercial zapewniają infrastrukturę dla scenariuszy mikrousług, modułów kompatybilnych z mikrousługami, próbek i dokumentacji, które pomogą Ci zbudować własne rozwiązanie. Ale nie oczekuj, że bezpośrednio pobierzesz swoje wymarzone rozwiązanie, które jest dla Ciebie gotowe. Musisz to zrozumieć i połączyć niektóre części w oparciu o swoje wymagania.",
    "WhereCanIDownloadSourceCode": "Gdzie mogę pobrać kod źródłowy?",
    "WhereCanIDownloadSourceCodeExplanation": "Możesz pobrać kod źródłowy wszystkich modułów ABP, pakietów Angular i motywów za pośrednictwem ABP Suite lub ABP CLI. Zobacz <a href=\"{0}\">Jak pobrać kod źródłowy?</a>",
    "ComputerLimitation": "Ile komputerów może zalogować się programista podczas opracowywania ABP?",
    "ComputerLimitationExplanation": "W szczególności zezwalamy na <strong>{0} komputery</strong> na osobę/licencjonowanego programistę. Ilekroć istnieje potrzeba, aby programista rozwijał produkty ABP Commercial na trzeciej maszynie, należy wysłać e-mail na adres license@abp.io wyjaśniając sytuację, a następnie dokonamy odpowiedniej alokacji w naszym systemie.",
    "RefundPolicy": "Czy masz politykę zwrotów?",
    "RefundPolicyExplanation": "Możesz poprosić o zwrot pieniędzy w ciągu <strong>30 dni</strong> od zakupu licencji. Licencje Business i Enterprise mają opcję pobierania kodu źródłowego, dlatego zwroty kosztów nie są dostępne w przypadku licencji Business i Enterprise (oraz wszelkich licencji zawierających prawo do otrzymania kodu źródłowego). Ponadto nie są dokonywane żadne zwroty za odnowienia i zakup drugiej licencji.",
    "HowCanIRefundVat": "Jak mogę zwrócić VAT?",
    "HowCanIRefundVatExplanation1": "Jeśli dokonałeś płatności za pomocą 2Checkout, możesz zwrócić podatek VAT za pośrednictwem swojego konta 2Checkout:",
    "HowCanIRefundVatExplanation2": "Zaloguj się na swoje konto <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\">2Checkout</a>",
    "HowCanIRefundVatExplanation3": "Znajdź odpowiednie zamówienie i naciśnij „Zwróć spóźniony VAT” (wprowadź swój NIP)",
    "HowCanIGetMyInvoice": "Jak mogę otrzymać fakturę?",
    "HowCanIGetMyInvoiceExplanation": "Istnieją 2 bramki płatnicze do zakupu licencji: Iyzico i 2Checkout. Jeśli kupisz licencję za pośrednictwem bramki 2Checkout, faktura w formacie PDF zostanie wysłana na Twój adres e-mail, zobacz <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How- do-invoices-work\">Fakturowanie 2Checkout.</a> Jeśli dokonasz zakupu przez bramkę Iyzico, z niestandardowym linkiem do zakupu lub przelewem bankowym, przygotujemy i wyślemy Twoją fakturę. Możesz poprosić o fakturę lub ją pobrać na <a href=\"{0}\">stronie zarządzania organizacją</a>. Zanim skontaktujesz się z nami w sprawie faktury, sprawdź stronę zarządzania organizacją!",
    "Forum": "Forum",
    "SupportExplanation": "Licencje komercyjne ABP zapewniają wsparcie forum premium przez zespół składający się z ekspertów ABP Framework.",
    "PrivateTicket": "Bilet prywatny",
    "PrivateTicketExplanation": "Licencja Enterprise obejmuje również prywatne wsparcie z systemem e-mail i ticketów.",
    "AbpSuiteExplanation1": "ABP Suite umożliwia tworzenie stron internetowych w ciągu kilku minut. Jest to narzędzie .NET Core Global, które można zainstalować z wiersza polecenia.",
    "AbpSuiteExplanation2": "Może tworzyć nowe rozwiązanie ABP, generować strony CRUD z bazy danych do front-endu. Przegląd techniczny znajduje się w <a href=\"{0}\">dokumencie</a>",
    "FastEasy": "Szybki i łatwy",
    "AbpSuiteExplanation3": "ABP Suite umożliwia łatwe tworzenie stron CRUD. Musisz tylko zdefiniować swoją encję i jej właściwości, resztę niech ABP Suite za Ciebie! ABP Suite generuje cały niezbędny kod dla Twojej strony CRUD w kilka sekund. Obsługuje interfejsy użytkownika Angular, MVC i Blazor.",
    "RichOptions": "Bogate opcje",
    "AbpSuiteExplanation4": "ABP Suite obsługuje wiele opcji interfejsu użytkownika, takich jak <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\">Razor Pages</a> i <a href=\"https:/ /angular.io\">Angular</a>. Obsługuje również wiele baz danych, takich jak <a href=\"https://www.mongodb.com\">MongoDB</a> i wszystkie bazy danych obsługiwane przez <strong>EntityFramework Core< /strong> (MS SQL Server, Oracle, MySql, PostgreSQL i <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\">więcej </a>).",
    "AbpSuiteExplanation5": "Dobrą rzeczą jest to, że nie musisz się martwić o te opcje. ABP Suite rozumie typ twojego projektu i generuje kod dla twojego projektu oraz umieszcza wygenerowany kod we właściwym miejscu w twoim projekcie.",
    "SourceCode": "Kod źródłowy",
    "AbpSuiteExplanation6": "ABP Suite generuje dla Ciebie kod źródłowy! Nie generuje magicznych plików do generowania strony internetowej. ABP Suite generuje kod źródłowy dla <strong>jednostki, repozytorium, usługi aplikacji, migracji Code First, JavaScript/TypeScript i CSHTML/HTML</strong> oraz niezbędnych interfejsów. ABP Suite generuje również kod zgodnie z <strong>najlepszymi praktykami</strong> tworzenia oprogramowania, więc nie musisz się martwić o jakość wygenerowanego kodu.",
    "AbpSuiteExplanation7": "Ponieważ masz kod źródłowy bloków konstrukcyjnych wygenerowanej strony CRUD w poprawnych warstwach aplikacji, możesz łatwo modyfikować kod źródłowy i wstrzykiwać własną/biznesową logikę do wygenerowanego kodu.",
    "CrossPlatform": "Platforma międzyplatformowa",
    "AbpSuiteExplanation8": "ABP Suite jest zbudowany z .NET Core i jest wieloplatformowy. Działa jako aplikacja internetowa na komputerze lokalnym. Możesz go uruchomić na <strong>Windows</strong>, <strong>Mac</strong> i <strong>Linux</strong>",
    "OtherFeatures": "Inne funkcje",
    "OtherFeatures1": "Łatwo aktualizuje pakiety <strong>NuGet</strong> i <strong>NPM</strong> w Twoim rozwiązaniu.",
    "OtherFeatures2": "Regeneruje już wygenerowane strony od podstaw.",
    "OtherFeatures3": "Tworzy nowe rozwiązania",
    "ThanksForCreatingProject": "Dziękujemy za stworzenie projektu!",
    "HotToRunSolution": "Jak uruchomić swoje rozwiązanie?",
    "HotToRunSolutionExplanation": "Zobacz dokument wprowadzający, aby dowiedzieć się, jak skonfigurować i uruchomić swoje rozwiązanie.",
    "GettingStarted": "Pierwsze kroki",
    "WebAppDevTutorial": "Samouczek dla programistów aplikacji internetowych",
    "WebAppDevTutorialExplanation": "Zobacz samouczek dotyczący tworzenia aplikacji internetowych, aby zapoznać się z przykładem programowania krok po kroku.",
    "Document": "Dokument",
    "UsingABPSuiteToCURD": "Korzystanie z ABP Suite do generowania stron i narzędzi CRUD",
    "SeeABPSuiteDocument": "Zobacz dokument ABP Suite, aby dowiedzieć się, jak korzystać z ABP Suite.",
    "AskQuestionsOnSupport": "Możesz zadawać pytania dotyczące wsparcia komercyjnego ABP.",
    "Documentation": "Dokumentacja",
    "SeeModulesDocument": "Zobacz dokument dotyczący modułów, aby zobaczyć listę wszystkich komercyjnych (pro) modułów i ich dokumentów.",
    "Pricing": "cennik",
    "PricingExplanation": "Wybierz funkcje i funkcje, których potrzebuje Twoja firma. Łatwa rozbudowa wraz z rozwojem firmy.",
    "Team": "Zespół",
    "Business": "Biznes",
    "Enterprise": "Przedsiębiorstwo",
    "Custom": "Zwyczaj",
    "IncludedDeveloperLicenses": "Dołączone licencje programistyczne",
    "CustomLicenceOrAdditionalServices": "Potrzebujesz niestandardowej licencji lub dodatkowych usług?",
    "CustomOrVolumeLicense": "Licencja niestandardowa lub zbiorcza",
    "LiveTrainingSupport": "Szkolenie na żywo i wsparcie",
    "AndMore": "i więcej",
    "AdditionalDeveloperLicense": "Dodatkowa licencja programisty",
    "ProjectCount": "Liczba projektów",
    "AllProModules": "Wszystkie moduły pro",
    "AllProThemes": "Wszystkie motywy pro",
    "AllProStartupTemplates": "Wszystkie profesjonalne szablony startowe",
    "SourceCodeOfAllModules": "Kod źródłowy wszystkich modułów",
    "SourceCodeOfAllThemes": "Kod źródłowy wszystkich motywów",
    "PerpetualLicense": "Dożywotnia licencja",
    "UnlimitedServerDeployment": "Nieograniczone wdrażanie serwerów",
    "YearUpgrade": "1 rok aktualizacji",
    "YearPremiumForumSupport": "Roczne wsparcie forum premium",
    "ForumSupportIncidentCountYear": "Liczba incydentów wsparcia forum/rok",
    "PrivateTicketEmailSupport": "Prywatny bilet i wsparcie e-mail",
    "BuyNow": "Kup Teraz",
    "PayViaAmexCard": "Jak mogę zapłacić kartą AMEX?",
    "PayViaAmexCardDescription": "Domyślna bramka płatnicza „Iyzico” może odrzucić niektóre karty kredytowe AMEX ze względu na środki bezpieczeństwa. W takim przypadku możesz zapłacić za pośrednictwem alternatywnej bramki płatniczej „2Checkout”.",
    "ThankYou": "Dziękuję Ci",
    "InvalidReCaptchaErrorMessage": "Wystąpił błąd podczas weryfikacji reCAPTCHA. Proszę spróbuj ponownie.",
    "CompanyName": "Nazwa firmy",
    "YourCompanyName": "Nazwa Twojej firmy",
    "FirstName": "Imię",
    "LastName": "Nazwisko",
    "Optional": "Opcjonalny",
    "YourFirstName": "Twoje imię",
    "YourLastName": "Twoje nazwisko",
    "SpecialOffer": "Oferta specjalna",
    "SpecialOfferMessage": "Pośpiesz się! Ceny obowiązują przez ograniczony czas.",
    "DiscountRequest": "Prośba o zniżkę",
    "DiscountRequestDescribeCustomerQuestion": "Która z poniższych odpowiedzi Cię opisuje?",
    "DiscountRequestStudentEmailMessage": "Adres e-mail musi zawierać „edu”.",
    "DiscountRequestDeveloperCount": "Ilu programistów jesteś?",
    "DiscountRequestDeveloperCountExceedMessage": "Nie oferujemy licencji ze zniżką dla firm, które mają ponad {0} programistów.",
    "DiscountRequestOrganizationName": "Nazwa firmy/organizacji/szkoły",
    "Website": "Strona internetowa",
    "GithubUsername": "Nazwa użytkownika GitHub",
    "PhoneNumber": "Numer telefonu",
    "Country": "Kraj",
    "DescribeABPCommercialUsage": "Opisz projekt, który planujesz rozwijać w oparciu o APB Commercial",
    "DiscountRequestCertifyInformationMessage": "Oświadczam, że wszystkie informacje są prawdziwe i poprawne.",
    "DiscountRequestReceived": "Otrzymaliśmy Twoją prośbę o zniżkę.",
    "DiscountRequestStatusMessage": "Odpowiemy Ci po sprawdzeniu podanych przez Ciebie informacji.",
    "MVCOrRazorPages": "MVC (Strony brzytwy)",
    "Angular": "Kątowy",
    "Blazor": "Blazor",
    "New": "Nowy",
    "MongoDB": "MongoDB",
    "EBookDDD": "Projekt oparty na domenie e-booków",
    "PracticalGuideForImplementingDDD": "Ta książka jest praktycznym przewodnikiem wdrażania projektowania opartego na domenie za pomocą ABP Framework.",
    "IntroducingDDD": "Przedstawiamy projektowanie oparte na domenie",
    "DDDLayersAndCleanArchitecture": "Warstwy DDD i czysta architektura",
    "LayeringOfADotnetSolution": "Nakładanie warstw rozwiązania .NET",
    "ImplementingDDDBuildingBlocks": "Wdrażanie bloków konstrukcyjnych DDD",
    "DomainVsApplicationLogic": "Logika domeny a logika aplikacji",
    "SamplesAndDiscussions": "Próbki i dyskusje",
    "Free": "Darmowy",
    "Download": "Pobierać",
    "DDDEBook": "E-book DDD",
    "ImplementingDDD": "Wdrażanie projektowania opartego na domenie",
    "DDDBookExplanation": "Praktyczny przewodnik dotyczący wdrażania projektu opartego na domenie za pomocą ABP Framework.",
    "Overview": "Przegląd",
    "DDDBookPracticalGuide": "To jest praktyczny przewodnik dotyczący wdrażania projektu opartego na domenie (DDD). Chociaż szczegóły implementacji opierają się na infrastrukturze ABP Framework, podstawowe koncepcje, zasady i wzorce mają zastosowanie w każdym rozwiązaniu, nawet jeśli nie jest to rozwiązanie .NET.",
    "TableOfContents": "Spis treści",
    "IntroductionToImplementingDDD": "Wprowadzenie do wdrażania projektowania opartego na domenie",
    "WhatIsDDD": "Co to jest projektowanie oparte na domenie?",
    "Implementation": "Realizacja",
    "TheBigPicture": "Wielkie zdjęcie",
    "TheBuildingBlock": "Blok konstrukcyjny",
    "ExampleUseCase": "Przykładowy przypadek użycia",
    "DomainAndApplicationLogic": "Logika domeny i logika aplikacji",
    "Author": "Autor",
    "PublishedOn": "Opublikowano dnia",
    "Page": "Strona",
    "FreeEBook": "Bezpłatny e-book",
    "EBookSignInForDownload": "Aby pobrać e-booka, zaloguj się",
    "SignIn": "Zaloguj",
    "Or": "Lub",
    "TellUsAboutYourself": "Opowiedz nam trochę o sobie",
    "Surname": "Nazwisko",
    "DoYouAgreePrivacyPolicy": "Akceptuję <a href=\"/TermsConditions\">Warunki korzystania z usługi<a/> i <a href=\"/Privacy\">Politykę prywatności</a>.",
    "VolosoftMarketingInformationMessage": "Chcę uzyskać informacje, wskazówki i oferty dotyczące rozwiązań dla firm i organizacji oraz innych produktów i usług Volosoft.",
    "VolosoftSharingInformationMessage": "Chciałbym, aby firma Volosoft udostępniała moje informacje wybranym partnerom, abym mogła otrzymywać istotne informacje o ich produktach i usługach.",
    "WeWillSendYouADownloadLink": "Link do pobrania e-booka został wysłany na {0}.<br/> Sprawdź skrzynkę odbiorczą/śmieci/spam!",
    "InvalidFormInputs": "Proszę wpisać prawidłowe informacje podane w formularzu.",
    "DDDBookEmailBody": "Dziękuję Ci. <br /> Aby pobrać książkę, <a href=\"{0}\">kliknij tutaj</a>.",
    "FreeDDDEBook": "Bezpłatny e-book DDD",
    "StartFree": "Zacznij bezpłatnie",
    "FreeTrial": "Bezpłatna wersja próbna",
    "AcceptsMarketingCommunications": " Tak, chcę otrzymywać komunikaty marketingowe ABP Commercial.",
    "PurposeOfUsage": "Cel użycia",
    "Industry": "Przemysł",
    "Choose": "- Wybierać -",
    "CompanyOrganizationName": "Nazwa firmy/organizacji",
    "CompanySize": "Wielkość spółki",
    "Next": "Następny",
    "StartTrial": "Rozpocznij mój bezpłatny okres próbny",
    "ContactUsIssues": "Skontaktuj się z nami, jeśli masz jakiekolwiek problemy",
    "TrialActivatedWarning": "Drogi {0}, użytkownik może mieć tylko 1 bezpłatny okres próbny. Korzystałeś już z okresu próbnego.",
    "ActivationRequirement": "Jesteś o krok od rozpoczęcia bezpłatnego okresu próbnego.<br>Wysłaliśmy wiadomość e-mail na adres <b>{0}</b>, aby aktywować Twoje konto. Sprawdź swoją skrzynkę odbiorczą/śmieci/spam!",
    "SaveAndDownload": "Zapisz i pobierz",
    "CompanyNameValidationMessage": "Nazwa firmy jest za długa!",
    "AddressValidationMessage": "Adres jest za długi!",
    "TaxNoValidationMessage": "Numer podatku/VAT jest za długi!",
    "NotesValidationMessage": "Pole notatek jest za długie!",
    "CheckYourBillingInfo": "Fakturę możesz utworzyć tylko raz! Sprawdź informacje rozliczeniowe przed utworzeniem faktury.",
    "Volo.AbpIo.Commercial:030000": "Korzystałeś już z okresu próbnego.",
    "Volo.AbpIo.Commercial:030001": "Ta nazwa organizacji już istnieje.",
    "StartYourFreeTrial": "Rozpocznij darmowy okres próbny",
    "TrialLicenseModelInvalidErrorMessage": "Jedno z następujących pól jest nieprawidłowe: nazwa kraju, wielkość firmy, branża lub cel użytkowania.",
    "Trial": "Test",
    "Purchased": "Zakupione",
    "PurchaseLicense": "Licencja kupna",
    "PurchaseTrialLicenseMessage": "Data wygaśnięcia Twojej licencji to {0}. <br> Jeśli chcesz nadal korzystać z projektów utworzonych podczas bezpłatnego okresu próbnego, musisz zmienić klucze licencyjne w plikach <code>appsettings.secrets.json</code>. Oto twój klucz licencyjny:",
    "TrialLicenseExpireMessage": "Korzystasz z licencji próbnej, a Twoja licencja próbna wygaśnie w dniu {0}.",
    "TryForFree": "Wypróbuj za darmo",
    "TrialLicenseExpiredInfo": "Twoja licencja próbna wygasła!",
    "CommercialNewsletterConfirmationMessage": "Wyrażam zgodę na <a href=\"https://commercial.abp.io/TermsConditions\">Warunki</a> i <a href=\"https://commercial.abp.io/Privacy\">Politykę prywatności </a>."
  }
}