{
  "culture": "pl-PL",
  "texts": {
    "OrganizationManagement": "Zarządzanie organizacją",
    "OrganizationList": "Lista organizacji",
    "Volo.AbpIo.Commercial:010003": "Nie jesteś właścicielem tej organizacji!",
    "OrganizationNotFoundMessage": "Nie znaleziono organizacji!",
    "DeveloperCount": "Programiści przydzieleni/ogółem",
    "QuestionCount": "Pozostałe/wszystkie pytania",
    "Unlimited": "Nieograniczony",
    "Owners": "Właściciele",
    "Owner": "Właściciel",
    "AddMember": "Dodaj członka",
    "AddNewOwner": "Dodaj nowego właściciela",
    "AddNewDeveloper": "Dodaj nowego programistę",
    "UserName": "Nazwa użytkownika",
    "Name": "Nazwa",
    "EmailAddress": "Adres e-mail",
    "Developers": "Deweloperzy",
    "LicenseType": "Rodzaj licencji",
    "Manage": "Zarządzać",
    "SetDefault": "Ustaw jako domyślne",
    "DefaultOrganization": "Domyślny",
    "StartDate": "Data rozpoczęcia",
    "EndDate": "Data końcowa",
    "Modules": "Moduły",
    "LicenseExtendMessage": "Data zakończenia Twojej licencji została przedłużona do {0}",
    "LicenseUpgradeMessage": "Twoja licencja została uaktualniona do {0}",
    "LicenseExtendAdnUpgradeMessage": "Twoja licencja została przedłużona do {0}, a plan licencji został uaktualniony do {1}.",
    "LicenseAddDeveloperMessage": "{0} programistów dodanych do Twojej licencji",
    "Volo.AbpIo.Commercial:010004": "Nie można znaleźć podanego użytkownika! Użytkownik musi być już zarejestrowany.",
    "MyOrganizations": "Moje organizacje",
    "ApiKey": "Klucz API",
    "UserNameNotFound": "Brak użytkownika o nazwie użytkownika {0}",
    "SuccessfullyAddedToNewsletter": "Dziękujemy za zapisanie się do naszego newslettera!",
    "MyProfile": "Mój profil",
    "EmailNotValid": "Proszę wpisać aktualny adres e-mail.",
    "JoinOurMarketingNewsletter": "Dołącz do naszego newslettera marketingowego",
    "WouldLikeToReceiveMarketingMaterials": "Chcę otrzymywać materiały marketingowe, takie jak oferty produktów i oferty specjalne.",
    "StartUsingYourLicenseNow": "Zacznij korzystać z licencji już teraz!",
    "WelcomePage": "Strona powitalna",
    "UnsubscriptionExpireEmail": "Anuluj subskrypcję e-maili z przypomnieniem o dacie wygaśnięcia licencji",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Ta subskrypcja e-mail zawiera tylko przypomnienie o dacie wygaśnięcia licencji.",
    "UnsubscribeFromLicenseExpireEmails": "Jeśli nie chcesz otrzymywać wiadomości e-mail o dacie wygaśnięcia licencji, możesz zrezygnować z subskrypcji w dowolnym momencie.",
    "Unsubscribe": "Anuluj subskrypcję",
    "NotOrganizationMember": "Nie jesteś członkiem żadnej organizacji.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Pomyślnie anulowano subskrypcję",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Nie będziesz już otrzymywać wiadomości e-mail z przypomnieniem o dacie wygaśnięcia licencji.",
    "IndexPageHeroSection": "<span class=\"first-line\">A complete</span><span class=\"second-line\"> web development platform</span><span class=\"third-line\">built-on <img src=\"{0}\" width=\"110\" class=\"ml-1\" /> framework</span>",
    "AbpCommercialShortDescription": "ABP Commercial zapewnia gotowe moduły aplikacji, narzędzia do szybkiego tworzenia aplikacji, profesjonalne motywy interfejsu użytkownika, wsparcie premium i nie tylko.",
    "LiveDemo": "Demo na żywo",
    "LiveDemoLead": "<a href=\"{0}\">{1}</a> korzystając z konta ABP, <a href=\"{2}\">{3}</a> to abp.io.<br/>Lub wypełnij poniższy formularz, aby utworzyć teraz demo na żywo",
    "ThereIsAlreadyAnAccountWithTheGivenEmailAddress": "Istnieje już konto o podanym adresie e-mail: <b>{0}</b><br/> Możesz się zalogować na swoje konto, aby kontynuować.",
    "GetLicence": "Uzyskaj licencję",
    "Application": "Podanie",
    "StartupTemplates": "Szablony startowe",
    "Startup": "Uruchomienie",
    "Templates": "Szablony",
    "Developer": "Deweloper",
    "Tools": "Narzędzia",
    "Premium": "Premia",
    "PremiumSupport": "Wsparcie Premium",
    "PremiumForumSupport": "Wsparcie forum Premium",
    "UI": "interfejs użytkownika",
    "Themes": "Motywy",
    "JoinOurNewsletter": "Dołącz do naszego newslettera",
    "Send": "Wysłać",
    "WhatIsABPFramework": "CO TO JEST RAMA ABP?",
    "OpenSourceBaseFramework": "Podstawowa platforma open source",
    "ABPFrameworkExplanation": "<p class=\"lead\">ABP Commercial jest oparty na ABP Framework, platformie aplikacji internetowych typu open source i opartej na społeczności dla ASP.NET Core.</p><p>ABP Framework zapewnia doskonałą infrastrukturę do pisania, którą można konserwować i rozszerzać i testowalny kod z najlepszymi praktykami.</p><p>Wbudowany i zintegrowany z popularnymi narzędziami, które już znasz. Niska krzywa uczenia się, łatwa adaptacja, komfortowy rozwój.</p>",
    "Modular": "Modułowy",
    "MicroserviceCompatible": "Kompatybilny z mikroserwisami",
    "DomainDrivenDesignInfrastructure": "Infrastruktura projektowa oparta na domenie",
    "MultiTenancy": "Wielu najemców",
    "DistributedMessaging": "Wiadomości rozproszone",
    "DynamicProxying": "Dynamiczne proxy",
    "BackgroundJobs": "Praca w tle",
    "AuditLogging": "Rejestrowanie audytów",
    "BLOBStoring": "Przechowywanie BLOB",
    "BundlingMinification": "Grupowanie i minifikacja",
    "AdvancedLocalization": "Zaawansowana lokalizacja",
    "ManyMore": "Wiele więcej",
    "ExploreTheABPFramework": "Poznaj ramy ABP",
    "WhyUseTheABPCommercial": "Dlaczego warto korzystać z reklamy ABP?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\">Tworzenie aplikacji internetowych klasy korporacyjnej może być złożone i czasochłonne.</p><p>ABP Commercial oferuje idealną infrastrukturę podstawową niezbędną dla wszystkich nowoczesnych ASP.NET Core klasy korporacyjnej oparte na rozwiązaniach. Od projektu do wdrożenia cały cykl rozwoju jest wspierany przez wbudowane funkcje i moduły ABP.</p>",
    "StartupTemplatesShortDescription": "Szablony startowe pozwalają błyskawicznie rozpocząć projekt w kilka sekund.",
    "UIFrameworksOptions": "opcje ram interfejsu użytkownika;",
    "DatabaseProviderOptions": "Opcje dostawcy bazy danych;",
    "PreBuiltApplicationModules": "Gotowe moduły aplikacji",
    "PreBuiltApplicationModulesShortDescription": "Większość typowych wymagań dotyczących aplikacji została już opracowana dla Ciebie jako moduły wielokrotnego użytku.",
    "Account": "Konto",
    "Blogging": "Blogowanie",
    "Identity": "Tożsamość",
    "IdentityServer": "Serwer tożsamości",
    "Saas": "Saas",
    "LanguageManagement": "Zarządzanie językiem",
    "TextTemplateManagement": "Zarządzanie szablonami tekstu",
    "See All Modules": "Zobacz wszystkie moduły",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "ABP Suite jest narzędziem uzupełniającym do ABP Commercial.",
    "AbpSuiteExplanation": "Umożliwia tworzenie stron internetowych w ciągu kilku minut. Jest to narzędzie .NET Core Global, które można zainstalować z wiersza poleceń. Może tworzyć nowe rozwiązanie ABP, generować strony CRUD z bazy danych do front-endu.",
    "Details": "Detale",
    "LeptonTheme": "Motyw Lepton",
    "ProfessionalModernUIThemes": "Profesjonalne, nowoczesne motywy interfejsu użytkownika",
    "LeptonThemeExplanation": "Lepton zapewnia gamę motywów administracyjnych Bootstrap, które służą jako solidna podstawa dla każdego projektu wymagającego pulpitu administracyjnego.",
    "DefaultTheme": "Domyślny motyw",
    "MaterialTheme": "Motyw materiału",
    "Default2Theme": "Domyślny motyw 2",
    "DarkTheme": "Ciemny schemat",
    "DarkBlueTheme": "Ciemnoniebieski motyw",
    "LightTheme": "Jasny motyw",
    "ProudToWorkWith": "Dumni ze współpracy",
    "OurConsumers": "Tysiące przedsiębiorstw i deweloperów w ponad 70 krajach na całym świecie polega na ABP Commercial.",
    "JoinOurConsumers": "Dołącz do nich i szybko buduj niesamowite produkty.",
    "AdditionalServicesExplanation": "Potrzebujesz usług dodatkowych lub niestandardowych? <strong>My i nasi partnerzy możemy zapewnić;</strong>",
    "CustomProjectDevelopment": "Rozwój projektów niestandardowych",
    "CustomProjectDevelopmentExplanation": "Dedykowani programiści do Twoich niestandardowych projektów.",
    "PortingExistingProjects": "Przenoszenie istniejących projektów",
    "PortingExistingProjectsExplanation": "Migracja dotychczasowych projektów na platformę ABP.",
    "LiveSupport": "Wsparcie na żywo",
    "LiveSupportExplanation": "Opcja zdalnej pomocy na żywo, kiedy jej potrzebujesz.",
    "Training": "Szkolenie",
    "TrainingExplanation": "Dedykowane szkolenie dla Twoich programistów.",
    "OnBoarding": "Proces wdrażania do firmy nowego pracownika",
    "OnBoardingExplanation": "Pomoc w konfiguracji środowisk programistycznych, CI i CD.",
    "PrioritizedTechnicalSupport": "Priorytetowe wsparcie techniczne",
    "PremiumSupportExplanation": "Poza wspaniałym wsparciem społeczności ABP, nasz zespół wsparcia odpowiada na pytania techniczne i problemy użytkowników komercyjnych o wysokim priorytecie.",
    "SeeTheSupportOptions": "Zobacz opcje pomocy technicznej",
    "Contact": "Kontakt",
    "TellUsWhatYouNeed": "Powiedz nam, czego potrzebujesz.",
    "YourMessage": "Twoja wiadomość",
    "YourFullName": "Twoje pełne imię",
    "FirstNameField": "Imię",
    "LastNameField": "Nazwisko",
    "EmailField": "Adres e-mail",
    "YourEmailAddress": "Twój adres email",
    "ValidEmailAddressIsRequired": "Wymagany jest prawidłowy adres e-mail.",
    "HowMayWeHelpYou": "Jak możemy Ci pomóc?",
    "SendMessage": "Wyślij wiadomość",
    "Success": "Powodzenie",
    "WeWillReplyYou": "Otrzymaliśmy Twoją wiadomość i wkrótce się z Tobą skontaktujemy.",
    "GoHome": "Idź do domu",
    "CreateLiveDemo": "Utwórz demo na żywo",
    "CreateLiveDemoDescription": "Po wysłaniu tego formularza otrzymasz e-mail z linkiem do swojego demo.",
    "RegisterToTheNewsletter": "Zarejestruj się do newslettera, aby otrzymywać informacje dotyczące ABP.IO, w tym nowości itp.",
    "EnterYourEmailOrLogin": "Wprowadź swój adres e-mail, aby utworzyć demo lub <a href=\"{0}\">Zaloguj się</a> przy użyciu istniejącego konta.",
    "ApplicationTemplate": "Szablon aplikacji",
    "ApplicationTemplateExplanation": "Szablon startowy aplikacji służy do tworzenia nowej aplikacji internetowej.",
    "EfCoreProvider": "Entity Framework (obsługuje SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\">i inne</a>)",
    "AlreadyIncludedInTemplateModules": "W tym szablonie są już uwzględnione i skonfigurowane następujące moduły:",
    "ApplicationTemplateArchitecture": "Ten szablon aplikacji obsługuje również architekturę warstwową, w której warstwa interfejsu użytkownika, warstwa interfejsu API i usługa uwierzytelniania są fizycznie oddzielone.",
    "SeeTheGuideOrGoToTheLiveDemo": "Zapoznaj się z przewodnikiem dla programistów, aby uzyskać informacje techniczne o tym szablonie lub przejdź do demonstracji na żywo.",
    "DeveloperGuide": "Przewodnik dla programistów",
    "ModuleTemplate": "Szablon modułu",
    "ModuleTemplateExplanation1": "Chcesz stworzyć moduł i używać go ponownie w różnych aplikacjach? Ten szablon startowy przygotowuje wszystko do rozpoczęcia tworzenia <strong>modułu aplikacji</strong> wielokrotnego użytku lub <strong>mikroserwisu</strong>.",
    "ModuleTemplateExplanation2": "<p>Możesz obsługiwać jeden lub wiele struktur interfejsu użytkownika, jednego lub wielu dostawców baz danych dla jednego modułu. Szablon startowy jest skonfigurowany do uruchamiania i <strong>testowania Twojego modułu</strong> w minimalnej aplikacji oprócz infrastruktury testów jednostkowych i integracyjnych. </p> <p>Zapoznaj się z przewodnikiem programisty, aby uzyskać informacje techniczne na temat tego szablonu.</p>",
    "WithAllStyleOptions": "ze wszystkimi opcjami stylu",
    "Demo": "Próbny",
    "SeeAllModules": "Zobacz wszystkie moduły",
    "ABPCLIExplanation": "ABP CLI (Interfejs wiersza poleceń) to narzędzie wiersza poleceń do wykonywania niektórych typowych operacji dla rozwiązań opartych na ABP.",
    "ABPSuiteEasilyCURD": "ABP Suite to narzędzie, które pozwala łatwo tworzyć strony CRUD",
    "WeAreHereToHelp": "Jesteśmy tutaj, aby <span class=\"zero-text\">pomoc</span>",
    "BrowseOrAskQuestion": "Możesz przeglądać nasze tematy pomocy lub przeszukiwać często zadawane pytania albo możesz zadać nam pytanie, korzystając z <a href=\"{0}\" class=\"text-success\">formularza kontaktowego</a>.",
    "SearchQuestionPlaceholder": "Szukaj w często zadawanych pytaniach",
    "WhatIsTheABPCommercial": "Co to jest reklama ABP?",
    "WhatAreDifferencesThanAbpFramework": "Jakie są różnice między Open Source ABP Framework a ABP Commercial?",
    "AbpCommercialMetaTitle": "{0} | Reklama ABP",
    "AbpCommercialMetaDescription": "Kompleksowa platforma do tworzenia stron internetowych oparta na ABP Framework z gotowymi modułami, szablonami startowymi, narzędziami szybkiego programowania, profesjonalnymi motywami interfejsu użytkownika i wsparciem premium.",
    "ABPCommercialExplanation": "ABP Commercial to zestaw modułów, narzędzi, motywów i usług premium zbudowanych na bazie <a target=\"_blank\" href=\"{0}\">szkieletu ABP</a> o otwartym kodzie źródłowym. ABP Commercial jest rozwijany i wspierany przez ten sam zespół odpowiedzialny za framework ABP.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\">Struktura ABP</a> to modułowa, oparta na motywach, zgodna z mikrousługami platforma do tworzenia aplikacji dla ASP.NET Core. Zapewnia kompletną architekturę i silną infrastrukturę, dzięki czemu możesz skupić się na własnym kodzie biznesowym, zamiast powtarzać się przy każdym nowym projekcie. Opiera się na najlepszych praktykach tworzenia oprogramowania i popularnych narzędziach, które już znasz. </p> <p> Framework ABP jest całkowicie darmowy, open source i oparty na społeczności. Zapewnia również darmowy motyw i kilka gotowych modułów (np. Zarządzanie tożsamością i zarządzanie najemcami).</p>",
    "VisitTheFrameworkVSCommercialDocument": "Odwiedź poniższy link, aby uzyskać więcej informacji <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial dodaje następujące korzyści do ram ABP;",
    "Professional": "Profesjonalny",
    "UIThemes": "Motywy interfejsu użytkownika",
    "EnterpriseModules": "Gotowe dla przedsiębiorstw, bogate w funkcje, wstępnie wbudowane <a href=\"{0}\">moduły aplikacji</a> (np. zarządzanie serwerem tożsamości, zarządzanie SaaS, zarządzanie językiem)",
    "ToolingToSupport": "Narzędzia wspierające Twoją produktywność programistyczną (np. <a href=\"{0}\">ABP Suite</a>)",
    "PremiumSupportLink": "<a href=\"{0}\" target=\"_blank\">wsparcie premium</a>",
    "WhatDoIDownloadABPCommercial": "Co mogę pobrać, kupując reklamę ABP?",
    "CreateUnlimitedSolutions": "Po zakupie licencji komercyjnej ABP będziesz mógł tworzyć nieograniczone rozwiązania, jak opisano w dokumencie <a href=\"{0}\">Pierwsze kroki</a>.",
    "ABPCommercialSolutionExplanation": "Podczas tworzenia nowej aplikacji otrzymujesz rozwiązanie Visual Studio (szablon startowy) na podstawie Twoich preferencji. Pobrane rozwiązanie zawiera już zainstalowane i skonfigurowane komercyjne moduły i motywy. Możesz usunąć wstępnie zainstalowany moduł lub dodać inny moduł, jeśli chcesz. Wszystkie moduły i motywy są domyślnie używane jako pakiety NuGet/NPM.",
    "StartDevelopWithTutorials": "Pobrane rozwiązanie jest dobrze zaprojektowane i udokumentowane. Możesz zacząć tworzyć własny kod biznesowy na jego podstawie, postępując zgodnie z <a href=\"{0}\">samouczkami</a>",
    "TryTheCommercialDemo": "Możesz wypróbować <a href=\"{0}\">demo</a>, aby zobaczyć przykładową aplikację utworzoną przy użyciu szablonu startowego ABP Commercial.",
    "HowManyProducts": "Ile różnych produktów/rozwiązań mogę zbudować za pomocą ABP Commercial?",
    "HowManyProductsExplanation": "Nie ma ograniczeń co do tworzenia projektu ABP. Możesz stworzyć tyle projektów, ile chcesz, rozwijać i przesyłać je na różne serwery.",
    "HowManyDevelopers": "Ilu programistów może pracować nad reklamą ABP?",
    "HowManyDevelopersExplanation": "Licencje komercyjne ABP dotyczą jednego dewelopera. Różne typy licencji mają różne ograniczenia programistyczne. Możesz jednak dodać więcej programistów do dowolnego typu licencji, kiedy tylko zajdzie taka potrzeba. Zobacz stronę <a href=\"{0}\">ceny</a>, aby poznać typy licencji, limity programistów i dodatkowe koszty programistów.",
    "ChangingLicenseType": "Czy mogę uaktualnić swój typ licencji później?",
    "ChangingLicenseTypeExplanation": "Możesz uaktualnić do wyższej licencji, płacąc różnicę w okresie aktywnej licencji. Po uaktualnieniu do wyższego planu licencji uzyskujesz korzyści z nowego planu, ale uaktualnienie licencji nie zmienia daty wygaśnięcia licencji. Poza tym możesz również dodać nowe stanowiska programisty do istniejącej licencji, zobacz „Ilu programistów może pracować nad komercyjnym ABP?”",
    "LicenseExtendUpgradeDiff": "Jaka jest różnica między rozszerzeniem licencji a aktualizacją?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Przedłużenie:</strong> przedłużając/odnawiając licencję, będziesz nadal otrzymywać wsparcie premium i otrzymywać większe lub mniejsze aktualizacje modułów i motywów. Poza tym będziesz mógł kontynuować tworzenie nowych projektów. A Ty nadal będziesz mógł korzystać z pakietu ABP Suite, który przyspiesza Twój rozwój. W przypadku przedłużenia licencji do daty wygaśnięcia licencji dodawany jest 1 rok.<hr/> <strong>Aktualizacja:</strong> Aktualizując licencję, zostaniesz awansowany na wyższy plan licencyjny, który pozwoli Ci uzyskać dodatkowe korzyści. Sprawdź <a href=\"/pricing\">tabelę porównawczą licencji</a> , aby zobaczyć różnice pomiędzy planami licencyjnymi. <strong>Z drugiej strony, kiedy dokonasz aktualizacji, data wygaśnięcia Twojej licencji nie ulegnie zmianie!</strong> Aby przedłużyć datę końcową licencji, musisz przedłużyć licencję.",
    "LicenseRenewalCost": "Jaki jest koszt odnowienia licencji po 1 roku?",
    "LicenseRenewalCostExplanation": "Cena odnowienia (przedłużenia) standardowej licencji zespołowej to {0}$, standardowej licencji biznesowej to {1}$, a standardowej licencji Enterprise to {2}$. Jeśli jesteś już klientem, <a href='{3}' target='_blank'>zaloguj się na swoje konto</a>, aby sprawdzić dostępne ceny odnowienia.",
    "HowDoIRenewMyLicense": "Jak odnowić licencję?",
    "HowDoIRenewMyLicenseExplanation": "Możesz odnowić licencję, przechodząc na <a href='{0}' target='_blank'>stronę zarządzania organizacją</a>. Aby skorzystać z naszych obniżonych stawek za wcześniejsze odnowienie, pamiętaj o odnowieniu przed wygaśnięciem licencji. Nie martw się jednak, że nie wiesz, kiedy kończy się Twoja szansa na wczesne odnowienie. Otrzymasz 3 e-maile z przypomnieniem przed wygaśnięciem subskrypcji. Wyślemy je na 30 dni, 7 dni i 1 dzień przed wygaśnięciem.",
    "IsSourceCodeIncluded": "Czy moja licencja zawiera kod źródłowy modułów i motywów komercyjnych?",
    "IsSourceCodeIncludedExplanation1": "Zależy od typu zakupionej licencji:",
    "IsSourceCodeIncludedExplanation2": "<strong>Zespół</strong>: Twoje rozwiązanie używa modułów i motywów jako pakietów NuGet i NPM. Nie zawiera ich kodu źródłowego. W ten sposób możesz łatwo aktualizować te moduły i motywy, gdy tylko dostępna jest nowa wersja. Nie możesz jednak uzyskać kodu źródłowego modułów i motywów.",
    "IsSourceCodeIncludedExplanation3": "<strong>Business/Enterprise</strong>: oprócz licencji zespołowej możesz pobrać kod źródłowy dowolnego modułu lub motywu, którego potrzebujesz. Możesz nawet usunąć odwołania do pakietu NuGet/NPM dla określonego modułu i dodać jego kod źródłowy bezpośrednio do rozwiązania, aby w pełni go zmienić.",
    "IsSourceCodeIncludedExplanation4": "<p>Dołączenie kodu źródłowego modułu do rozwiązania zapewnia maksymalną swobodę dostosowywania tego modułu. Jednak wtedy nie będzie możliwe automatyczne uaktualnienie modułu po wydaniu nowej wersji.</p><p>Żadna z licencji nie zawiera kodu źródłowego ABP Suite, który jest zewnętrznym narzędziem, które generuje kod dla Ciebie i pomaga do swojego rozwoju.</p><p>Zobacz <a href=\"{0}\">stronę cen</a>, aby poznać inne różnice między typami licencji.</p>",
    "ChangingDevelopers": "Czy mogę w przyszłości zmienić zarejestrowanych programistów mojej organizacji?",
    "ChangingDevelopersExplanation": "Oprócz dodawania nowych programistów do swojej licencji możesz również zmieniać istniejących programistów (możesz usunąć programistę i dodać nowego do tego samego stanowiska) bez żadnych dodatkowych kosztów.",
    "WhatHappensWhenLicenseEnds": "Co się stanie, gdy zakończy się okres mojej licencji?",
    "WhatHappensWhenLicenseEndsExplanation1": "Licencja komercyjna ABP jest <a href=\"{0}\" target=\"_blank\">licencją wieczystą</a> . Po wygaśnięciu licencji możesz kontynuować rozwój swojego projektu. Nie masz też obowiązku odnawiania licencji. Twoja licencja jest dostarczana z rocznym planem aktualizacji i wsparcia. Aby nadal otrzymywać nowe funkcje, ulepszenia wydajności, poprawki błędów, wsparcie i kontynuować korzystanie z pakietu ABP Suite, musisz odnowić swoją licencję. Kiedy Twoja licencja wygaśnie;",
    "WhatHappensWhenLicenseEndsExplanation2": "Nie możesz tworzyć nowych rozwiązań za pomocą ABP Commercial, ale możesz w nieskończoność rozwijać swoje istniejące aplikacje.",
    "WhatHappensWhenLicenseEndsExplanation3": "Będziesz mógł uzyskać aktualizacje modułów i motywów w swojej wersji MINOR (z wyjątkiem wersji RC lub Preview). Na przykład, jeśli używasz wersji 3.2.0 modułu, nadal możesz uzyskać aktualizacje wersji 3.2.x (v3.2.1, v3.2.5... itd.) tego modułu. Nie można jednak uzyskać aktualizacji dla następnej wersji głównej lub pomocniczej (np. v3.3.0, v3.3.3, 4.xx. itd.). Na przykład, gdy Twoja licencja wygasła, najnowszą wersją była wersja 4.4.3, a później opublikowano zarówno wersję 4.4.4, jak i wersję 4.5.0, będziesz mógł uzyskać dostęp do wersji 4.4.X, ale nie będziesz uzyskaj dostęp do wersji 4.5.X.",
    "WhatHappensWhenLicenseEndsExplanation4": "Po wygaśnięciu licencji nie można instalować nowych modułów i motywów dodanych do platformy ABP Commercial.",
    "WhatHappensWhenLicenseEndsExplanation5": "Nie możesz korzystać z pakietu ABP.",
    "WhatHappensWhenLicenseEndsExplanation6": "Nie możesz już uzyskać <a href=\"{0}\">wsparcia premium</a> .",
    "WhatHappensWhenLicenseEndsExplanation7": "Możesz przedłużyć (odnowić) swoją licencję, jeśli chcesz nadal korzystać z tych korzyści. Jeśli przedłużysz licencję w ciągu <strong>{3} dni</strong> od jej wygaśnięcia, zostaną zastosowane następujące zniżki: Licencja zespołowa {0}; Licencja na prowadzenie działalności {1}; Licencja dla przedsiębiorstw {2}.",
    "discountForYears": "{0}% zniżki na {1} lat",
    "WhatHappensWhenLicenseEndsExplanation8": "Wygenerowane przez Ciebie projekty ABP nie są przechowywane na naszych serwerach. Dlatego Twoim obowiązkiem jest zachowanie pobranego kodu źródłowego. Po wygaśnięciu licencji nie będzie możliwości uzyskania wygenerowanego kodu źródłowego projektu ABP.",
    "WhenShouldIRenewMyLicense": "Kiedy powinienem odnowić licencję?",
    "WhenShouldIRenewMyLicenseExplanation": "Jeśli odnowisz licencję w ciągu <strong>{3} dni</strong> po wygaśnięciu licencji, zostaną zastosowane następujące rabaty: licencja zespołowa {0}% rabatu, licencja biznesowa {1}% rabatu, licencja Enterprise {2}% rabatu . Jeśli odnowisz licencję <strong>1 miesiąc</strong> po dacie wygaśnięcia licencji, cena odnowienia będzie taka sama jak cena zakupu licencji i nie będzie rabatu na odnowienie.",
    "TrialPlan": "Czy masz plan próbny?",
    "TrialPlanExplanation": "Tak, aby rozpocząć bezpłatny okres próbny, napisz na adres <a href=\"mailto:marketing@volosoft.com?subject=ABP Commercial — Trial License Request\">marketing@volosoft.com</a> . Oferujemy również 30-dniową gwarancję zwrotu pieniędzy za licencję Team, bez zadawania pytań! Możesz poprosić o pełny zwrot pieniędzy w ciągu pierwszych 30 dni od zakupu licencji. W przypadku licencji Business i Enterprise zapewniamy zwrot 60% kwoty w ciągu 30 dni. Dzieje się tak dlatego, że licencje Business i Enterprise zawierają pełny kod źródłowy wszystkich modułów i motywów.",
    "DoYouAcceptBankWireTransfer": "Czy akceptujesz przelew bankowy?",
    "DoYouAcceptBankWireTransferExplanation": "Tak, akceptujemy przelew bankowy.<br />Po wysłaniu opłaty licencyjnej przelewem bankowym wyślij nam e-mail na adres accounting@abp.io z potwierdzeniem odbioru i rodzajem żądanej licencji. Informacje o naszych międzynarodowych kontach bankowych:",
    "HowToUpgrade": "Jak zaktualizować istniejące aplikacje, gdy dostępna jest nowa wersja?",
    "HowToUpgradeExplanation1": "Podczas tworzenia nowej aplikacji przy użyciu ABP Commercial wszystkie moduły i motyw są używane jako pakiety NuGet i NPM. Możesz więc łatwo zaktualizować pakiety, gdy dostępna będzie nowa wersja.",
    "HowToUpgradeExplanation2": "Oprócz standardowych uaktualnień NuGet/NPM <a href=\"{0}\">ABP CLI</a> udostępnia polecenie aktualizacji, które automatycznie wyszukuje i uaktualnia wszystkie pakiety powiązane z ABP w Twoim rozwiązaniu.",
    "DatabaseSupport": "Jakie systemy baz danych są obsługiwane?",
    "DatabaseSupportExplanation": "ABP Framework sam w sobie jest niezależny od bazy danych i może współpracować z dowolnym dostawcą bazy danych ze względu na swoją naturę. Zobacz <a href=\"{0}\" target=\"_blank\">dokument dostępu do danych</a>, aby zobaczyć listę aktualnie wdrożonych dostawców.",
    "UISupport": "Jakie frameworki interfejsu użytkownika są obsługiwane?",
    "Supported": "Utrzymany",
    "UISupportExplanation": "ABP Framework sam w sobie jest niezależny od frameworka UI i może współpracować z dowolnym frameworkiem UI. Jednak szablony startowe, interfejsy użytkownika modułów i motywy nie zostały zaimplementowane dla wszystkich frameworków interfejsu użytkownika. Zobacz <a href=\"{0}\">dokument wprowadzający</a>, aby uzyskać aktualną listę opcji interfejsu użytkownika.",
    "MicroserviceSupport": "Czy wspiera architekturę mikroserwisów?",
    "MicroserviceSupportExplanation1": "Jednym z głównych celów ram ABP jest zapewnienie wygodnej infrastruktury do tworzenia rozwiązań mikrousługowych. Zapoznaj się z dokumentem <a href=\"{0}\">architektura mikrousług</a>, aby dowiedzieć się, jak pomaga tworzyć systemy mikrousług.",
    "MicroserviceSupportExplanation2": "Wszystkie moduły komercyjne ABP są zaprojektowane do obsługi scenariuszy wdrażania mikrousług (z własnym interfejsem API i bazą danych) zgodnie z dokumentem <a href=\"{0}\">najlepsze praktyki tworzenia modułów</a>.",
    "MicroserviceSupportExplanation3": "Udostępniamy przykładowe <a href=\"{0}\">rozwiązanie demonstracyjne mikrousług</a>, które demonstruje implementację architektury mikrousług, aby pomóc Ci stworzyć własne rozwiązanie.",
    "MicroserviceSupportExplanation4": "Krótka odpowiedź brzmi więc „<strong>tak, obsługuje architekturę mikrousług</strong>”.",
    "MicroserviceSupportExplanation5": "Jednak system mikrousług jest rozwiązaniem, a każde rozwiązanie będzie miało inne wymagania, topologię sieci, scenariusze komunikacji, możliwości uwierzytelniania, decyzje o separacji/udostępnianiu baz danych, konfiguracje środowiska uruchomieniowego, integracje z systemami innych firm i wiele innych.",
    "MicroserviceSupportExplanation6": "ABP Framework i ABP Commercial zapewniają infrastrukturę dla scenariuszy mikrousług, modułów kompatybilnych z mikrousługami, próbek i dokumentacji, które pomogą Ci zbudować własne rozwiązanie. Ale nie oczekuj, że bezpośrednio pobierzesz swoje wymarzone rozwiązanie, które jest dla Ciebie gotowe. Musisz to zrozumieć i połączyć niektóre części w oparciu o swoje wymagania.",
    "WhereCanIDownloadSourceCode": "Gdzie mogę pobrać kod źródłowy?",
    "WhereCanIDownloadSourceCodeExplanation": "Możesz pobrać kod źródłowy wszystkich modułów ABP, pakietów Angular i motywów za pośrednictwem ABP Suite lub ABP CLI. Zobacz <a href=\"{0}\">Jak pobrać kod źródłowy?</a>",
    "ComputerLimitation": "Ile komputerów może zalogować się programista podczas opracowywania ABP?",
    "ComputerLimitationExplanation": "W szczególności zezwalamy na <strong>{0} komputery</strong> na osobę/licencjonowanego programistę. Ilekroć istnieje potrzeba, aby programista rozwijał produkty ABP Commercial na trzeciej maszynie, należy wysłać e-mail na adres license@abp.io wyjaśniając sytuację, a następnie dokonamy odpowiedniej alokacji w naszym systemie.",
    "RefundPolicy": "Czy masz politykę zwrotów?",
    "RefundPolicyExplanation": "Możesz poprosić o zwrot pieniędzy w ciągu <strong>30 dni</strong> od zakupu licencji. Licencje Business i Enterprise mają opcję pobierania kodu źródłowego, dlatego zwroty kosztów nie są dostępne w przypadku licencji Business i Enterprise (oraz wszelkich licencji zawierających prawo do otrzymania kodu źródłowego). Ponadto nie są dokonywane żadne zwroty za odnowienia i zakup drugiej licencji.",
    "HowCanIRefundVat": "Jak mogę zwrócić VAT?",
    "HowCanIRefundVatExplanation1": "Jeśli dokonałeś płatności za pomocą 2Checkout, możesz zwrócić podatek VAT za pośrednictwem swojego konta 2Checkout:",
    "HowCanIRefundVatExplanation2": "Zaloguj się na swoje konto <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\">2Checkout</a>",
    "HowCanIRefundVatExplanation3": "Znajdź odpowiednie zamówienie i naciśnij „Zwróć spóźniony VAT” (wprowadź swój NIP)",
    "HowCanIGetMyInvoice": "Jak mogę otrzymać fakturę?",
    "HowCanIGetMyInvoiceExplanation": "Istnieją 2 bramki płatnicze do zakupu licencji: Iyzico i 2Checkout. Jeśli kupisz licencję za pośrednictwem bramki 2Checkout, faktura w formacie PDF zostanie wysłana na Twój adres e-mail, zobacz <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How- do-invoices-work\">Fakturowanie 2Checkout.</a> Jeśli dokonasz zakupu przez bramkę Iyzico, z niestandardowym linkiem do zakupu lub przelewem bankowym, przygotujemy i wyślemy Twoją fakturę. Możesz poprosić o fakturę lub ją pobrać na <a href=\"{0}\">stronie zarządzania organizacją</a>. Zanim skontaktujesz się z nami w sprawie faktury, sprawdź stronę zarządzania organizacją!",
    "Forum": "Forum",
    "SupportExplanation": "Licencje komercyjne ABP zapewniają wsparcie forum premium przez zespół składający się z ekspertów ABP Framework.",
    "PrivateTicket": "Bilet prywatny",
    "PrivateTicketExplanation": "Licencja Enterprise obejmuje również prywatne wsparcie z systemem e-mail i ticketów.",
    "AbpSuiteExplanation1": "ABP Suite umożliwia tworzenie stron internetowych w ciągu kilku minut. Jest to narzędzie .NET Core Global, które można zainstalować z wiersza polecenia.",
    "AbpSuiteExplanation2": "Może tworzyć nowe rozwiązanie ABP, generować strony CRUD z bazy danych do front-endu. Przegląd techniczny znajduje się w <a href=\"{0}\">dokumencie</a>",
    "FastEasy": "Szybki i łatwy",
    "AbpSuiteExplanation3": "ABP Suite umożliwia łatwe tworzenie stron CRUD. Musisz tylko zdefiniować swoją encję i jej właściwości, resztę niech ABP Suite za Ciebie! ABP Suite generuje cały niezbędny kod dla Twojej strony CRUD w kilka sekund. Obsługuje interfejsy użytkownika Angular, MVC i Blazor.",
    "RichOptions": "Bogate opcje",
    "AbpSuiteExplanation4": "ABP Suite obsługuje wiele opcji interfejsu użytkownika, takich jak <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\">Razor Pages</a> i <a href=\"https:/ /angular.io\">Angular</a>. Obsługuje również wiele baz danych, takich jak <a href=\"https://www.mongodb.com\">MongoDB</a> i wszystkie bazy danych obsługiwane przez <strong>EntityFramework Core< /strong> (MS SQL Server, Oracle, MySql, PostgreSQL i <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\">więcej </a>).",
    "AbpSuiteExplanation5": "Dobrą rzeczą jest to, że nie musisz się martwić o te opcje. ABP Suite rozumie typ twojego projektu i generuje kod dla twojego projektu oraz umieszcza wygenerowany kod we właściwym miejscu w twoim projekcie.",
    "SourceCode": "Kod źródłowy",
    "AbpSuiteExplanation6": "ABP Suite generuje dla Ciebie kod źródłowy! Nie generuje magicznych plików do generowania strony internetowej. ABP Suite generuje kod źródłowy dla <strong>jednostki, repozytorium, usługi aplikacji, migracji Code First, JavaScript/TypeScript i CSHTML/HTML</strong> oraz niezbędnych interfejsów. ABP Suite generuje również kod zgodnie z <strong>najlepszymi praktykami</strong> tworzenia oprogramowania, więc nie musisz się martwić o jakość wygenerowanego kodu.",
    "AbpSuiteExplanation7": "Ponieważ masz kod źródłowy bloków konstrukcyjnych wygenerowanej strony CRUD w poprawnych warstwach aplikacji, możesz łatwo modyfikować kod źródłowy i wstrzykiwać własną/biznesową logikę do wygenerowanego kodu.",
    "CrossPlatform": "Platforma międzyplatformowa",
    "AbpSuiteExplanation8": "ABP Suite jest zbudowany z .NET Core i jest wieloplatformowy. Działa jako aplikacja internetowa na komputerze lokalnym. Możesz go uruchomić na <strong>Windows</strong>, <strong>Mac</strong> i <strong>Linux</strong>",
    "OtherFeatures": "Inne funkcje",
    "OtherFeatures1": "Łatwo aktualizuje pakiety <strong>NuGet</strong> i <strong>NPM</strong> w Twoim rozwiązaniu.",
    "OtherFeatures2": "Regeneruje już wygenerowane strony od podstaw.",
    "OtherFeatures3": "Tworzy nowe rozwiązania",
    "ThanksForCreatingProject": "Dziękujemy za stworzenie projektu!",
    "HotToRunSolution": "Jak uruchomić swoje rozwiązanie?",
    "HotToRunSolutionExplanation": "Zobacz dokument wprowadzający, aby dowiedzieć się, jak skonfigurować i uruchomić swoje rozwiązanie.",
    "GettingStarted": "Pierwsze kroki",
    "WebAppDevTutorial": "Samouczek dla programistów aplikacji internetowych",
    "WebAppDevTutorialExplanation": "Zobacz samouczek dotyczący tworzenia aplikacji internetowych, aby zapoznać się z przykładem programowania krok po kroku.",
    "Document": "Dokument",
    "UsingABPSuiteToCURD": "Korzystanie z ABP Suite do generowania stron i narzędzi CRUD",
    "SeeABPSuiteDocument": "Zobacz dokument ABP Suite, aby dowiedzieć się, jak korzystać z ABP Suite.",
    "AskQuestionsOnSupport": "Możesz zadawać pytania dotyczące wsparcia komercyjnego ABP.",
    "Documentation": "Dokumentacja",
    "SeeModulesDocument": "Zobacz dokument dotyczący modułów, aby zobaczyć listę wszystkich komercyjnych(pro) modułów i ich dokumentów.",
    "Pricing": "cennik",
    "PricingExplanation": "Wybierz funkcje i funkcje, których potrzebuje Twoja firma. Łatwa rozbudowa wraz z rozwojem firmy.",
    "Team": "Zespół",
    "Business": "Biznes",
    "Enterprise": "Przedsiębiorstwo",
    "Custom": "Zwyczaj",
    "IncludedDeveloperLicenses": "Dołączone licencje programistyczne",
    "CustomLicenceOrAdditionalServices": "Potrzebujesz niestandardowej licencji lub dodatkowych usług?",
    "CustomOrVolumeLicense": "Licencja niestandardowa lub zbiorcza",
    "LiveTrainingSupport": "Szkolenie na żywo i wsparcie",
    "AndMore": "i więcej",
    "AdditionalDeveloperLicense": "Dodatkowa licencja programisty",
    "ProjectCount": "Liczba projektów",
    "AllProModules": "Wszystkie moduły pro",
    "AllProThemes": "Wszystkie motywy pro",
    "AllProStartupTemplates": "Wszystkie profesjonalne szablony startowe",
    "SourceCodeOfAllModules": "Kod źródłowy wszystkich modułów",
    "SourceCodeOfAllThemes": "Kod źródłowy wszystkich motywów",
    "PerpetualLicense": "Dożywotnia licencja",
    "UnlimitedServerDeployment": "Nieograniczone wdrażanie serwerów",
    "YearUpgrade": "1 rok aktualizacji",
    "YearPremiumForumSupport": "Roczne wsparcie forum premium",
    "ForumSupportIncidentCountYear": "Liczba incydentów wsparcia forum/rok",
    "PrivateTicketEmailSupport": "Prywatny bilet i wsparcie e-mail",
    "BuyNow": "Kup Teraz",
    "PayViaAmexCard": "Jak mogę zapłacić kartą AMEX?",
    "PayViaAmexCardDescription": "Domyślna bramka płatnicza „Iyzico” może odrzucić niektóre karty kredytowe AMEX ze względu na środki bezpieczeństwa. W takim przypadku możesz zapłacić za pośrednictwem alternatywnej bramki płatniczej „2Checkout”.",
    "ThankYou": "Dziękuję Ci",
    "InvalidReCaptchaErrorMessage": "Wystąpił błąd podczas weryfikacji reCAPTCHA. Proszę spróbuj ponownie.",
    "CompanyName": "Nazwa firmy",
    "YourCompanyName": "Nazwa Twojej firmy",
    "FirstName": "Imię",
    "LastName": "Nazwisko",
    "Optional": "Opcjonalny",
    "YourFirstName": "Twoje imię",
    "YourLastName": "Twoje nazwisko",
    "SpecialOffer": "Oferta specjalna",
    "SpecialOfferMessage": "Pośpiesz się! Ceny obowiązują przez ograniczony czas.",
    "DiscountRequest": "Prośba o zniżkę",
    "DiscountRequestDescribeCustomerQuestion": "Która z poniższych odpowiedzi Cię opisuje?",
    "DiscountRequestStudentEmailMessage": "Adres e-mail musi zawierać „edu”.",
    "DiscountRequestDeveloperCount": "Ilu programistów jesteś?",
    "DiscountRequestDeveloperCountExceedMessage": "Nie oferujemy licencji ze zniżką dla firm, które mają ponad {0} programistów.",
    "DiscountRequestOrganizationName": "Nazwa firmy/organizacji/szkoły",
    "Website": "Strona internetowa",
    "GithubUsername": "Nazwa użytkownika GitHub",
    "PhoneNumber": "Numer telefonu",
    "Country": "Kraj",
    "DescribeABPCommercialUsage": "Opisz projekt, który planujesz rozwijać w oparciu o APB Commercial",
    "DiscountRequestCertifyInformationMessage": "Oświadczam, że wszystkie informacje są prawdziwe i poprawne.",
    "DiscountRequestReceived": "Otrzymaliśmy Twoją prośbę o zniżkę.",
    "DiscountRequestStatusMessage": "Odpowiemy Ci po sprawdzeniu podanych przez Ciebie informacji.",
    "MVCOrRazorPages": "MVC (Strony brzytwy)",
    "Angular": "Kątowy",
    "Blazor": "Blazor",
    "New": "Nowy",
    "MongoDB": "MongoDB",
    "EBookDDD": "Projekt oparty na domenie e-booków",
    "PracticalGuideForImplementingDDD": "Ta książka jest praktycznym przewodnikiem wdrażania projektowania opartego na domenie za pomocą ABP Framework.",
    "IntroducingDDD": "Przedstawiamy projektowanie oparte na domenie",
    "DDDLayersAndCleanArchitecture": "Warstwy DDD i czysta architektura",
    "LayeringOfADotnetSolution": "Nakładanie warstw rozwiązania .NET",
    "ImplementingDDDBuildingBlocks": "Wdrażanie bloków konstrukcyjnych DDD",
    "DomainVsApplicationLogic": "Logika domeny a logika aplikacji",
    "SamplesAndDiscussions": "Próbki i dyskusje",
    "Free": "Darmowy",
    "Download": "Pobierać",
    "DDDEBook": "E-book DDD",
    "ImplementingDDD": "Wdrażanie projektowania opartego na domenie",
    "DDDBookExplanation": "Praktyczny przewodnik dotyczący wdrażania projektu opartego na domenie za pomocą ABP Framework.",
    "Overview": "Przegląd",
    "DDDBookPracticalGuide": "To jest praktyczny przewodnik dotyczący wdrażania projektu opartego na domenie (DDD). Chociaż szczegóły implementacji opierają się na infrastrukturze ABP Framework, podstawowe koncepcje, zasady i wzorce mają zastosowanie w każdym rozwiązaniu, nawet jeśli nie jest to rozwiązanie .NET.",
    "TableOfContents": "Spis treści",
    "IntroductionToImplementingDDD": "Wprowadzenie do wdrażania projektowania opartego na domenie",
    "WhatIsDDD": "Co to jest projektowanie oparte na domenie?",
    "Implementation": "Realizacja",
    "TheBigPicture": "Wielkie zdjęcie",
    "TheBuildingBlock": "Blok konstrukcyjny",
    "ExampleUseCase": "Przykładowy przypadek użycia",
    "DomainAndApplicationLogic": "Logika domeny i logika aplikacji",
    "Author": "Autor",
    "PublishedOn": "Opublikowano dnia",
    "Page": "Strona",
    "FreeEBook": "Bezpłatny e-book",
    "EBookSignInForDownload": "Aby pobrać e-booka, zaloguj się",
    "SignIn": "Zaloguj",
    "Or": "Lub",
    "TellUsAboutYourself": "Opowiedz nam trochę o sobie",
    "Surname": "Nazwisko",
    "DoYouAgreePrivacyPolicy": "Akceptuję <a href=\"/TermsConditions\">Warunki korzystania z usługi<a/> i <a href=\"/Privacy\">Politykę prywatności</a>.",
    "VolosoftMarketingInformationMessage": "Chcę uzyskać informacje, wskazówki i oferty dotyczące rozwiązań dla firm i organizacji oraz innych produktów i usług Volosoft.",
    "VolosoftSharingInformationMessage": "Chciałbym, aby firma Volosoft udostępniała moje informacje wybranym partnerom, abym mogła otrzymywać istotne informacje o ich produktach i usługach.",
    "WeWillSendYouADownloadLink": "Link do pobrania e-booka został wysłany na {0}.<br/> Sprawdź skrzynkę odbiorczą/śmieci/spam!",
    "InvalidFormInputs": "Proszę wpisać prawidłowe informacje podane w formularzu.",
    "DDDBookEmailBody": "Dziękuję Ci. <br /> Aby pobrać książkę, <a href=\"{0}\">kliknij tutaj</a>.",
    "StartFree": "Zacznij bezpłatnie",
    "FreeTrial": "Bezpłatna wersja próbna",
    "AcceptsMarketingCommunications": " Tak, chcę otrzymywać komunikaty marketingowe ABP Commercial.",
    "PurposeOfUsage": "Cel użycia",
    "Choose": "- Wybierać -",
    "CompanyOrganizationName": "Nazwa firmy/organizacji",
    "CompanySize": "Wielkość spółki",
    "Next": "Następny",
    "StartTrial": "Rozpocznij mój bezpłatny okres próbny",
    "ContactUsQuestions": "Skontaktuj się z nami, jeśli masz jakiekolwiek pytania",
    "TrialActivatedWarning": "Użytkownikowi przysługuje tylko 1 darmowy okres próbny. Już wykorzystałeś swój okres próbny.",
    "ActivationRequirement": "Jesteś o krok od rozpoczęcia okresu próbnego.<br> Po sprawdzeniu Twoich danych aktywujemy Twoją licencję. Po aktywowaniu Twojej licencji wyślemy wiadomość e-mail na adres <b>{0}</b> . Nie martw się, ten proces nie potrwa długo!",
    "SaveAndDownload": "Zapisz i pobierz",
    "CompanyNameValidationMessage": "Nazwa firmy jest za długa!",
    "AddressValidationMessage": "Adres jest za długi!",
    "TaxNoValidationMessage": "Numer podatku/VAT jest za długi!",
    "NotesValidationMessage": "Pole notatek jest za długie!",
    "CheckYourBillingInfo": "Fakturę możesz utworzyć tylko raz! Sprawdź informacje rozliczeniowe przed utworzeniem faktury.",
    "StartYourFreeTrial": "Rozpocznij darmowy okres próbny",
    "TrialLicenseModelInvalidErrorMessage": "Jedno z następujących pól jest nieprawidłowe: nazwa kraju, wielkość firmy, branża lub cel użytkowania.",
    "Trial": "Test",
    "Purchased": "Zakupione",
    "PurchaseNow": "Kup Teraz",
    "PurchaseTrialLicenseMessage": "Data wygaśnięcia Twojej licencji to {0}. <br> Jeśli chcesz nadal korzystać z projektów utworzonych podczas bezpłatnego okresu próbnego, musisz zmienić klucze licencyjne w plikach <code>appsettings.secrets.json</code>. Oto twój klucz licencyjny:",
    "TrialLicenseExpireMessage": "Korzystasz z licencji próbnej, a Twoja licencja próbna wygaśnie w dniu {0}.",
    "TryForFree": "Wypróbuj za darmo",
    "TrialLicenseExpiredInfo": "Twoja licencja próbna wygasła!",
    "DowngradeLicensePlan": "Czy mogę w przyszłości przejść na niższy plan licencyjny?",
    "DowngradeLicensePlanExplanation": "Nie można obniżyć istniejącego planu licencji. Możesz jednak kupić nowy niższy plan licencji i kontynuować rozwój na nowej licencji. Po zakupie niższej licencji wystarczy zalogować się do nowego planu licencyjnego za pomocą polecenia ABP CLI: ` abp login<username> -o<organization> `.",
    "LicenseTransfer": "Czy licencję można przenieść z jednego programisty na drugiego?",
    "LicenseTransferExplanation": "Tak! Kupując licencję, stajesz się jej posiadaczem, dzięki czemu będziesz mieć dostęp do strony zarządzania organizacją. Organizacja ma role właściciela i programisty. Właściciele mogą zarządzać stanowiskami programistów i przypisywać programistów. Każdy przydzielony programista zaloguje się do systemu za pomocą polecenia ABP CLI i będzie miał uprawnienia do programowania i wsparcia.",
    "UserOwnerDescription": "„Właściciel” organizacji jest administratorem tego konta. Zarządza organizacją poprzez zakup licencji i przydzielanie programistów. „Właściciel” nie może pisać kodu w projektach komercyjnych ABP, nie może pobierać przykładowych projektów ABP i nie może zadawać pytań na stronie pomocy technicznej. Jeśli chcesz to wszystko zrobić, musisz także dodać siebie jako programistę.",
    "UserDeveloperDescription": "„Programiści” mogą pisać kod w projektach komercyjnych ABP, pobierać przykładowe projekty ABP i zadawać pytania na stronie pomocy technicznej. Z drugiej strony „Programiści” nie mogą zarządzać tą organizacją.",
    "RemoveCurrentUserFromOrganizationWarningMessage": "Usuwasz się ze swojej własnej organizacji. Nie będziesz już mógł zarządzać tą organizacją, potwierdzasz?",
    "RenewExistingOrganizationOrCreateNewOneMessage": "Możesz odnowić licencję swojej organizacji, klikając poniższy przycisk (przyciski „Przedłuż teraz”) i w ten sposób przedłużyć datę wygaśnięcia licencji o 1 rok. Jeśli będziesz kontynuować realizację transakcji, będziesz mieć nową organizację. Czy chcesz kontynuować pracę w nowej organizacji?",
    "PurchaseTrialOrganizationOrCreateNewOneMessage": "Masz licencję próbną. Aby kupić licencję próbną, kliknij przycisk Kup teraz. Jeśli będziesz kontynuować realizację transakcji, będziesz mieć nową organizację. Czy chcesz kontynuować pracę w nowej organizacji?",
    "ExtendNow": "Przedłuż teraz",
    "CreateNewOrganization": "Utwórz nową organizację",
    "RenewLicenseEarly": "Czy jeśli odnowię licencję wcześniej, otrzymam cały rok?",
    "RenewLicenseEarylExplanation": "Jeśli odnowisz licencję przed datą wygaśnięcia licencji, do daty wygaśnięcia licencji zostanie dodany 1 rok. Na przykład, jeśli Twoja licencja wygaśnie w dniu {0}-06-06 i odnowisz ją w dniu {0}-01-01, nowa data wygaśnięcia licencji będzie wynosić {1}-06-06.",
    "OpenSourceWebApplication": "Aplikacja internetowa typu open source",
    "CompleteWebDevelopment": "Kompletne tworzenie stron internetowych",
    "ABPFrameworkDescription": "ABP Framework to kompletna infrastruktura do tworzenia nowoczesnych aplikacji internetowych przy zastosowaniu najlepszych praktyk i konwencji rozwoju oprogramowania.",
    "CommunityDescription": "Podziel się swoimi doświadczeniami z ABP Framework!",
    "GetStarted": "Zaczynaj",
    "Views": "wyświetlenia",
    "LatestPosts": "Najnowsze posty",
    "PreBuiltApplication": "Wstępnie zbudowana aplikacja",
    "DatabaseProviders": "Dostawcy baz danych",
    "UIFrameworks": "Ramy interfejsu użytkownika",
    "UsefulLinks": "Przydatne linki",
    "Platform": "Platforma",
    "CoolestCompaniesUseABPCommercial": "Najfajniejsze firmy już korzystają z <span class=\"fw-bold\">ABP Commercial.</span>",
    "UserInterface": "Interfejs użytkownika",
    "APIGateway": "Brama API",
    "Microservice": "Mikroserwis",
    "Database": "Baza danych",
    "Architecture": "Architektura",
    "MicroserviceArchitectureExplanation": "Jest to kompletna architektura rozwiązania, która składa się z wielu aplikacji, bram API, mikroserwisów i baz danych w celu zbudowania skalowalnego rozwiązania mikroserwisowego z wykorzystaniem najnowszych technologii.",
    "BusinessLogic": "Logika biznesowa",
    "DataAccessLayer": "Warstwa dostępu do danych",
    "Monolith": "Monolit",
    "ModularArchitectureExplanation": "Ten szablon startowy zapewnia warstwową, modułową architekturę rozwiązania opartą na DDD, umożliwiającą zbudowanie przejrzystej i łatwej w utrzymaniu bazy kodu.",
    "SeeDetails": "Patrz szczegóły",
    "SeeDocumentation": "Sprawdź Dokumentację",
    "Bs5Compatible": "Profesjonalny motyw zgodny z Bootstrap 5, idealny dla Twojej witryny administratora.",
    "LeptonXTheme": "Motyw LeptonX",
    "LeptonXDark": "LeptonX Ciemny",
    "LeptonXLight": "Światło LeptonX",
    "LeptonXSemiDark": "LeptonX Półciemny",
    "BuiltOnBs5Library": "Zbudowany na bibliotece Bootstrap 5",
    "FullyCompatibleWithBs5": "W 100% kompatybilny ze strukturą HTML Bootstrap 5 i klasami CSS",
    "ResponsiveAndMobileCompatible": "Responsywny, kompatybilny z urządzeniami mobilnymi, obsługa RTL",
    "ProvidesStylesForDatatables": "Zapewnia style dla Datatables",
    "MultipleLayoutOptions": "Wiele opcji układu",
    "EasilyInstallAndUpgrade": "Łatwa instalacja i aktualizacja",
    "SupportForum": "Forum wsparcia",
    "TrustedBy": "Zaufany przez",
    "OurPricing": "Nasze <span class=\"gradient-commercial\">ceny</span>",
    "Plans": "Plany",
    "NameSurname": "Imię Nazwisko",
    "Unspecified": "Nieokreślony",
    "LicenceType": "Typ licencji",
    "LicenseDiscountWarning": "TA STRONA ZNIŻEK WYKORZYSTUJE DOMYŚLNY KOD RABATOWY I DLA PROGRAMISTÓW VOLOSOFT. LINKI DO ZAKUPÓW PONIŻEJ NIE DZIAŁAJĄ.",
    "DiscountedLicenseExplanation": "Podane ceny licencji dotyczą małych start-upów, indywidualnych programistów, studentów, organizacji i projektów non-profit!",
    "General": "Ogólny",
    "License": "Licencja",
    "Development": "Rozwój",
    "Payment": "Zapłata",
    "WatchExplainerVideo": "Spotkajmy się! Obejrzyj film wyjaśniający",
    "LightDarkAndSemiDarkThemes": "Jasne, ciemne i półmroczne",
    "LeptonXThemeExplanation": "Motyw Lepton może zmienić motyw zgodnie z ustawieniami systemu.",
    "PRO": "ZAWODOWIEC",
    "WelcomeToABPCommercial": "Witamy w <span class=\"gradient-commercial\">sklepie ABP Commercial!</span>",
    "YourAccountDetails": "Dane Twojego konta",
    "OrganizationName": "Nazwa organizacji",
    "AddDevelopers": "Dodaj programistów",
    "StartDevelopment": "Rozpocznij rozwój",
    "CreateAndRunApplicationUsingStartupTemplate": "Dowiedz się, jak utworzyć i uruchomić nową aplikację internetową przy użyciu szablonu startowego ABP Commercial.",
    "CommunityDescription2": "<span class=\"fw-6\">Community.abp.io</span> to miejsce, w którym ludzie mogą udostępniać artykuły związane z ABP. Szukaj artykułów, samouczków, próbek kodu, studiów przypadków i spotykaj ludzi na tej samej ścieżce, co Ty.",
    "UseABPSuiteExplanation": "Użyj pakietu ABP Suite, aby pobrać kod źródłowy modułów i motywów.",
    "ManageModulesWithSuite": "Za pomocą pakietu Suite możesz także zarządzać modułami ABP.",
    "LearnHowToInstallSuite": "Dowiedz się, jak zainstalować i używać pakietu ABP Suite.",
    "SeeMore": "Zobacz więcej",
    "SeeLess": "Zobacz Mniej",
    "LayeredSolutionStructure": "Warstwowa struktura rozwiązania",
    "LayeredSolutionStructureExplanation": "Rozwiązanie jest wielowarstwowe w oparciu o zasady i wzorce Domain Driven Design, aby odizolować logikę biznesową od infrastruktury i integracji oraz zmaksymalizować łatwość konserwacji i ponownego użycia kodu. Struktura ABP zapewnia już abstrakcje, klasy bazowe i przewodniki umożliwiające rzeczywiste wdrożenie DDD w Twojej aplikacji.",
    "MultipleUIOptions": "Wiele opcji interfejsu użytkownika",
    "MultipleUIOptionsExplanation": "Uwielbiamy różne sposoby tworzenia interfejsu użytkownika. To rozwiązanie startowe zapewnia trzy różne opcje struktury interfejsu użytkownika dla aplikacji biznesowej.",
    "MultipleDatabaseOptions": "Wiele opcji bazy danych",
    "MultipleDatabaseOptionsExplanation": "Masz dwie opcje dostawcy bazy danych (oprócz korzystania z obu w jednej aplikacji). Użyj Entity Framework Core do pracy z dowolną relacyjną bazą danych i opcjonalnie użyj Dapper, gdy musisz napisać zapytania niskiego poziomu w celu uzyskania lepszej wydajności. MongoDB to kolejna opcja, jeśli chcesz korzystać z bazy danych NoSQL opartej na dokumentach. Chociaż ci dostawcy są dobrze zintegrowani, wyodrębnieni i wstępnie skonfigurowani, w rzeczywistości można wchodzić w interakcję z dowolnym systemem baz danych, którego można używać z platformą .NET.",
    "ModularArchitectureExplanation2": "Modularność jest obywatelem pierwszej klasy na platformie ABP.IO. Wszystkie funkcjonalności aplikacji są podzielone na dobrze odizolowane, opcjonalne moduły. Rozwiązanie startowe zawiera już preinstalowane podstawowe <a href=\"/modules\" class=\"text-primary\">moduły ABP Commercial</a> . Możesz także stworzyć własne moduły, aby zbudować system modułowy dla własnej aplikacji.",
    "MultiTenancyForSaasBusiness": "Możliwość wielu najemców dla Twojej firmy SaaS",
    "MultiTenancyForSaasBusinessExplanation": "ABP Commercial zapewnia kompletny, kompleksowy system dla wielu dzierżawców, umożliwiający tworzenie systemów SaaS (oprogramowanie jako usługa). Umożliwia najemcom udostępnianie lub posiadanie własnych baz danych z systemem tworzenia i migracji baz danych na bieżąco.",
    "MicroserviceStartupSolution": "Rozwiązanie startowe mikrousług",
    "MicroserviceArchitectureExplanation2": "Możesz go pobrać do swojego następnego systemu mikrousług, aby skorzystać z gotowego rozwiązania podstawowego i wyjątkowego doświadczenia.",
    "PreIntegratedTools": "Wstępnie zintegrowane z popularnymi narzędziami",
    "PreIntegratedToolsExplanation": "Rozwiązanie jest już zintegrowane ze standardowymi w branży narzędziami i technologiami, ale zawsze możesz je zmienić i zintegrować ze swoimi ulubionymi narzędziami.",
    "SingleSignOnAuthenticationServer": "Serwer uwierzytelniania z pojedynczym logowaniem",
    "SingleSignOnAuthenticationServerExplanation": "Rozwiązanie zawiera aplikację serwera uwierzytelniania, która jest używana przez inne aplikacje jako serwer pojedynczego logowania z funkcjami zarządzania dostępem API. Opiera się na IdentityServer.",
    "WebAppsWithGateways": "2 aplikacje internetowe z 2 bramkami API",
    "WebAppsWithGatewaysExplanation": "Rozwiązanie składa się z dwóch aplikacji webowych, każda posiada dedykowaną bramkę API (wzorzec BFF – Backend For Frontend).",
    "BackOfficeApplication": "Aplikacja back-office",
    "BackOfficeApplicationExplanation": "Rzeczywista aplikacja internetowa Twojego systemu z wieloma opcjami struktury interfejsu użytkownika. Możesz stworzyć dowolną aplikację biznesową.",
    "LandingWebsite": "Strona docelowa",
    "LandingWebsiteExplanation": "Ogólna witryna docelowa/publiczna, której można używać do różnych celów, takich jak przedstawianie firmy, sprzedaż produktów itp.",
    "ABPFrameworkEBook": "Opanowanie e-booka dotyczącego frameworku ABP",
    "MasteringAbpFrameworkEBookDescription": "Zawarte w licencji komercyjnej ABP",
    "FullName": "Pełne imię i nazwisko",
    "LicenseTypeNotCorrect": "Typ licencji jest nieprawidłowy!",
    "Trainings": "Treningi",
    "ChooseTrainingPlaceholder": "Wybierz szkolenie...",
    "DoYouNeedTrainings": "Czy potrzebujesz jednego z tych szkoleń?",
    "DoYouNeedTraining": "Czy potrzebujesz szkolenia z zakresu {0}?",
    "GetInTouchUs": "Skontaktuj się z nami",
    "ForMoreInformationClickHere": "Aby uzyskać więcej informacji, kliknij <a href='{0}'>tutaj.</a>",
    "ForMoreInformationClickHereByClass": "<span class=\"{1}\">Aby uzyskać więcej informacji, kliknij</span> <a href='{0}'>tutaj.</a>",
    "IsGetOnboardingTraining": "Czy chcesz przejść szkolenie z zakresu wdrażania i tworzenia aplikacji internetowych?",
    "OnboardingWebApplicationDevelopmentTrainingMessage": "Aby zaplanować kalendarz szkoleń, po utworzeniu organizacji skontaktuj się z {0}",
    "CustomPurchaseMessage": "Aby przejść do następnego kroku, kliknij {0}, aby się z nami skontaktować.",
    "Note": "Notatka",
    "AdditionalNote": "Dodatkowa uwaga",
    "OnboardingTrainingFaqTitle": "Czy masz szkolenie wprowadzające ABP?",
    "OnboardingTrainingFaqExplanation": "Tak, posiadamy usługi szkoleniowe ABP, które pomogą Ci szybko rozpocząć projekt ABP. Dowiesz się o ABP od głównego członka zespołu ABP i zdobędziesz umiejętności potrzebne do rozpoczęcia projektu ABP. Na szkoleniu wprowadzającym wyjaśnimy jak skonfigurować środowisko programistyczne, zainstalować wymagane narzędzia i stworzyć w pełni funkcjonalną stronę CRUD. Szkolenie odbędzie się na żywo, wykorzystana zostanie aplikacja Zoom, jesteśmy otwarci na korzystanie z innych platform spotkań online. Językiem szkolenia będzie język angielski. Podczas sesji możesz także zadawać pytania dotyczące ABP. Ustalony zostanie dogodny dla obu stron termin i termin. Aby uzyskać więcej informacji, skontaktuj się z nami pod <a href=\"mailto:info@abp.io\">adresem info@abp.io</a> .",
    "AddBasket": "Dodaj do koszyka",
    "SendTrainingRequest": "Wyślij prośbę o szkolenie",
    "OnlyEnglishVersionOfThisDocumentIsTheRecentAndValid": "* Wersja angielska tego dokumentu jest najbardziej aktualna i w przypadku wszelkich sporów rozstrzygająca będzie wersja angielska.",
    "Pricing_Page_Title": "Ceny i plany",
    "Pricing_Page_Description": "Wybierz funkcje i funkcjonalności, których potrzebuje Twoja firma już dziś. Kup licencję ABP Commercial i twórz nieograniczoną liczbę projektów.",
    "Pricing_Page_HurryUp": "Pośpiesz się!",
    "Pricing_Page_BuyLicense": "Kup licencję w <strong>cenach z 2021 roku</strong> do 16 stycznia!",
    "Pricing_Page_ValidForExistingCustomers": "Dotyczy również istniejących klientów i odnowień licencji.",
    "Pricing_Page_Hint1": "Cena licencji obejmuje określoną liczbę stanowisk programistycznych. Jeśli masz więcej programistów, zawsze możesz dokupić dodatkowe stanowiska.",
    "Pricing_Page_Hint2": "Możesz kupić więcej licencji programisty teraz lub w przyszłości. Licencje są oparte na stanowiskach, więc możesz przenieść stanowisko od jednego programisty do drugiego.",
    "Pricing_Page_Hint3": "Dzięki swojej licencji możesz rozwijać nieograniczoną liczbę różnych produktów.",
    "Pricing_Page_Hint4": "ABP Suite to narzędzie pomagające w rozwoju i poprawie produktywności. Obsługuje generowanie stron CRUD i tworzenie nowych projektów.",
    "Pricing_Page_Hint5": "Możesz używać wszystkich gotowych modułów w swoich aplikacjach.",
    "Pricing_Page_Hint6": "Możesz używać wszystkich gotowych motywów w swoich aplikacjach.",
    "Pricing_Page_Hint7": "Szablon startowy to rozwiązanie programu Visual Studio umożliwiające szybkie rozpoczęcie projektu. Wszystkie podstawowe moduły są dodawane i wstępnie skonfigurowane dla Ciebie.",
    "Pricing_Page_Hint8": "E-book Mastering ABP Framework wyjaśnia, jak wdrażać rozwiązania .NET zgodnie z najlepszymi praktykami. Jest sprzedawana na Amazon.com i możesz pobrać ją bezpłatnie, korzystając ze swojej licencji.",
    "Pricing_Page_Hint9": "Możesz pobrać kod źródłowy dowolnego modułu. Możesz dodać kod źródłowy do swojego rozwiązania, aby wprowadzić radykalne zmiany lub po prostu zachować go dla siebie ze względów bezpieczeństwa.",
    "Pricing_Page_Hint10": "Licencje są dożywotnie. Oznacza to, że możesz w nieskończoność rozwijać swoją aplikację. Dostęp do najnowszej wersji i uzyskanie wsparcia udzielane są w okresie obowiązywania licencji (1 rok, chyba że ją odnowisz).",
    "Pricing_Page_Hint11": "Brak ograniczeń w zakresie wdrażania! Możesz wdrożyć rozwiązanie na dowolnej liczbie serwerów, w tym w usługach w chmurze lub lokalnie.",
    "Pricing_Page_Hint12": "Możesz zaktualizować moduły, motywy i narzędzia do najnowszej wersji w ramach aktywnego okresu licencji. Po wygaśnięciu licencji musisz ją odnowić, aby nadal otrzymywać aktualizacje zawierające poprawki błędów, nowe funkcje i ulepszenia.",
    "Pricing_Page_Hint13": "Wsparcie premium możesz uzyskać na okres jednego roku (możesz odnowić licencję, aby ją przedłużyć).",
    "Pricing_Page_Hint14": "Licencje zespołowe i biznesowe mają limit liczby incydentów/pytań. Jeśli kupisz dodatkowe licencje dla programistów, Twój limit incydentów wzrośnie o {0} (w przypadku licencji zespołowej) lub o {1} (w przypadku licencji biznesowej) na programistę.",
    "Pricing_Page_Hint15": "Tylko licencja Enterprise obejmuje wsparcie prywatne. Możesz wysłać e-mail bezpośrednio do zespołu ABP lub zadać pytania na stronie support.abp.io, korzystając z opcji prywatnego biletu. Bilety prywatne nie są widoczne dla publiczności.",
    "Pricing_Page_Hint16": "Możesz pobrać kod źródłowy wszystkich motywów ABP. Możesz dodać kod źródłowy do swojego rozwiązania, aby wprowadzić radykalne zmiany lub po prostu zachować go dla siebie ze względów bezpieczeństwa.",
    "Pricing_Page_Testimonial_1": "Firma ABP Commercial pozwoliła firmie SC Ventures na dostarczenie w ciągu 9 miesięcy platformy SaaS klasy bankowej z silosową bazą danych dla wielu najemców w celu obsługi finansowania łańcucha dostaw należności i zobowiązań w przypadku faktur o znacznej wartości z wielu zintegrowanych kotwic. Modułowość ABP umożliwiła zespołowi dostarczenie produktów w rekordowym czasie, przejście wszystkich testów VAPT i wdrożenie skonteneryzowanego stosu mikrousług za pośrednictwem pełnego CI/CD i potoków do produkcji.",
    "Pricing_Page_Testimonial_2": "Widzimy wartość wykorzystania ABP Commercial w celu zmniejszenia kosztów ogólnych niestandardowych projektów rozwojowych. Zespół jest w stanie ujednolicić wzorzec kodu w różnych strumieniach projektów. Widzimy w tym frameworku większy potencjał, dzięki któremu możemy tworzyć nowe funkcje szybciej niż wcześniej. Ufamy, że stale będziemy dostrzegać wartość wykorzystania ABP Commercial.",
    "Pricing_Page_Testimonial_3": "Kochamy ABP. Nie musimy pisać wszystkiego od zera. Zaczynamy od gotowych funkcji i skupiamy się na tym, co naprawdę musimy napisać. Ponadto ABP jest dobrze zaprojektowane, a kod jest wysokiej jakości i zawiera mniej błędów. Gdybyśmy musieli sami napisać wszystko, czego potrzebowaliśmy, być może musielibyśmy spędzić na to lata. Jeszcze jedną rzeczą, która nam się podoba, jest to, że nowa wersja, rozwiązanie problemu lub ulepszenie pojawia się bardzo szybko, co dwa tygodnie. Nie czekamy zbyt długo.",
    "Pricing_Page_Testimonial_4": "ABP Commercial to fantastyczny produkt, który polecam. Produkty komercyjne oferowane naszym klientom na jednej konfigurowalnej platformie. Skok zaczyna się od tego, że ramy i narzędzia, które zapewniają każdemu zespołowi, są warte każdego centa. Firma ABP Commercial była najlepiej dopasowana do naszych potrzeb.",
    "Pricing_Page_Testimonial_5": "ABP Framework to nie tylko framework, ale także przewodnik po opracowywaniu/zarządzaniu projektami, ponieważ zapewnia szkolenia z DDD, GenericRepository, DI, Microservice i Modularity. Nawet jeśli nie będziesz korzystał z samego frameworka, możesz rozwijać się dzięki dobrze i profesjonalnie przygotowanemu docs.abp.io (OpenIddict, Redis, Quartz itp.). Ponieważ wiele rzeczy jest gotowych, znacznie skraca to czas tworzenia projektu (np. strona logowania, obsługa wyjątków, filtrowanie danych, inicjowanie, rejestrowanie audytu, lokalizacja, automatyczny kontroler API itp.). Jako przykład z naszej aplikacji użyłem Local Event Bus do kontroli zapasów. Mogę więc zarządzać ruchami zamówień, pisząc moduł obsługi zapasów. Wspaniale jest nie tracić czasu na CreationTime, CreatorId. Są one wypełniane automatycznie.",
    "Pricing_Page_Testimonial_6": "ABP Framework to dobry framework, ale potrzebuje czasu, aby zrozumieć różne warstwy, klasy i biblioteki, których używa (zwłaszcza ABP). Spędziłem dużo czasu czytając bazę kodu, ale ABP Commercial zaoszczędziło nam czasu podczas tworzenia jednostek specjalistycznych projektu (AR) i repozytorium powiązanego z każdą z nich. Podobało mi się również podejście stosowane w ABP, które jest bardzo dojrzałe; wiemy, że opiera się na DDD i monolicie.",
    "Pricing_Page_Testimonial_7": "Jako startup musimy szybko wykonywać iteracje i spędzać minimalną ilość czasu na standardowych funkcjach i funkcjach innych niż podstawowe. \n Wśród naszych inżynierów znajdują się zarówno bardzo doświadczeni, jak i młodsi inżynierowie. Potrzebowaliśmy wspólnego zrozumienia oraz sposobu dzielenia się wiedzą techniczną i dziedzinową. Firma ABP umożliwiła nam to dzięki świetnym przewodnikom i dokumentacji. \n Są rzeczy, o które nie musimy się martwić, ponieważ działają one od razu z ABP. \n ABP pomogła nam usprawnić szybkie prototypowanie i rozwój w mniej niż 4 tygodnie od opracowania funkcji do produkcji. Dzięki wszystkim funkcjom premium zawartym w licencji firma ABP zapewniła nam „uruchomienie w pudełku” po stronie inżynierii oprogramowania.",
    "Pricing_Page_Testimonial_8": "Polecam firmę ABP każdemu, kto chce poszerzyć gamę produktów dostępnych dla swoich klientów. Jest to fantastyczne, gdy trzeba korzystać z rozproszonego środowiska korporacyjnego (Angular, WPF, Win&amp;Linux). Oprócz ich produktów uwielbiamy ich wsparcie, dzięki któremu nasza praca jest szybsza i łatwiejsza. Wiemy już, że znaleźliśmy świetnego partnera na przyszłość, który będzie nas wspierał w rozwijaniu naszego biznesu.",
    "Pricing_Page_Testimonial_9": "Jesteśmy firmą dwuosobową działającą na rynku już ponad 20 lat. \n Jeśli chodzi o nasze doświadczenia z ABP Commercial, zwrócił się do nas klient, który poprosił o opracowanie nowej aplikacji do zarządzania zasobami ludzkimi w nowoczesnym środowisku, która zastąpiłaby jego 25-letnią aplikację Access. Zdecydowaliśmy się na przejście z rozwiązania desktopowego na rozwiązanie internetowe. \n \n W tamtym czasie mieliśmy bardzo małą wiedzę na temat aplikacji internetowych i .NET, ale natknęliśmy się na ABP Commercial i przy pomocy ABP Framework, dokumentacji technicznej i pakietu ABP Suite byliśmy w stanie nie tylko opracować aplikację specyfikacji klienta, ale także z sukcesem w ciągu roku pracować w środowisku .NET.",
    "AbpBookDownloadArea_ClaimYourEBook": "Odbierz swój e-book <span class='gradient-framework'>dotyczący masteringu ABP Framework</span>",
    "AddMemberModal_Warning_1": "Jeśli <strong>nazwa użytkownika,</strong> którą próbujesz dodać, nie istnieje w systemie, poproś członka swojego zespołu o zarejestrowanie się na <a href='{0}/Account/Register'>{0}</a> i udostępnienie Ci nazwy użytkownika swojego konta.",
    "MyOrganizations_Detail_WelcomeMessage": "Witamy w Twojej organizacji, {0}",
    "MyOrganizations_Detail_OrganizationManagement": "<span class=\"gradient-commercial\">Zarządzanie</span> organizacją",
    "OrganizationDisplayName": "Nazwa wyświetlana organizacji",
    "MyOrganizations_Detail_EditDisplayName": "Edytuj nazwę wyświetlaną",
    "MyOrganizations_Detail_UpgradeYourLicense": "Uaktualnij swoją licencję",
    "MyOrganizations_Detail_LicenseStartAndExpiryDate": "Data rozpoczęcia licencji — data wygaśnięcia",
    "MyOrganizations_Detail_OwnerRightInfo": "Korzystasz z {0} ze swoich {1} praw właściciela.",
    "MyOrganizations_Detail_CopyApiKey": "Skopiuj klucz",
    "MyOrganizations_Detail_ApiKeyDescription": "Klucz API to token pakietów PRO hostowanych na platformie <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{1}.</a>",
    "MyOrganizations_Detail_YourPrivateNugetSource": "Twoje prywatne źródło NuGet to <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{0}</a>",
    "MyOrganizations_Detail_PrivateNugetSourceWarning": "Jest to automatycznie dodawane jako źródło danych do NuGet.Config w rozwiązaniu ABP. Nie udostępniaj swojego klucza prywatnego nieupoważnionym użytkownikom!",
    "MyOrganizations_Detail_DeveloperSeatInfo": "Używasz {0} z {1} stanowisk programistów.",
    "NeedMoreSeatsForYourTeam": "Potrzebujesz więcej miejsc dla swojego zespołu?",
    "MyOrganizations_Detail_PricePerYear": "{0} / rocznie",
    "MyOrganizations_Detail_PurchaseDeveloperSeats": "Kup stanowiska programisty",
    "Invoices": "Faktury",
    "RequestInvoice": "Poproś o fakturę",
    "OrderNumber": "Numer zamówienia",
    "Date": "Data",
    "Products": "Produkty",
    "TotalPrice": "Całkowita cena",
    "ThereIsNoInvoice": "Nie ma faktury",
    "MyOrganizations_Detail_PaymentProviderInfo": "Jeśli kupiłeś licencję za pośrednictwem bramy <i>{0}</i> , faktura w formacie PDF zostanie wysłana na Twój adres e-mail, zobacz <a href=\"{1}\" target=\"_blank\">fakturowanie {0}.</a>",
    "MyOrganizations_Detail_PayUInfo": "Jeśli dokonałeś zakupu za pośrednictwem bramki <i>Iyzico</i> , kliknij przycisk „Poproś o fakturę” i podaj informacje rozliczeniowe.",
    "MyOrganizations_Detail_ConclusionInfo": "Twoja prośba o fakturę zostanie rozpatrzona w ciągu {0} dni roboczych.",
    "ExtendYourLicense": "Przedłuż swoją licencję <span class=\"text-primary\">{0}</span>",
    "Continue": "Kontynuować",
    "PurchaseLicense": "Kup licencję {0}",
    "DownloadInvoiceModal_DownloadInvoice": "Pobierz fakturę",
    "DownloadInvoiceModal_SaveInformationOnlyOnce": "Informacje rozliczeniowe możesz zapisać tylko raz.",
    "InvoiceModal_EnterCompanyName": "Wpisz swoją prawną nazwę firmy...",
    "InvoiceModal_EnterCompanyAddress": "Podaj oficjalny adres swojej firmy...",
    "InvoiceModal_EnterTaxNumber": "Wprowadź swój numer TAX/VAT, jeśli jest dostępny...",
    "RequestInvoiceModal_EnterNotes": "Wpisz dodatkową wiadomość dotyczącą faktury...",
    "PrePayment_PayWithIyzico": "Zapłacisz za pomocą Iyzico",
    "ContinueToCheckout": "Kontynułuj żeby sprawdzić",
    "PrePayment_IyzicoRedirectionInfo": "Zostaniesz przekierowany do bramki płatności Iyzico, aby bezpiecznie sfinalizować zakup.",
    "PrePayment_IyzicoAcceptVisaAndMasterCard": "Iyzico akceptuje karty Visa i MasterCard.",
    "Purchase": "Zakup",
    "AcceptTermsAndConditions": "Przeczytałem, zrozumiałem i akceptuję <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">politykę prywatności</a> , <a href=\"{1}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">regulamin i</a> <a href=\"{2}\" target=\"_blank\" class=\"text-primary\">umowę EULA.</a>",
    "AcceptTermsAndConditionsWarningMessage": "Proszę zaakceptować politykę prywatności oraz regulamin",
    "SelectGatewayToContinue": "Wybierz bramkę, aby kontynuować!",
    "GatewaySelection_SelectGateway": "Wybierz bramkę płatniczą",
    "GatewaySelection_RedirectionMessage": "Następnie zostaniesz przekierowany na stronę internetową wybranej bramki płatniczej, w której chcesz przeprowadzić transakcję.",
    "PaymentSucceed_PaymentSuccessMessage": "Płatność pomyślna",
    "PaymentSucceed_ThanksForPurchase": "Dziękujemy za zakupy!",
    "PaymentSucceed_CreateYourOrganization": "Stwórz swoją organizację",
    "PaymentSucceed_AddMeAsDeveloper": "Ja też jestem programistą. Dodaj mnie jako programistę do mojej organizacji.",
    "PaymentSucceed_CreateOrganization": "Utwórz organizację",
    "PaymentSucceed_OrganizationDescription": "Organizacja składa się z programistów i właścicieli. Deweloperzy to użytkownicy, którzy piszą kod w projekcie ABP i będą korzystać z witryny internetowej <a href=\"{0}\" target=\"_blank\">{1}</a> . Właścicielami są użytkownicy, którzy przydzielają stanowiska programistów i zarządzają licencjami.",
    "PaymentSucceed_ViewOrganization": "Kliknij tutaj, aby zobaczyć organizację",
    "Purchase_TotalAnnualPrice": "ŁĄCZNIE <small class=\"opacity-50\">(opłata roczna)</small>",
    "Purchase_TrainingPrice": "Cena szkolenia",
    "Purchase_OnboardingTraining": "Szkolenie na żywo z zakresu wdrażania i tworzenia aplikacji internetowych",
    "TotalDeveloperPrice": "Całkowita cena dewelopera",
    "Purchase_PricePerDeveloper": "<span>{0} {1}</span> na programistę",
    "Purchase_IncludedDeveloperInfo": "Uwzględniono {0} {1}.",
    "Purchase_LicenseExtraDeveloperPurchaseMessage": "<span class=\"fw-bold\">Licencja {0}</span> obejmuje programistów {1}. Możesz dodać dodatkowych programistów.",
    "StartupTemplates_Page_Title": "Szablony startowe ABP",
    "StartupTemplates_Page_Description": "ABP Commercial pozwala na budowanie rozwiązań o dowolnym poziomie złożoności. Zapewnia dwa główne, gotowe rozwiązania startowe. Możesz wybrać ten, który jest najbliższy Twoim wymaganiom i zbudować na jego podstawie własne, niestandardowe rozwiązanie.",
    "MicroserviceStartupSolutionForDotnet": "Rozwiązanie startowe mikrousług dla .NET",
    "MonolithSolutionForDotnet": "Rozwiązanie Monolith (modułowe) dla .NET",
    "TrainingDetailsHeaderInfo_TrainingHour": "{0} godzina (y)",
    "Trainings_Content": "Treść szkolenia",
    "Trial_Page_StartYourFreeTrial": "Rozpocznij <span class=\"gradient-commercial\">darmowy okres próbny</span>",
    "TrialLicenseFeatures": "Będziesz mógł korzystać ze wszystkich funkcji komercyjnych ABP",
    "TrialPeriodDays": "Będziesz mieć {0}-dniową licencję zespołową",
    "TrialForumSupportIncident": "Będziesz mieć {0} incydentów związanych z pomocą techniczną na forum",
    "Contact_Page_Title": "Skontaktuj się z Zespołem Rozwoju ABP",
    "Contact_Page_Description": "Skontaktuj się z zespołem ABP Development, jeśli potrzebujesz pomocy lub podzielisz się swoimi przemyśleniami i opiniami! Zespół wsparcia ABP jest gotowy do pomocy.",
    "Demo_Page_Title": "Utwórz wersję demonstracyjną",
    "Demo_Page_Description": "Utwórz bezpłatną wersję demonstracyjną, aby zobaczyć przykładową aplikację utworzoną przy użyciu szablonu startowego ABP Commercial. Nie powtarzaj się w przypadku typowych wymagań aplikacji.",
    "Discounted_Page_Title": "Obniżone ceny",
    "Discounted_Page_Description": "Wybierz funkcje i funkcjonalności, których potrzebuje Twoja firma już dziś. Kup licencję ABP Commercial i twórz nieograniczoną liczbę projektów",
    "Faq_Page_Title": "Często zadawane pytania (FAQ)",
    "Faq_Page_Description": "Czy masz jakieś pytania? Przeszukaj często zadawane pytania lub zadaj nam pytanie za pomocą formularza kontaktowego.",
    "Faq_Page_SwiftCode": "Kod SWIFT",
    "Faq_Page_BankName": "Nazwa banku",
    "Faq_Page_AccountName": "Nazwa konta",
    "Faq_Page_AccountNumber": "Numer konta",
    "Faq_Page_Currency": "Waluta",
    "Faq_Page_VatNumber": "Numer VAT",
    "Faq_Page_OtherCurrenciesInfo": "W przypadku innych walut zobacz <a href='{0}'>wszystkie konta</a>",
    "ProjectCreatedSuccess_Page_Title": "Twój projekt został utworzony",
    "ProjectCreatedSuccess_Page_Description": "Twój projekt ABP został pomyślnie utworzony!",
    "Suite_Page_Title": "Pakiet ABP",
    "Suite_Page_Description": "ABP Commercial zapewnia narzędzia do szybkiego tworzenia aplikacji, zwiększające produktywność programistów. ABP Suite umożliwia łatwe tworzenie stron CRUD.",
    "Themes_Page_Title": "Motywy ABP",
    "Themes_Page_Description": "ABP Commercial zapewnia wiele profesjonalnych, nowoczesnych motywów interfejsu użytkownika. Utwórz bezpłatną wersję demonstracyjną, aby szybko zobaczyć, jak wygląda interfejs użytkownika.",
    "Tools_Page_Title": "Narzędzia do szybkiego tworzenia aplikacji",
    "Tools_Page_Description": "ABP Commercial zapewnia narzędzia do szybkiego tworzenia aplikacji, zwiększające produktywność programistów. ABP Suite umożliwia łatwe tworzenie stron CRUD.",
    "DeveloperPrice": "Cena dewelopera",
    "AdditionalDeveloperPaymentInfoSection_AdditionalDevelopers": "{0} <small>programistów</small>",
    "LicenseRemainingDays": "przez <span>{0}</span> dni",
    "ExtendPaymentInfoSection_Description": "Przedłużając/odnawiając licencję, będziesz nadal otrzymywać <a href=\"{0}\" target=\"_blank\">wsparcie premium</a> . Będziesz także mógł uzyskać większe lub mniejsze aktualizacje modułów i motywów. Będziesz mógł kontynuować tworzenie nowych projektów. Nadal będziesz mógł korzystać z <a href=\"{1}\" target=\"_blank\">pakietu ABP Suite</a> , który przyspiesza Twój rozwój.",
    "LicenseRenewalPrice": "Cena odnowienia licencji",
    "LicensePrice": "Cena licencji",
    "TrialLicensePaymentInfoSection_Description": "<strong>Kup licencję:</strong> Kupując licencję, będziesz nadal otrzymywać <a href=\"{0}\" target=\"_blank\" rel=\"noopener\">wsparcie premium</a> . Będziesz także mógł uzyskać większe lub mniejsze aktualizacje modułów i motywów. Będziesz mógł kontynuować tworzenie nowych projektów. Nadal będziesz mógł korzystać z <a href=\"{1}\" target=\"_blank\" rel=\"noopener\">pakietu ABP Suite</a> , który przyspiesza Twój rozwój.<br> Zobacz <a href=\"{2}\" target=\"_blank\" rel=\"noopener\">tabelę porównawczą licencji</a> , aby sprawdzić różnice pomiędzy typami licencji.",
    "SelectTargetLicense": "Wybierz Licencję docelową",
    "UpgradePaymentInfoSection_ExtendMyLicenseForOneYear": "Tak, przedłuż datę ważności mojej licencji o 1 rok.",
    "UpgradePaymentInfoSection_WantToExtendLicense": "Czy chcesz przedłużyć licencję na kolejny rok?",
    "UpgradePaymentInfoSection_UpgradingWillNotExtendLicense": "Aktualizacja nie przedłuży daty wygaśnięcia licencji!",
    "UpgradePaymentInfoSection_LicenseUpgradeDescription": "Aktualizując licencję, zostaniesz awansowany na wyższy typ licencji, co pozwoli Ci uzyskać dodatkowe korzyści. Zobacz <a href=\"/Pricing\" target=\"_blank\">tabelę porównawczą licencji</a> , aby sprawdzić różnice pomiędzy typami licencji.",
    "Landing_Page_CustomerStories": "Historie klientów",
    "Landing_Page_OurGreatCustomers": "Nasi Wielcy Klienci",
    "Landing_Page_WebApplicationFramework": "Ramy aplikacji internetowych",
    "Landing_Page_WebDevelopmentPlatform": "Platforma do tworzenia stron internetowych",
    "Landing_Page_CompleteWebDevelopmentPlatform": "Kompletna platforma do tworzenia stron internetowych",
    "Landing_Page_TryFreeDemo": "Wypróbuj bezpłatną wersję demonstracyjną",
    "Landing_Page_StartingPointForWebApplications": "Punkt wyjścia dla aplikacji internetowych opartych na ASP.NET Core! Opiera się na ramach ABP dla najlepszego tworzenia stron internetowych.",
    "Landing_Page_AbpProvidesSoftwareInfrastructure": "ABP Framework zapewnia infrastrukturę oprogramowania do tworzenia doskonałych aplikacji internetowych z najlepszymi praktykami.",
    "Landing_Page_MicroserviceCompatibleArchitecture": "Architektura zgodna z mikrousługami",
    "Landing_Page_PreBuiltApplicationModulesAndThemes": "Gotowe moduły i motywy aplikacji",
    "Landing_Page_MultiTenantArchitecture": "Architektura z wieloma najemcami",
    "Landing_Page_MultiTenancyDescription": "Aplikacje SaaS stają się proste! Zintegrowana obsługa wielu najemców z bazy danych do interfejsu użytkownika.",
    "Landing_Page_DDDIntroduction": "Zaprojektowane i opracowane w oparciu o wzorce i zasady DDD. Zapewnia model warstwowy dla Twojej aplikacji.",
    "Landing_Page_CrossCuttingConcernsInfo": "Kompletna infrastruktura do autoryzacji, walidacji, obsługi wyjątków, buforowania, rejestrowania audytów, zarządzania transakcjami i nie tylko.",
    "Landing_Page_PreBuiltApplicationModules": "Wstępnie zbudowane moduły aplikacji, które obejmują najczęstsze wymagania aplikacji internetowych.",
    "Landing_Page_ChatModule": "Czat",
    "Landing_Page_DocsModule": "Dokumenty",
    "Landing_Page_FileManagementModule": "Zarządzanie plikami",
    "Landing_Page_CustomerStory_1": "Firma ABP Commercial pozwoliła firmie SC Ventures na dostarczenie w ciągu 9 miesięcy platformy SaaS klasy bankowej z silosową bazą danych dla wielu najemców w celu obsługi finansowania łańcucha dostaw należności i zobowiązań w przypadku faktur o znacznej wartości z wielu zintegrowanych kotwic. Modułowość ABP umożliwiła zespołowi dostarczenie produktów w rekordowym czasie, przejście wszystkich testów VAPT i wdrożenie skonteneryzowanego stosu mikrousług za pośrednictwem pełnego CI/CD i potoków do produkcji.",
    "Landing_Page_CustomerStory_2": "Widzimy wartość wykorzystania ABP Commercial w celu zmniejszenia kosztów ogólnych niestandardowych projektów rozwojowych. Zespół może ujednolicić wzorzec kodu w różnych strumieniach projektu. Widzimy w tym frameworku większy potencjał, dzięki któremu możemy tworzyć nowe funkcje szybciej niż wcześniej. Ufamy, że stale będziemy dostrzegać wartość wykorzystania ABP Commercial.",
    "Landing_Page_CustomerStory_3": "Kochamy ABP. Nie musimy pisać wszystkiego od zera. Zaczynamy od gotowych funkcji i skupiamy się na tym, co naprawdę musimy napisać. Ponadto ABP jest dobrze zaprojektowane, a kod jest wysokiej jakości i zawiera mniej błędów. Gdybyśmy musieli sami napisać wszystko, czego potrzebowaliśmy, być może musielibyśmy spędzić na to lata. Jeszcze jedną rzeczą, którą lubimy, jest to, że nowa wersja, rozwiązanie problemu lub ulepszenie pojawia się bardzo szybko \n co dwa tygodnie. Nie czekamy zbyt długo.",
    "Landing_Page_CustomerStory_4": "ABP Commercial to fantastyczny produkt, który polecam. Produkty komercyjne oferowane naszym klientom na jednej konfigurowalnej platformie. Skok zaczyna się od tego, że ramy i narzędzia, które zapewniają każdemu zespołowi, są warte każdego centa. Firma ABP Commercial była najlepiej dopasowana do naszych potrzeb.",
    "Landing_Page_AdditionalServices": "Licencja niestandardowa lub zbiorcza, wdrożenie, szkolenia i wsparcie na żywo, opracowywanie projektów niestandardowych, przenoszenie istniejących projektów i wiele więcej...",
    "Landing_Page_IncludedDeveloperLicenses": "Zawiera <strong>{0}</strong> licencji programisty",
    "Landing_Page_SeeOnDemo": "Zobacz na Demo",
    "Landing_Page_LeptonThemes": "Motywy Leptona",
    "Landing_Page_AccountModuleDescription_1": "Moduł ten implementuje system uwierzytelniania aplikacji;",
    "Landing_Page_AccountModuleDescription_2": "Wyświetla stronę <strong>logowania</strong> zawierającą nazwę użytkownika i hasło",
    "Landing_Page_AccountModuleDescription_3": "Udostępnia stronę <strong>rejestracyjną</strong> umożliwiającą utworzenie nowego konta.",
    "Landing_Page_AccountModuleDescription_4": "Udostępnia stronę <strong>zapomnianego hasła</strong> , na której można wysłać link <strong>do resetowania hasła</strong> w wiadomości e-mail.",
    "Landing_Page_AccountModuleDescription_5": "Zapewnia funkcję <strong>potwierdzania wiadomości e-mail</strong> za pomocą interfejsu użytkownika.",
    "Landing_Page_AccountModuleDescription_6": "Implementuje uwierzytelnianie <strong>dwuskładnikowe</strong> (SMS i e-mail).",
    "Landing_Page_AccountModuleDescription_7": "Implementuje <strong>blokadę użytkownika</strong> (blokuje konto na określony czas, gdy w określonym przedziale czasu nastąpi określona liczba nieudanych logowań z powodu nieprawidłowych danych uwierzytelniających).",
    "Landing_Page_AccountModuleDescription_8": "Implementuje interfejs użytkownika i funkcjonalność serwera uwierzytelniania <strong>Identity Server</strong> .",
    "Landing_Page_AccountModuleDescription_9": "Umożliwia <strong>przełączanie między dzierżawcami</strong> w środowisku z wieloma dzierżawcami.",
    "Landing_Page_AccountModuleDescription_10": "Umożliwia zmianę <strong>języka interfejsu</strong> aplikacji.",
    "Landing_Page_AuditLoggingModuleDescription_1": "Ten moduł udostępnia interfejs użytkownika do raportowania dziennika inspekcji dla infrastruktury inspekcji. Umożliwia wyszukiwanie, filtrowanie i wyświetlanie wpisów dziennika audytu oraz dzienników zmian jednostek.",
    "Landing_Page_AuditLoggingModuleDescription_2": "Wpis dziennika audytu zawiera krytyczne dane dotyczące każdego żądania klienta:",
    "Landing_Page_AuditLoggingModuleDescription_3": "Adres URL, przeglądarka, adres IP, nazwa klienta",
    "Landing_Page_AuditLoggingModuleDescription_4": "Użytkownik",
    "Landing_Page_AuditLoggingModuleDescription_5": "Metoda HTTP, zwrotny kod stanu HTTP",
    "Landing_Page_AuditLoggingModuleDescription_6": "Sukces/porażka, szczegóły wyjątku, jeśli są dostępne",
    "Landing_Page_AuditLoggingModuleDescription_7": "Czas realizacji żądania",
    "Landing_Page_AuditLoggingModuleDescription_8": "Podmioty zostały utworzone, usunięte lub zaktualizowane w tym żądaniu (ze zmienionymi właściwościami).",
    "Landing_Page_BloggingModuleDescription_1": "Ten moduł dodaje prosty blog do aplikacji ABP;",
    "Landing_Page_BloggingModuleDescription_2": "Umożliwia tworzenie wielu blogów w jednej aplikacji.",
    "Landing_Page_BloggingModuleDescription_3": "Obsługuje format Markdown.",
    "Landing_Page_BloggingModuleDescription_4": "Umożliwia napisanie komentarza do wpisu.",
    "Landing_Page_BloggingModuleDescription_5": "Umożliwia przypisywanie tagów do wpisów na blogu.",
    "Landing_Page_BloggingModuleDescription_6": "Zobacz witrynę <a href=\"blog.abp.io\">blog.abp.io</a> jako żywy przykład modułu blogowania.",
    "Landing_Page_ChatModuleDescription_1": "Moduł ten służy do komunikacji w czasie rzeczywistym pomiędzy użytkownikami aplikacji.",
    "Landing_Page_ChatModuleDescription_2": "Wiadomości w czasie rzeczywistym na stronie czatu.",
    "Landing_Page_ChatModuleDescription_3": "Wyszukaj użytkowników w aplikacji pod kątem nowych rozmów.",
    "Landing_Page_ChatModuleDescription_4": "Lista kontaktów dla ostatnich rozmów.",
    "Landing_Page_ChatModuleDescription_5": "Powiadomienia o nowych wiadomościach, gdy użytkownik przegląda inną stronę.",
    "Landing_Page_ChatModuleDescription_6": "Znaczek całkowitej liczby nieprzeczytanych wiadomości na ikonie menu.",
    "Landing_Page_ChatModuleDescription_7": "Liczba nieprzeczytanych wiadomości w każdej rozmowie.",
    "Landing_Page_ChatModuleDescription_8": "Leniwie załadowane rozmowy.",
    "Landing_Page_DocsModuleDescription_1": "Moduł ten służy do tworzenia stron internetowych z dokumentacją techniczną;",
    "Landing_Page_DocsModuleDescription_2": "Wbudowana <strong>integracja z GitHub</strong> : bezpośrednio pisz dokumenty i zarządzaj nimi w GitHub.",
    "Landing_Page_DocsModuleDescription_3": "Obsługa <strong>wersjonowania</strong> bezpośrednio zintegrowana z wydaniami GitHub.",
    "Landing_Page_DocsModuleDescription_4": "Obsługuje <strong>wiele języków</strong> (z możliwością powrotu do języka domyślnego).",
    "Landing_Page_DocsModuleDescription_5": "Obsługuje formaty <strong>Markdown</strong> i HTML.",
    "Landing_Page_DocsModuleDescription_6": "Zawiera <strong>nawigację</strong> i sekcję <strong>konspektu</strong> .",
    "Landing_Page_DocsModuleDescription_7": "Umożliwia przechowywanie dokumentacji <strong>wielu projektów</strong> w jednej aplikacji.",
    "Landing_Page_DocsModuleDescription_8": "Linki do pliku w serwisie GitHub, dzięki czemu każdy może z łatwością współtworzyć plik, klikając <strong>link Edytuj</strong> .",
    "Landing_Page_DocsModuleDescription_9": "Oprócz źródła GitHub, pozwala po prostu użyć folderu jako źródła dokumentacji.",
    "Landing_Page_FileManagementModuleDescription_1": "Przesyłaj, pobieraj i organizuj pliki w hierarchicznej strukturze folderów.",
    "Landing_Page_FileManagementModuleDescription_2": "Moduł ten służy do przesyłania, pobierania i organizowania plików w hierarchicznej strukturze folderów. Jest również kompatybilny z wieloma najemcami i możesz określić całkowity limit wielkości dla swoich najemców.",
    "Landing_Page_FileManagementModuleDescription_3": "Moduł ten oparty jest na systemie <a href=\"https://docs.abp.io/en/abp/latest/Blob-Storing\">BLOB Storing</a> , dzięki czemu może korzystać z usług różnych dostawców Storage do przechowywania zawartości plików.",
    "Landing_Page_IdentityModuleDescription_1": "Moduł ten implementuje system użytkowników i ról aplikacji;",
    "Landing_Page_IdentityModuleDescription_2": "Zbudowany w oparciu o bibliotekę <a href=\"https://docs.microsoft.com/en-us/aspnet/core/security/authentication/identity\">tożsamości ASP.NET Core firmy Microsoft</a> .",
    "Landing_Page_IdentityModuleDescription_3": "Zarządzaj <strong>rolami</strong> i <strong>użytkownikami</strong> w systemie. Użytkownik może pełnić <strong>wiele ról</strong> .",
    "Landing_Page_IdentityModuleDescription_4": "Ustaw <strong>uprawnienia</strong> na poziomach roli i użytkownika.",
    "Landing_Page_IdentityModuleDescription_5": "Włącz/wyłącz <strong>uwierzytelnianie dwuskładnikowe</strong> i <strong>blokadę</strong> użytkownika dla każdego użytkownika.",
    "Landing_Page_IdentityModuleDescription_6": "Zarządzaj podstawowym <strong>profilem użytkownika</strong> i <strong>hasłem</strong> .",
    "Landing_Page_IdentityModuleDescription_7": "Zarządzaj <strong>typami roszczeń</strong> w systemie, przypisuj roszczenia do ról i użytkowników.",
    "Landing_Page_IdentityModuleDescription_8": "Strona ustawień do zarządzania <strong>złożonością haseł</strong> , logowaniem użytkownika, kontem i blokadą.",
    "Landing_Page_IdentityModuleDescription_9": "Obsługuje uwierzytelnianie <strong>LDAP</strong> .",
    "Landing_Page_IdentityModuleDescription_10": "Zapewnia weryfikację <strong>adresu e-mail i numeru telefonu</strong> .",
    "Landing_Page_IdentityModuleDescription_11": "Obsługuje integrację logowania społecznościowego (Twitter, Facebook, GitHub itp.).",
    "Landing_Page_IdentityModuleDescription_12": "Zarządzaj <strong>jednostkami organizacyjnymi</strong> w systemie.",
    "Landing_Page_PaymentModuleDescription_1": "Zapewnia integrację dla różnych bramek płatniczych.",
    "Landing_Page_PaymentModuleDescription_2": "Moduł ten zapewnia integrację z bramkami płatniczymi, dzięki czemu możesz łatwo otrzymać płatność od swoich klientów.",
    "Landing_Page_PaymentModuleDescription_3": "Moduł ten obsługuje następujące bramki płatnicze",
    "Welcome_Page_UseSameCredentialForCommercialWebsites": "Użyj tych samych poświadczeń w plikach <a href=\"https://commercial.abp.io\" class=\"text-primary\">Commercial.abp.io</a> i <a href=\"https://support.abp.io\" class=\"text-primary\">support.abp.io</a> .",
    "WatchCrudPagesVideo": "Obejrzyj film „Tworzenie stron CRUD za pomocą pakietu ABP”!",
    "WatchGeneratingFromDatabaseVideo": "Obejrzyj film „ABP Suite: generowanie stron CRUD z istniejących tabel bazy danych”!",
    "WatchTakeCloserLookVideo": "Obejrzyj film „Przyjrzyj się bliżej generowaniu kodu: ABP Suite”!",
    "ConfirmedEmailAddressRequiredToStartTrial": "Aby rozpocząć licencję próbną, musisz mieć potwierdzony adres e-mail.",
    "EmailVerificationMailNotSent": "Nie udało się wysłać wiadomości weryfikacyjnej e-mail.",
    "GetConfirmationEmail": "<a href=\"javascript:void(0);\" id=\"{0}\" class=\"text-decoration-underline\">Kliknij tutaj, aby otrzymać e-mail weryfikacyjny,</a> jeśli jeszcze go nie otrzymałeś.",
    "WhichLicenseTypeYouAreInterestedIn": "Jaki typ licencji Cię interesuje?",
    "DontTakeOurWordForIt": "Nie wierz nam na słowo...",
    "ReadAbpCommercialUsersWantYouToKnow": "Przeczytaj, co użytkownicy ABP Commercial chcą, abyś wiedział",
    "Testimonial_ShortDescription_1": "Modułowość ABP umożliwiła zespołowi realizację dostaw na czas.",
    "Testimonial_ShortDescription_2": "Twórz nowe funkcje szybciej niż wcześniej.",
    "Testimonial_ShortDescription_3": "Zaczynamy od gotowych funkcji i skupiamy się na tym, co naprawdę musimy napisać.",
    "Testimonial_ShortDescription_4": "Firma ABP Commercial była najlepiej dopasowana do naszych potrzeb.",
    "OnlineReviewersOnAbpCommercial": "Recenzje online na temat reklamy ABP",
    "SeeWhatToldAboutAbpCommercial": "Zobacz, co powiedziano o ABP Commercial i napisz, co myślisz, jeśli chcesz.",
    "BlazoriseLicense": "Czy musimy kupić licencję Blazorise?",
    "BlazoriseLicenseExplanation": "Mamy umowę pomiędzy Volosoft i Megabit, na mocy tej umowy licencja Blazorise jest dołączona do produktów ABP Commercial, dlatego nasi klienci nie muszą kupować dodatkowej licencji Blazorise.",
    "ExtendPaymentInfoSection_DeveloperPrice": "{0}x Dodatkowi programiści",
    "ExtendPaymentInfoSection_DiscountRate": "Rabat {0}%",
    "TotalNetPrice": "Łączna cena netto",
    "EFCore": "Rdzeń Entity Framework",
    "All": "Wszystko",
    "Mvc": "MVC",
    "DataBaseProvider": "Dostawca danych",
    "UIFramework": "Struktura interfejsu użytkownika",
    "LeptonXThemeForDashboard": "Motyw LeptonX dla Twojego panelu administracyjnego autorstwa",
    "AbpPlatform": "Platforma ABP",
    "YouDeserveGoodUXUI": "Zasługujesz na dobry interfejs użytkownika i lepszy UX. Motyw LeptonX firmy ABP jest tutaj, aby mu służyć.",
    "ViewLiveDemo": "Zobacz prezentację motywu na żywo",
    "GetLeptonX": "Kup LeptonX teraz",
    "SeeLeptonXDocumentation": "Zobacz dokumentację LeptonX",
    "SeeLeptonDocumentation": "Zobacz dokumentację Leptona",
    "SimplifiedMenu": "Uproszczone menu",
    "SimplifiedMenuDescription": "Możesz łatwo znaleźć stronę, której szukasz, filtrując menu",
    "YourFavoritePages": "Twoje ulubione strony w zasięgu ręki",
    "YourFavoritePagesDescription": "Z łatwością dodaj lub usuń stronę z ulubionych, klikając ikonę gwiazdki w prawym górnym rogu strony.",
    "BreadCrumbs": "Breadcrumb dla płynnego przełączania",
    "BreadCrumbsDescription": "Korzystając z Breadcrumb, jednym kliknięciem możesz przełączać się na strony na tym samym poziomie, nawet gdy lewe menu jest zamknięte, a wszystko działa responsywnie na tabletach i urządzeniach mobilnych!",
    "YourMenu": "Twoje menu, jak chcesz",
    "YourMenuDescription": "Dostosuj bezpośrednio klikalne ikony i pola rozwijane w menu użytkownika według własnego uznania. Menu użytkownika można w pełni dostosować do swoich potrzeb",
    "RtlSupport": "Obsługa RTL dla Twojego języka",
    "RtlSupportDescription": "Motyw LeptonX obsługuje RTL dla Twojego języka. Opcje językowe znajdują się w menu ustawień i umożliwiają zmianę języka.",
    "YourColors": "Twoje kolory w interfejsie panelu administracyjnego",
    "YourColorsDescription": "Motyw LeptonX działa zgodnie z preferencjami systemowymi i zawiera opcje jasnego motywu deski rozdzielczej, ciemnego motywu deski rozdzielczej i półciemnego motywu deski rozdzielczej.",
    "ArrangeContentWidth": "Z łatwością dopasuj szerokość treści",
    "ArrangeContentWidthDescription": "Z łatwością zmieniaj szerokość obszaru zawartości.",
    "LeptonXCompatibleWith": "Motyw LeptonX jest kompatybilny z",
    "MobileResponsiveTemplate": "Szablon responsywny na urządzenia mobilne",
    "MobileResponsiveTemplateDescription1": "Uzyskaj dostęp do panelu administracyjnego LeptonX z dowolnego urządzenia.",
    "MobileResponsiveTemplateDescription2": "Został zaprojektowany tak, aby można go było łatwo używać na każdym urządzeniu. Jest responsywny na urządzeniach mobilnych i rozmiarach tabletów.",
    "TopMenuLayoutOption": "Opcja układu górnego menu",
    "TopMenuLayoutOptionDescription1": "Jeśli chcesz skonfigurować swoją witrynę internetową z tym samym panelem administracyjnym, możesz to zrobić za pomocą motywu LeptonX!",
    "TopMenuLayoutOptionDescription2": "Po prostu wypróbuj układ górnego menu LeptonX, aby to osiągnąć!",
    "EasilyCustomizable": "Możliwość łatwego dostosowania kolorów Twojej marki",
    "EasilyCustomizableDescription1": "Możesz dostosować motyw LeptonX za pomocą zaledwie kilku zmiennych SCSS. Bez zastępowania, bez dodatkowego ładowania CSS!",
    "EasilyCustomizableDescription2": "Dzięki LeptonX możesz ustawić swój pulpit administracyjny w dowolny sposób.",
    "IndependentLayout": "Niezależny układ i obszar treści",
    "IndependentLayoutDescription1": "Infrastruktura układu LeptonX została zaprojektowana całkowicie niezależnie od treści.",
    "IndependentLayoutDescription2": "Oznacza to, że jeśli chcesz, możesz dowolnie projektować swój projekt ze strukturą treści inną niż Bootstrap.",
    "MostUsedLibraries": "Najczęściej używane biblioteki zintegrowane z LeptonX",
    "MostUsedLibrariesDescription1": "LeptonX zawiera najczęściej używane biblioteki. Umożliwia bezproblemowe korzystanie z bibliotek takich jak ApexCharts, DataTables, DropZone, FullCalender, JSTree, Select2 i Toastr.",
    "MostUsedLibrariesDescription2": "LeptonX obsługuje także biblioteki specyficzne dla MVC Angular i Blazor.",
    "CreateAndCustomize": "Twórz i dostosowuj potrzebne strony w ciągu kilku sekund dzięki niestandardowym stronom LeptonX",
    "CreateAndCustomizeDescription": "Korzystając z motywu LeptonX, masz także dostęp do wielu gotowych stron HTML. Należą do nich wiele stron, takich jak strona logowania, blog, często zadawane pytania, lista subskrypcji, faktura, ceny i zarządzanie plikami.",
    "LeptonThemeForAdmin": "Motyw Lepton dla panelu administracyjnego autorstwa",
    "LeptonThemeForAdminDescription": "Motyw Lepton jest nadal dostępny i będzie utrzymywany. Jeśli chcesz przełączyć się na LeptonX Theme jako użytkownik Lepton Theme, możesz zapoznać się z dokumentacją, aby dowiedzieć się, jak to zrobić.",
    "LeptonCompatibleWith": "Motyw Lepton jest kompatybilny z",
    "BlackFridayDiscount": "Zniżka Black Friday",
    "UpgradePaymentInfoSection_DeveloperPrice": "{0} dla {1} dodatkowych programistów",
    "Upgrade": "Aktualizacja",
    "Renewal": "Odnowienie",
    "UpgradePaymentInfoSection_LicensePrice": "licencja {0}",
    "UpgradePaymentInfoSection_LicenseRenewalPrice": "Odnowienie licencji",
    "Total": "Całkowity",
    "SupportPolicyFaqTitle": "Jaka jest Twoja polityka wsparcia?",
    "SupportPolicyFaqExplanation": "Obsługujemy tylko wersję aktywną i poprzednią wersję główną. Nie gwarantujemy wydania łatki dla trzeciej i starszych wersji głównych. Na przykład, jeśli aktywna wersja to 7.0.0, wydamy łatki zarówno dla 6.xx, jak i 7.xx. Poza tym zapewniamy wsparcie tylko dla problemów związanych z ABP Framework i ABP Commercial. Oznacza to, że nie jest zapewnione wsparcie dla aplikacji innych firm, usług w chmurze i innych bibliotek peryferyjnych używanych przez produkty ABP. Dołożymy uzasadnionych handlowo starań, aby zapewnić naszym klientom wsparcie techniczne w oficjalnych godzinach pracy „Volosoft Bilisim AS”. Z drugiej strony nie zobowiązujemy się do przestrzegania umowy o poziomie usług (SLA), ale postaramy się odpowiedzieć na problemy techniczne tak szybko, jak to możliwe, w naszych oficjalnych godzinach pracy. O ile nie zostanie zawarta specjalna umowa z klientem, wsparcie zapewniamy wyłącznie pod adresem https://support.abp.io. Oferujemy także prywatną pomoc e-mailową, dostępną wyłącznie dla posiadaczy licencji Enterprise.",
    "TotalDevelopers": "Razem {0} programistów",
    "CustomPurchaseExplanation": "Dostosowane do Twoich konkretnych potrzeb",
    "WhereDidYouHearAboutUs": "Gdzie o nas usłyszałeś?",
    "Twitter": "Świergot",
    "Facebook": "Facebook",
    "Youtube": "Youtube",
    "Google": "Google",
    "Github": "GitHub",
    "Friend": "Od przyjaciela",
    "Other": "Inny",
    "WhereDidYouHearAboutUs_explain": "Określ...",
    "DeletingMemberWarningMessage": "„{0}” zostanie usunięty z listy programistów. Jeśli chcesz, możesz później przypisać to puste miejsce innemu programiście.",
    "AdditionalInfo": "Jeśli liczba stanowisk programistów przekracza Twoje wymagania, możesz je zmniejszyć. Możesz wysłać e-mail na <a href=\"mailto:info@abp.io\">adres info@abp.io</a> , aby usunąć część swoich stanowisk programistów. Usunięcie niewykorzystanych stanowisk programistów obniży koszt odnowienia licencji. Jeśli chcesz, możesz ponownie kupić dodatkowe stanowiska programisty w ramach aktywnego okresu licencji. Należy pamiętać, że ponieważ w tym pakiecie licencji znajduje się {0} programistów, nie można zmniejszyć tej liczby.",
    "LinkExpiredErrorMessage": "Link, do którego próbujesz uzyskać dostęp, wygasł.",
    "ExpirationDate": "Termin ważności",
    "SpringCampaignDiscount": "Rabat na kampanię wiosenną",
    "WhyUseAbpIoPlatform": "Dlaczego warto skorzystać z Platformy ABP.IO, zamiast tworzyć nowe rozwiązanie od podstaw?",
    "WhyUseAbpIoPlatformFaqExplanation": "Zobacz <a href=\"/why-abp-io \">tę stronę</a> , aby uzyskać szczegółowe wyjaśnienie, dlaczego korzystanie z platformy ABP.IO ma znaczną przewagę nad robieniem wszystkiego samodzielnie.",
    "EulaPageTitle": "Umowa licencyjna użytkownika końcowego (EULA)",
    "PrivacyPolicyPageTitle": "Polityka Prywatności - Polityka Cookies",
    "TermsConditionsPageTitle": "Regulamin",
    "TrainingsPageTitle": "Pakiety szkoleniowe ABP",
    "ModulesPageTitle": "Gotowe moduły aplikacji ABP",
    "Volo.AbpIo.Commercial:040001": "Klucz dostępu API jest nieprawidłowy.",
    "GetLepton": "Zdobądź Lepton teraz",
    "MyOrganizations_Detail_LicenseStartDate": "Data rozpoczęcia licencji",
    "MyOrganizations_Detail_LicenseExpiryDate": "Data wygaśnięcia",
    "BlazoriseSupport": "Jak uzyskać klucz licencyjny Blazorise i pomoc techniczną od zespołu Blazorise?",
    "BlazoriseSupportExplanation": "Wykonaj poniższe kroki, aby uzyskać pomoc od zespołu Blazorise i otrzymać klucz licencyjny Blazorise:",
    "BlazoriseSupportExplanation1": "Zarejestruj nowe konto na <a href=\"https://blazorise.com/support/register\">blazorise.com/support/register</a> , używając tego samego adresu e-mail, co Twoje konto abp.io. Pozostaw pusty wpis „Klucz licencyjny”. <strong>Musi to być ten sam adres e-mail, co Twoje konto e-mail na abp.io.</strong>",
    "BlazoriseSupportExplanation2": "Zweryfikuj swój adres e-mail, zaznaczając swoją skrzynkę e-mail. Sprawdź skrzynkę ze spamem, jeśli nie widzisz wiadomości e-mail w swojej skrzynce odbiorczej!",
    "BlazoriseSupportExplanation3": "Zaloguj się na stronie pomocy technicznej Blazorise pod <a href=\"https://blazorise.com/support/login\">adresem blazorise.com/support/login</a> .",
    "BlazoriseSupportExplanation4": "Jeśli posiadasz aktywną licencję ABP Commercial, będziesz mieć również licencję Blazorise PRO. Klucz licencyjny Blazorise możesz uzyskać na <a href=\"https://blazorise.com/support/user/manage/license\">stronie blazorise.com/support/user/manage/license</a> .",
    "BlazoriseSupportExplanation5": "Możesz zamieścić swoje pytania na stronie pomocy technicznej i wygenerować token produktu dla swojej aplikacji.",
    "AbpLiveTrainingPackages": "Pakiety szkoleniowe na żywo ABP",
    "Releases": "Wydania",
    "ReleasesDescription": "Dzienniki wydań programu ABP Commercial.",
    "ReleaseDate": "Data wydania",
    "Labels": "Etykiety",
    "PreRelease": "Wersja przedpremierowa",
    "AllTypes": "Wszystkie typy",
    "Enhancement": "Wzmocnienie",
    "Bug": "Błąd",
    "Feature": "Funkcja",
    "AllUIs": "Wszystkie interfejsy użytkownika",
    "MVC": "MVC",
    "BlazorServer": "Serwer Blazora",
    "MAUI": "MAUI",
    "HowItWorks_Page_Title": "Jak to działa?",
    "HowItWorks_Page_Description": "ABP Framework rozszerza platformę .NET. Zatem wszystko, co można zrobić za pomocą zwykłego rozwiązania .NET, jest już możliwe dzięki ABP Framework. Ułatwia to rozpoczęcie pracy z niską krzywą uczenia się.",
    "HowItWorks_Description1": "ABP Framework rozszerza platformę .NET. Zatem wszystko, co można zrobić za pomocą zwykłego rozwiązania .NET, jest już możliwe dzięki ABP Framework. Ułatwia to rozpoczęcie pracy z niską krzywą uczenia się.",
    "HowItWorks_Description2": "Gdy zaczniesz uczyć się i korzystać z funkcji ABP Framework, tworzenie oprogramowania będzie znacznie przyjemniejsze niż kiedykolwiek.",
    "HowItWorks_Description3": "Ta strona w zasadzie wyjaśnia, w jaki sposób korzystasz z platformy ABP.IO jako programista .NET.",
    "CreateANewSolution": "Utwórz nowe rozwiązanie .NET",
    "CreateANewSolution_Description1": "Wszystko zaczyna się od stworzenia nowego, zintegrowanego rozwiązania ABP .NET.",
    "StartWithStartupTemplates": "Uruchom jeden z gotowych <a href=\"/startup-templates\">szablonów rozwiązań startowych</a>",
    "SimpleMonolithApplicationTemplate": "Prosty szablon aplikacji monolitu",
    "LayeredApplicationTemplate": "Warstwowy szablon aplikacji",
    "MicroserviceSolutionTemplate": "Szablon rozwiązania mikrousług",
    "CreateEmptySolutionAndUseAbp": "Lub utwórz nowe, puste rozwiązanie .NET i samodzielnie zainstaluj <a href=\"https://abp.io/packages\" target=\"_blank\">pakiety</a> ABP NuGet i NPM.",
    "CreatingSolutionWithMultipleOptions": "Podczas tworzenia nowego rozwiązania dostępnych jest wiele opcji interfejsu użytkownika i bazy danych.",
    "UIFrameworkOptions": "Opcje struktury interfejsu użytkownika",
    "DotnetSolutionWithoutDependency": "Teraz masz zwykłe rozwiązanie .NET na swoim komputerze lokalnym, które nie jest zależne od platformy w chmurze ani usługi zewnętrznej.",
    "CheckTheDocumentForDetails": "Aby uzyskać szczegółowe informacje, możesz sprawdzić dokument <a href=\"{0}\" target=\"_blank\">{1}</a> .",
    "UIAndDatabaseIndependent": "ABP może współpracować z dowolnym interfejsem użytkownika i dowolnym dostawcą bazy danych obsługiwanym przez platformę .NET. \n Jednakże ci dostawcy interfejsu użytkownika i baz danych są wstępnie zintegrowani i dobrze udokumentowani.",
    "InstallAbpModules": "Zainstaluj moduły ABP",
    "DevelopYourSolution": "Opracuj swoje rozwiązanie",
    "DeployAnywhere": "Wdrażaj gdziekolwiek",
    "InstallAbpModule_Description1": "ABP to modułowa platforma do tworzenia aplikacji. Szablony rozwiązań startowych są już dostarczane z zainstalowanymi niezbędnymi modułami. \n Istnieje jednak więcej modułów aplikacji, których możesz chcieć użyć w swoim rozwiązaniu.",
    "InstallAbpModule_Description2": "Każdy moduł składa się z kilku pakietów NuGet i NPM oraz posiada dokument instalacyjny. <a href=\"/tools/suite\">Pakiet ABP Suite</a> wykonuje większość pracy automatycznie, następnie użytkownik ręcznie konfiguruje lub dostraja moduł w oparciu o jego dokumentację.",
    "DevelopYourSolution_Description1": "Infrastruktura ABP pozwala <b class=\"text-white\">skupić się na własnym kodzie biznesowym,</b> automatyzując powtarzalną pracę i udostępniając wstępnie zbudowaną infrastrukturę i <a href=\"https://abp.io/features\" target=\"_blank\">funkcje</a> aplikacji.",
    "DevelopYourSolution_Description2": "W poniższym bloku kodu możesz zobaczyć, jak struktura ABP płynnie integruje się z Twoim kodem i automatyzuje za Ciebie powtarzalne zadania.",
    "DevelopYourSolution_Description3": "Nawet w tym bloku krótkiego kodu ABP robi za Ciebie wiele rzeczy.",
    "DevelopYourSolution_Description4": "Zapewnia klasy bazowe do stosowania konwencji, takich jak <a href=\"https://docs.abp.io/en/abp/latest/Dependency-Injection\" target=\"_blank\">wstrzykiwanie zależności</a> \n . Ogólne usługi <a href=\"https://docs.abp.io/en/abp/latest/Repositories\" target=\"_blank\">repozytorium</a> \n zapewniają wygodny sposób interakcji z bazą danych \n . Deklaratywna <a href=\"https://docs.abp.io/en/abp/latest/Authorization\" target=\"_blank\">autoryzacja</a> \n współpracuje z precyzyjnie dostosowanym systemem uprawnień.",
    "DevelopYourSolution_Description5": "ABP całkowicie automatyzuje <a href=\"https://docs.abp.io/en/abp/latest/Unit-Of-Work\" target=\"_blank\">jednostkę pracy</a> \n (do połączenia z bazą danych i zarządzania transakcjami), <a href=\"https://docs.abp.io/en/abp/latest/Exception-Handling\" target=\"_blank\">obsługę wyjątków</a> \n , <a href=\"https://docs.abp.io/en/abp/latest/Validation\" target=\"_blank\">sprawdzanie poprawności</a> \n \n i <a href=\"https://docs.abp.io/en/abp/latest/Audit-Logging\" target=\"_blank\">rejestrowanie audytu</a> . Zapewnia o wiele więcej elementów konstrukcyjnych, które upraszczają codzienne zadania programistyczne i skupiają się na własnym kodzie podczas tworzenia gotowych do produkcji aplikacji \n .",
    "DevelopYourSolution_Description6": "Możesz sobie wyobrazić, jak bardzo długi i skomplikowany może być ten blok kodu, jeśli zrobisz to wszystko ręcznie.",
    "SuiteCrudGenerationInFewSeconds": "Oprócz ręcznego kodowania rozwiązania, możesz w ciągu kilku minut utworzyć w pełni działające, zaawansowane strony CRUD, korzystając z narzędzi pakietu ABP Suite. Generuje kod w rozwiązaniu, dzięki czemu można go dostosować w oparciu o niestandardowe wymagania.",
    "DeployAnywhere_Description1": "Ostatecznie masz rozwiązanie oparte wyłącznie na platformie .NET. Możesz wdrożyć swoje rozwiązanie na własnym serwerze, na platformie chmurowej, w Kubernetesie lub gdziekolwiek chcesz. Możesz wdrożyć na dowolnej liczbie serwerów. ABP to narzędzie niezależne od środowiska wdrażania.",
    "ExpertiseAbpFramework": "Znajomość ram ABP",
    "ExpertiseAbpFramework_Description1": "Chcesz wyjść poza podstawy i zdobyć wiedzę dzięki platformie ABP.IO?",
    "FreeDownload": "Darmowe pobieranie",
    "Read": "Czytać",
    "HavingTrouble": "Mieć problemy?",
    "HavingTrouble_Description1": "Masz problemy z opracowaniem swojego rozwiązania? Jesteśmy tutaj! Skorzystaj z platformy wsparcia ABP \n lub wyślij e-mail, aby uzyskać pomoc bezpośrednio od członków zespołu Core ABP Framework.",
    "WeAreHereToHelp_Description1": "Możesz przeglądać nasze tematy pomocy, przeszukiwać często zadawane pytania, \n lub zadać nam pytanie korzystając z formularza kontaktowego.",
    "OtherModules": "Inne moduły",
    "OtherModules_Description1": "Konto, rejestrowanie audytu, czat, zestaw CMS, zarządzanie plikami, formularze, RODO, tożsamość, zarządzanie językiem, płatności, Saas i więcej...",
    "HowItWorks_DatabaseProviderOptions": "Opcje dostawcy bazy danych",
    "SeeFAQ": "Zobacz często zadawane pytania",
    "ReleaseLogs": "Dzienniki wydań",
    "ReleaseLogs_Tag": "{0} Dzienniki wydań",
    "ReleaseLogs_Pr": "Żądanie ściągnięcia nr{0} - {1}",
    "NoLabels": "Brak etykiet",
    "DoesTheSubscriptionRenewAutomatically": "Czy subskrypcja odnawia się automatycznie?",
    "DoesTheSubscriptionRenewAutomaticallyExplanation": "ABP Commercial nie ma modelu rozliczeniowego automatycznego odnawiania. Dlatego <strong>Twoja subskrypcja nie zostanie automatycznie odnowiona</strong> po zakończeniu okresu licencji. Jeśli chcesz nadal korzystać z zalet programu ABP Commercial, musisz go ręcznie odnowić na <a href=\"/my-organizations\">stronie zarządzania organizacją</a> . Jeśli masz wiele organizacji, kliknij przycisk „Zarządzaj” przy wygasającej organizacji, a następnie kliknij przycisk „Przedłuż teraz”, aby odnowić licencję. Możesz także zapoznać się z sekcją <a href=\"/faq#what-happens-when-license-ends\">Co się stanie, gdy wygaśnie moja licencja?</a> Sekcja.",
    "ExtraQuestionCreditsFaqTitle": "Czy mogę kupić dodatkowe kredyty na pytania do pomocy technicznej?",
    "ExtraQuestionCreditsFaqExplanation": "Tak, możesz. Aby kupić dodatkowe punkty za pytania, wyślij wiadomość e-mail na <a href=\"mailto:info@abp.io\">adres info@abp.io</a> , podając nazwę swojej organizacji. Oto cennik dodatkowych punktów za pytania:<ul><li> Pakiet 50 pytań o wartości 999 USD</li><li> Pakiet 25 pytań o wartości 625 USD</li><li> Pakiet 15 pytań o wartości 450 USD</li></ul>",
    "AlreadyBetaTester": "Dołączyłeś już do programu beta testerów.",
    "AbpStudio": "Studio ABP",
    "AbpStudio_Description": "ABP Studio jest wciąż w fazie rozwoju. Możesz wypełnić poniższy formularz i zostać jednym z pierwszych użytkowników.",
    "AbpStudio_Description1": "ABP Studio to <span class=\"text-highlight-white\">wieloplatformowa aplikacja komputerowa</span> dla programistów ABP.",
    "AbpStudio_Description2": "Jest <span class=\"text-highlight-white\">dobrze zintegrowany</span> ze strukturą ABP i ma na celu zapewnienie wygodnego środowiska programistycznego poprzez <span class=\"text-highlight-white\">automatyzację działań, dostarczanie wglądu</span> w rozwiązanie, <span class=\"text-highlight-white\">dzięki czemu opracowywanie, uruchamianie</span> i <span class=\"text-highlight-white\">wdrażanie</span> rozwiązań jest znacznie łatwiejsze.",
    "AbpStudio_ComingSoon": "Już wkrótce <span class=\"opacity-50 ms-0 ms-md-3 d-block d-md-inline-block \">Planowana data wydania wersji beta: czwarty kwartał 2023 r.</span>",
    "AbpStudio_PlannedPreviewDate": "Planowana data premiery wersji zapoznawczej: czwarty kwartał 2023 r.",
    "BetaRequest": "Prośba o wersję beta",
    "CreateNewSolutions": "Twórz nowe rozwiązania",
    "CreateNewSolutions_Description1": "Dzięki wielu opcjom możesz łatwo tworzyć od prostych aplikacji po modułowe rozwiązania monolitowe lub mikrousługowe. Otrzymujesz w pełni gotowe do produkcji oprogramowanie bazowe dla swojej firmy.",
    "ArchitectYourSolutions": "Zaprojektuj swoje rozwiązania",
    "ArchitectYourSolutions_Description1": "Łatwiej buduj struktury rozwiązań monolityczno-modułowych i mikrousługowych, tworząc moduły lub usługi i ustanawiając relacje między nimi. Możesz także zainstalować lub odinstalować gotowe moduły aplikacji.",
    "ExploreYourSolution": "Poznaj swoje rozwiązanie",
    "ExploreYourSolution_Description1": "ABP Studio pokazuje ogólny widok komponentów Twojego rozwiązania i modułów, od których zależy Twoje rozwiązanie. Możesz eksplorować encje, usługi, interfejsy API HTTP i wiele więcej bez konieczności otwierania bazy kodu.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze": "Błyskawicznie uruchamiaj rozwiązania wieloaplikacyjne lub mikrousługowe",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description1": "Uruchom jedną, <span class=\"text-highlight-white\">wiele</span> lub <span class=\"text-highlight-white\">wszystkie usługi</span> jednym kliknięciem. W ten sposób bardzo łatwo jest zatrzymać usługę, uruchomić ją w Visual Studio w celu <span class=\"text-highlight-white\">przetestowania</span> lub <span class=\"text-highlight-white\">debugowania</span> .",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description2": "Zobacz listę usług, wyświetl <span class=\"text-highlight-white\">liczbę żądań HTTP w czasie rzeczywistym</span> i <span class=\"text-highlight-white\">liczbę wyjątków</span> dla każdej usługi.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description3": "Zobacz wszystkie szczegóły wszystkich <span class=\"text-highlight-white\">żądań HTTP</span> przychodzących do dowolnej usługi.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description4": "Przeglądaj <span class=\"text-highlight-white\">szczegóły wyjątków</span> w czasie rzeczywistym w dowolnej usłudze, łatwo filtruj i wyszukuj.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description5": "Pokaż <span class=\"text-highlight-white\">logi aplikacji</span> , filtruj według poziomu dziennika lub szukaj według tekstu..",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description6": "<span class=\"text-highlight-white\">Przeglądaj</span> interfejs użytkownika aplikacji bez opuszczania modułu uruchamiającego rozwiązanie.",
    "IntegrateToYourKubernetesCluster": "Zintegruj się ze swoim klastrem Kubernetes",
    "IntegrateToYourKubernetesCluster_Description1": "<span class=\"text-highlight-white\">Połącz swoje lokalne środowisko programistyczne z lokalnym lub zdalnym klastrem Kubernetes</span> , w którym na tym klastrze działa już Twoje rozwiązanie mikrousług.",
    "IntegrateToYourKubernetesCluster_Description2": "Uzyskaj dostęp do dowolnej usługi w Kubernetes z nazwą usługi jako DNS, tak jak są one uruchomione na Twoim komputerze lokalnym.",
    "IntegrateToYourKubernetesCluster_Description3": "<span class=\"text-highlight-white\">Przechwyć dowolną usługę</span> w tym klastrze, aby cały <span class=\"text-highlight-white\">ruch do przechwyconej usługi był automatycznie przekierowywany do usługi</span> działającej na komputerze lokalnym. Gdy Twoja usługa musi skorzystać z dowolnej usługi w Kubernetes, ruch jest przekierowywany z powrotem do klastra, tak jak Twoja usługa lokalna działa w Kubernetes.",
    "GetInformed": "Zostać poinformowany",
    "Studio_GetInformed_Description1": "Zostaw swoje dane kontaktowe, aby <span class=\"text-highlight-white\">uzyskać informacje</span> i <span class=\"text-highlight-white\">wypróbuj najpierw</span> po uruchomieniu ABP Studio.",
    "Studio_GetInformed_Description2": "Planowana data premiery wersji zapoznawczej: trzeci kwartał 2023 r.",
    "ThankYou!": "Dziękuję!",
    "SendBetaRequest": "Wyślij prośbę o wersję beta",
    "YouJoinedTheBetaTesterProgram": "Dołączyłeś do programu beta testerów ABP Studio.",
    "PricingExplanation2": "30-dniowa gwarancja zwrotu pieniędzy — <a href=\"/faq#refund-policy\">Dowiedz się więcej</a>",
    "MoneyBackGuaranteeText": "* 30-dniowa gwarancja zwrotu pieniędzy na wszystkie licencje! 100% zwrotu w przypadku licencji Team, 60% zwrotu w przypadku licencji Business i Enterprise w ciągu 30 dni.",
    "MobileApplicationStartupTemplates": "Szablony uruchamiania aplikacji mobilnych",
    "MobileApplicationStartupTemplates_Description1": "Zintegrowane szablony startowe aplikacji mobilnych dla rozwiązań ABP Commercial.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates": "Twórz zaawansowane aplikacje biznesowe, korzystając z szablonów startowych ABP Mobile",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description1": "ABP Commercial udostępnia dwa szablony uruchamiania aplikacji mobilnych zaimplementowane przy użyciu <span class=\"text-highlight\">React Native</span> i <span class=\"text-highlight\">.NET MAUI.</span> Kiedy utworzysz nowe rozwiązanie oparte na ABP, będziesz mieć również podstawowe aplikacje startowe podłączone do interfejsów API zaplecza.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description2": "Aplikacja ma wbudowany cykl tokenów uwierzytelniających, <span class=\"text-highlight\">obsługę wielu języków, obsługę wielu dzierżawców, logowanie, zapomniałem hasła, zarządzanie profilami i stronę zarządzania użytkownikami</span> . Możesz dodać własną logikę biznesową i dostosować ją do swoich wymagań.",
    "TwoFrameworkOptions": "Dwie opcje ramowe",
    "TwoFrameworkOptions_Description": "ABP udostępnia szablony uruchamiania mobilnego zarówno <span class=\"text-highlight\">React Native</span> , jak i <span class=\"text-highlight\">.NET MAUI</span> . W ten sposób możesz wybrać ten, który najlepiej odpowiada Twoim potrzebom. Obie aplikacje ponownie wykorzystują kod z największą szybkością między platformami iOS i Android.",
    "PreIntegratedToYourBackend": "Wstępnie zintegrowany z Twoim backendem",
    "PreIntegratedToYourBackend_Description": "Aplikacje mobilne ABP są wstępnie zintegrowane z interfejsami API zaplecza. Otrzymuje ważny token uwierzytelniający z serwera i wysyła uwierzytelnione żądania.",
    "MultiLanguage": "Wielojęzyczny",
    "MultiLanguage_Description": "Od razu po wyjęciu z pudełka obsługuje już ponad 10 języków. Możesz także dodawać kolejne języki.",
    "Arabic": "arabski",
    "Czech": "Czech",
    "English": "język angielski",
    "Hungarian": "język węgierski",
    "Finnish": "fiński",
    "French": "Francuski",
    "Hindi": "hinduski",
    "Portuguese": "portugalski",
    "Italian": "Włoski",
    "Russian": "Rosyjski",
    "Slovak": "słowacki",
    "Turkish": "turecki",
    "EngageAndRetainYourCustomersWithABPMobileApps": "Angażuj i utrzymuj swoich klientów dzięki aplikacjom mobilnym ABP",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description1": "Twoi klienci chcą zarządzać swoimi produktami i subskrypcjami z dowolnego miejsca i o każdej porze. Wymaga to od organizacji tworzenia aplikacji mobilnych, które umożliwią klientom szybką i bezproblemową realizację ich żądań.",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description2": "Dzięki aplikacjom mobilnym ABP możesz tworzyć wysokiej jakości natywne aplikacje mobilne na Androida i iOS… Używając jednej bazy kodu i bez uszczerbku dla bezpieczeństwa, jakości i skalowalności.",
    "OneCodeBaseMultipleDevices": "Jedno urządzenie oparte na kodzie i wiele urządzeń",
    "OneCodeBaseMultipleDevices_Description": "Aplikacje ABP Mobile są wieloplatformowe. Są gotowe do zainstalowania i uruchomienia na urządzeniach z systemem iOS i Android oraz dostosowują się do różnych formatów przy użyciu jednej bazy kodu. Programiści muszą tylko raz utworzyć interfejs użytkownika i kod front-end, nie ma potrzeby dostosowywania kodu dla każdego urządzenia, które chcesz obsługiwać.",
    "ComesWithTheSourceCode": "W zestawie z kodem źródłowym",
    "ComesWithTheSourceCode_Description": "Aplikacje mobilne dostarczane są z kodem źródłowym. Z łatwością dostosuj UX/UI swoich aplikacji, aby spełniały wytyczne dotyczące marki.",
    "Purchase_OneYearPrice": "Cena za 1 rok",
    "Purchase_DeveloperSeatCount": "Liczba miejsc programisty",
    "Purchase_DevelopersAlreadyIncluded": "Uwzględniono już {0} programistów",
    "1Year": "1 rok",
    "{0}Years": "{0} lat",
    "1YearLicense": "Licencja na 1 rok",
    "{0}YearsLicense": "Licencja na {0} lat",
    "1AdditionalDeveloper": "1 dodatkowy programista",
    "{0}AdditionalDevelopers": "{0} Dodatkowi programiści",
    "Discount": "Rabat ({0}%)",
    "Summary": "Streszczenie",
    "TrainingPack": "Pakiet szkoleniowy",
    "TrainingPackDiscount": "Zniżka na pakiet szkoleniowy",
    "Purchase_OnboardingTraining_Description": "Ten pakiet szkoleń na żywo jest ważny dla klasy składającej się z 8 uczniów, a zniżka obowiązuje tylko w przypadku zakupu z nową licencją. <a href=\"{0}\" class=\"text-white\">Ucz się więcej<i class=\"fa fa-external-link ms-1\"></i></a>",
    "Purchase_Save": "{0}% <span class=\"save ms-1\">oszczędności {1} {2}</span>",
    "RemoveBasket": "Usuń z koszyka",
    "WhyABPIOPlatform?": "Dlaczego <span class=\"gradient-commercial\">platforma ABP.IO</span> ?",
    "DocumentAim": "Celem tego dokumentu jest udzielenie odpowiedzi na najważniejsze pytanie:",
    "DocumentAim_Description": "„Dlaczego warto skorzystać z Platformy ABP.IO zamiast tworzyć nowe rozwiązanie od podstaw?”",
    "DocumentAim_Description2": "Dokument przedstawia wyzwania związane z budowaniem nowoczesnego oprogramowania i wyjaśnia, w jaki sposób ABP radzi sobie z tymi wyzwaniami.",
    "CreatingANewSolution": "Tworzenie nowego rozwiązania",
    "CreatingANewSolution_Description": "Kiedy musisz uruchomić nowe rozwiązanie, musisz zadać sobie wiele pytań i poświęcić dużo czasu, zanim zaczniesz pisać swój pierwszy kod biznesowy.",
    "CreatingAnEmptySolution": "Tworzenie pustego rozwiązania",
    "THEPROBLEM": "PROBLEM",
    "CreatingAnEmptySolution_THEPROBLEM_Description": "Nawet stworzenie prawie pustego rozwiązania jest wyzwaniem;",
    "CreatingAnEmptySolution_THEPROBLEM_Description2": "Jak organizujesz bazę kodu pomiędzy projektami?",
    "CreatingAnEmptySolution_THEPROBLEM_Description3": "Jakie są warstwy i jak na siebie oddziałują?",
    "CreatingAnEmptySolution_THEPROBLEM_Description4": "Jak integrować się z bibliotekami i systemami innych firm?",
    "CreatingAnEmptySolution_THEPROBLEM_Description5": "Jak skonfigurować testy automatyczne?",
    "ABPSOLUTION": "ROZWIĄZANIE ABP",
    "CreatingAnEmptySolution_ABPSOLUTION_Description": "ABP zapewnia dobrze zaprojektowane, warstwowe i gotowe do produkcji <a href=\"https://docs.abp.io/en/abp/latest/Startup-Templates/Application\" target=\"_blank\">rozwiązanie startowe</a> oparte na zasadach <a href=\"https://docs.abp.io/en/abp/latest/Domain-Driven-Design\" target=\"_blank\">Domain Driven Design</a> . Rozwiązanie zawiera także wstępnie skonfigurowane projekty <a href=\"https://docs.abp.io/en/abp/latest/Testing\" target=\"_blank\">testów</a> jednostkowych i integracyjnych dla każdej warstwy.",
    "CommonLibraries": "Wspólne biblioteki",
    "CommonLibraries_THEPROBLEM_Description": "Których bibliotek należy używać do implementowania typowych wymagań? Ekosystem tworzenia oprogramowania jest bardzo dynamiczny, co utrudnia nadążanie za najnowszymi narzędziami, bibliotekami, trendami i podejściami.",
    "CommonLibraries_ABPSOLUTION_Description": "ABP wstępnie integruje z rozwiązaniem popularne, dojrzałe i aktualne biblioteki. Nie musisz tracić czasu na integrowanie ich ani sprawianie, by komunikowały się ze sobą. Działają poprawnie po wyjęciu z pudełka.",
    "UITheme&Layout": "Motyw i układ interfejsu użytkownika",
    "UITheme&Layout_THEPROBLEM_Description": "Rozwiązując problemy związane z interfejsem użytkownika, pojawia się szereg wyzwań. Obejmują one stworzenie podstaw pod responsywny, nowoczesny i elastyczny zestaw interfejsu użytkownika o spójnym wyglądzie i szeregu funkcji, takich jak menu nawigacyjne, nagłówki, paski narzędzi, stopki, widżety i inne.",
    "UITheme&Layout_THEPROBLEM_Description2": "Nawet jeśli zdecydujesz się na wstępnie zaprojektowany motyw, bezproblemowe zintegrowanie go z projektem może wymagać wielu dni programowania. Dodatkową przeszkodą jest aktualizacja takich motywów. Często struktura HTML/CSS motywu przeplata się z kodem interfejsu użytkownika, co sprawia, że przyszłe zmiany motywu lub aktualizacje stają się skomplikowanymi zadaniami. To przeplatanie się kodu i projektu komplikuje elastyczność wprowadzania poprawek w dalszej części.",
    "UITheme&Layout_ABPSOLUTION_Description": "ABP Framework oferuje charakterystyczny system motywów, który uwalnia kod interfejsu użytkownika od ograniczeń tematycznych. Motywy istnieją osobno, spakowane jako pakiety NuGet lub NPM, dzięki czemu instalacja motywu lub uaktualnienia zajmuje kilka minut. Zachowując możliwość opracowania własnego motywu lub zintegrowania istniejącego, ABP Commercial prezentuje kolekcję dopracowanych i współczesnych motywów.",
    "UITheme&Layout_ABPSOLUTION_Description2": "Ponadto istnieją dostawcy komponentów interfejsu użytkownika, tacy jak Telerik i DevExpress. Jednakże dostawcy ci dostarczają przede wszystkim pojedyncze komponenty, nakładając na Ciebie obowiązek ustalenia systemu rozmieszczenia. Pracując w projektach opartych na ABP, możesz bezproblemowo włączyć te biblioteki, podobnie jak w każdym innym projekcie.",
    "TestInfrastructure": "Infrastruktura testowa",
    "TestInfrastructure_THEPROBLEM_Description": "Stworzenie solidnego środowiska testowego jest przedsięwzięciem czasochłonnym. Obejmuje tworzenie dedykowanych projektów testowych w ramach rozwiązania, staranny wybór niezbędnych narzędzi, tworzenie makiet usług i baz danych, tworzenie niezbędnych klas bazowych i usług narzędziowych w celu zminimalizowania nadmiaru kodu w testach oraz wykonywanie różnych powiązanych zadań.",
    "TestInfrastructure_ABPSOLUTION_Description": "Szablony startowe ABP są dostarczane wstępnie wyposażone w skonfigurowane projekty testowe, co usprawnia proces. Oznacza to, że od pierwszego dnia możesz łatwo i bezzwłocznie rozpocząć pisanie początkowego kodu testu jednostkowego lub integracyjnego.",
    "CodingStandards&Training": "Standardy kodowania i szkolenia",
    "CodingStandards&Training_THEPROBLEM_Description": "Po skonfigurowaniu rozwiązania do programowania zwykle trzeba nauczyć programistów, jak działa system i jak go zbudować, korzystając z tych samych uzgodnionych metod. Nawet jeśli przeszkolisz ich, utrzymywanie aktualności dokumentacji może być trudne. Z biegiem czasu każdy programista może pisać kod na swój własny sposób, przez co zasady pisania kodu będą się od siebie różnić.",
    "CodingStandards&Training_ABPSOLUTION_Description": "Rozwiązanie ABP jest już starannie zorganizowane i zawiera jasne wyjaśnienia. Samouczki i przewodniki krok po kroku pokazują dokładnie, jak pracować nad projektem ABP.",
    "KeepingYourSolutionUpToDate": "Aktualizowanie rozwiązania",
    "KeepingYourSolutionUpToDate_THEPROBLEM_Description": "Po rozpoczęciu programowania musisz śledzić nowe wersje bibliotek, których używasz do aktualizacji i poprawek.",
    "KeepingYourSolutionUpToDate_ABPSOLUTION_Description": "Regularnie aktualizujemy wszystkie pakiety do najnowszych wersji i testujemy je przed wydaniem stabilnym. Po zaktualizowaniu struktury ABP wszystkie jej zależności zostaną zaktualizowane do technologii brzegowej.",
    "DRY": "Nie powtarzaj się!",
    "DRY_Description": "Stworzenie rozwiązania bazowego zajmuje dużo czasu i wymaga dobrego doświadczenia architektonicznego. Jednak to dopiero początek! Gdy zaczniesz programować, prawdopodobnie będziesz musiał napisać dużo powtarzalnego kodu; byłoby wspaniale, gdyby wszystko to można było obsłużyć automatycznie.",
    "DRY_Description2": "ABP automatyzuje i upraszcza powtarzający się kod tak bardzo, jak to możliwe, postępując zgodnie z konwencją dotyczącą zasady konfiguracji. Nie ogranicza Cię to jednak w przypadku konieczności przełączenia na bieg ręczny. Kontrola jest zawsze w Twoich rękach.",
    "Authentication": "Uwierzytelnianie",
    "Authentication_THEPROBLEM_Description": "Pojedyncze logowanie, integracja z Active Directory / LDAP, integracja z OpenIddict, logowanie społecznościowe, uwierzytelnianie dwuskładnikowe, zapomnienie/resetowanie hasła, aktywacja poczty e-mail, rejestracja nowego użytkownika, kontrola złożoności hasła, blokowanie konta w przypadku nieudanych prób, wyświetlanie nieudanych prób logowania... itp. Wiemy, że wszystkie te ogólne wymagania są Ci znane. Nie jesteś sam!",
    "Authentication_ABPSOLUTION_Description": "ABP Framework i wersja komercyjna zapewniają wszystkie te standardowe elementy, wstępnie zaimplementowane jako moduł konta do ponownego wykorzystania. Po prostu włączasz i konfigurujesz to, czego potrzebujesz.",
    "CrossCuttingConcerns": "Obawy przekrojowe",
    "CrossCuttingConcerns_THEPROBLEM_Description": "Zagadnienia przekrojowe to podstawowa powtarzalna logika, którą należy wdrożyć dla każdego przypadku użycia. Kilka przykładów;",
    "CrossCuttingConcerns_THEPROBLEM_Description2": "Rozpoczynanie transakcji, zatwierdzanie sukcesu i wycofywanie błędów.",
    "CrossCuttingConcerns_THEPROBLEM_Description3": "Obsługa i raportowanie wyjątków, zwracanie klientom właściwej odpowiedzi na błędy oraz obsługa przypadków błędów po stronie klienta.",
    "CrossCuttingConcerns_THEPROBLEM_Description4": "Wdrażanie autoryzacji i walidacji, zwracanie właściwych odpowiedzi i obsługa ich po stronie klienta.",
    "CrossCuttingConcerns_ABPSOLUTION_Description": "ABP Framework automatyzuje lub upraszcza wszystkie typowe problemy przekrojowe. Piszesz tylko kod, który ma znaczenie dla Twojej firmy, a ABP zajmuje się resztą zgodnie z konwencjami.",
    "ArchitecturalInfrastructure": "Infrastruktura Architektoniczna",
    "ArchitecturalInfrastructure_THEPROBLEM_Description": "Aby prawidłowo wdrożyć architekturę, zazwyczaj trzeba zbudować infrastrukturę. Na przykład zazwyczaj implementujesz wzorzec Repozytorium. Definiujesz pewne klasy bazowe, aby uprościć i ujednolicić tworzenie jednostek, usług, kontrolerów i innych obiektów.",
    "ArchitecturalInfrastructure_ABPSOLUTION_Description": "ABP Framework zapewnia to wszystko i więcej od razu po wyjęciu z pudełka. Jest dojrzały i dobrze udokumentowany.",
    "EnterpriseApplicationRequirements": "Wymagania aplikacji korporacyjnych",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description": "Istnieje wiele wymagań, które wielokrotnie wdrażasz w każdej aplikacji biznesowej;",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description2": "Szczegółowy system uprawnień i zarządzanie uprawnieniami w interfejsie użytkownika w oparciu o role i użytkowników.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description3": "Zapisywanie dzienników audytu i historii jednostek w celu śledzenia modyfikacji rekordu bazy danych przez użytkownika.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description4": "Spraw, aby Twoje encje zostały usunięte nietrwale, aby zostały oznaczone jako usunięte, zamiast fizycznego usuwania z bazy danych i automatycznego filtrowania usuniętych encji w Twoich zapytaniach.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description5": "Tworzenie abstrakcji i opakowań w celu wykorzystania interfejsów API zaplecza z kodu frontendu.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description6": "Kolejkowanie i wykonywanie zadań w tle.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description7": "Obsługa wielu stref czasowych w systemie globalnym.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description8": "Udostępnianie walidacji, lokalizacji, logiki autoryzacji pomiędzy serwerem a klientem.",
    "EnterpriseApplicationRequirements_ABPSOLUTION_Description": "ABP zapewnia infrastrukturę umożliwiającą łatwe wdrożenie takich wymagań. Ponownie, nie marnujesz swojego cennego czasu na ponowne wdrażanie tego wszystkiego.",
    "GeneratingInitialCode&Tooling": "Generowanie początkowego kodu i narzędzi",
    "GeneratingInitialCode&Tooling_THEPROBLEM_Description": "W typowej aplikacji internetowej zbudujesz wiele podobnych stron. Większość z nich wykona podobne operacje CRUD. Wielokrotne tworzenie takich stron jest bardzo żmudne i podatne na błędy.",
    "GeneratingInitialCode&Tooling_ABPSOLUTION_Description": "<a href=\"/tools/suite\">ABP Suite</a> może w ciągu kilku sekund wygenerować stronę CRUD z pełnym stosem dla Twoich podmiotów. Wygenerowany kod jest warstwowy i czysty. Wdrożono wszystkie standardowe wymagania dotyczące walidacji i autoryzacji. Ponadto generowane są klasy testów jednostkowych. Gdy otrzymasz w pełni działającą stronę, możesz ją modyfikować zgodnie z wymaganiami biznesowymi.",
    "IntegratingTo3rdPartyLibrariesAndSystems": "Integracja z bibliotekami i systemami innych firm",
    "IntegratingTo3rdPartyLibrariesAndSystems_THEPROBLEM_Description": "Większość bibliotek zaprojektowano jako niskopoziomowe i zazwyczaj trzeba trochę popracować nad ich poprawną integracją bez powtarzania tego samego kodu integracyjnego i konfiguracyjnego w każdym miejscu rozwiązania. Załóżmy na przykład, że musisz użyć RabbitMQ do zaimplementowania rozproszonej magistrali zdarzeń. Wszystko, co chcesz zrobić, to; wysłać wiadomość do kolejki i obsługiwać wiadomości przychodzące. Musisz jednak zrozumieć wzorce przesyłania wiadomości, kolejki i szczegóły wymiany. Aby napisać wydajny kod, musisz stworzyć pulę do zarządzania połączeniami, klientami i kanałami. Musisz także radzić sobie z wyjątkami, komunikatami ACK, ponownym łączeniem się z RabbitMQ w przypadku awarii i nie tylko.",
    "IntegratingTo3rdPartyLibrariesAndSystems_ABPSOLUTION_Description": "Na przykład integracja z magistralą zdarzeń rozproszonych RabbitMQ firmy ABP abstrahuje wszystkie te szczegóły. Wysyłasz i odbierasz wiadomości bez zgiełku. Czy potrzebujesz pisać kod niskiego poziomu? Nie ma problemu, zawsze możesz to zrobić. ABP nie ogranicza Cię, gdy musisz korzystać z funkcji niskiego poziomu używanej biblioteki.",
    "WhyNotBuildYourOwnFramework?": "Dlaczego nie zbudować własnego frameworka?",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description": "Cała infrastruktura, nawet najprostsza, wymaga dużo czasu, aby ją zbudować, utrzymać i udokumentować. Z biegiem czasu staje się większy i trudno jest go utrzymać w rozwiązaniu. Rozdzielenie ich na projekt nadający się do ponownego wykorzystania jest punktem wyjścia do zbudowania własnego wewnętrznego szkieletu.",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description2": "Budowanie, dokumentowanie, szkolenie i utrzymywanie wewnętrznych ram jest naprawdę trudne. Jeśli nie masz doświadczonego, oddanego zespołu zajmującego się frameworkiem, Twój wewnętrzny framework szybko staje się nieudokumentowanym, starszym kodem, którego nikt nie jest już w stanie zrozumieć i utrzymać. Z drugiej strony te frameworki są zazwyczaj opracowywane przez jednego lub dwóch programistów w zespole. A ci ludzie stają się silosem wiedzy. Jest to dla nich dobre, ale złe dla firmy, ponieważ są pojedynczym punktem awarii projektu <a href=\"https://en.wikipedia.org/wiki/Single_point_of_failure\">-SPOF-</a> . Kiedy opuszczą firmę, projekt drastycznie się pogarsza.",
    "WhyNotBuildYourOwnFramework_ABPSOLUTION_Description": "ABP Framework to kierowana przez społeczność, dobrze udokumentowana, dojrzała i ogólna platforma aplikacji. Zespół bardzo doświadczonych programistów ciężko pracuje, aby był on aktualny, łatwy do zrozumienia i wygodny w użyciu. Korzystanie z tak stabilnego frameworka pozwala skupić się na własnym kodzie biznesowym i uzyskać pomoc dotyczącą frameworku od ekspertów, kiedy tylko jej potrzebujesz.",
    "ArchitecturalInfrastructure_Description": "Aplikacje SaaS, systemy modułowe lub mikrousługowe to najczęściej używane modele oprogramowania dla przedsiębiorstw. Budowa takich systemów wymaga nie tylko dobrego zrozumienia i doświadczenia, ale także silnej infrastruktury oprogramowania. W przeciwnym razie będziesz musiał włożyć wiele wysiłku w obsługę tych szczegółów architektonicznych w swojej bazie kodu.",
    "Modularity": "Modułowość",
    "Modularity_THEPROBLEM_Description": "Zbudowanie prawdziwie modułowego systemu nie jest łatwe! Wszystkie aspekty systemu (baza danych, encje, interfejsy API, strony/komponenty interfejsu użytkownika) można podzielić na moduły, a każdy moduł można ponownie wykorzystać bez innych. Zwykły ASP.NET Core nie zapewnia takiej modułowej architektury. Jeśli tego potrzebujesz, powinieneś pomyśleć o tym od podstaw.",
    "Modularity_ABPSOLUTION_Description": "Struktura ABP narodziła się jako modułowa struktura do tworzenia aplikacji. Każda funkcja w ramach została opracowana tak, aby była kompatybilna z modułowością. Dokumentacja i przewodniki wyjaśniają, jak w standardowy sposób opracowywać moduły wielokrotnego użytku.",
    "SaaSMultiTenancy": "SaaS / obsługa wielu najemców",
    "SaaSMultiTenancy_THEPROBLEM_Description": "<a href=\"https://docs.abp.io/en/abp/latest/Multi-Tenancy\">Multi-Tenancy</a> to powszechny sposób wdrażania systemów SaaS. Jednakże wdrożenie spójnej infrastruktury obsługującej wielu najemców może być skomplikowane.",
    "SaaSMultiTenancy_ABPSOLUTION_Description": "ABP Framework zapewnia kompletną infrastrukturę dla wielu dzierżawców i abstrakcyjną złożoność kodu biznesowego. Twój kod aplikacji będzie w większości obsługiwał wielodostępność, podczas gdy ABP Framework automatycznie izoluje od siebie bazę danych, pamięć podręczną i inne szczegóły najemców. Obsługuje pojedynczą bazę danych, bazę danych na dzierżawcę i podejścia hybrydowe. Prawidłowo konfiguruje biblioteki takie jak Microsoft Identity i OpenIddict, które zwykle nie są kompatybilne z wieloma dzierżawcami.",
    "Microservices": "Mikrousługi",
    "Microservices_THEPROBLEM_Description": "Budowa systemu mikrousług wymaga wielu szczegółów infrastruktury: najbardziej podstawowymi kwestiami są uwierzytelnianie i autoryzacja aplikacji i mikrousług oraz wdrażanie asynchronicznego przesyłania komunikatów i synchronicznych wzorców komunikacji (Rest/GRPC) pomiędzy mikrousługami.",
    "Microservices_ABPSOLUTION_Description": "Struktura ABP zapewnia usługi, <a href=\"https://docs.abp.io/en/abp/latest/Microservice-Architecture\" target=\"_blank\">przewodniki</a> i próbki, które pomogą Ci wdrożyć rozwiązanie mikrousług przy użyciu standardowych narzędzi branżowych.",
    "Microservices_ABPSOLUTION_Description2": "ABP Commercial idzie nawet o krok dalej i zapewnia kompletny <a href=\"https://docs.abp.io/en/commercial/latest/startup-templates/microservice/index\" target=\"_blank\">szablon startowy</a> , który umożliwi szybkie uruchomienie rozwiązania mikrousługowego.",
    "PreBuiltModules": "Gotowe moduły",
    "PreBuiltModules_THEPROBLEM_Description": "Wszyscy mamy podobne, ale nieco inne wymagania biznesowe. Jednak wszyscy powinniśmy wymyślić koło na nowo, ponieważ żaden kod nie może bezpośrednio zadziałać w naszym rozwiązaniu. Wszystkie są osadzonymi częściami większego rozwiązania.",
    "PreBuiltModules_ABPSOLUTION_Description": "<a href=\"/modules\">Moduły</a> ABP Commercial zapewniają wiele modułów aplikacji wielokrotnego użytku, takich jak płatności, czat, zarządzanie plikami, raportowanie dziennika audytu... itp. Wszystkie te moduły można łatwo zainstalować w rozwiązaniu i bezpośrednio działają. Stale dodajemy kolejne moduły.",
    "PreBuiltModules_ABPSOLUTION_Description2": "Wszystkie moduły zaprojektowano z możliwością dostosowania do wymagań biznesowych. Jeśli potrzebujesz pełnej kontroli, możesz pobrać pełny kod źródłowy dowolnego modułu i całkowicie dostosować go do konkretnych wymagań biznesowych.",
    "ABPCommunity": "Społeczność ABP",
    "ABPCommunity_Description": "Wreszcie bycie w dużej społeczności, w której wszyscy postępują zgodnie z podobnymi stylami i zasadami kodowania oraz mają wspólną infrastrukturę, zapewnia moc, gdy masz problemy lub potrzebujesz pomocy przy podejmowaniu decyzji projektowych. Ponieważ piszemy kod podobnie, możemy sobie nawzajem znacznie lepiej pomagać. ABP to projekt wspierany przez społeczność, który ma ponad 10 000 gwiazdek na GitHubie.",
    "ABPCommunity_Description2": "Łatwo jest udostępniać kod lub nawet biblioteki do ponownego wykorzystania pomiędzy programistami ABP. Fragment kodu, który działa dla Ciebie, będzie również działać dla innych. Istnieje wiele przykładów i samouczków, które możesz bezpośrednio wdrożyć w swojej aplikacji.",
    "ABPCommunity_Description3": "Zatrudniając programistę, który pracował wcześniej z architekturą ABP, natychmiast zrozumie Twoje rozwiązanie i w bardzo krótkim czasie rozpocznie prace nad nim.",
    "WhyAbpIo_Page_Title": "Dlaczego platforma ABP.IO?",
    "AbpStudio_Page_Title": "Studio ABP",
    "CampaignInfo": "Kup nową licencję lub odnów istniejącą i <span class=\"text-white\">zyskaj dodatkowe 2 miesiące</span> bez dodatkowych kosztów! Oferta ta dotyczy wszystkich planów licencyjnych. Skorzystaj z tej ograniczonej czasowo promocji, aby poszerzyć swój dostęp do funkcji premium i uaktualnień.",
    "HurryUpLastDay": "Pośpiesz się! Ostatni dzień: {0}",
    "CreatingCRUDPagesWithABPSuite": "Tworzenie stron CRUD za pomocą pakietu ABP Suite",
    "Testimonials": "Referencje",
    "MultipleYearDiscount": "Wieloletnia zniżka",
    "CampaignDiscountText": "Zniżka na Czarny Piątek",
    "CampaignDiscountName": "Czarny Piątek",
    "CampaignName:BlackFriday": "Czarny Piątek"
  }
}