{
  "culture": "pt-BR",
  "texts": {
    "OrganizationManagement": "Gerenciamento da organização",
    "OrganizationList": "Lista de organização",
    "Volo.AbpIo.Commercial:010003": "Você não é proprietário desta organização!",
    "OrganizationNotFoundMessage": "Nenhuma organização encontrada!",
    "DeveloperCount": "Número de desenvolvedores",
    "QuestionCount": "Perguntas restantes/total",
    "Unlimited": "Ilimitado",
    "Owners": "Proprietários",
    "AddMember": "Adicionar membro",
    "AddOwner": "Adicionar proprietário",
    "AddDeveloper": "Adicionar desenvolvedor",
    "UserName": "Nome de usuário",
    "Name": "Nome",
    "EmailAddress": "Endereço de email",
    "Developers": "Desenvolvedores",
    "LicenseType": "Tipo de licença",
    "Manage": "Gerenciar",
    "StartDate": "Data de início",
    "EndDate": "Data final",
    "Modules": "Módulos",
    "LicenseExtendMessage": "A data de término da sua licença foi estendida para {0}",
    "LicenseUpgradeMessage": "Sua licença foi atualizada para {0}",
    "LicenseExtendAdnUpgradeMessage": "Sua licença foi estendida até {0} e seu plano de licença foi atualizado para {1}.",
    "LicenseAddDeveloperMessage": "{0} desenvolvedores adicionados à sua licença",
    "Volo.AbpIo.Commercial:010004": "Não foi possível encontrar o usuário especificado! O usuário já deve ter se registrado.",
    "MyOrganizations": "Minhas organizações",
    "ApiKey": "Chave da API",
    "UserNameNotFound": "Não há usuário com nome de usuário {0}",
    "SuccessfullyAddedToNewsletter": "Obrigado por subscrever a nossa newsletter!",
    "MyProfile": "Meu perfil",
    "EmailNotValid": "Por favor insira um endereço de e-mail válido.",
    "JoinOurMarketingNewsletter": "Junte-se ao nosso boletim informativo de marketing",
    "WouldLikeToReceiveMarketingMaterials": "Gostaria de receber materiais de marketing, como promoções de produtos e ofertas especiais.",
    "StartUsingYourLicenseNow": "Comece a usar sua licença agora!",
    "WelcomePage": "Página de boas-vindas",
    "UnsubscriptionExpireEmail": "Cancelar inscrição de e-mails de lembrete de data de expiração de licença",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Esta assinatura de e-mail contém apenas um lembrete da data de expiração da licença.",
    "UnsubscribeFromLicenseExpireEmails": "Se não quiser receber e-mails sobre a data de expiração da licença, você pode cancelar a assinatura a qualquer momento.",
    "Unsubscribe": "Cancelar subscrição",
    "NotOrganizationMember": "Você não é membro de nenhuma organização.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Cancelado com Sucesso",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Você não receberá mais e-mails de lembrete da data de expiração da licença.",
    "IndexPageHeroSection": "<span class=\"first-line\"> Uma completa </span> <span class=\"second-line\"> plataforma de desenvolvimento web </span> <span class=\"third-line\"> integrada <img src=\"{0}\" width = \"110\" class=\"ml-1\" /> estrutura </span>",
    "AbpCommercialShortDescription": "ABP Commercial fornece módulos de aplicativos pré-construídos, ferramentas de desenvolvimento rápido de aplicativos, temas de UI profissionais, suporte premium e muito mais.",
    "LiveDemo": "Demonstração ao vivo",
    "GetLicence": "Obtenha uma licença",
    "Application": "Aplicativo",
    "StartupTemplates": "Modelos de inicialização",
    "Startup": "Comece",
    "Templates": "Modelos",
    "Developer": "Desenvolvedor",
    "Tools": "Ferramentas",
    "Premium": "Prêmio",
    "PremiumSupport": "Suporte Premium",
    "PremiumForumSupport": "Suporte Premium Forum",
    "UI": "UI",
    "Themes": "Temas",
    "JoinOurNewsletter": "Junte-se ao nosso boletim informativo",
    "Send": "Mandar",
    "Learn": "Aprender",
    "AdditionalServices": "Serviços adicionais",
    "WhatIsABPFramework": "O QUE É A ESTRUTURA DO ABP?",
    "OpenSourceBaseFramework": "Estrutura de base de código aberto",
    "ABPFrameworkExplanation": "<p class=\"lead\"> ABP Commercial é baseado no ABP Framework, um código aberto e um framework de aplicação web dirigido pela comunidade para ASP.NET Core. </p> <p> O ABP Framework fornece uma excelente infraestrutura para escrever extensível e sustentável e código testável com práticas recomendadas. </p> <p> Construído e integrado a ferramentas populares que você já conhece. Curva de aprendizado baixa, fácil adaptação, desenvolvimento confortável. </p>",
    "Modular": "Modular",
    "MicroserviceCompatible": "Compatível com microsserviço",
    "DomainDrivenDesignInfrastructure": "Infraestrutura de design orientada por domínio",
    "MultiTenancy": "Múltiplos inquilinos",
    "DistributedMessaging": "Mensagens Distribuídas",
    "DynamicProxying": "Proxying Dinâmico",
    "BackgroundJobs": "Trabalhos em segundo plano",
    "AuditLogging": "Registro de auditoria",
    "BLOBStoring": "Armazenamento BLOB",
    "BundlingMinification": "Empacotamento e Minificação",
    "AdvancedLocalization": "Localização Avançada",
    "ManyMore": "Muito mais",
    "ExploreTheABPFramework": "Explore a estrutura ABP",
    "WhyUseTheABPCommercial": "Por que usar o comercial da ABP?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\"> Criar aplicativos da web de nível empresarial pode ser complexo e demorado. </p> <p> O ABP Commercial oferece a infraestrutura básica perfeita necessária para todos os ASP.NET Core modernos de nível empresarial soluções baseadas. Desde o design até a implantação, todo o ciclo de desenvolvimento é fortalecido pelos recursos e módulos integrados da ABP. </p>",
    "StartupTemplatesShortDescription": "Os modelos de inicialização permitem que você inicie seu projeto em poucos segundos.",
    "UIFrameworksOptions": "Opções de estruturas de IU;",
    "DatabaseProviderOptions": "Opções de provedor de banco de dados;",
    "PreBuiltApplicationModules": "Módulos de aplicativos pré-construídos",
    "PreBuiltApplicationModulesShortDescription": "Os requisitos de aplicativos mais comuns já foram desenvolvidos para você como módulos reutilizáveis.",
    "Account": "Conta",
    "Blogging": "Blogging",
    "Identity": "Identidade",
    "IdentityServer": "Servidor de Identidade",
    "Saas": "Saas",
    "LanguageManagement": "Gestão da Língua",
    "TextTemplateManagement": "Gerenciamento de modelos de texto",
    "See All Modules": "SeeAllModules",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "ABP Suite é uma ferramenta complementar ao ABP Commercial.",
    "AbpSuiteExplanation": "Ele permite que você crie páginas da web em questão de minutos. É uma ferramenta .NET Core Global que pode ser instalada a partir da linha de comando. Ele pode criar uma nova solução ABP, gerar páginas CRUD do banco de dados para o front-end.",
    "Details": "Detalhes",
    "LeptonTheme": "Tema Lepton",
    "ProfessionalModernUIThemes": "Temas de IU profissionais e modernos",
    "LeptonThemeExplanation": "Lepton fornece uma gama de temas de administração do Bootstrap que servem como uma base sólida para qualquer projeto que requeira painel de administração.",
    "DefaultTheme": "Tema Padrão",
    "MaterialTheme": "Tema do Material",
    "Default2Theme": "Tema 2 padrão",
    "DarkTheme": "Tema escuro",
    "DarkBlueTheme": "Tema Azul Escuro",
    "LightTheme": "Tema claro",
    "ProudToWorkWith": "Orgulho de trabalhar com",
    "OurConsumers": "Milhares de empresas e desenvolvedores em mais de 70 países em todo o mundo confiam na ABP Commercial.",
    "JoinOurConsumers": "Junte-se a eles e crie produtos incríveis rapidamente.",
    "AdditionalServicesExplanation": "Você precisa de serviços adicionais ou personalizados? <strong> Nós e nossos parceiros podemos fornecer; </strong>",
    "CustomProjectDevelopment": "Desenvolvimento de Projeto Personalizado",
    "CustomProjectDevelopmentExplanation": "Desenvolvedores dedicados para seus projetos personalizados.",
    "PortingExistingProjects": "Portando Projetos Existentes",
    "PortingExistingProjectsExplanation": "Migrando seus projetos legados para a plataforma ABP.",
    "LiveSupport": "Suporte ao Vivo",
    "LiveSupportExplanation": "Opção de suporte remoto ao vivo quando você precisar.",
    "Training": "Treinamento",
    "TrainingExplanation": "Treinamento dedicado para seus desenvolvedores.",
    "OnBoarding": "Onboarding",
    "OnBoardingExplanation": "Ajude a configurar seus ambientes de desenvolvimento, CI e CD.",
    "PrioritizedTechnicalSupport": "Suporte Técnico Priorizado",
    "PremiumSupportExplanation": "Além do grande suporte da comunidade do framework ABP, nossa equipe de suporte responde a questões técnicas e problemas dos usuários comerciais com alta prioridade.",
    "SeeTheSupportOptions": "Veja as opções de suporte",
    "Contact": "Contato",
    "TellUsWhatYouNeed": "Diga-nos o que você precisa.",
    "YourMessage": "Sua mensagem",
    "YourFullName": "Seu nome completo",
    "EmailField": "Endereço de e-mail",
    "YourEmailAddress": "Seu endereço de email",
    "HowMayWeHelpYou": "Como podemos ajudá-lo?",
    "SendMessage": "Enviar mensagem",
    "Success": "Sucesso",
    "WeWillReplyYou": "Recebemos sua mensagem e entraremos em contato em breve.",
    "GoHome": "Ir para casa",
    "CreateLiveDemo": "Criar demonstração ao vivo",
    "RegisterToTheNewsletter": "Cadastre-se no boletim informativo para receber informações sobre ABP.IO, incluindo novos lançamentos etc.",
    "EnterYourEmailOrLogin": "Digite seu endereço de e-mail para criar sua demonstração ou <a href=\"{0}\"> Faça login </a> usando sua conta existente.",
    "ApplicationTemplate": "Modelo de aplicativo",
    "ApplicationTemplateExplanation": "O modelo de inicialização do aplicativo é usado para criar um novo aplicativo da web.",
    "EfCoreProvider": "Entity Framework (suporta SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\"> e outros </a>)",
    "AlreadyIncludedInTemplateModules": "Os seguintes módulos já estão incluídos e configurados neste modelo:",
    "ApplicationTemplateArchitecture": "Este modelo de aplicativo também oferece suporte à arquitetura em camadas, em que a camada de IU, a camada de API e o serviço de autenticação são fisicamente separados.",
    "SeeTheGuideOrGoToTheLiveDemo": "Consulte o guia do desenvolvedor para obter informações técnicas sobre este modelo ou vá para a demonstração ao vivo.",
    "DeveloperGuide": "Guia do desenvolvedor",
    "ModuleTemplate": "Modelo de Módulo",
    "ModuleTemplateExplanation1": "Você deseja criar um módulo e reutilizá-lo em diferentes aplicativos? Este modelo de inicialização prepara tudo para começar a criar um <strong> módulo de aplicativo </strong> reutilizável ou um <strong> microsserviço </strong>.",
    "ModuleTemplateExplanation2": "<p> Você pode oferecer suporte a uma ou várias estruturas de IU, um ou vários provedores de banco de dados para um único módulo. O modelo de inicialização é configurado para executar e <strong> testar seu módulo </strong> em um aplicativo mínimo, além da unidade e da infraestrutura de teste de integração. </p> <p> Consulte o guia do desenvolvedor para obter informações técnicas sobre este modelo. </p>",
    "WithAllStyleOptions": "com todas as opções de estilo",
    "Demo": "Demo",
    "SeeAllModules": "Veja todos os módulos",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) é uma ferramenta de linha de comando para realizar algumas operações comuns para soluções baseadas em ABP.",
    "ABPSuiteEasilyCURD": "ABP Suite é uma ferramenta que permite criar facilmente páginas CRUD",
    "WeAreHereToHelp": "Estamos aqui para <span class=\"zero-text\"> ajudar </span>",
    "BrowseOrAskQuestion": "Você pode navegar em nossos tópicos de ajuda ou pesquisar as perguntas mais frequentes, ou pode nos fazer uma pergunta usando o <a href=\"{0}\" class=\"text-success\"> formulário de contato </a>.",
    "SearchQuestionPlaceholder": "Pesquise nas perguntas mais frequentes",
    "WhatIsTheABPCommercial": "O que é o comercial ABP?",
    "WhatAreDifferencesThanAbpFramework": "Quais são as diferenças entre o ABP Framework de código aberto e o ABP Commercial?",
    "ABPCommercialExplanation": "ABP Commercial é um conjunto de módulos premium, ferramentas, temas e serviços desenvolvidos com base na <a target=\"_blank\" href=\"{0}\"> estrutura ABP </a> de código-fonte aberto. O ABP Commercial está sendo desenvolvido e apoiado pela mesma equipe por trás da estrutura ABP.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\"> A estrutura ABP </a> é uma estrutura de desenvolvimento de aplicativos compatível com microsserviços, modular, para ASP.NET Core. Ele fornece uma arquitetura completa e uma infraestrutura forte para que você se concentre em seu próprio código de negócios, em vez de se repetir a cada novo projeto. É baseado nas melhores práticas de desenvolvimento de software e ferramentas populares que você já conhece. </p> <p> A estrutura ABP é totalmente gratuita, de código aberto e dirigida pela comunidade. Ele também fornece um tema gratuito e alguns módulos pré-construídos (por exemplo, gerenciamento de identidade e gerenciamento de inquilino). </p>",
    "VisitTheFrameworkVSCommercialDocument": "Visite o seguinte link para obter mais informações <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial adiciona os seguintes benefícios no topo da estrutura ABP;",
    "Professional": "Profissional",
    "UIThemes": "Temas de IU",
    "EnterpriseModules": "Pronto para empresas, repleto de recursos, <a href=\"{0}\"> módulos de aplicativos </a> pré-construídos (por exemplo, gerenciamento de Identity Server, gerenciamento de SaaS, gerenciamento de linguagem)",
    "ToolingToSupport": "Ferramentas para apoiar sua produtividade de desenvolvimento (por exemplo, <a href=\"{0}\"> ABP Suite </a>)",
    "PremiumSupportLink": "<a href=\"{0}\" target=\"_blank\"> Suporte </a> premium",
    "WhatDoIDownloadABPCommercial": "O que eu faço download quando adquiro o comercial da ABP?",
    "CreateUnlimitedSolutions": "Depois de adquirir uma licença comercial ABP, você poderá criar soluções ilimitadas conforme descrito no documento <a href=\"{0}\"> Primeiros passos </a>.",
    "ABPCommercialSolutionExplanation": "Ao criar um novo aplicativo, você obtém uma solução do Visual Studio (um modelo de inicialização) com base em suas preferências. A solução baixada possui módulos e temas comerciais já instalados e configurados para você. Você pode remover um módulo pré-instalado ou adicionar outro módulo, se desejar. Todos os módulos e temas são usados como pacotes NuGet/NPM por padrão.",
    "StartDevelopWithTutorials": "A solução baixada é bem arquitetada e documentada. Você pode começar a desenvolver seu próprio código comercial com base nele seguindo <a href=\"{0}\"> os tutoriais </a>",
    "TryTheCommercialDemo": "Você pode experimentar <a href=\"{0}\"> a demonstração </a> para ver um aplicativo de amostra criado usando o modelo de inicialização comercial ABP.",
    "HowManyProducts": "Quantos produtos/soluções diferentes posso criar usando o comercial ABP?",
    "HowManyProductsExplanation": "Não há limite para criar um projeto ABP. Você pode criar quantos projetos quiser, desenvolvê-los e enviá-los para diferentes servidores.",
    "HowManyDevelopers": "Quantos desenvolvedores podem trabalhar no comercial ABP?",
    "HowManyDevelopersExplanation": "As licenças comerciais da ABP são por desenvolvedor. Diferentes tipos de licença têm diferentes limites de desenvolvedor. No entanto, você pode adicionar mais desenvolvedores a qualquer tipo de licença sempre que precisar. Consulte <a href=\"{0}\"> a página de preços </a> para os tipos de licença, limites do desenvolvedor e custos adicionais do desenvolvedor.",
    "ChangingLicenseType": "Posso atualizar meu tipo de licença mais tarde?",
    "ChangingLicenseTypeExplanation": "Você pode atualizar para uma licença superior pagando a diferença dentro do período de sua licença ativa. Ao atualizar para um plano de licença superior, você obtém os benefícios do novo plano, mas a atualização da licença não altera a data de expiração da licença. Além disso, você também pode adicionar novas licenças de desenvolvedor à sua licença existente, consulte \"Quantos desenvolvedores podem trabalhar no comercial ABP?\"",
    "LicenseExtendUpgradeDiff": "Qual é a diferença entre extensão de licença e atualização?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Extending:</strong> By extending/renewing your license, you will continue to get premium support and get major updates for the modules and themes. Besides, you will be able to continue creating new projects. And you will still be able to use ABP Suite which speeds up your development.<hr/><strong>Upgrading:</strong> By upgrading your license, you will promote to a higher license plan which will allow you to get additional benefits. See the <a href=\"/pricing\">license comparison table</a> to check the differences between the license plans.<strong>On the other hand, when you upgrade, your license expiry date will not change!</strong>To extend your license end date, you need to extend your license.",
    "LicenseRenewalCost": "Qual é o custo de renovação da licença após 1 ano?",
    "LicenseRenewalCostExplanation": "A taxa de renovação (extensão) de todas as licenças perpétuas da ABP Commercial é {0} do preço de lista da licença. O preço de renovação da Licença de equipe padrão é $ {1}, a Licença comercial padrão é $ {2} e a Licença corporativa padrão é $ {3}. Se você já é um cliente, <a href='{4}' target='_blank'> faça login em sua conta </a> para verificar os preços de renovação disponíveis.",
    "HowDoIRenewMyLicense": "Como eu renovo minha licença?",
    "HowDoIRenewMyLicenseExplanation": "Você pode renovar sua licença navegando até a <a href='{0}' target='_blank'> página de gerenciamento da organização </a>. Para aproveitar nossas taxas de desconto de renovação antecipada, certifique-se de renovar antes que sua licença expire. Não se preocupe em não saber quando sua oportunidade de Renovação Antecipada terminará. Você receberá 3 e-mails de lembrete antes que sua assinatura expire. Iremos enviá-los 30 dias, 7 dias e 1 dia antes do vencimento.",
    "IsSourceCodeIncluded": "Minha licença inclui o código-fonte dos módulos e temas comerciais?",
    "IsSourceCodeIncludedExplanation1": "Depende do tipo de licença que você comprou:",
    "IsSourceCodeIncludedExplanation2": "<strong> Equipe </strong>: sua solução usa os módulos e os temas como pacotes NuGet e NPM. Não inclui seu código-fonte. Dessa forma, você pode atualizar facilmente esses módulos e temas sempre que uma nova versão estiver disponível. No entanto, você não pode obter o código-fonte dos módulos e dos temas.",
    "IsSourceCodeIncludedExplanation3": "<strong> Business/Enterprise </strong>: Além da licença Team, você pode baixar o código-fonte de qualquer módulo ou tema de que precisar. Você pode até mesmo remover as referências do pacote NuGet/NPM para um módulo específico e adicionar seu código-fonte diretamente à sua solução para alterá-lo totalmente.",
    "IsSourceCodeIncludedExplanation4": "<p> Incluir o código-fonte de um módulo em sua solução oferece o máximo de liberdade para personalizar esse módulo. No entanto, não será possível atualizar automaticamente o módulo quando uma nova versão for lançada. </p> <p> Nenhuma das licenças inclui o código-fonte do ABP Suite, que é uma ferramenta externa que gera código para você e ajuda para o seu desenvolvimento. </p> <p> Consulte <a href=\"{0}\"> a página de preços </a> para outras diferenças entre os tipos de licença. </p>",
    "ChangingDevelopers": "Posso mudar os desenvolvedores registrados da minha organização no futuro?",
    "ChangingDevelopersExplanation": "Além de adicionar novos desenvolvedores à sua licença, você também pode alterar os desenvolvedores existentes (você pode remover um desenvolvedor e adicionar um novo ao mesmo assento) sem nenhum custo adicional.",
    "WhatHappensWhenLicenseEnds": "O que acontece quando meu período de licença termina?",
    "WhatHappensWhenLicenseEndsExplanation1": "O tipo de licença comercial ABP é <a href=\"{0}\" target=\"_blank\"> licença perpétua </a>. Depois que sua licença expirar, você pode continuar desenvolvendo seu projeto. E você não é obrigado a renovar sua licença. Sua licença vem com um plano de suporte e atualizações de um ano pronto para uso. Para continuar a receber novos recursos, melhorias de desempenho, correções de bugs, suporte e continuar a usar o ABP Suite, certifique-se de renovar seu plano a cada ano. Quando sua licença expirar, você não poderá obter mais dos seguintes benefícios;",
    "WhatHappensWhenLicenseEndsExplanation2": "Você não pode criar novas soluções usando o ABP Commercial, mas pode continuar a desenvolver seus aplicativos existentes para sempre.",
    "WhatHappensWhenLicenseEndsExplanation3": "Você poderá obter atualizações para os módulos e temas em sua versão PRINCIPAL. Por exemplo; se estiver usando a v3.2.0 de um módulo, você ainda pode obter atualizações para v3.x.x (v3.3.0, v3.5.2 ... etc.) desse módulo. Mas você não pode obter atualizações para a próxima versão principal (como v4.x, v5.x)",
    "WhatHappensWhenLicenseEndsExplanation4": "Você não pode instalar novos módulos e temas adicionados à plataforma comercial da ABP após o término de sua licença.",
    "WhatHappensWhenLicenseEndsExplanation5": "Você não pode usar o ABP Suite.",
    "WhatHappensWhenLicenseEndsExplanation6": "Você não pode mais obter o <a href=\"{0}\"> suporte premium </a>.",
    "WhatHappensWhenLicenseEndsExplanation7": "Você pode renovar sua assinatura se quiser continuar a obter esses benefícios. Se você renovar sua assinatura dentro de 1 mês após a expiração da licença, um desconto de 20% será aplicado.",
    "WhenShouldIRenewMyLicense": "Quando devo renovar minha licença?",
    "WhenShouldIRenewMyLicenseExplanation1": "Se você renovar sua licença em <strong> 1 mês </strong> após a expiração da licença, um desconto de 20% será aplicado.",
    "WhenShouldIRenewMyLicenseExplanation2": "Se você renovar sua licença após 1 mês da data de expiração da licença, o preço de renovação será igual ao preço de compra da licença e não haverá desconto para sua renovação.",
    "TrialPlan": "Você tem um plano experimental?",
    "TrialPlanExplanation": "Por enquanto, a ABP Commercial não tem um plano de teste. Para as licenças Team, oferecemos 30 dias de garantia de devolução do dinheiro. Você pode apenas solicitar um reembolso nos primeiros 30 dias. Para as licenças Business e Enterprise, oferecemos reembolso de 60% em 30 dias. Isso ocorre porque as licenças Business e Enterprise incluem o código-fonte completo de todos os módulos e temas.",
    "DoYouAcceptBankWireTransfer": "Você aceita transferência bancária?",
    "DoYouAcceptBankWireTransferExplanation": "Sim, aceitamos transferência bancária. <br /> Após o envio da licença por transferência bancária, envie-nos um e-mail para info@abp.io com o seu recibo e o tipo de licença solicitada. Nossas informações de conta bancária internacional:",
    "HowToUpgrade": "Como atualizar os aplicativos existentes quando uma nova versão estiver disponível?",
    "HowToUpgradeExplanation1": "Quando você cria um novo aplicativo usando ABP Comercial, todos os módulos e o tema são usados como pacotes NuGet e NPM. Assim, você pode atualizar facilmente os pacotes quando uma nova versão estiver disponível.",
    "HowToUpgradeExplanation2": "Além das atualizações NuGet/NPM padrão, <a href=\"{0}\"> ABP CLI </a> fornece um comando de atualização que automaticamente encontra e atualiza todos os pacotes relacionados a ABP em sua solução.",
    "DatabaseSupport": "Quais sistemas de banco de dados são suportados?",
    "DatabaseSupportExplanation": "O próprio ABP Framework é agnóstico de banco de dados e pode funcionar com qualquer provedor de banco de dados por sua natureza. Consulte <a href=\"{0}\" target=\"_blank\"> o documento de acesso a dados </a> para obter uma lista dos provedores implementados atualmente.",
    "UISupport": "Quais estruturas de IU são suportadas?",
    "Supported": "Suportado",
    "UISupportExplanation": "O próprio ABP Framework é agnóstico em relação à estrutura de IU e pode funcionar com qualquer estrutura de IU. No entanto, os modelos de inicialização, módulos de UIs e temas não foram implementados para todos os frameworks de UI. Consulte <a href=\"{0}\"> o documento de primeiros passos </a> para obter a lista atualizada de opções de IU.",
    "MicroserviceSupport": "Ele suporta a arquitetura de micro-serviços?",
    "MicroserviceSupportExplanation1": "Um dos principais objetivos da estrutura ABP é fornecer uma infraestrutura conveniente para criar soluções de micro-serviços. Consulte o documento de <a href=\"{0}\"> arquitetura de microsserviço </a> para entender como isso ajuda a criar sistemas de microsserviço.",
    "MicroserviceSupportExplanation2": "Todos os módulos ABP Commercial são projetados para suportar cenários de implantação de micro-serviços (com sua própria API e banco de dados) seguindo o documento de <a href=\"{0}\"> melhores práticas de desenvolvimento de módulo </a>.",
    "MicroserviceSupportExplanation3": "Fornecemos um exemplo de <a href=\"{0}\"> solução de demonstração de microsserviço </a> que demonstra uma implementação de arquitetura de microsserviço para ajudá-lo a criar sua própria solução.",
    "MicroserviceSupportExplanation4": "Portanto, a resposta curta é \"<strong> sim, ele oferece suporte à arquitetura de micro-serviços </strong>\".",
    "MicroserviceSupportExplanation5": "No entanto, um sistema de microsserviço é uma solução e cada solução terá diferentes requisitos, topologia de rede, cenários de comunicação, possibilidades de autenticação, decisões de separação/compartilhamento de banco de dados, configurações de tempo de execução, integrações de sistemas de terceiros e muito mais.",
    "MicroserviceSupportExplanation6": "O ABP Framework e o ABP Commercial fornecem infraestrutura para cenários de micro-serviços, módulos compatíveis com micro-serviços, amostras e documentação para ajudá-lo a construir sua própria solução. Mas não espere baixar diretamente a solução dos seus sonhos pré-construída para você. Você precisará entendê-lo e reunir algumas partes com base em seus requisitos.",
    "WhereCanIDownloadSourceCode": "Onde posso baixar o código-fonte?",
    "WhereCanIDownloadSourceCodeExplanation": "Você pode baixar o código-fonte de todos os módulos ABP, pacotes e temas Angular via ABP Suite ou ABP CLI. Consulte <a href=\"{0}\"> Como fazer download do código-fonte? </a>",
    "ComputerLimitation": "Quantos computadores um desenvolvedor pode fazer login ao desenvolver ABP?",
    "ComputerLimitationExplanation": "Nós permitimos especificamente <strong> {0} computadores </strong> por desenvolvedor individual/licenciado. Sempre que houver necessidade de um desenvolvedor desenvolver produtos ABP Comerciais em uma terceira máquina, deverá ser enviado um e-mail para license@abp.io explicando a situação e faremos a devida alocação em nosso sistema.",
    "RefundPolicy": "Você tem uma política de reembolso?",
    "RefundPolicyExplanation": "Você pode solicitar um reembolso em <strong> 30 dias </strong> após a compra da licença. Os tipos de licença Business e Enterprise têm a opção de download do código-fonte, portanto, os reembolsos não estão disponíveis para Business e Enterprise (e quaisquer licenças que incluam o direito de receber o código-fonte). Além disso, nenhum reembolso é feito para renovações e compras de segunda licença.",
    "HowCanIRefundVat": "Como posso reembolsar o IVA?",
    "HowCanIRefundVatExplanation1": "Se você fez o pagamento usando 2Checkout, pode reembolsar o IVA por meio de sua conta 2Checkout:",
    "HowCanIRefundVatExplanation2": "Faça login em sua conta <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\"> 2Checkout </a>",
    "HowCanIRefundVatExplanation3": "Encontre o pedido apropriado e pressione \"Reembolsar IVA atrasado\" (insira seu ID de IVA)",
    "HowCanIGetMyInvoice": "Como posso obter minha fatura?",
    "HowCanIGetMyInvoiceExplanation": "Existem 2 gateways de pagamento para comprar uma licença: Iyzico e 2Checkout. Se você adquirir sua licença por meio do gateway 2Checkout, ele enviará a fatura em PDF para seu endereço de e-mail, consulte <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How- do-invoices-work \"> 2Fatura de checkout. </a> Se você comprar pelo gateway Iyzico, com link de compra personalizado ou por transferência bancária, prepararemos e enviaremos sua fatura. Você pode solicitar ou baixar sua fatura na <a href=\"{0}\"> página de gerenciamento da organização </a>. Antes de nos contactar para a fatura, consulte a página de gestão da sua organização!",
    "Forum": "Fórum",
    "SupportExplanation": "As licenças comerciais da ABP fornecem um suporte de fórum premium por uma equipe composta por especialistas do ABP Framework.",
    "PrivateTicket": "Ingresso Privado",
    "PrivateTicketExplanation": "A licença empresarial também inclui um suporte privado com sistema de e-mail e tíquetes.",
    "AbpSuiteExplanation1": "O ABP Suite permite que você crie páginas da web em questão de minutos. É uma ferramenta .NET Core Global que pode ser instalada a partir da linha de comando.",
    "AbpSuiteExplanation2": "Ele pode criar uma nova solução ABP, gerar páginas CRUD do banco de dados para o front-end. Para uma visão geral técnica, consulte <a href=\"{0}\"> o documento </a>",
    "FastEasy": "Rápido e fácil",
    "AbpSuiteExplanation3": "O ABP Suite permite que você crie facilmente páginas CRUD. Você só precisa definir sua entidade e suas propriedades, deixe o resto com o ABP Suite para você! O ABP Suite gera todo o código necessário para sua página CRUD em poucos segundos. Suporta interfaces de usuário Angular, MVC e Blazor.",
    "RichOptions": "Opções ricas",
    "AbpSuiteExplanation4": "O ABP Suite oferece suporte a várias opções de IU, como <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\"> Razor Pages </a> e <a href=\"https://angular.io\">Angular </a>. Também oferece suporte a vários bancos de dados como <a href=\"https://www.mongodb.com\"> MongoDB </a> e todos os bancos de dados suportados por <strong> EntityFramework Core </strong> (MS SQL Server, Oracle, MySql, PostgreSQL e <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\"> mais </a>).",
    "AbpSuiteExplanation5": "O bom é que você não precisa se preocupar com essas opções. O ABP Suite entende seu tipo de projeto e gera o código para seu projeto e coloca o código gerado no lugar correto em seu projeto.",
    "SourceCode": "Código fonte",
    "AbpSuiteExplanation6": "O ABP Suite gera o código-fonte para você! Ele não gera arquivos mágicos para gerar a página da web. O ABP Suite gera o código-fonte para <strong> Entidade, Repositório, Serviço de Aplicativo, Migração Code First, JavaScript/TypeScript e CSHTML/HTML </strong> e também as interfaces necessárias. O ABP Suite também gera o código de acordo com as <strong> Melhores Práticas </strong> de desenvolvimento de software, para que você não precise se preocupar com a qualidade do código gerado.",
    "AbpSuiteExplanation7": "Como você tem o código-fonte dos blocos de construção da página CRUD gerada nas camadas corretas do aplicativo, pode modificar facilmente o código-fonte e injetar sua lógica customizada/comercial no código gerado.",
    "CrossPlatform": "Plataforma Cruzada",
    "AbpSuiteExplanation8": "O ABP Suite é desenvolvido com .NET Core e é multiplataforma. Ele é executado como um aplicativo da web em seu computador local. Você pode executá-lo no <strong> Windows </strong>, <strong> Mac </strong> e <strong> Linux </strong>",
    "OtherFeatures": "Outras características",
    "OtherFeatures1": "Atualiza pacotes <strong>NuGet</strong> e <strong>NPM</strong> em sua solução facilmente.",
    "OtherFeatures2": "Regenera páginas já geradas do zero.",
    "OtherFeatures3": "Cria novas soluções",
    "ThanksForCreatingProject": "Obrigado por criar seu projeto!",
    "HotToRunSolution": "Como executar sua solução?",
    "HotToRunSolutionExplanation": "Consulte o documento de introdução para saber como configurar e executar sua solução.",
    "GettingStarted": "Começando",
    "WebAppDevTutorial": "Tutorial de desenvolvimento de aplicativo da web",
    "WebAppDevTutorialExplanation": "Consulte o documento do tutorial de desenvolvimento de aplicativo da web para obter um exemplo de desenvolvimento passo a passo.",
    "Document": "Documento",
    "UsingABPSuiteToCURD": "Usando ABP Suite para CRUD Page Generation & Tooling",
    "SeeABPSuiteDocument": "Consulte o documento ABP Suite para aprender a usar o ABP Suite.",
    "AskQuestionsOnSupport": "Você pode fazer perguntas no Suporte Comercial ABP.",
    "Documentation": "Documentação",
    "SeeModulesDocument": "Consulte o documento de módulos para obter uma lista de todos os módulos comerciais(pro) e seus documentos.",
    "Pricing": "Preços",
    "PricingExplanation": "Escolha os recursos e a funcionalidade de que sua empresa precisa hoje. Atualize facilmente à medida que sua empresa cresce.",
    "Team": "Equipe",
    "Business": "O negócio",
    "Enterprise": "Empreendimento",
    "Custom": "Personalizado",
    "IncludedDeveloperLicenses": "Licenças de desenvolvedor incluídas",
    "CustomLicenceOrAdditionalServices": "Precisa de licença personalizada ou serviços adicionais?",
    "CustomOrVolumeLicense": "Licença personalizada ou por volume",
    "LiveTrainingSupport": "Treinamento e suporte ao vivo",
    "AndMore": "e mais",
    "AdditionalDeveloperLicense": "Licença de desenvolvedor adicional",
    "ProjectCount": "Contagem de projetos",
    "AllProModules": "Todos os módulos profissionais",
    "AllProThemes": "Todos os temas profissionais",
    "AllProStartupTemplates": "Todos os modelos de inicialização profissionais",
    "SourceCodeOfAllModules": "Código fonte de todos os módulos",
    "SourceCodeOfAllThemes": "Código fonte de todos os temas",
    "PerpetualLicense": "Licença perpétua",
    "UnlimitedServerDeployment": "Implantação de servidor ilimitada",
    "YearUpgrade": "Atualização de 1 ano",
    "YearPremiumForumSupport": "Suporte de fórum premium por 1 ano",
    "ForumSupportIncidentCountYear": "Contagem de incidentes de suporte do fórum/ano",
    "PrivateTicketEmailSupport": "Tíquete privado e suporte por e-mail",
    "BuyNow": "Compre Agora",
    "PayViaAmexCard": "Como posso pagar com meu cartão AMEX?",
    "PayViaAmexCardDescription": "O gateway de pagamento padrão 'Iyzico' pode recusar alguns cartões de crédito AMEX devido a medidas de segurança. Neste caso, você pode pagar através do portal de pagamento alternativo '2Checkout'.",
    "ThankYou": "Obrigado",
    "InvalidReCaptchaErrorMessage": "Ocorreu um erro ao verificar o reCAPTCHA. Por favor, tente novamente.",
    "CompanyName": "Nome da empresa",
    "YourCompanyName": "O nome da sua empresa",
    "FirstName": "Primeiro nome",
    "LastName": "Último nome",
    "Optional": "Opcional",
    "YourFirstName": "Seu primeiro nome",
    "YourLastName": "Seu último Nome",
    "SpecialOffer": "Oferta especial",
    "SpecialOfferMessage": "Se apresse! Os preços são válidos por tempo limitado.",
    "DiscountRequest": "Pedido de desconto",
    "DiscountRequestDescribeCustomerQuestion": "Qual das seguintes opções descreve você?",
    "DiscountRequestStudentEmailMessage": "O endereço de e-mail deve conter 'edu'.",
    "DiscountRequestDeveloperCount": "Quantos desenvolvedores você é?",
    "DiscountRequestDeveloperCountExceedMessage": "Não oferecemos licença com desconto para empresas que possuem mais de {0} desenvolvedores.",
    "DiscountRequestOrganizationName": "Nome da empresa/organização/escola",
    "Website": "Local na rede Internet",
    "GithubUsername": "Nome de usuário GitHub",
    "PhoneNumber": "Número de telefone",
    "Country": "País",
    "DescribeABPCommercialUsage": "Descreva o projeto que você está planejando desenvolver com base no APB Comercial",
    "DiscountRequestCertifyInformationMessage": "Certifico que todas as informações são verdadeiras e corretas.",
    "DiscountRequestReceived": "Recebemos sua solicitação de desconto.",
    "DiscountRequestStatusMessage": "Responderemos a você após verificar as informações fornecidas.",
    "MVCOrRazorPages": "MVC (páginas do Razor)",
    "Angular": "Angular",
    "Blazor": "Blazor",
    "New": "Novo",
    "MongoDB": "MongoDB",
    "EBookDDD": "Design baseado em domínio de e-book",
    "PracticalGuideForImplementingDDD": "Este livro é um guia prático para implementar o Domain Driven Design com o ABP Framework.",
    "IntroducingDDD": "Apresentando o Domain Driven Design",
    "DDDLayersAndCleanArchitecture": "Camadas DDD e arquitetura limpa",
    "LayeringOfADotnetSolution": "Camada de uma solução .NET",
    "ImplementingDDDBuildingBlocks": "Implementando blocos de construção DDD",
    "DomainVsApplicationLogic": "Lógica de domínio versus lógica de aplicativo",
    "SamplesAndDiscussions": "Amostras e discussões",
    "Free": "Sem custos",
    "Download": "Download",
    "DDDEBook": "DDD E-book",
    "ImplementingDDD": "Implementando Design Orientado a Domínio",
    "DDDBookExplanation": "Um guia prático para implementar o Domain Driven Design com o ABP Framework.",
    "Overview": "Visão geral",
    "DDDBookPracticalGuide": "Este é um guia prático para implementar o Domain Driven Design (DDD). Embora os detalhes de implementação dependam da infraestrutura do ABP Framework, os principais conceitos, princípios e padrões são aplicáveis em qualquer tipo de solução, mesmo que não seja uma solução .NET.",
    "TableOfContents": "Índice",
    "IntroductionToImplementingDDD": "Introdução à implementação de design orientado a domínio",
    "WhatIsDDD": "O que é Domain Driven Design?",
    "Implementation": "Implementação",
    "TheBigPicture": "A grande imagem",
    "TheBuildingBlock": "O Bloco de Construção",
    "ExampleUseCase": "Exemplo de caso de uso",
    "DomainAndApplicationLogic": "Lógica de domínio e lógica de aplicativo",
    "Author": "Autor",
    "PublishedOn": "publicado em",
    "Page": "Página",
    "FreeEBook": "E-book grátis",
    "EBookSignInForDownload": "Para baixar o e-book, faça login",
    "SignIn": "Entrar",
    "Or": "Ou",
    "TellUsAboutYourself": "Conte-nos um pouco sobre você",
    "Surname": "Sobrenome",
    "DoYouAgreePrivacyPolicy": "Eu concordo com os <a href=\"/TermsConditions\"> Termos e Condições <a/> e a <a href=\"/Privacy\"> Política de Privacidade </a>.",
    "VolosoftMarketingInformationMessage": "Desejo informações, dicas e ofertas sobre Soluções para Empresas e Organizações e outros produtos e serviços da Volosoft.",
    "VolosoftSharingInformationMessage": "Gostaria que a Volosoft compartilhasse minhas informações com parceiros selecionados para que eu pudesse receber informações relevantes sobre seus produtos e serviços.",
    "WeWillSendYouADownloadLink": "Um link para baixar o e-book foi enviado para {0}. <br/> Verifique sua caixa de entrada/caixas de lixo/spam!",
    "InvalidFormInputs": "Por favor, digite as informações válidas especificadas no formulário.",
    "DDDBookEmailBody": "Obrigada. <br /> Para baixar seu livro, <a href=\"{0}\"> clique aqui </a>.",
    "FreeDDDEBook": "E-book DDD grátis",
    "StartFree": "Comece de graça",
    "FreeTrial": "Teste grátis",
    "AcceptsMarketingCommunications": " Sim, desejo receber comunicações de marketing comercial da ABP.",
    "PurposeOfUsage": "Objetivo de uso",
    "Industry": "Indústria",
    "Choose": "- Escolher -",
    "CompanyOrganizationName": "Nome da empresa/organização",
    "CompanySize": "Tamanho da empresa",
    "Next": "Próximo",
    "StartTrial": "Comece meu teste grátis",
    "ContactUsIssues": "Contate-nos se tiver algum problema",
    "TrialActivatedWarning": "Caro {0}, um usuário tem direito a apenas 1 período de teste gratuito. Você já usou seu período de teste.",
    "ActivationRequirement": "Você está a um passo de iniciar seu teste gratuito. <br> Enviamos um e-mail para <b> {0} </b> para ativar sua conta. Verifique sua caixa de entrada/caixas de lixo/spam!",
    "SaveAndDownload": "Salvar e baixar",
    "CompanyNameValidationMessage": "O nome da empresa é muito longo!",
    "AddressValidationMessage": "O endereço é muito longo!",
    "TaxNoValidationMessage": "TAX/VAT Não é muito longo!",
    "NotesValidationMessage": "O campo de notas é muito longo!",
    "CheckYourBillingInfo": "Você pode criar sua fatura apenas uma vez! Verifique suas informações de faturamento antes de criar sua fatura.",
    "Volo.AbpIo.Commercial:030000": "Você já usou seu período de teste.",
    "Volo.AbpIo.Commercial:030001": "Este nome de organização já existe.",
    "StartYourFreeTrial": "Inicie o seu teste gratuito",
    "TrialLicenseModelInvalidErrorMessage": "Um dos campos a seguir é inválido: nome do país, tamanho da empresa, setor ou finalidade do uso.",
    "Trial": "Tentativas",
    "Purchased": "Comprado",
    "PurchaseLicense": "Licença de Compra",
    "PurchaseTrialLicenseMessage": "A data de expiração da sua licença é {0}. <br> Se você deseja continuar usando os projetos que criou durante o período de teste gratuito, você precisa alterar as chaves de licença em seus arquivos <code> appsettings.secrets.json </code>. Aqui está sua chave de licença:",
    "TrialLicenseExpireMessage": "Você está usando a licença de teste e sua licença de teste irá expirar em {0}.",
    "TryForFree": "Experimentar gratuitamente",
    "TrialLicenseExpiredInfo": "Seu período de licença de teste expirou!",
    "CommercialNewsletterConfirmationMessage": "Eu concordo com os <a href=\"https://commercial.abp.io/TermsConditions\"> Termos e Condições </a> e a <a href=\"https://commercial.abp.io/Privacy\"> Política de Privacidade </a>"
  }
}