{
  "culture": "pt-BR",
  "texts": {
    "OrganizationManagement": "Gerenciamento da organização",
    "OrganizationList": "Lista de organização",
    "Volo.AbpIo.Commercial:010003": "Você não é proprietário desta organização!",
    "OrganizationNotFoundMessage": "Nenhuma organização encontrada!",
    "DeveloperCount": "Número de desenvolvedores",
    "QuestionCount": "Perguntas restantes/total",
    "Unlimited": "Ilimitado",
    "Owners": "Proprietários",
    "Owner": "Proprietário",
    "AddMember": "Adicionar membro",
    "AddNewOwner": "Adicionar novo proprietário",
    "AddNewDeveloper": "Adicionar novo desenvolvedor",
    "UserName": "Nome de usuário",
    "Name": "Nome",
    "EmailAddress": "Endereço de email",
    "Developers": "Desenvolvedores",
    "LicenseType": "Tipo de licença",
    "Manage": "Gerenciar",
    "SetDefault": "Definir como padrão",
    "DefaultOrganization": "Padrão",
    "StartDate": "Data de início",
    "EndDate": "Data final",
    "Modules": "Módulos",
    "LicenseExtendMessage": "A data de término da sua licença foi estendida para {0}",
    "LicenseUpgradeMessage": "Sua licença foi atualizada para {0}",
    "LicenseExtendAdnUpgradeMessage": "Sua licença foi estendida até {0} e seu plano de licença foi atualizado para {1}.",
    "LicenseAddDeveloperMessage": "{0} desenvolvedores adicionados à sua licença",
    "Volo.AbpIo.Commercial:010004": "Não foi possível encontrar o usuário especificado! O usuário já deve ter se registrado.",
    "MyOrganizations": "Minhas organizações",
    "ApiKey": "Chave da API",
    "UserNameNotFound": "Não há usuário com nome de usuário {0}",
    "SuccessfullyAddedToNewsletter": "Obrigado por subscrever a nossa newsletter!",
    "MyProfile": "Meu perfil",
    "EmailNotValid": "Por favor insira um endereço de e-mail válido.",
    "JoinOurMarketingNewsletter": "Junte-se ao nosso boletim informativo de marketing",
    "WouldLikeToReceiveMarketingMaterials": "Gostaria de receber materiais de marketing, como promoções de produtos e ofertas especiais.",
    "StartUsingYourLicenseNow": "Comece a usar sua licença agora!",
    "WelcomePage": "Página de boas-vindas",
    "UnsubscriptionExpireEmail": "Cancelar inscrição de e-mails de lembrete de data de expiração de licença",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Esta assinatura de e-mail contém apenas um lembrete da data de expiração da licença.",
    "UnsubscribeFromLicenseExpireEmails": "Se não quiser receber e-mails sobre a data de expiração da licença, você pode cancelar a assinatura a qualquer momento.",
    "Unsubscribe": "Cancelar subscrição",
    "NotOrganizationMember": "Você não é membro de nenhuma organização.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Cancelado com Sucesso",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Você não receberá mais e-mails de lembrete da data de expiração da licença.",
    "IndexPageHeroSection": "<span class=\"first-line\"> Uma completa </span> <span class=\"second-line\"> plataforma de desenvolvimento web </span> <span class=\"third-line\"> integrada <img src=\"{0}\" width = \"110\" class=\"ml-1\" /> estrutura </span>",
    "AbpCommercialShortDescription": "ABP Commercial fornece módulos de aplicativos pré-construídos, ferramentas de desenvolvimento rápido de aplicativos, temas de UI profissionais, suporte premium e muito mais.",
    "LiveDemo": "Demonstração ao vivo",
    "LiveDemoLead": "<a href=\"{0}\">{1}</a> usando sua conta ABP, <a href=\"{2}\">{3}</a> para abp.io.<br/>Ou preencha o formulário abaixo para criar uma demonstração ao vivo agora",
    "ThereIsAlreadyAnAccountWithTheGivenEmailAddress": "Já existe uma conta com o endereço de e-mail fornecido: <b>{0}</b><br/> Você pode fazer login com sua conta para continuar.",
    "GetLicence": "Obtenha uma licença",
    "Application": "Aplicativo",
    "StartupTemplates": "Modelos de inicialização",
    "Startup": "Comece",
    "Templates": "Modelos",
    "Developer": "Desenvolvedor",
    "Tools": "Ferramentas",
    "Premium": "Prêmio",
    "PremiumSupport": "Suporte Premium",
    "PremiumForumSupport": "Suporte Premium Forum",
    "UI": "UI",
    "Themes": "Temas",
    "JoinOurNewsletter": "Junte-se ao nosso boletim informativo",
    "Send": "Mandar",
    "WhatIsABPFramework": "O QUE É A ESTRUTURA DO ABP?",
    "OpenSourceBaseFramework": "Estrutura de base de código aberto",
    "ABPFrameworkExplanation": "<p class=\"lead\"> ABP Commercial é baseado no ABP Framework, um código aberto e um framework de aplicação web dirigido pela comunidade para ASP.NET Core. </p> <p> O ABP Framework fornece uma excelente infraestrutura para escrever extensível e sustentável e código testável com práticas recomendadas. </p> <p> Construído e integrado a ferramentas populares que você já conhece. Curva de aprendizado baixa, fácil adaptação, desenvolvimento confortável. </p>",
    "Modular": "Modular",
    "MicroserviceCompatible": "Compatível com microsserviço",
    "DomainDrivenDesignInfrastructure": "Infraestrutura de design orientada por domínio",
    "MultiTenancy": "Múltiplos inquilinos",
    "DistributedMessaging": "Mensagens Distribuídas",
    "DynamicProxying": "Proxying Dinâmico",
    "BackgroundJobs": "Trabalhos em segundo plano",
    "AuditLogging": "Registro de auditoria",
    "BLOBStoring": "Armazenamento BLOB",
    "BundlingMinification": "Empacotamento e Minificação",
    "AdvancedLocalization": "Localização Avançada",
    "ManyMore": "Muito mais",
    "ExploreTheABPFramework": "Explore a estrutura ABP",
    "WhyUseTheABPCommercial": "Por que usar o comercial da ABP?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\"> Criar aplicativos da web de nível empresarial pode ser complexo e demorado. </p> <p> O ABP Commercial oferece a infraestrutura básica perfeita necessária para todos os ASP.NET Core modernos de nível empresarial soluções baseadas. Desde o design até a implantação, todo o ciclo de desenvolvimento é fortalecido pelos recursos e módulos integrados da ABP. </p>",
    "StartupTemplatesShortDescription": "Os modelos de inicialização permitem que você inicie seu projeto em poucos segundos.",
    "UIFrameworksOptions": "Opções de estruturas de IU;",
    "DatabaseProviderOptions": "Opções de provedor de banco de dados;",
    "PreBuiltApplicationModules": "Módulos de aplicativos pré-construídos",
    "PreBuiltApplicationModulesShortDescription": "Os requisitos de aplicativos mais comuns já foram desenvolvidos para você como módulos reutilizáveis.",
    "Account": "Conta",
    "Blogging": "Blogging",
    "Identity": "Identidade",
    "IdentityServer": "Servidor de Identidade",
    "Saas": "Saas",
    "LanguageManagement": "Gestão da Língua",
    "TextTemplateManagement": "Gerenciamento de modelos de texto",
    "See All Modules": "SeeAllModules",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "ABP Suite é uma ferramenta complementar ao ABP Commercial.",
    "AbpSuiteExplanation": "Ele permite que você crie páginas da web em questão de minutos. É uma ferramenta .NET Core Global que pode ser instalada a partir da linha de comando. Ele pode criar uma nova solução ABP, gerar páginas CRUD do banco de dados para o front-end.",
    "Details": "Detalhes",
    "LeptonTheme": "Tema Lepton",
    "ProfessionalModernUIThemes": "Temas de IU profissionais e modernos",
    "LeptonThemeExplanation": "Lepton fornece uma gama de temas de administração do Bootstrap que servem como uma base sólida para qualquer projeto que requeira painel de administração.",
    "DefaultTheme": "Tema Padrão",
    "MaterialTheme": "Tema do Material",
    "Default2Theme": "Tema 2 padrão",
    "DarkTheme": "Tema escuro",
    "DarkBlueTheme": "Tema Azul Escuro",
    "LightTheme": "Tema claro",
    "ProudToWorkWith": "Orgulho de trabalhar com",
    "OurConsumers": "Milhares de empresas e desenvolvedores em mais de 70 países em todo o mundo confiam na ABP Commercial.",
    "JoinOurConsumers": "Junte-se a eles e crie produtos incríveis rapidamente.",
    "AdditionalServicesExplanation": "Você precisa de serviços adicionais ou personalizados? <strong> Nós e nossos parceiros podemos fornecer; </strong>",
    "CustomProjectDevelopment": "Desenvolvimento de Projeto Personalizado",
    "CustomProjectDevelopmentExplanation": "Desenvolvedores dedicados para seus projetos personalizados.",
    "PortingExistingProjects": "Portando Projetos Existentes",
    "PortingExistingProjectsExplanation": "Migrando seus projetos legados para a plataforma ABP.",
    "LiveSupport": "Suporte ao Vivo",
    "LiveSupportExplanation": "Opção de suporte remoto ao vivo quando você precisar.",
    "Training": "Treinamento",
    "TrainingExplanation": "Treinamento dedicado para seus desenvolvedores.",
    "OnBoarding": "Onboarding",
    "OnBoardingExplanation": "Ajude a configurar seus ambientes de desenvolvimento, CI e CD.",
    "PrioritizedTechnicalSupport": "Suporte Técnico Priorizado",
    "PremiumSupportExplanation": "Além do grande suporte da comunidade do framework ABP, nossa equipe de suporte responde a questões técnicas e problemas dos usuários comerciais com alta prioridade.",
    "SeeTheSupportOptions": "Veja as opções de suporte",
    "Contact": "Contato",
    "TellUsWhatYouNeed": "Diga-nos o que você precisa.",
    "YourMessage": "Sua mensagem",
    "YourFullName": "Seu nome completo",
    "FirstNameField": "Primeiro nome",
    "LastNameField": "Sobrenome",
    "EmailField": "Endereço de e-mail",
    "YourEmailAddress": "Seu endereço de email",
    "ValidEmailAddressIsRequired": "Um endereço de e-mail válido é obrigatório.",
    "HowMayWeHelpYou": "Como podemos ajudá-lo?",
    "SendMessage": "Enviar mensagem",
    "Success": "Sucesso",
    "WeWillReplyYou": "Recebemos sua mensagem e entraremos em contato em breve.",
    "GoHome": "Ir para casa",
    "CreateLiveDemo": "Criar demonstração ao vivo",
    "CreateLiveDemoDescription": "Depois de enviar este formulário, você receberá um e-mail contendo o link da sua demonstração.",
    "RegisterToTheNewsletter": "Cadastre-se no boletim informativo para receber informações sobre ABP.IO, incluindo novos lançamentos etc.",
    "EnterYourEmailOrLogin": "Digite seu endereço de e-mail para criar sua demonstração ou <a href=\"{0}\"> Faça login </a> usando sua conta existente.",
    "ApplicationTemplate": "Modelo de aplicativo",
    "ApplicationTemplateExplanation": "O modelo de inicialização do aplicativo é usado para criar um novo aplicativo da web.",
    "EfCoreProvider": "Entity Framework (suporta SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\"> e outros </a>)",
    "AlreadyIncludedInTemplateModules": "Os seguintes módulos já estão incluídos e configurados neste modelo:",
    "ApplicationTemplateArchitecture": "Este modelo de aplicativo também oferece suporte à arquitetura em camadas, em que a camada de IU, a camada de API e o serviço de autenticação são fisicamente separados.",
    "SeeTheGuideOrGoToTheLiveDemo": "Consulte o guia do desenvolvedor para obter informações técnicas sobre este modelo ou vá para a demonstração ao vivo.",
    "DeveloperGuide": "Guia do desenvolvedor",
    "ModuleTemplate": "Modelo de Módulo",
    "ModuleTemplateExplanation1": "Você deseja criar um módulo e reutilizá-lo em diferentes aplicativos? Este modelo de inicialização prepara tudo para começar a criar um <strong> módulo de aplicativo </strong> reutilizável ou um <strong> microsserviço </strong>.",
    "ModuleTemplateExplanation2": "<p> Você pode oferecer suporte a uma ou várias estruturas de IU, um ou vários provedores de banco de dados para um único módulo. O modelo de inicialização é configurado para executar e <strong> testar seu módulo </strong> em um aplicativo mínimo, além da unidade e da infraestrutura de teste de integração. </p> <p> Consulte o guia do desenvolvedor para obter informações técnicas sobre este modelo. </p>",
    "WithAllStyleOptions": "com todas as opções de estilo",
    "Demo": "Demo",
    "SeeAllModules": "Veja todos os módulos",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) é uma ferramenta de linha de comando para realizar algumas operações comuns para soluções baseadas em ABP.",
    "ABPSuiteEasilyCURD": "ABP Suite é uma ferramenta que permite criar facilmente páginas CRUD",
    "WeAreHereToHelp": "Estamos aqui para <span class=\"zero-text\"> ajudar </span>",
    "BrowseOrAskQuestion": "Você pode navegar em nossos tópicos de ajuda ou pesquisar as perguntas mais frequentes, ou pode nos fazer uma pergunta usando o <a href=\"{0}\" class=\"text-success\"> formulário de contato </a>.",
    "SearchQuestionPlaceholder": "Pesquise nas perguntas mais frequentes",
    "WhatIsTheABPCommercial": "O que é o comercial ABP?",
    "WhatAreDifferencesThanAbpFramework": "Quais são as diferenças entre o ABP Framework de código aberto e o ABP Commercial?",
    "AbpCommercialMetaTitle": "{0} | Comercial ABP",
    "AbpCommercialMetaDescription": "Uma plataforma abrangente de desenvolvimento web no ABP Framework com módulos pré-construídos, modelos de inicialização, ferramentas de desenvolvimento rápido, temas de UI profissionais e suporte premium.",
    "ABPCommercialExplanation": "ABP Commercial é um conjunto de módulos premium, ferramentas, temas e serviços desenvolvidos com base na <a target=\"_blank\" href=\"{0}\"> estrutura ABP </a> de código-fonte aberto. O ABP Commercial está sendo desenvolvido e apoiado pela mesma equipe por trás da estrutura ABP.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\"> A estrutura ABP </a> é uma estrutura de desenvolvimento de aplicativos compatível com microsserviços, modular, para ASP.NET Core. Ele fornece uma arquitetura completa e uma infraestrutura forte para que você se concentre em seu próprio código de negócios, em vez de se repetir a cada novo projeto. É baseado nas melhores práticas de desenvolvimento de software e ferramentas populares que você já conhece. </p> <p> A estrutura ABP é totalmente gratuita, de código aberto e dirigida pela comunidade. Ele também fornece um tema gratuito e alguns módulos pré-construídos (por exemplo, gerenciamento de identidade e gerenciamento de inquilino). </p>",
    "VisitTheFrameworkVSCommercialDocument": "Visite o seguinte link para obter mais informações <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial adiciona os seguintes benefícios no topo da estrutura ABP;",
    "Professional": "Profissional",
    "UIThemes": "Temas de IU",
    "EnterpriseModules": "Pronto para empresas, repleto de recursos, <a href=\"{0}\"> módulos de aplicativos </a> pré-construídos (por exemplo, gerenciamento de Identity Server, gerenciamento de SaaS, gerenciamento de linguagem)",
    "ToolingToSupport": "Ferramentas para apoiar sua produtividade de desenvolvimento (por exemplo, <a href=\"{0}\"> ABP Suite </a>)",
    "PremiumSupportLink": "<a href=\"{0}\" target=\"_blank\"> Suporte </a> premium",
    "WhatDoIDownloadABPCommercial": "O que eu faço download quando adquiro o comercial da ABP?",
    "CreateUnlimitedSolutions": "Depois de adquirir uma licença comercial ABP, você poderá criar soluções ilimitadas conforme descrito no documento <a href=\"{0}\"> Primeiros passos </a>.",
    "ABPCommercialSolutionExplanation": "Ao criar um novo aplicativo, você obtém uma solução do Visual Studio (um modelo de inicialização) com base em suas preferências. A solução baixada possui módulos e temas comerciais já instalados e configurados para você. Você pode remover um módulo pré-instalado ou adicionar outro módulo, se desejar. Todos os módulos e temas são usados como pacotes NuGet/NPM por padrão.",
    "StartDevelopWithTutorials": "A solução baixada é bem arquitetada e documentada. Você pode começar a desenvolver seu próprio código comercial com base nele seguindo <a href=\"{0}\"> os tutoriais </a>",
    "TryTheCommercialDemo": "Você pode experimentar <a href=\"{0}\"> a demonstração </a> para ver um aplicativo de amostra criado usando o modelo de inicialização comercial ABP.",
    "HowManyProducts": "Quantos produtos/soluções diferentes posso criar usando o comercial ABP?",
    "HowManyProductsExplanation": "Não há limite para criar um projeto ABP. Você pode criar quantos projetos quiser, desenvolvê-los e enviá-los para diferentes servidores.",
    "HowManyDevelopers": "Quantos desenvolvedores podem trabalhar no comercial ABP?",
    "HowManyDevelopersExplanation": "As licenças comerciais da ABP são por desenvolvedor. Diferentes tipos de licença têm diferentes limites de desenvolvedor. No entanto, você pode adicionar mais desenvolvedores a qualquer tipo de licença sempre que precisar. Consulte <a href=\"{0}\"> a página de preços </a> para os tipos de licença, limites do desenvolvedor e custos adicionais do desenvolvedor.",
    "ChangingLicenseType": "Posso atualizar meu tipo de licença mais tarde?",
    "ChangingLicenseTypeExplanation": "Você pode atualizar para uma licença superior pagando a diferença dentro do período de sua licença ativa. Ao atualizar para um plano de licença superior, você obtém os benefícios do novo plano, mas a atualização da licença não altera a data de expiração da licença. Além disso, você também pode adicionar novas licenças de desenvolvedor à sua licença existente, consulte \"Quantos desenvolvedores podem trabalhar no comercial ABP?\"",
    "LicenseExtendUpgradeDiff": "Qual é a diferença entre extensão de licença e atualização?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Extensão:</strong> ao estender/renovar sua licença, você continuará a obter suporte premium e obter atualizações principais ou secundárias para os módulos e temas. Além disso, você poderá continuar criando novos projetos. E você ainda poderá utilizar o ABP Suite que agiliza seu desenvolvimento. Ao estender sua licença, 1 ano é adicionado à data de expiração da licença. <hr/><strong>Atualização:</strong> Ao atualizar sua licença, você será promovido para um plano de licença superior que lhe permitirá obter benefícios adicionais. Confira a <a href=\"/pricing\">tabela de comparação de licenças</a> para ver as diferenças entre os planos de licença. <strong>Por outro lado, quando você atualizar, a data de expiração de sua licença não será alterada!</strong> Para estender a data de término de sua licença, você precisa estender sua licença.",
    "LicenseRenewalCost": "Qual é o custo de renovação da licença após 1 ano?",
    "LicenseRenewalCostExplanation": "O preço de renovação (extensão) da Licença de equipe padrão é $ {0}, a Licença comercial padrão é $ {1} e a Licença corporativa padrão é $ {2}. Se você já é um cliente, <a href='{3}' target='_blank'> faça login em sua conta </a> para verificar os preços de renovação disponíveis.",
    "HowDoIRenewMyLicense": "Como eu renovo minha licença?",
    "HowDoIRenewMyLicenseExplanation": "Você pode renovar sua licença navegando até a <a href='{0}' target='_blank'> página de gerenciamento da organização </a>. Para aproveitar nossas taxas de desconto de renovação antecipada, certifique-se de renovar antes que sua licença expire. Não se preocupe em não saber quando sua oportunidade de Renovação Antecipada terminará. Você receberá 3 e-mails de lembrete antes que sua assinatura expire. Iremos enviá-los 30 dias, 7 dias e 1 dia antes do vencimento.",
    "IsSourceCodeIncluded": "Minha licença inclui o código-fonte dos módulos e temas comerciais?",
    "IsSourceCodeIncludedExplanation1": "Depende do tipo de licença que você comprou:",
    "IsSourceCodeIncludedExplanation2": "<strong> Equipe </strong>: sua solução usa os módulos e os temas como pacotes NuGet e NPM. Não inclui seu código-fonte. Dessa forma, você pode atualizar facilmente esses módulos e temas sempre que uma nova versão estiver disponível. No entanto, você não pode obter o código-fonte dos módulos e dos temas.",
    "IsSourceCodeIncludedExplanation3": "<strong> Business/Enterprise </strong>: Além da licença Team, você pode baixar o código-fonte de qualquer módulo ou tema de que precisar. Você pode até mesmo remover as referências do pacote NuGet/NPM para um módulo específico e adicionar seu código-fonte diretamente à sua solução para alterá-lo totalmente.",
    "IsSourceCodeIncludedExplanation4": "<p> Incluir o código-fonte de um módulo em sua solução oferece o máximo de liberdade para personalizar esse módulo. No entanto, não será possível atualizar automaticamente o módulo quando uma nova versão for lançada. </p> <p> Nenhuma das licenças inclui o código-fonte do ABP Suite, que é uma ferramenta externa que gera código para você e ajuda para o seu desenvolvimento. </p> <p> Consulte <a href=\"{0}\"> a página de preços </a> para outras diferenças entre os tipos de licença. </p>",
    "ChangingDevelopers": "Posso mudar os desenvolvedores registrados da minha organização no futuro?",
    "ChangingDevelopersExplanation": "Além de adicionar novos desenvolvedores à sua licença, você também pode alterar os desenvolvedores existentes (você pode remover um desenvolvedor e adicionar um novo ao mesmo assento) sem nenhum custo adicional.",
    "WhatHappensWhenLicenseEnds": "O que acontece quando meu período de licença termina?",
    "WhatHappensWhenLicenseEndsExplanation1": "A licença comercial da ABP é uma <a href=\"{0}\" target=\"_blank=\">licença perpétua</a>. Após a expiração de sua licença, você pode continuar desenvolvendo seu projeto. E você não é obrigado a renovar sua licença. Sua licença vem com uma atualização de um ano e um plano de suporte fora da caixa. A fim de continuar a obter novos recursos, melhorias de desempenho, correção de bugs, suporte e continuar usando o ABP Suite, você precisa renovar sua licença. Quando sua licença expirar;",
    "WhatHappensWhenLicenseEndsExplanation2": "Você não pode criar novas soluções usando o ABP Commercial, mas pode continuar desenvolvendo suas aplicações existentes para sempre.",
    "WhatHappensWhenLicenseEndsExplanation3": "Você poderá obter atualizações para os módulos e temas dentro de sua versão MINOR (exceto as versões RC ou Preview). Por exemplo: se você estiver usando a v3.2.0 de um módulo, você ainda poderá obter atualizações para a v3.2.x (v3.2.1, v3.2.5... etc.) desse módulo. Mas você não pode obter atualizações para a próxima versão maior ou menor (como v3.3.0, v3.3.3, 4.x.x... etc.). Por exemplo, quando sua licença expirou, a última versão foi a v4.4.3, e mais tarde, publicou tanto a versão 4.4.4 quanto a 4.5.0, você poderia acessar a v4.4.X, mas não poderia acessar a v4.5.X.",
    "WhatHappensWhenLicenseEndsExplanation4": "Você não pode instalar novos módulos e temas adicionados à plataforma comercial da ABP após o término de sua licença.",
    "WhatHappensWhenLicenseEndsExplanation5": "Você não pode usar o ABP Suite",
    "WhatHappensWhenLicenseEndsExplanation6": "Você não pode mais obter o <a href==\"{0}\">apoio de premium</a>.",
    "WhatHappensWhenLicenseEndsExplanation7": "Você pode estender (renovar) sua licença se quiser continuar obtendo esses benefícios. Se você estender sua licença dentro de <strong>{3} dias</strong> após a expiração de sua licença, os seguintes descontos serão aplicados: Licença de equipe {0}; Licença Comercial {1}; Licença empresarial {2}.",
    "discountForYears": "{0}% de desconto por {1} ano(s)",
    "WhatHappensWhenLicenseEndsExplanation8": "Os projetos ABP que você gerou não são armazenados em nossos servidores. Portanto, é sua responsabilidade manter o código-fonte baixado. Quando sua licença expirar, não será possível obter o código-fonte do projeto ABP gerado.",
    "WhenShouldIRenewMyLicense": "Quando devo renovar minha licença?",
    "WhenShouldIRenewMyLicenseExplanation": "Se você renovar sua licença em <strong> {3} dias </strong> após a expiração da licença, os seguintes descontos serão aplicados: Licença de equipe {0} ; Licença de negócios {1} ; Licença empresarial {2} . Se você renovar sua licença <strong> {3} dias </strong> após a data de expiração de sua licença, o preço de renovação será o mesmo que o preço de compra da licença e não haverá desconto em sua renovação.",
    "TrialPlan": "Você tem um plano experimental?",
    "TrialPlanExplanation": "Sim, para iniciar sua avaliação gratuita, entre em contato com <a href=\"mailto:marketing@volosoft.com?subject=ABP Commercial — Trial License Request\">marketing@volosoft.com</a> . Também oferecemos uma garantia de devolução do dinheiro em 30 dias para a licença Team, sem perguntas! Você pode solicitar um reembolso total nos primeiros 30 dias após a compra da licença. Oferecemos um reembolso de 60% em 30 dias para licenças Business e Enterprise. Isso ocorre porque as licenças Business e Enterprise contêm o código-fonte completo de todos os módulos e temas.",
    "DoYouAcceptBankWireTransfer": "Você aceita transferência bancária?",
    "DoYouAcceptBankWireTransferExplanation": "Sim, aceitamos transferência bancária. <br /> Após enviar a taxa de licença por transferência bancária, envie-nos um e-mail para accounting@abp.io com seu recibo e o tipo de licença solicitada. Nossas informações de conta bancária internacional:",
    "HowToUpgrade": "Como atualizar os aplicativos existentes quando uma nova versão estiver disponível?",
    "HowToUpgradeExplanation1": "Quando você cria um novo aplicativo usando ABP Comercial, todos os módulos e o tema são usados como pacotes NuGet e NPM. Assim, você pode atualizar facilmente os pacotes quando uma nova versão estiver disponível.",
    "HowToUpgradeExplanation2": "Além das atualizações NuGet/NPM padrão, <a href=\"{0}\"> ABP CLI </a> fornece um comando de atualização que automaticamente encontra e atualiza todos os pacotes relacionados a ABP em sua solução.",
    "DatabaseSupport": "Quais sistemas de banco de dados são suportados?",
    "DatabaseSupportExplanation": "O próprio ABP Framework é agnóstico de banco de dados e pode funcionar com qualquer provedor de banco de dados por sua natureza. Consulte <a href=\"{0}\" target=\"_blank\"> o documento de acesso a dados </a> para obter uma lista dos provedores implementados atualmente.",
    "UISupport": "Quais estruturas de IU são suportadas?",
    "Supported": "Suportado",
    "UISupportExplanation": "O próprio ABP Framework é agnóstico em relação à estrutura de IU e pode funcionar com qualquer estrutura de IU. No entanto, os modelos de inicialização, módulos de UIs e temas não foram implementados para todos os frameworks de UI. Consulte <a href=\"{0}\"> o documento de primeiros passos </a> para obter a lista atualizada de opções de IU.",
    "MicroserviceSupport": "Ele suporta a arquitetura de micro-serviços?",
    "MicroserviceSupportExplanation1": "Um dos principais objetivos da estrutura ABP é fornecer uma infraestrutura conveniente para criar soluções de micro-serviços. Consulte o documento de <a href=\"{0}\"> arquitetura de microsserviço </a> para entender como isso ajuda a criar sistemas de microsserviço.",
    "MicroserviceSupportExplanation2": "Todos os módulos ABP Commercial são projetados para suportar cenários de implantação de micro-serviços (com sua própria API e banco de dados) seguindo o documento de <a href=\"{0}\"> melhores práticas de desenvolvimento de módulo </a>.",
    "MicroserviceSupportExplanation3": "Fornecemos um exemplo de <a href=\"{0}\"> solução de demonstração de microsserviço </a> que demonstra uma implementação de arquitetura de microsserviço para ajudá-lo a criar sua própria solução.",
    "MicroserviceSupportExplanation4": "Portanto, a resposta curta é \"<strong> sim, ele oferece suporte à arquitetura de micro-serviços </strong>\".",
    "MicroserviceSupportExplanation5": "No entanto, um sistema de microsserviço é uma solução e cada solução terá diferentes requisitos, topologia de rede, cenários de comunicação, possibilidades de autenticação, decisões de separação/compartilhamento de banco de dados, configurações de tempo de execução, integrações de sistemas de terceiros e muito mais.",
    "MicroserviceSupportExplanation6": "O ABP Framework e o ABP Commercial fornecem infraestrutura para cenários de micro-serviços, módulos compatíveis com micro-serviços, amostras e documentação para ajudá-lo a construir sua própria solução. Mas não espere baixar diretamente a solução dos seus sonhos pré-construída para você. Você precisará entendê-lo e reunir algumas partes com base em seus requisitos.",
    "WhereCanIDownloadSourceCode": "Onde posso baixar o código-fonte?",
    "WhereCanIDownloadSourceCodeExplanation": "Você pode baixar o código-fonte de todos os módulos ABP, pacotes e temas Angular via ABP Suite ou ABP CLI. Consulte <a href=\"{0}\"> Como fazer download do código-fonte? </a>",
    "ComputerLimitation": "Quantos computadores um desenvolvedor pode fazer login ao desenvolver ABP?",
    "ComputerLimitationExplanation": "Nós permitimos especificamente <strong> {0} computadores </strong> por desenvolvedor individual/licenciado. Sempre que houver necessidade de um desenvolvedor desenvolver produtos ABP Comerciais em uma terceira máquina, deverá ser enviado um e-mail para license@abp.io explicando a situação e faremos a devida alocação em nosso sistema.",
    "RefundPolicy": "Você tem uma política de reembolso?",
    "RefundPolicyExplanation": "Você pode solicitar um reembolso em <strong> 30 dias </strong> após a compra da licença. Os tipos de licença Business e Enterprise têm a opção de download do código-fonte, portanto, os reembolsos não estão disponíveis para Business e Enterprise (e quaisquer licenças que incluam o direito de receber o código-fonte). Além disso, nenhum reembolso é feito para renovações e compras de segunda licença.",
    "HowCanIRefundVat": "Como posso reembolsar o IVA?",
    "HowCanIRefundVatExplanation1": "Se você fez o pagamento usando 2Checkout, pode reembolsar o IVA por meio de sua conta 2Checkout:",
    "HowCanIRefundVatExplanation2": "Faça login em sua conta <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\"> 2Checkout </a>",
    "HowCanIRefundVatExplanation3": "Encontre o pedido apropriado e pressione \"Reembolsar IVA atrasado\" (insira seu ID de IVA)",
    "HowCanIGetMyInvoice": "Como posso obter minha fatura?",
    "HowCanIGetMyInvoiceExplanation": "Existem 2 gateways de pagamento para comprar uma licença: Iyzico e 2Checkout. Se você adquirir sua licença por meio do gateway 2Checkout, ele enviará a fatura em PDF para seu endereço de e-mail, consulte <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How- do-invoices-work \"> 2Fatura de checkout. </a> Se você comprar pelo gateway Iyzico, com link de compra personalizado ou por transferência bancária, prepararemos e enviaremos sua fatura. Você pode solicitar ou baixar sua fatura na <a href=\"{0}\"> página de gerenciamento da organização </a>. Antes de nos contactar para a fatura, consulte a página de gestão da sua organização!",
    "Forum": "Fórum",
    "SupportExplanation": "As licenças comerciais da ABP fornecem um suporte de fórum premium por uma equipe composta por especialistas do ABP Framework.",
    "PrivateTicket": "Ingresso Privado",
    "PrivateTicketExplanation": "A licença empresarial também inclui um suporte privado com sistema de e-mail e tíquetes.",
    "AbpSuiteExplanation1": "O ABP Suite permite que você crie páginas da web em questão de minutos. É uma ferramenta .NET Core Global que pode ser instalada a partir da linha de comando.",
    "AbpSuiteExplanation2": "Ele pode criar uma nova solução ABP, gerar páginas CRUD do banco de dados para o front-end. Para uma visão geral técnica, consulte <a href=\"{0}\"> o documento </a>",
    "FastEasy": "Rápido e fácil",
    "AbpSuiteExplanation3": "O ABP Suite permite que você crie facilmente páginas CRUD. Você só precisa definir sua entidade e suas propriedades, deixe o resto com o ABP Suite para você! O ABP Suite gera todo o código necessário para sua página CRUD em poucos segundos. Suporta interfaces de usuário Angular, MVC e Blazor.",
    "RichOptions": "Opções ricas",
    "AbpSuiteExplanation4": "O ABP Suite oferece suporte a várias opções de IU, como <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\"> Razor Pages </a> e <a href=\"https://angular.io\">Angular </a>. Também oferece suporte a vários bancos de dados como <a href=\"https://www.mongodb.com\"> MongoDB </a> e todos os bancos de dados suportados por <strong> EntityFramework Core </strong> (MS SQL Server, Oracle, MySql, PostgreSQL e <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\"> mais </a>).",
    "AbpSuiteExplanation5": "O bom é que você não precisa se preocupar com essas opções. O ABP Suite entende seu tipo de projeto e gera o código para seu projeto e coloca o código gerado no lugar correto em seu projeto.",
    "SourceCode": "Código fonte",
    "AbpSuiteExplanation6": "O ABP Suite gera o código-fonte para você! Ele não gera arquivos mágicos para gerar a página da web. O ABP Suite gera o código-fonte para <strong> Entidade, Repositório, Serviço de Aplicativo, Migração Code First, JavaScript/TypeScript e CSHTML/HTML </strong> e também as interfaces necessárias. O ABP Suite também gera o código de acordo com as <strong> Melhores Práticas </strong> de desenvolvimento de software, para que você não precise se preocupar com a qualidade do código gerado.",
    "AbpSuiteExplanation7": "Como você tem o código-fonte dos blocos de construção da página CRUD gerada nas camadas corretas do aplicativo, pode modificar facilmente o código-fonte e injetar sua lógica customizada/comercial no código gerado.",
    "CrossPlatform": "Plataforma Cruzada",
    "AbpSuiteExplanation8": "O ABP Suite é desenvolvido com .NET Core e é multiplataforma. Ele é executado como um aplicativo da web em seu computador local. Você pode executá-lo no <strong> Windows </strong>, <strong> Mac </strong> e <strong> Linux </strong>",
    "OtherFeatures": "Outras características",
    "OtherFeatures1": "Atualiza pacotes <strong>NuGet</strong> e <strong>NPM</strong> em sua solução facilmente.",
    "OtherFeatures2": "Regenera páginas já geradas do zero.",
    "OtherFeatures3": "Cria novas soluções",
    "ThanksForCreatingProject": "Obrigado por criar seu projeto!",
    "HotToRunSolution": "Como executar sua solução?",
    "HotToRunSolutionExplanation": "Consulte o documento de introdução para saber como configurar e executar sua solução.",
    "GettingStarted": "Começando",
    "WebAppDevTutorial": "Tutorial de desenvolvimento de aplicativo da web",
    "WebAppDevTutorialExplanation": "Consulte o documento do tutorial de desenvolvimento de aplicativo da web para obter um exemplo de desenvolvimento passo a passo.",
    "Document": "Documento",
    "UsingABPSuiteToCURD": "Usando ABP Suite para CRUD Page Generation & Tooling",
    "SeeABPSuiteDocument": "Consulte o documento ABP Suite para aprender a usar o ABP Suite.",
    "AskQuestionsOnSupport": "Você pode fazer perguntas no Suporte Comercial ABP.",
    "Documentation": "Documentação",
    "SeeModulesDocument": "Consulte o documento de módulos para obter uma lista de todos os módulos comerciais(pro) e seus documentos.",
    "Pricing": "Preços",
    "PricingExplanation": "Escolha os recursos e a funcionalidade de que sua empresa precisa hoje. Atualize facilmente à medida que sua empresa cresce.",
    "Team": "Equipe",
    "Business": "O negócio",
    "Enterprise": "Empreendimento",
    "Custom": "Personalizado",
    "IncludedDeveloperLicenses": "Licenças de desenvolvedor incluídas",
    "CustomLicenceOrAdditionalServices": "Precisa de licença personalizada ou serviços adicionais?",
    "CustomOrVolumeLicense": "Licença personalizada ou por volume",
    "LiveTrainingSupport": "Treinamento e suporte ao vivo",
    "AndMore": "e mais",
    "AdditionalDeveloperLicense": "Licença de desenvolvedor adicional",
    "ProjectCount": "Contagem de projetos",
    "AllProModules": "Todos os módulos profissionais",
    "AllProThemes": "Todos os temas profissionais",
    "AllProStartupTemplates": "Todos os modelos de inicialização profissionais",
    "SourceCodeOfAllModules": "Código fonte de todos os módulos",
    "SourceCodeOfAllThemes": "Código fonte de todos os temas",
    "PerpetualLicense": "Licença perpétua",
    "UnlimitedServerDeployment": "Implantação de servidor ilimitada",
    "YearUpgrade": "Atualização de 1 ano",
    "YearPremiumForumSupport": "Suporte de fórum premium por 1 ano",
    "ForumSupportIncidentCountYear": "Contagem de incidentes de suporte do fórum/ano",
    "PrivateTicketEmailSupport": "Tíquete privado e suporte por e-mail",
    "BuyNow": "Compre Agora",
    "PayViaAmexCard": "Como posso pagar com meu cartão AMEX?",
    "PayViaAmexCardDescription": "O gateway de pagamento padrão 'Iyzico' pode recusar alguns cartões de crédito AMEX devido a medidas de segurança. Neste caso, você pode pagar através do portal de pagamento alternativo '2Checkout'.",
    "ThankYou": "Obrigado",
    "InvalidReCaptchaErrorMessage": "Ocorreu um erro ao verificar o reCAPTCHA. Por favor, tente novamente.",
    "CompanyName": "Nome da empresa",
    "YourCompanyName": "O nome da sua empresa",
    "FirstName": "Primeiro nome",
    "LastName": "Último nome",
    "Optional": "Opcional",
    "YourFirstName": "Seu primeiro nome",
    "YourLastName": "Seu último Nome",
    "SpecialOffer": "Oferta especial",
    "SpecialOfferMessage": "Se apresse! Os preços são válidos por tempo limitado.",
    "DiscountRequest": "Pedido de desconto",
    "DiscountRequestDescribeCustomerQuestion": "Qual das seguintes opções descreve você?",
    "DiscountRequestStudentEmailMessage": "O endereço de e-mail deve conter 'edu'.",
    "DiscountRequestDeveloperCount": "Quantos desenvolvedores você é?",
    "DiscountRequestDeveloperCountExceedMessage": "Não oferecemos licença com desconto para empresas que possuem mais de {0} desenvolvedores.",
    "DiscountRequestOrganizationName": "Nome da empresa/organização/escola",
    "Website": "Local na rede Internet",
    "GithubUsername": "Nome de usuário GitHub",
    "PhoneNumber": "Número de telefone",
    "Country": "País",
    "DescribeABPCommercialUsage": "Descreva o projeto que você está planejando desenvolver com base no APB Comercial",
    "DiscountRequestCertifyInformationMessage": "Certifico que todas as informações são verdadeiras e corretas.",
    "DiscountRequestReceived": "Recebemos sua solicitação de desconto.",
    "DiscountRequestStatusMessage": "Responderemos a você após verificar as informações fornecidas.",
    "MVCOrRazorPages": "MVC (páginas do Razor)",
    "Angular": "Angular",
    "Blazor": "Blazor",
    "New": "Novo",
    "MongoDB": "MongoDB",
    "EBookDDD": "Design baseado em domínio de e-book",
    "PracticalGuideForImplementingDDD": "Este livro é um guia prático para implementar o Domain Driven Design com o ABP Framework.",
    "IntroducingDDD": "Apresentando o Domain Driven Design",
    "DDDLayersAndCleanArchitecture": "Camadas DDD e arquitetura limpa",
    "LayeringOfADotnetSolution": "Camada de uma solução .NET",
    "ImplementingDDDBuildingBlocks": "Implementando blocos de construção DDD",
    "DomainVsApplicationLogic": "Lógica de domínio versus lógica de aplicativo",
    "SamplesAndDiscussions": "Amostras e discussões",
    "Free": "Sem custos",
    "Download": "Download",
    "DDDEBook": "DDD E-book",
    "ImplementingDDD": "Implementando Design Orientado a Domínio",
    "DDDBookExplanation": "Um guia prático para implementar o Domain Driven Design com o ABP Framework.",
    "Overview": "Visão geral",
    "DDDBookPracticalGuide": "Este é um guia prático para implementar o Domain Driven Design (DDD). Embora os detalhes de implementação dependam da infraestrutura do ABP Framework, os principais conceitos, princípios e padrões são aplicáveis em qualquer tipo de solução, mesmo que não seja uma solução .NET.",
    "TableOfContents": "Índice",
    "IntroductionToImplementingDDD": "Introdução à implementação de design orientado a domínio",
    "WhatIsDDD": "O que é Domain Driven Design?",
    "Implementation": "Implementação",
    "TheBigPicture": "A grande imagem",
    "TheBuildingBlock": "O Bloco de Construção",
    "ExampleUseCase": "Exemplo de caso de uso",
    "DomainAndApplicationLogic": "Lógica de domínio e lógica de aplicativo",
    "Author": "Autor",
    "PublishedOn": "publicado em",
    "Page": "Página",
    "FreeEBook": "E-book grátis",
    "EBookSignInForDownload": "Para baixar o e-book, faça login",
    "SignIn": "Entrar",
    "Or": "Ou",
    "TellUsAboutYourself": "Conte-nos um pouco sobre você",
    "Surname": "Sobrenome",
    "DoYouAgreePrivacyPolicy": "Eu concordo com os <a href=\"/TermsConditions\"> Termos e Condições <a/> e a <a href=\"/Privacy\"> Política de Privacidade </a>.",
    "VolosoftMarketingInformationMessage": "Desejo informações, dicas e ofertas sobre Soluções para Empresas e Organizações e outros produtos e serviços da Volosoft.",
    "VolosoftSharingInformationMessage": "Gostaria que a Volosoft compartilhasse minhas informações com parceiros selecionados para que eu pudesse receber informações relevantes sobre seus produtos e serviços.",
    "WeWillSendYouADownloadLink": "Um link para baixar o e-book foi enviado para {0}. <br/> Verifique sua caixa de entrada/caixas de lixo/spam!",
    "InvalidFormInputs": "Por favor, digite as informações válidas especificadas no formulário.",
    "DDDBookEmailBody": "Obrigada. <br /> Para baixar seu livro, <a href=\"{0}\"> clique aqui </a>.",
    "StartFree": "Comece de graça",
    "FreeTrial": "Teste grátis",
    "AcceptsMarketingCommunications": " Sim, desejo receber comunicações de marketing comercial da ABP.",
    "PurposeOfUsage": "Objetivo de uso",
    "Choose": "- Escolher -",
    "CompanyOrganizationName": "Nome da empresa/organização",
    "CompanySize": "Tamanho da empresa",
    "Next": "Próximo",
    "StartTrial": "Comece meu teste grátis",
    "ContactUsQuestions": "Entre em contato conosco se tiver alguma dúvida",
    "TrialActivatedWarning": "Um usuário tem direito a apenas 1 período de teste gratuito. Você já usou seu período de teste.",
    "ActivationRequirement": "Você está a um passo de iniciar seu teste.<br> Após verificar suas informações, ativaremos sua licença. Assim que sua licença for ativada, enviaremos um e-mail para <b>{0}</b> . Não se preocupe, esse processo não demorará muito!",
    "SaveAndDownload": "Salvar e baixar",
    "CompanyNameValidationMessage": "O nome da empresa é muito longo!",
    "AddressValidationMessage": "O endereço é muito longo!",
    "TaxNoValidationMessage": "TAX/VAT Não é muito longo!",
    "NotesValidationMessage": "O campo de notas é muito longo!",
    "CheckYourBillingInfo": "Você pode criar sua fatura apenas uma vez! Verifique suas informações de faturamento antes de criar sua fatura.",
    "StartYourFreeTrial": "Inicie o seu teste gratuito",
    "TrialLicenseModelInvalidErrorMessage": "Um dos campos a seguir é inválido: nome do país, tamanho da empresa, setor ou finalidade do uso.",
    "Trial": "Tentativas",
    "Purchased": "Comprado",
    "PurchaseNow": "Compre agora",
    "PurchaseTrialLicenseMessage": "A data de expiração da sua licença é {0}. <br> Se você deseja continuar usando os projetos que criou durante o período de teste gratuito, você precisa alterar as chaves de licença em seus arquivos <code> appsettings.secrets.json </code>. Aqui está sua chave de licença:",
    "TrialLicenseExpireMessage": "Você está usando a licença de teste e sua licença de teste irá expirar em {0}.",
    "TryForFree": "Experimentar gratuitamente",
    "TrialLicenseExpiredInfo": "Seu período de licença de teste expirou!",
    "DowngradeLicensePlan": "Posso baixar para um plano de licença mais baixo no futuro?",
    "DowngradeLicensePlanExplanation": "Você não pode rebaixar seu plano de licença existente. Mas você pode adquirir um novo plano de licença inferior e continuar seu desenvolvimento com a nova licença. Após adquirir uma licença inferior, você só precisa fazer o login em seu novo plano de licença via comando ABP CLI: abp login <nome do usuário> -o <organização> `.",
    "LicenseTransfer": "Uma licença pode ser transferida de um desenvolvedor para outro?",
    "LicenseTransferExplanation": "Sim! Ao adquirir uma licença, você se torna o detentor da licença, portanto, você terá acesso à página de gerenciamento da organização. Uma organização tem funções de proprietário e desenvolvedor. Os proprietários podem gerenciar os cargos de desenvolvedor e designar desenvolvedores. Cada desenvolvedor designado fará login via comando ABP CLI no sistema e terá permissões de desenvolvimento e suporte.",
    "UserOwnerDescription": "O &#39;Proprietário&#39; da organização é o administrador desta conta. Ele/ela gerencia a organização comprando licenças e alocando desenvolvedores. Um &#39;Proprietário&#39; não pode escrever código nos projetos comerciais do ABP, não pode baixar os projetos de amostra do ABP e não pode fazer perguntas no site de suporte. Se quiser fazer tudo isso, você também deve se adicionar como desenvolvedor.",
    "UserDeveloperDescription": "Os &#39;Desenvolvedores&#39; podem escrever código nos projetos comerciais da ABP, baixar os projetos de amostra da ABP e fazer perguntas no site de suporte. Por outro lado, os &#39;Desenvolvedores&#39; não podem gerir esta organização.",
    "RemoveCurrentUserFromOrganizationWarningMessage": "Você está se retirando de sua própria organização. Você não poderá mais gerenciar esta organização, confirma?",
    "RenewExistingOrganizationOrCreateNewOneMessage": "Você pode renovar a licença da(s) sua(s) organização(ões) clicando no(s) botão(ões) &quot;Estender agora&quot; abaixo e, assim, estender a data de expiração da licença por 1 ano. Se continuar a finalizar a compra, você terá uma nova organização. Você quer continuar com uma nova organização?",
    "PurchaseTrialOrganizationOrCreateNewOneMessage": "Você tem uma licença de teste. Para adquirir sua licença de avaliação, clique no botão Comprar agora. Se continuar a finalizar a compra, você terá uma nova organização. Você quer continuar com uma nova organização?",
    "ExtendNow": "Estenda agora",
    "CreateNewOrganization": "Criar uma nova organização",
    "RenewLicenseEarly": "Se eu renovar minha licença mais cedo, terei o ano todo",
    "RenewLicenseEarylExplanation": "Quando você renovar sua licença antes da data de expiração, 1 ano será adicionado à data de expiração de sua licença. Por exemplo, se sua licença expirar em {0}-06-06 e você a renovar em {0}-01-01, sua nova data de expiração será {1}-06-06.",
    "OpenSourceWebApplication": "Aplicativo web de código aberto",
    "CompleteWebDevelopment": "Um desenvolvimento web completo",
    "ABPFrameworkDescription": "ABP Framework é uma infraestrutura completa para criar aplicações web modernas seguindo as melhores práticas de desenvolvimento de software e convenções.",
    "CommunityDescription": "Compartilhe suas experiências com o Framework ABP!",
    "GetStarted": "Iniciar",
    "Views": "Visualizações",
    "LatestPosts": "últimas postagens",
    "PreBuiltApplication": "Aplicativo pré-construído",
    "DatabaseProviders": "Provedores de banco de dados",
    "UIFrameworks": "Estruturas de IU",
    "UsefulLinks": "Links Úteis",
    "Platform": "Plataforma",
    "CoolestCompaniesUseABPCommercial": "As empresas mais legais já usam <span class=\"fw-bold\">o ABP Comercial.</span>",
    "UserInterface": "Interface de usuário",
    "APIGateway": "Gateway de API",
    "Microservice": "Microsserviço",
    "Database": "Base de dados",
    "Architecture": "Arquitetura",
    "MicroserviceArchitectureExplanation": "Esta é uma arquitetura de solução completa que consiste em vários aplicativos, gateways de API, microsserviços e bancos de dados para construir uma solução de microsserviços escalável com as tecnologias mais recentes.",
    "BusinessLogic": "Logíca de negócios",
    "DataAccessLayer": "Camada de acesso a dados",
    "Monolith": "Monólito",
    "ModularArchitectureExplanation": "Este modelo de inicialização fornece uma arquitetura de solução em camadas, modular e baseada em DDD para construir uma base de código limpa e sustentável.",
    "SeeDetails": "Veja detalhes",
    "SeeDocumentation": "Confira a Documentação",
    "Bs5Compatible": "Tema profissional compatível com Bootstrap 5, perfeito para o seu site administrativo.",
    "LeptonXTheme": "Tema LeptonX",
    "LeptonXDark": "LeptonX escuro",
    "LeptonXLight": "LeptonX Luz",
    "LeptonXSemiDark": "LeptonX Semi-Escuro",
    "BuiltOnBs5Library": "Construído na biblioteca Bootstrap 5",
    "FullyCompatibleWithBs5": "100% compatível com estrutura HTML e classes CSS do Bootstrap 5",
    "ResponsiveAndMobileCompatible": "Suporte RTL responsivo e compatível com dispositivos móveis",
    "ProvidesStylesForDatatables": "Fornece estilos para tabelas de dados",
    "MultipleLayoutOptions": "Várias opções de layout",
    "EasilyInstallAndUpgrade": "Instale e atualize facilmente",
    "SupportForum": "Fórum de suporte",
    "TrustedBy": "Confiável por",
    "OurPricing": "Nossos <span class=\"gradient-commercial\">preços</span>",
    "Plans": "Planos",
    "NameSurname": "Nome sobrenome",
    "Unspecified": "Não especificado",
    "LicenceType": "Tipo de licença",
    "LicenseDiscountWarning": "ESTA PÁGINA DE DESCONTO USA CÓDIGO DE DESCONTO PADRÃO E PARA DESENVOLVEDORES VOLOSOFT. LINKS DE COMPRA ABAIXO NÃO FUNCIONAM.",
    "DiscountedLicenseExplanation": "Esses preços de licença são para pequenas startups, desenvolvedores individuais, estudantes, organizações e projetos sem fins lucrativos!",
    "General": "Em geral",
    "License": "Licença",
    "Development": "Desenvolvimento",
    "Payment": "Pagamento",
    "WatchExplainerVideo": "Vamos nos encontrar! Assista ao vídeo explicativo",
    "LightDarkAndSemiDarkThemes": "Claro, escuro e semi-escuro",
    "LeptonXThemeExplanation": "Lepton Theme pode alterar seu tema de acordo com as configurações do sistema.",
    "PRO": "PRÓ",
    "WelcomeToABPCommercial": "Bem-vindo à <span class=\"gradient-commercial\">ABP Comercial!</span>",
    "YourAccountDetails": "Detalhes da sua conta",
    "OrganizationName": "Nome da organização",
    "AddDevelopers": "Adicionar desenvolvedores",
    "StartDevelopment": "Iniciar o desenvolvimento",
    "CreateAndRunApplicationUsingStartupTemplate": "Aprenda como criar e executar um novo aplicativo web usando o modelo de inicialização comercial da ABP.",
    "CommunityDescription2": "<span class=\"fw-6\">community.abp.io</span> é um lugar onde as pessoas podem compartilhar artigos relacionados à ABP. Pesquise artigos, tutoriais, exemplos de código, estudos de caso e conheça pessoas na mesma área que você.",
    "UseABPSuiteExplanation": "Utilize o ABP Suite para baixar o código-fonte dos módulos e temas.",
    "ManageModulesWithSuite": "Você também pode gerenciar seus módulos ABP com o Suite.",
    "LearnHowToInstallSuite": "Aprenda como instalar e usar o ABP Suite.",
    "SeeMore": "Ver mais",
    "SeeLess": "Ver menos",
    "LayeredSolutionStructure": "Estrutura da solução em camadas",
    "LayeredSolutionStructureExplanation": "A solução é dividida em camadas com base nos princípios e padrões do Domain Driven Design para isolar sua lógica de negócios da infraestrutura e das integrações e para maximizar a capacidade de manutenção e reutilização do código. O ABP Framework já fornece abstrações, classes base e guias para realmente implementar DDD em sua aplicação.",
    "MultipleUIOptions": "Várias opções de interface do usuário",
    "MultipleUIOptionsExplanation": "Adoramos diferentes maneiras de criar a interface do usuário. Esta solução inicial oferece três opções diferentes de estrutura de UI para seu aplicativo de negócios.",
    "MultipleDatabaseOptions": "Várias opções de banco de dados",
    "MultipleDatabaseOptionsExplanation": "Você tem duas opções de provedor de banco de dados (além de usar ambos em uma única aplicação). Use o Entity Framework Core para trabalhar com qualquer banco de dados relacional e, opcionalmente, use o Dapper quando precisar escrever consultas de baixo nível para obter melhor desempenho. MongoDB é outra opção se você precisar usar um banco de dados NoSQL baseado em documentos. Embora esses provedores sejam bem integrados, abstraídos e pré-configurados, você pode realmente interagir com qualquer sistema de banco de dados que possa usar com .NET.",
    "ModularArchitectureExplanation2": "A modularidade é um cidadão de primeira classe na plataforma ABP.IO. Todas as funcionalidades do aplicativo estão divididas em módulos opcionais bem isolados. A solução startup já vem com os <a href=\"/modules\" class=\"text-primary\">módulos comerciais fundamentais da ABP</a> pré-instalados. Você também pode criar seus próprios módulos para construir um sistema modular para sua própria aplicação.",
    "MultiTenancyForSaasBusiness": "Multilocação para seu negócio SaaS",
    "MultiTenancyForSaasBusinessExplanation": "ABP Commercial fornece um sistema multilocatário completo e ponta a ponta para criar seus sistemas SaaS (Software como Serviço). Ele permite que os locatários compartilhem ou tenham seus próprios bancos de dados com sistema de criação e migração de banco de dados em tempo real.",
    "MicroserviceStartupSolution": "Solução de inicialização de microsserviços",
    "MicroserviceArchitectureExplanation2": "Você pode obtê-lo em seu próximo sistema de microsserviço para aproveitar as vantagens da solução base pré-construída e da experiência destilada.",
    "PreIntegratedTools": "Pré-integrado a ferramentas populares",
    "PreIntegratedToolsExplanation": "A solução já está integrada às ferramentas e tecnologias padrão do setor, mas você sempre pode alterá-las e integrá-las às suas ferramentas favoritas.",
    "SingleSignOnAuthenticationServer": "Servidor de autenticação de logon único",
    "SingleSignOnAuthenticationServerExplanation": "A solução possui um aplicativo de servidor de autenticação que é utilizado pelos demais aplicativos como um servidor de logon único com recursos de gerenciamento de acesso API. É baseado no IdentityServer.",
    "WebAppsWithGateways": "2 aplicativos da Web com 2 gateways de API",
    "WebAppsWithGatewaysExplanation": "A solução contém duas aplicações web, cada uma possui um gateway API dedicado (padrão BFF - Backend For Frontend).",
    "BackOfficeApplication": "Aplicativo de back-office",
    "BackOfficeApplicationExplanation": "A aplicação web real do seu sistema, com múltiplas opções de estrutura de UI. Você pode criar qualquer tipo de aplicativo comercial.",
    "LandingWebsite": "Site de destino",
    "LandingWebsiteExplanation": "Um site público/de destino genérico que pode ser usado para diversos fins, como apresentar sua empresa, vender seus produtos, etc.",
    "ABPFrameworkEBook": "E-book Dominando o Framework ABP",
    "MasteringAbpFrameworkEBookDescription": "Incluído em sua licença comercial ABP",
    "FullName": "Nome completo",
    "LicenseTypeNotCorrect": "O tipo de licença não está correto!",
    "Trainings": "Treinamentos",
    "ChooseTrainingPlaceholder": "Escolha o treinamento...",
    "DoYouNeedTrainings": "Você precisa de um desses treinamentos?",
    "DoYouNeedTraining": "Você precisa de {0} treinamento?",
    "GetInTouchUs": "Entre em contato conosco",
    "ForMoreInformationClickHere": "Para mais informações, clique <a href='{0}'>aqui.</a>",
    "ForMoreInformationClickHereByClass": "<span class=\"{1}\">Para mais informações, clique</span> <a href='{0}'>aqui.</a>",
    "IsGetOnboardingTraining": "Você gostaria de receber treinamento de integração e desenvolvimento de aplicativos da web?",
    "OnboardingWebApplicationDevelopmentTrainingMessage": "Para agendar seu calendário de treinamento, entre em contato com {0} após criar a organização",
    "CustomPurchaseMessage": "Para a próxima etapa, clique em {0} para entrar em contato conosco.",
    "Note": "Observação",
    "AdditionalNote": "Nota adicional",
    "OnboardingTrainingFaqTitle": "Você tem treinamento de ABP a bordo?",
    "OnboardingTrainingFaqExplanation": "Sim, temos serviços de treinamento ABP para ajudá-lo a iniciar seu projeto ABP rapidamente. Você aprenderá sobre ABP com um membro da equipe principal da ABP e obterá as habilidades para iniciar seu projeto ABP. No treinamento de integração, explicaremos como configurar seu ambiente de desenvolvimento, instalar as ferramentas necessárias e criar uma página CRUD totalmente funcional. O treinamento será ao vivo, e será utilizado o aplicativo Zoom, estamos abertos a utilizar outras plataformas de reuniões online. O idioma do treinamento será o inglês. Você também pode tirar suas dúvidas sobre ABP durante as sessões. Um horário e data convenientes serão planejados para ambas as partes. Para obter mais informações, entre em contato conosco pelo <a href=\"mailto:info@abp.io\">e-mail info@abp.io</a> .",
    "AddBasket": "Adicionar a cesta",
    "SendTrainingRequest": "Enviar solicitação de treinamento",
    "OnlyEnglishVersionOfThisDocumentIsTheRecentAndValid": "* A versão em inglês deste documento é a mais atualizada e a versão em inglês prevalecerá em qualquer disputa.",
    "Pricing_Page_Title": "Preços e Planos",
    "Pricing_Page_Description": "Escolha os recursos e funcionalidades que sua empresa precisa hoje. Compre uma licença comercial ABP e crie projetos ilimitados.",
    "Pricing_Page_HurryUp": "Se apresse!",
    "Pricing_Page_BuyLicense": "Compre uma licença a <strong>preços de 2021</strong> até 16 de janeiro!",
    "Pricing_Page_ValidForExistingCustomers": "Também válido para clientes existentes e renovações de licença.",
    "Pricing_Page_Hint1": "O preço da licença inclui um certo número de licenças de desenvolvedor. Se você tiver mais desenvolvedores, poderá sempre adquirir licenças adicionais.",
    "Pricing_Page_Hint2": "Você pode adquirir mais licenças de desenvolvedor agora ou no futuro. As licenças são baseadas em licenças, portanto você pode transferir uma licença de um desenvolvedor para outro.",
    "Pricing_Page_Hint3": "Você pode desenvolver uma contagem ilimitada de produtos diferentes com sua licença.",
    "Pricing_Page_Hint4": "ABP Suite é uma ferramenta para auxiliar seu desenvolvimento para melhorar sua produtividade. Suporta a geração de páginas CRUD e a criação de novos projetos.",
    "Pricing_Page_Hint5": "Você pode usar todos os módulos pré-construídos em seus aplicativos.",
    "Pricing_Page_Hint6": "Você pode usar todos os temas pré-construídos em seus aplicativos.",
    "Pricing_Page_Hint7": "Um modelo de inicialização é uma solução do Visual Studio para ajudar você a iniciar seu projeto. Todos os módulos fundamentais são adicionados e pré-configurados para você.",
    "Pricing_Page_Hint8": "O e-book Mastering ABP Framework explica como implementar soluções .NET com as melhores práticas. É vendido na Amazon.com e você pode baixar o livro gratuitamente com sua licença.",
    "Pricing_Page_Hint9": "Você pode baixar o código-fonte de qualquer módulo. Você pode adicionar o código-fonte à sua solução para fazer alterações radicais ou apenas mantê-lo para você por motivos de segurança.",
    "Pricing_Page_Hint10": "As licenças são vitalícias. Isso significa que você pode continuar desenvolvendo seu aplicativo para sempre. O acesso à versão mais recente e a obtenção de suporte são concedidos dentro do período de licença (1 ano, a menos que você a renove).",
    "Pricing_Page_Hint11": "Sem restrições de implantação! Você pode implantar em quantos servidores desejar, incluindo serviços em nuvem ou locais.",
    "Pricing_Page_Hint12": "Você pode atualizar os módulos, temas e ferramentas para a versão mais recente dentro do período de licença ativa. Depois que sua licença expirar, você precisará renová-la para continuar recebendo atualizações para correções de bugs, novos recursos e melhorias.",
    "Pricing_Page_Hint13": "Você pode obter suporte premium por um ano (você pode renovar sua licença para estendê-la).",
    "Pricing_Page_Hint14": "As licenças Team e Business têm limite de contagem de incidentes/perguntas. Se você comprar licenças de desenvolvedor adicionais, seu limite de incidentes aumentará em {0} (para a licença de equipe) ou {1} (para a licença comercial) por desenvolvedor.",
    "Pricing_Page_Hint15": "Somente a Licença Empresarial inclui suporte privado. Você pode enviar um e-mail diretamente para a equipe ABP ou tirar dúvidas em support.abp.io com opção de ticket privado. Os ingressos privados não são visíveis ao público.",
    "Pricing_Page_Hint16": "Você pode baixar o código-fonte de todos os temas ABP. Você pode adicionar o código-fonte à sua solução para fazer alterações radicais ou apenas mantê-lo para você por motivos de segurança.",
    "Pricing_Page_Testimonial_1": "ABP Commercial permitiu que a SC Ventures entregasse uma plataforma SaaS de banco de dados de silo multilocatário de nível bancário em 9 meses para apoiar o financiamento da cadeia de suprimentos de contas a receber/contas a pagar de faturas de valor significativo de múltiplas âncoras integradas. A modularidade do ABP possibilitou que a equipe entregasse em tempo recorde, passasse por todos os VAPT e implantasse a pilha de microsserviços em contêineres por meio de CI/CD completo e pipelines na produção.",
    "Pricing_Page_Testimonial_2": "Vemos o valor de usar o ABP Commercial para reduzir as despesas gerais de projetos de desenvolvimento personalizados. A equipe é capaz de unificar o padrão de código em diferentes fluxos de projeto. Vemos mais potencial na estrutura para construirmos novos recursos mais rapidamente do que antes. Confiamos que veremos constantemente o valor de alavancar a ABP Commercial.",
    "Pricing_Page_Testimonial_3": "Nós amamos a ABP. Não precisamos escrever tudo do zero. Começamos com recursos prontos para uso e nos concentramos apenas no que realmente precisamos escrever. Além disso, o ABP é bem arquitetado e o código é de alta qualidade com menos bugs. Se tivéssemos que escrever tudo o que precisávamos sozinhos, talvez levassemos anos. Mais uma coisa de que gostamos é que a nova versão, correção de problemas ou melhorias serão lançadas em breve, a cada duas semanas. Não esperamos muito.",
    "Pricing_Page_Testimonial_4": "ABP Commercial é um produto fantástico que recomendo. Produtos comerciais para comercializar para nossos clientes em uma única plataforma configurável. O salto começa com o fato de que a estrutura e as ferramentas fornecidas a qualquer equipe valem cada centavo. A ABP Commercial foi a que melhor atendeu às nossas necessidades.",
    "Pricing_Page_Testimonial_5": "O ABP Framework não é apenas um framework, mas também um guia para desenvolvimento/gerenciamento de projetos, pois fornece treinamento em DDD, GenericRepository, DI, Microservice e Modularidade. Mesmo que não vá usar o framework em si, você pode desenvolver-se com docs.abp.io que está bem preparado e profissionalmente (OpenIddict, Redis, Quartz etc.). Como muitas coisas são pré-construídas, isso reduz significativamente o tempo de desenvolvimento do projeto (como página de login, tratamento de exceções, filtragem de dados, propagação, registro de auditoria, localização, controlador automático de API, etc.). Como exemplo de nossa aplicação, usei o Local Event Bus para controle de estoque. Portanto, sou capaz de gerenciar os movimentos dos pedidos escrevendo o gerenciador de estoque. É maravilhoso não perder tempo com CreationTime, CreatorId. Eles estão sendo preenchidos automaticamente.",
    "Pricing_Page_Testimonial_6": "O ABP Framework é um bom framework, mas precisa de tempo para entender as diferentes camadas, classes e bibliotecas que usa (especialmente o ABP). Passei muito tempo lendo a base de código, mas o ABP Commercial nos economizou tempo na criação das entidades especializadas (AR) do projeto e do repositório vinculado a cada uma delas. Gostei também da abordagem utilizada no ABP que é muito madura; sabemos que é baseado em DDD e Monolith.",
    "Pricing_Page_Testimonial_7": "Como uma startup, precisamos iterar rapidamente e gastar o mínimo de tempo em recursos padronizados e não essenciais. \n Nossos engenheiros variam de engenheiros altamente experientes a juniores, e precisávamos de um entendimento comum e de uma maneira de compartilhar conhecimento técnico e de domínio. A ABP nos permitiu fazer isso devido aos seus excelentes guias e documentação. \n Há coisas com as quais não precisamos nos preocupar, pois elas funcionam imediatamente com o ABP. \n ABP nos ajudou a agilizar a prototipagem e o desenvolvimento rápidos, em menos de 4 semanas desde o início do recurso até a produção. Com todos os seus recursos premium incluídos na licença, a ABP nos deu “Startup in a Box” no lado da engenharia de software.",
    "Pricing_Page_Testimonial_8": "Eu recomendaria o comercial ABP a todos aqueles que desejam ampliar a gama de produtos à disposição de seus clientes. É fantástico quando é necessário usar um ambiente corporativo distribuído (Angular, WPF, Win&amp;Linux). Além dos produtos, adoramos o suporte, o que torna nosso trabalho mais rápido e fácil. Já sabemos que encontramos um grande parceiro para o futuro que nos apoiará na expansão do nosso negócio.",
    "Pricing_Page_Testimonial_9": "Somos uma empresa de 2 funcionários que está no mercado há mais de 20 anos. \n Em termos de nossa experiência com a ABP Comercial, fomos abordados por um cliente que solicitou que desenvolvêssemos um novo aplicativo de recursos humanos em um ambiente moderno para substituir seu aplicativo Access de 25 anos. Decidimos fazer a transição de uma solução desktop para uma baseada na web. \n \n Na época, tínhamos muito pouco conhecimento de aplicações web e .NET, mas nos deparamos com o ABP Commercial e, com a ajuda do ABP Framework, da documentação técnica e do ABP Suite, conseguimos não apenas desenvolver o aplicativo para as especificações do cliente, mas também trabalhar com sucesso em um ambiente .NET dentro de um ano.",
    "AbpBookDownloadArea_ClaimYourEBook": "Solicite seu e-book <span class='gradient-framework'>Mastering ABP Framework</span>",
    "AddMemberModal_Warning_1": "Se o <strong>nome de usuário</strong> que você está tentando adicionar não existir no sistema, peça ao membro da sua equipe para se registrar em <a href='{0}/Account/Register'>{0}</a> e compartilhe o nome de usuário da conta dele com você.",
    "MyOrganizations_Detail_WelcomeMessage": "Bem-vindo à sua organização, {0}",
    "MyOrganizations_Detail_OrganizationManagement": "<span class=\"gradient-commercial\">Gestão</span> da organização",
    "OrganizationDisplayName": "Nome de exibição da organização",
    "MyOrganizations_Detail_EditDisplayName": "Editar nome de exibição",
    "MyOrganizations_Detail_UpgradeYourLicense": "Atualize sua licença",
    "MyOrganizations_Detail_LicenseStartAndExpiryDate": "Data de início da licença - Data de expiração",
    "MyOrganizations_Detail_OwnerRightInfo": "Você está usando {0} dos seus {1} direitos de proprietário.",
    "MyOrganizations_Detail_CopyApiKey": "Copie a chave",
    "MyOrganizations_Detail_ApiKeyDescription": "A chave de API é o token dos pacotes PRO hospedados em <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{1}.</a>",
    "MyOrganizations_Detail_YourPrivateNugetSource": "Sua fonte privada do NuGet é <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{0}</a>",
    "MyOrganizations_Detail_PrivateNugetSourceWarning": "Isso é adicionado automaticamente como um feed ao NuGet.Config na sua solução ABP. Não compartilhe sua chave privada com usuários não autorizados!",
    "MyOrganizations_Detail_DeveloperSeatInfo": "Você está usando {0} de suas {1} licenças de desenvolvedor.",
    "NeedMoreSeatsForYourTeam": "Precisa de mais vagas para sua equipe?",
    "MyOrganizations_Detail_PricePerYear": "{0} / por ano",
    "MyOrganizations_Detail_PurchaseDeveloperSeats": "Comprar licenças de desenvolvedor",
    "Invoices": "Faturas",
    "RequestInvoice": "Solicitação de fatura",
    "OrderNumber": "Número do pedido",
    "Date": "Data",
    "Products": "Produtos",
    "TotalPrice": "Preço total",
    "ThereIsNoInvoice": "Não há fatura",
    "MyOrganizations_Detail_PaymentProviderInfo": "Se você comprou sua licença através do gateway <i>{0}</i> , ele envia a fatura em PDF para seu endereço de e-mail, consulte <a href=\"{1}\" target=\"_blank\">faturamento de {0}.</a>",
    "MyOrganizations_Detail_PayUInfo": "Se você comprou pelo gateway <i>Iyzico</i> , clique no botão “Solicitar Nota Fiscal” e preencha os dados de faturamento.",
    "MyOrganizations_Detail_ConclusionInfo": "Sua solicitação de fatura será concluída em {0} dias úteis.",
    "ExtendYourLicense": "Estenda sua licença <span class=\"text-primary\">do {0}</span>",
    "Continue": "Continuar",
    "PurchaseLicense": "Comprar {0} licença",
    "DownloadInvoiceModal_DownloadInvoice": "Baixe o Invoice",
    "DownloadInvoiceModal_SaveInformationOnlyOnce": "Você pode salvar suas informações de faturamento apenas uma vez.",
    "InvoiceModal_EnterCompanyName": "Digite o nome legal da sua empresa...",
    "InvoiceModal_EnterCompanyAddress": "Insira o endereço legal da sua empresa...",
    "InvoiceModal_EnterTaxNumber": "Digite seu número de imposto/IVA, se disponível...",
    "RequestInvoiceModal_EnterNotes": "Insira sua mensagem extra sobre sua fatura...",
    "PrePayment_PayWithIyzico": "Você vai pagar com Iyzico",
    "ContinueToCheckout": "Continuar para finalizar a compra",
    "PrePayment_IyzicoRedirectionInfo": "Você será redirecionado para o Iyzico Payment Gateway para concluir sua compra com segurança.",
    "PrePayment_IyzicoAcceptVisaAndMasterCard": "Iyzico aceita Visa e MasterCard.",
    "Purchase": "Comprar",
    "AcceptTermsAndConditions": "Li, compreendi e aceito a <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">política de privacidade</a> , <a href=\"{1}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">os termos e condições</a> e <a href=\"{2}\" target=\"_blank\" class=\"text-primary\">o EULA.</a>",
    "AcceptTermsAndConditionsWarningMessage": "Por favor, aceite a política de privacidade e os termos e condições",
    "SelectGatewayToContinue": "Selecione um Gateway para continuar!",
    "GatewaySelection_SelectGateway": "Selecione um gateway de pagamento",
    "GatewaySelection_RedirectionMessage": "Em seguida, você será redirecionado ao site do gateway de pagamento selecionado para a transação.",
    "PaymentSucceed_PaymentSuccessMessage": "Pagamento bem-sucedido",
    "PaymentSucceed_ThanksForPurchase": "Obrigado pela sua compra!",
    "PaymentSucceed_CreateYourOrganization": "Crie sua organização",
    "PaymentSucceed_AddMeAsDeveloper": "Também sou desenvolvedor. Adicione-me como desenvolvedor à minha organização.",
    "PaymentSucceed_CreateOrganization": "Criar organização",
    "PaymentSucceed_OrganizationDescription": "Uma organização consiste em desenvolvedores e proprietários. Os desenvolvedores são usuários que escrevem código no projeto ABP e se beneficiarão do website <a href=\"{0}\" target=\"_blank\">{1}</a> . Os proprietários são usuários que alocam licenças de desenvolvedor e gerenciam o licenciamento.",
    "PaymentSucceed_ViewOrganization": "Clique aqui para ver a organização",
    "Purchase_TotalAnnualPrice": "TOTAL <small class=\"opacity-50\">(taxa anual)</small>",
    "Purchase_TrainingPrice": "Preço de treinamento",
    "Purchase_OnboardingTraining": "Treinamento ao vivo de integração e desenvolvimento de aplicativos da Web",
    "TotalDeveloperPrice": "Preço total do desenvolvedor",
    "Purchase_PricePerDeveloper": "<span>{0} {1}</span> por desenvolvedor",
    "Purchase_IncludedDeveloperInfo": "{0} {1} incluído.",
    "Purchase_LicenseExtraDeveloperPurchaseMessage": "A <span class=\"fw-bold\">licença {0}</span> inclui {1} desenvolvedores. Você pode adicionar desenvolvedores adicionais.",
    "StartupTemplates_Page_Title": "Modelos de inicialização ABP",
    "StartupTemplates_Page_Description": "ABP Comercial permite construir soluções com qualquer nível de complexidade. Ele fornece duas soluções principais de inicialização pré-construídas. Você pode selecionar aquele que mais se aproxima de seus requisitos e construir sua própria solução personalizada com base nele.",
    "MicroserviceStartupSolutionForDotnet": "Solução de inicialização de microsserviços para .NET",
    "MonolithSolutionForDotnet": "Solução Monolith (modular) para .NET",
    "TrainingDetailsHeaderInfo_TrainingHour": "{0} hora(s)",
    "Trainings_Content": "Conteúdo do Treinamento",
    "Trial_Page_StartYourFreeTrial": "Inicie o seu <span class=\"gradient-commercial\">teste gratuito</span>",
    "TrialLicenseFeatures": "Você poderá se beneficiar de todos os recursos comerciais da ABP",
    "TrialPeriodDays": "Você terá uma licença de equipe de {0} dias",
    "TrialForumSupportIncident": "Você terá {0} incidentes de suporte no fórum",
    "Contact_Page_Title": "Contato com a equipe de desenvolvimento da ABP",
    "Contact_Page_Description": "Entre em contato com a equipe de Desenvolvimento da ABP, caso precise de ajuda ou compartilhe seus pensamentos e opiniões! A equipe de suporte da ABP está pronta para ajudar.",
    "Demo_Page_Title": "Crie uma demonstração",
    "Demo_Page_Description": "Crie uma demonstração gratuita para ver um exemplo de aplicativo criado usando o modelo de inicialização comercial da ABP. Não se repita nos requisitos comuns de aplicação.",
    "Discounted_Page_Title": "Preços com desconto",
    "Discounted_Page_Description": "Escolha os recursos e funcionalidades que sua empresa precisa hoje. Compre uma licença comercial ABP e crie projetos ilimitados",
    "Faq_Page_Title": "Perguntas frequentes (FAQ)",
    "Faq_Page_Description": "Você tem alguma pergunta? Pesquise perguntas frequentes ou faça-nos uma pergunta através do formulário de contato.",
    "Faq_Page_SwiftCode": "Código Swift",
    "Faq_Page_BankName": "Nome do banco",
    "Faq_Page_AccountName": "Nome da conta",
    "Faq_Page_AccountNumber": "Número de conta",
    "Faq_Page_Currency": "Moeda",
    "Faq_Page_VatNumber": "Número de IVA",
    "Faq_Page_OtherCurrenciesInfo": "Para outras moedas, veja <a href='{0}'>todas as contas</a>",
    "ProjectCreatedSuccess_Page_Title": "Seu projeto criado",
    "ProjectCreatedSuccess_Page_Description": "Seu projeto ABP foi criado com sucesso!",
    "Suite_Page_Title": "Suíte ABP",
    "Suite_Page_Description": "ABP Commercial fornece ferramentas de desenvolvimento rápido de aplicativos para aumentar a produtividade do desenvolvedor. ABP Suite permite criar páginas CRUD facilmente.",
    "Themes_Page_Title": "Temas ABP",
    "Themes_Page_Description": "ABP Commercial oferece vários temas de UI modernos e profissionais. Crie uma demonstração gratuita para ter uma visão rápida da aparência da IU.",
    "Tools_Page_Title": "Ferramentas de desenvolvimento rápido de aplicativos",
    "Tools_Page_Description": "ABP Commercial fornece ferramentas de desenvolvimento rápido de aplicativos para aumentar a produtividade do desenvolvedor. ABP Suite permite criar páginas CRUD facilmente.",
    "DeveloperPrice": "Preço do desenvolvedor",
    "AdditionalDeveloperPaymentInfoSection_AdditionalDevelopers": "{0} <small>desenvolvedores</small>",
    "LicenseRemainingDays": "por <span>{0}</span> dias",
    "ExtendPaymentInfoSection_Description": "Ao estender/renovar sua licença, você continuará recebendo <a href=\"{0}\" target=\"_blank\">suporte premium</a> . Você também poderá obter atualizações maiores ou menores para módulos e temas. Você poderá continuar criando novos projetos. E você ainda poderá utilizar <a href=\"{1}\" target=\"_blank\">o ABP Suite</a> que agiliza seu desenvolvimento.",
    "LicenseRenewalPrice": "Preço de renovação da licença",
    "LicensePrice": "Preço da licença",
    "TrialLicensePaymentInfoSection_Description": "<strong>Licença de compra:</strong> Ao adquirir uma licença, você continuará a obter <a href=\"{0}\" target=\"_blank\" rel=\"noopener\">suporte premium</a> . Você também poderá obter atualizações maiores ou menores para módulos e temas. Você poderá continuar criando novos projetos. E você ainda poderá utilizar <a href=\"{1}\" target=\"_blank\" rel=\"noopener\">o ABP Suite</a> que agiliza seu desenvolvimento.<br> Consulte a <a href=\"{2}\" target=\"_blank\" rel=\"noopener\">tabela de comparação de licenças</a> para verificar as diferenças entre os tipos de licença.",
    "SelectTargetLicense": "Selecione a licença de destino",
    "UpgradePaymentInfoSection_ExtendMyLicenseForOneYear": "Sim, prorrogar a data de validade da minha licença por 1 ano.",
    "UpgradePaymentInfoSection_WantToExtendLicense": "Quer estender sua licença por mais 1 ano?",
    "UpgradePaymentInfoSection_UpgradingWillNotExtendLicense": "A atualização não estenderá a data de expiração da sua licença!",
    "UpgradePaymentInfoSection_LicenseUpgradeDescription": "Ao atualizar sua licença, você será promovido para um tipo de licença superior, o que lhe permitirá obter benefícios adicionais. Consulte a <a href=\"/Pricing\" target=\"_blank\">tabela de comparação de licenças</a> para verificar as diferenças entre os tipos de licença.",
    "Landing_Page_CustomerStories": "Histórias de clientes",
    "Landing_Page_OurGreatCustomers": "Nossos Grandes Clientes",
    "Landing_Page_WebApplicationFramework": "Estrutura de aplicativos da Web",
    "Landing_Page_WebDevelopmentPlatform": "Plataforma de Desenvolvimento Web",
    "Landing_Page_CompleteWebDevelopmentPlatform": "Plataforma completa de desenvolvimento web",
    "Landing_Page_TryFreeDemo": "Experimente a demonstração gratuita",
    "Landing_Page_StartingPointForWebApplications": "O ponto de partida para aplicativos Web baseados em ASP.NET Core! É baseado no Framework ABP para melhor desenvolvimento web.",
    "Landing_Page_AbpProvidesSoftwareInfrastructure": "ABP Framework fornece uma infraestrutura de software para desenvolver excelentes aplicações web com as melhores práticas.",
    "Landing_Page_MicroserviceCompatibleArchitecture": "Arquitetura compatível com microsserviços",
    "Landing_Page_PreBuiltApplicationModulesAndThemes": "Módulos e temas de aplicativos pré-construídos",
    "Landing_Page_MultiTenantArchitecture": "Arquitetura multilocatário",
    "Landing_Page_MultiTenancyDescription": "Aplicativos SaaS facilitados! Multilocação integrada do banco de dados à UI.",
    "Landing_Page_DDDIntroduction": "Projetado e desenvolvido com base em padrões e princípios DDD. Fornece um modelo em camadas para seu aplicativo.",
    "Landing_Page_CrossCuttingConcernsInfo": "Infraestrutura completa para autorização, validação, tratamento de exceções, armazenamento em cache, registro de auditoria, gerenciamento de transações e muito mais.",
    "Landing_Page_PreBuiltApplicationModules": "Módulos de aplicativos pré-construídos que incluem os requisitos mais comuns de aplicativos da web.",
    "Landing_Page_ChatModule": "Bater papo",
    "Landing_Page_DocsModule": "Documentos",
    "Landing_Page_FileManagementModule": "Gerenciamento de arquivos",
    "Landing_Page_CustomerStory_1": "ABP Commercial permitiu que a SC Ventures entregasse uma plataforma SaaS de banco de dados de silo multilocatário de nível bancário em 9 meses para apoiar o financiamento da cadeia de suprimentos de contas a receber/contas a pagar de faturas de valor significativo de múltiplas âncoras integradas. A modularidade do ABP possibilitou que a equipe entregasse em tempo recorde, passasse por todos os VAPT e implantasse a pilha de microsserviços em contêineres por meio de CI/CD completo e pipelines na produção.",
    "Landing_Page_CustomerStory_2": "Vemos o valor de usar o ABP Commercial para reduzir as despesas gerais de projetos de desenvolvimento personalizados. A equipe pode unificar o padrão de código em diferentes fluxos de projeto. Vemos mais potencial na estrutura para construirmos novos recursos mais rapidamente do que antes. Confiamos que veremos constantemente o valor de alavancar a ABP Comercial.",
    "Landing_Page_CustomerStory_3": "Nós amamos a ABP. Não precisamos escrever tudo do zero. Começamos com recursos prontos para uso e nos concentramos apenas no que realmente precisamos escrever. Além disso, o ABP é bem arquitetado e o código é de alta qualidade com menos bugs. Se tivéssemos que escrever tudo o que precisávamos sozinhos, talvez levassemos anos. Mais uma coisa que gostamos é que a nova versão, ou correção de problemas, ou melhoria sai muito em breve \n a cada duas semanas. Não esperamos muito.",
    "Landing_Page_CustomerStory_4": "ABP Commercial é um produto fantástico que recomendo. Produtos comerciais para comercializar para nossos clientes em uma única plataforma configurável. O salto começa com o fato de que a estrutura e as ferramentas fornecidas a qualquer equipe valem cada centavo. A ABP Commercial foi a que melhor atendeu às nossas necessidades.",
    "Landing_Page_AdditionalServices": "Licença personalizada ou por volume, integração, treinamento e suporte ao vivo, desenvolvimento de projetos personalizados, portabilidade de projetos existentes e muito mais...",
    "Landing_Page_IncludedDeveloperLicenses": "Incluídas <strong>{0}</strong> licenças de desenvolvedor",
    "Landing_Page_SeeOnDemo": "Veja na demonstração",
    "Landing_Page_LeptonThemes": "LeptonTemas",
    "Landing_Page_AccountModuleDescription_1": "Este módulo implementa o sistema de autenticação de uma aplicação;",
    "Landing_Page_AccountModuleDescription_2": "Fornece uma página <strong>de login</strong> com o nome de usuário e senha",
    "Landing_Page_AccountModuleDescription_3": "Fornece uma página <strong>de registro</strong> para criar uma nova conta.",
    "Landing_Page_AccountModuleDescription_4": "Fornece uma página <strong>de senha esquecida</strong> para enviar um link <strong>de redefinição de senha</strong> por e-mail.",
    "Landing_Page_AccountModuleDescription_5": "Fornece funcionalidade <strong>de confirmação de e-mail</strong> com UI.",
    "Landing_Page_AccountModuleDescription_6": "Implementa autenticação <strong>de dois fatores</strong> (SMS e e-mail).",
    "Landing_Page_AccountModuleDescription_7": "Implementa <strong>o bloqueio do usuário</strong> (bloqueia a conta pelo período de tempo definido quando ocorre um determinado número de logins com falha devido a credenciais inválidas dentro de um determinado intervalo de tempo).",
    "Landing_Page_AccountModuleDescription_8": "Implementa a interface e a funcionalidade do servidor de autenticação <strong>do Identity Server</strong> .",
    "Landing_Page_AccountModuleDescription_9": "Permite <strong>alternar entre locatários</strong> em um ambiente multilocatário.",
    "Landing_Page_AccountModuleDescription_10": "Permite alterar o <strong>idioma da UI</strong> do aplicativo.",
    "Landing_Page_AuditLoggingModuleDescription_1": "Este módulo fornece a UI de relatórios de log de auditoria para a infraestrutura de auditoria. Permite pesquisar, filtrar e mostrar entradas de log de auditoria e logs de alterações de entidade.",
    "Landing_Page_AuditLoggingModuleDescription_2": "Uma entrada de log de auditoria consiste em dados críticos sobre cada solicitação do cliente:",
    "Landing_Page_AuditLoggingModuleDescription_3": "URL, navegador, endereço IP, nome do cliente",
    "Landing_Page_AuditLoggingModuleDescription_4": "O usuário",
    "Landing_Page_AuditLoggingModuleDescription_5": "Método HTTP, código de status de retorno HTTP",
    "Landing_Page_AuditLoggingModuleDescription_6": "Sucesso/falha, detalhes da exceção, se disponíveis",
    "Landing_Page_AuditLoggingModuleDescription_7": "Duração da execução da solicitação",
    "Landing_Page_AuditLoggingModuleDescription_8": "As entidades foram criadas, excluídas ou atualizadas nesta solicitação (com propriedades alteradas).",
    "Landing_Page_BloggingModuleDescription_1": "Este módulo adiciona um blog simples ao seu aplicativo ABP;",
    "Landing_Page_BloggingModuleDescription_2": "Permite criar vários blogs em um único aplicativo.",
    "Landing_Page_BloggingModuleDescription_3": "Suporta o formato Markdown.",
    "Landing_Page_BloggingModuleDescription_4": "Permite escrever comentários para uma postagem.",
    "Landing_Page_BloggingModuleDescription_5": "Permite atribuir tags às postagens do blog.",
    "Landing_Page_BloggingModuleDescription_6": "Veja o site <a href=\"blog.abp.io\">blog.abp.io</a> como um exemplo ao vivo do módulo de blog.",
    "Landing_Page_ChatModuleDescription_1": "Este módulo é usado para mensagens em tempo real entre usuários do aplicativo.",
    "Landing_Page_ChatModuleDescription_2": "Mensagens em tempo real na página de chat.",
    "Landing_Page_ChatModuleDescription_3": "Pesquise usuários no aplicativo para novas conversas.",
    "Landing_Page_ChatModuleDescription_4": "Lista de contatos para conversas recentes.",
    "Landing_Page_ChatModuleDescription_5": "Notificações de novas mensagens quando o usuário está visualizando outra página.",
    "Landing_Page_ChatModuleDescription_6": "Crachá de contagem total de mensagens não lidas no ícone do menu.",
    "Landing_Page_ChatModuleDescription_7": "Contagem de mensagens não lidas para cada conversa.",
    "Landing_Page_ChatModuleDescription_8": "Conversas preguiçosas e carregadas.",
    "Landing_Page_DocsModuleDescription_1": "Este módulo é utilizado para criar sites de documentação técnica;",
    "Landing_Page_DocsModuleDescription_2": "<strong>Integração integrada com o GitHub</strong> : escreva e gerencie documentos diretamente no GitHub.",
    "Landing_Page_DocsModuleDescription_3": "Suporte <strong>de versionamento</strong> diretamente integrado às versões do GitHub.",
    "Landing_Page_DocsModuleDescription_4": "Suporta <strong>vários idiomas</strong> (com suporte alternativo para o idioma padrão).",
    "Landing_Page_DocsModuleDescription_5": "Suporta os formatos <strong>Markdown</strong> e HTML.",
    "Landing_Page_DocsModuleDescription_6": "Fornece uma <strong>navegação</strong> e uma seção <strong>de esboço</strong> .",
    "Landing_Page_DocsModuleDescription_7": "Permite hospedar documentação <strong>de múltiplos projetos</strong> em uma única aplicação.",
    "Landing_Page_DocsModuleDescription_8": "Links para o arquivo no GitHub, para que qualquer pessoa possa contribuir facilmente clicando no <strong>link Editar</strong> .",
    "Landing_Page_DocsModuleDescription_9": "Além da fonte GitHub, permite simplesmente usar uma pasta como fonte de documentação.",
    "Landing_Page_FileManagementModuleDescription_1": "Carregue, baixe e organize arquivos em uma estrutura hierárquica de pastas.",
    "Landing_Page_FileManagementModuleDescription_2": "Este módulo é usado para fazer upload, download e organizar arquivos em uma estrutura hierárquica de pastas. Também é compatível com multilocação e você pode determinar o limite de tamanho total para seus inquilinos.",
    "Landing_Page_FileManagementModuleDescription_3": "Este módulo é baseado no sistema <a href=\"https://docs.abp.io/en/abp/latest/Blob-Storing\">BLOB Storing</a> , portanto pode utilizar diferentes provedores de armazenamento para armazenar o conteúdo do arquivo.",
    "Landing_Page_IdentityModuleDescription_1": "Este módulo implementa o sistema de Usuário e Função de uma aplicação;",
    "Landing_Page_IdentityModuleDescription_2": "Baseado na biblioteca <a href=\"https://docs.microsoft.com/en-us/aspnet/core/security/authentication/identity\">ASP.NET Core Identity da Microsoft</a> .",
    "Landing_Page_IdentityModuleDescription_3": "Gerenciar <strong>funções</strong> e <strong>usuários</strong> no sistema. Um usuário pode ter <strong>múltiplas funções</strong> .",
    "Landing_Page_IdentityModuleDescription_4": "Defina <strong>permissões</strong> em níveis de função e usuário.",
    "Landing_Page_IdentityModuleDescription_5": "Ativar/desativar <strong>autenticação de dois fatores</strong> e <strong>bloqueio</strong> de usuário por usuário.",
    "Landing_Page_IdentityModuleDescription_6": "Gerenciar <strong>perfil de usuário</strong> básico e <strong>senha</strong> .",
    "Landing_Page_IdentityModuleDescription_7": "Gerencie <strong>tipos de declarações</strong> no sistema, defina declarações para funções e usuários.",
    "Landing_Page_IdentityModuleDescription_8": "Página de configuração para gerenciar <strong>a complexidade da senha</strong> , login do usuário, conta e bloqueio.",
    "Landing_Page_IdentityModuleDescription_9": "Suporta autenticação <strong>LDAP</strong> .",
    "Landing_Page_IdentityModuleDescription_10": "Fornece verificação <strong>de e-mail e número de telefone</strong> .",
    "Landing_Page_IdentityModuleDescription_11": "Suporta integrações de login social (Twitter, Facebook, GitHub etc...).",
    "Landing_Page_IdentityModuleDescription_12": "Gerenciar <strong>unidades organizacionais</strong> no sistema.",
    "Landing_Page_PaymentModuleDescription_1": "Fornece integração para diferentes gateways de pagamento.",
    "Landing_Page_PaymentModuleDescription_2": "Este módulo fornece integração para gateways de pagamento, para que você possa receber facilmente o pagamento de seus clientes.",
    "Landing_Page_PaymentModuleDescription_3": "Este módulo suporta os seguintes gateways de pagamento",
    "Welcome_Page_UseSameCredentialForCommercialWebsites": "Use as mesmas credenciais para <a href=\"https://commercial.abp.io\" class=\"text-primary\">Commercial.abp.io</a> e <a href=\"https://support.abp.io\" class=\"text-primary\">support.abp.io</a> .",
    "WatchCrudPagesVideo": "Assista ao vídeo &quot;Criando páginas CRUD com ABP Suite&quot;!",
    "WatchGeneratingFromDatabaseVideo": "Assista ao vídeo &quot;ABP Suite: Gerando páginas CRUD a partir de tabelas de banco de dados existentes&quot;!",
    "WatchTakeCloserLookVideo": "Assista ao vídeo &quot;Dê uma olhada mais de perto na geração de código: ABP Suite&quot;!",
    "ConfirmedEmailAddressRequiredToStartTrial": "Você deve ter um endereço de e-mail confirmado para iniciar uma licença de avaliação.",
    "EmailVerificationMailNotSent": "Não foi possível enviar o e-mail de verificação de e-mail.",
    "GetConfirmationEmail": "<a href=\"javascript:void(0);\" id=\"{0}\" class=\"text-decoration-underline\">Clique aqui para receber um e-mail de verificação,</a> caso ainda não o tenha recebido.",
    "WhichLicenseTypeYouAreInterestedIn": "Em qual tipo de licença você está interessado?",
    "DontTakeOurWordForIt": "Não acredite apenas na nossa palavra...",
    "ReadAbpCommercialUsersWantYouToKnow": "Leia o que os usuários comerciais da ABP querem que você saiba",
    "Testimonial_ShortDescription_1": "A modularidade do ABP possibilitou que a equipe entregasse no prazo.",
    "Testimonial_ShortDescription_2": "Crie novos recursos mais rápido do que antes.",
    "Testimonial_ShortDescription_3": "Começamos com recursos prontos para uso e nos concentramos apenas no que realmente precisamos escrever.",
    "Testimonial_ShortDescription_4": "A ABP Commercial foi a que melhor atendeu às nossas necessidades.",
    "OnlineReviewersOnAbpCommercial": "Avaliações on-line sobre comercial da ABP",
    "SeeWhatToldAboutAbpCommercial": "Veja o que foi contado sobre a ABP Comercial e escreva sua opinião se quiser.",
    "BlazoriseLicense": "Precisamos comprar a licença Blazorise?",
    "BlazoriseLicenseExplanation": "Temos um acordo entre a Volosoft e a Megabit, com este acordo a licença Blazorise é agregada aos produtos comerciais da ABP, portanto, nossos clientes não precisam comprar uma licença Blazorise extra.",
    "ExtendPaymentInfoSection_DeveloperPrice": "{0}x desenvolvedores adicionais",
    "ExtendPaymentInfoSection_DiscountRate": "Desconto {0}%",
    "TotalNetPrice": "Preço Líquido Total",
    "EFCore": "Núcleo do Entity Framework",
    "All": "Todos",
    "Mvc": "MVC",
    "DataBaseProvider": "Provedor de dados",
    "UIFramework": "Estrutura de IU",
    "LeptonXThemeForDashboard": "Tema LeptonX para seu painel de administração por",
    "AbpPlatform": "Plataforma ABP",
    "YouDeserveGoodUXUI": "Você merece uma boa UI e uma UX melhor. O tema LeptonX da ABP está aqui para servi-lo.",
    "ViewLiveDemo": "Veja a demonstração do tema ao vivo",
    "GetLeptonX": "Obtenha o LeptonX agora",
    "SeeLeptonXDocumentation": "Consulte a documentação do LeptonX",
    "SeeLeptonDocumentation": "Consulte a documentação do Lepton",
    "SimplifiedMenu": "Menu simplificado",
    "SimplifiedMenuDescription": "Você pode encontrar facilmente a página que procura filtrando o menu",
    "YourFavoritePages": "Suas páginas favoritas ao seu alcance",
    "YourFavoritePagesDescription": "Adicione ou remova facilmente a página dos favoritos clicando no ícone de estrela no canto superior direito da página.",
    "BreadCrumbs": "Breadcrumb para troca perfeita",
    "BreadCrumbsDescription": "Usando o Breadcrumb, você pode alternar para as páginas do mesmo nível com um clique, mesmo quando o menu esquerdo está fechado, e funciona responsivo em tablets e dispositivos móveis!",
    "YourMenu": "Seu cardápio como desejar",
    "YourMenuDescription": "Personalize os ícones clicáveis diretamente e as caixas suspensas no menu do usuário como desejar. O menu do usuário é totalmente personalizável de acordo com suas necessidades",
    "RtlSupport": "Suporte RTL para o seu idioma",
    "RtlSupportDescription": "O tema LeptonX suporta RTL para o seu idioma. As opções de idioma estão no menu de configurações para você alterar o idioma.",
    "YourColors": "Suas cores na IU do painel de administração",
    "YourColorsDescription": "O tema LeptonX funciona de acordo com as preferências do seu sistema e tem opções de tema claro de painel, tema escuro de painel e tema semi-escuro de painel.",
    "ArrangeContentWidth": "Organize facilmente a largura do seu conteúdo",
    "ArrangeContentWidthDescription": "Altere facilmente a largura da sua área de conteúdo.",
    "LeptonXCompatibleWith": "O tema LeptonX é compatível com",
    "MobileResponsiveTemplate": "Modelo responsivo para dispositivos móveis",
    "MobileResponsiveTemplateDescription1": "Acesse o painel de administração do LeptonX de qualquer dispositivo de sua preferência.",
    "MobileResponsiveTemplateDescription2": "Ele foi projetado para você usar facilmente em todos os seus dispositivos. É responsivo em dispositivos móveis e tamanhos de tablets.",
    "TopMenuLayoutOption": "Opção de layout do menu superior",
    "TopMenuLayoutOptionDescription1": "Se você deseja configurar seu site com o mesmo painel de administração, é possível fazê-lo com o Tema LeptonX!",
    "TopMenuLayoutOptionDescription2": "Experimente o layout do menu superior do LeptonX para que isso aconteça!",
    "EasilyCustomizable": "Facilmente personalizável para as cores da sua marca",
    "EasilyCustomizableDescription1": "Você pode personalizar o tema LeptonX usando apenas algumas variáveis SCSS. Sem substituição, sem carga extra de CSS!",
    "EasilyCustomizableDescription2": "Com LeptonX, você pode organizar seu painel de administração como quiser.",
    "IndependentLayout": "Layout independente e área de conteúdo",
    "IndependentLayoutDescription1": "A infraestrutura de layout do LeptonX foi projetada completamente separada do conteúdo.",
    "IndependentLayoutDescription2": "Isso significa que você pode criar livremente seu projeto com uma estrutura de conteúdo diferente do Bootstrap, se desejar.",
    "MostUsedLibraries": "Bibliotecas mais utilizadas integradas ao LeptonX",
    "MostUsedLibrariesDescription1": "LeptonX contém suas bibliotecas mais usadas. Ele permite que você use bibliotecas como ApexCharts, DataTables, DropZone, FullCalender, JSTree, Select2 e Toastr sem esforço.",
    "MostUsedLibrariesDescription2": "LeptonX também oferece suporte a bibliotecas MVC Angular e específicas do Blazor.",
    "CreateAndCustomize": "Crie e personalize as páginas que você precisa em segundos com as páginas personalizadas LeptonX",
    "CreateAndCustomizeDescription": "Ao usar o LeptonX Theme você também tem acesso a muitas páginas HTML pré-fabricadas. Isso inclui muitas páginas, como página de login, blog, perguntas frequentes, lista de assinaturas, fatura, preços e gerenciamento de arquivos.",
    "LeptonThemeForAdmin": "Tema Lepton para seu painel de administração por",
    "LeptonThemeForAdminDescription": "O tema Lepton ainda está disponível e será mantido. Se quiser mudar para o tema LeptonX como usuário do tema Lepton, você pode consultar a documentação para aprender como fazer.",
    "LeptonCompatibleWith": "O tema Lepton é compatível com",
    "BlackFridayDiscount": "Desconto de Black Friday",
    "UpgradePaymentInfoSection_DeveloperPrice": "{0} para {1} desenvolvedores adicionais",
    "Upgrade": "Atualizar",
    "Renewal": "Renovação",
    "UpgradePaymentInfoSection_LicensePrice": "{0} licença",
    "UpgradePaymentInfoSection_LicenseRenewalPrice": "Renovação da licença",
    "Total": "Total",
    "SupportPolicyFaqTitle": "Qual é sua política de apoio?",
    "SupportPolicyFaqExplanation": "Nós apoiamos apenas a versão ativa e a versão principal anterior. Não garantimos o lançamento de um patch para a 3ª e mais antigas versões principais. Por exemplo, se a versão ativa for a 7.0.0, lançaremos correções tanto para a 6.x.x como para a 7.x.x.x. Além disso, fornecemos suporte somente para questões relacionadas ao ABP Framework e ABP Commercial. Isso significa que nenhum suporte é dado para as aplicações de terceiros, serviços de nuvem e outras bibliotecas periféricas usadas pelos produtos ABP. Usaremos esforços comercialmente razoáveis para fornecer suporte técnico a nossos clientes durante o horário comercial oficial da \"Volosoft Bilisim A.S\". Por outro lado, não nos comprometemos com um acordo de nível de serviço (SLA) de tempo de resposta, mas tentaremos responder às questões técnicas o mais rápido possível dentro de nosso horário oficial de trabalho. A menos que um acordo especial seja feito com o cliente, fornecemos suporte somente em https://support.abp.io. Também temos suporte privado por e-mail, que só está disponível para os detentores de licenças empresariais.",
    "TotalDevelopers": "Total de {0} desenvolvedores",
    "CustomPurchaseExplanation": "Adaptado às suas necessidades específicas",
    "WhereDidYouHearAboutUs": "Onde você ouviu sobre nós?",
    "Twitter": "Twitter",
    "Facebook": "Facebook",
    "Youtube": "YouTube",
    "Google": "Google",
    "Github": "GitHub",
    "Friend": "De um amigo",
    "Other": "Outro",
    "WhereDidYouHearAboutUs_explain": "Especificamos ...",
    "DeletingMemberWarningMessage": "&quot;{0}&quot; será removido da lista de desenvolvedores. Se desejar, você pode atribuir esta vaga vazia a outro desenvolvedor posteriormente.",
    "AdditionalInfo": "Se as vagas de desenvolvedor estiverem acima de seus requisitos, você poderá reduzi-las. Você pode enviar um e-mail para <a href=\"mailto:info@abp.io\">info@abp.io</a> para remover algumas de suas licenças de desenvolvedor. A liberação de licenças de desenvolvedor não utilizadas reduzirá o custo de renovação da licença. Se desejar, você pode recomprar licenças de desenvolvedor adicionais dentro do período de licença ativa. Observe que, como há {0} desenvolvedores neste pacote de licença, você não pode reduzir esse número.",
    "LinkExpiredErrorMessage": "O link que você está tentando acessar expirou.",
    "ExpirationDate": "Data de validade",
    "SpringCampaignDiscount": "Desconto na campanha de primavera",
    "WhyUseAbpIoPlatform": "Por que devo usar a plataforma ABP.IO em vez de criar uma nova solução a partir do zero?",
    "WhyUseAbpIoPlatformFaqExplanation": "Veja <a href=\"https://docs.abp.io/en/commercial/latest/why-abp-io-platform \"> esse documento </a> para uma explicação detalhada do porquê de usar a Plataforma ABP.IO tem uma vantagem significativa sobre fazer tudo você mesmo.",
    "EulaPageTitle": "Contrato de licença de usuário final (EULA)",
    "PrivacyPolicyPageTitle": "Política de Privacidade - Política de Cookies",
    "TermsConditionsPageTitle": "Termos e Condições",
    "TrainingsPageTitle": "Pacotes de treinamento ABP",
    "ModulesPageTitle": "Módulos de aplicativos pré-construídos ABP",
    "Volo.AbpIo.Commercial:040001": "A chave de acesso da API está incorreta.",
    "GetLepton": "Obtenha Lepton agora",
    "MyOrganizations_Detail_LicenseStartDate": "Data de início da licença",
    "MyOrganizations_Detail_LicenseExpiryDate": "Data de validade",
    "BlazoriseSupport": "Como obtenho a chave de licença do Blazorise e o suporte da equipe do Blazorise?",
    "BlazoriseSupportExplanation": "Siga as etapas abaixo para obter suporte da equipe Blazorise e obter sua chave de licença Blazorise:",
    "BlazoriseSupportExplanation1": "Inscreva-se para uma nova conta em <a href=\"https://blazorise.com/support/register\">blazorise.com/support/register</a> com o mesmo endereço de e-mail da sua conta abp.io. Deixe a entrada &quot;Chave de licença&quot; em branco. <strong>Deve ser o mesmo endereço de e-mail da sua conta de e-mail no abp.io.</strong>",
    "BlazoriseSupportExplanation2": "Verifique seu endereço de e-mail verificando sua caixa de e-mail. Verifique sua caixa de spam se não encontrar um e-mail em sua caixa de entrada!",
    "BlazoriseSupportExplanation3": "Faça login no site de suporte do Blazorise em <a href=\"https://blazorise.com/support/login\">blazorise.com/support/login</a> .",
    "BlazoriseSupportExplanation4": "Se você tiver uma licença comercial ABP ativa, também terá uma licença Blazorise PRO. Você pode obter sua chave de licença do Blazorise em <a href=\"https://blazorise.com/support/user/manage/license\">blazorise.com/support/user/manage/license</a> .",
    "BlazoriseSupportExplanation5": "Você pode postar suas dúvidas no site de suporte e gerar um token de produto para seu aplicativo.",
    "AbpLiveTrainingPackages": "Pacotes de treinamento ao vivo da ABP",
    "Releases": "Lançamentos",
    "ReleasesDescription": "Registros de liberação do Comercial ABP.",
    "ReleaseDate": "Data de lançamento",
    "Labels": "Etiquetas",
    "PreRelease": "Pré-lançamento",
    "AllTypes": "Todos os tipos",
    "Enhancement": "Aprimoramento",
    "Bug": "Erro",
    "Feature": "Recurso",
    "AllUIs": "Todas as IUs",
    "MVC": "MVC",
    "BlazorServer": "Servidor Blazor",
    "MAUI": "Maui",
    "HowItWorks_Page_Title": "Como funciona?",
    "HowItWorks_Page_Description": "ABP Framework estende a plataforma .NET. Portanto, tudo o que você pode fazer com uma solução .NET simples já é possível com o ABP Framework. Isso torna mais fácil começar com uma curva de aprendizado baixa.",
    "HowItWorks_Description1": "ABP Framework estende a plataforma .NET. Portanto, tudo o que você pode fazer com uma solução .NET simples já é possível com o ABP Framework. Isso torna mais fácil começar com uma curva de aprendizado baixa.",
    "HowItWorks_Description2": "Depois que você começar a aprender e usar os recursos do ABP Framework, desenvolver seu software será muito mais divertido do que nunca.",
    "HowItWorks_Description3": "Esta página explica basicamente como você usa a plataforma ABP.IO como desenvolvedor .NET.",
    "CreateANewSolution": "Crie uma nova solução .NET",
    "CreateANewSolution_Description1": "Tudo começa com a criação de uma nova solução .NET integrada da ABP.",
    "StartWithStartupTemplates": "Inicie um dos <a href=\"/startup-templates\">modelos de solução de inicialização</a> predefinidos",
    "SimpleMonolithApplicationTemplate": "Modelo de aplicativo monolítico simples",
    "LayeredApplicationTemplate": "Modelo de aplicativo em camadas",
    "MicroserviceSolutionTemplate": "Modelo de solução de microsserviço",
    "CreateEmptySolutionAndUseAbp": "Ou crie uma nova solução .NET vazia e instale você mesmo <a href=\"https://abp.io/packages\" target=\"_blank\">os pacotes</a> ABP NuGet e NPM.",
    "CreatingSolutionWithMultipleOptions": "Existem várias opções de interface de usuário e banco de dados ao criar uma nova solução.",
    "UIFrameworkOptions": "Opções de estrutura de interface do usuário",
    "DotnetSolutionWithoutDependency": "Agora, você tem uma solução .NET regular em seu computador local que não depende de uma plataforma de nuvem ou serviço externo.",
    "CheckTheDocumentForDetails": "Você pode verificar o documento <a href=\"{0}\" target=\"_blank\">{1}</a> para obter detalhes.",
    "UIAndDatabaseIndependent": "ABP pode funcionar com qualquer UI e qualquer provedor de banco de dados compatível com .NET. \n No entanto, esses provedores de UI e banco de dados são pré-integrados e bem documentados.",
    "InstallAbpModules": "Instale módulos ABP",
    "DevelopYourSolution": "Desenvolva sua solução",
    "DeployAnywhere": "Implante em qualquer lugar",
    "InstallAbpModule_Description1": "ABP é uma estrutura modular de desenvolvimento de aplicativos. Os modelos de solução de inicialização já vêm com os módulos essenciais instalados. \n Mas há mais módulos de aplicativos que você pode querer usar em sua solução.",
    "InstallAbpModule_Description2": "Cada módulo consiste em alguns pacotes NuGet e NPM e possui um documento de instalação. <a href=\"/tools/suite\">O ABP Suite</a> faz a maior parte do trabalho automaticamente e, em seguida, você configura ou ajusta manualmente o módulo com base em sua documentação.",
    "DevelopYourSolution_Description1": "A infraestrutura da ABP faz com que você <b class=\"text-white\">se concentre em seu próprio código de negócios</b> , automatizando o trabalho repetitivo e fornecendo infraestrutura pré-construída e <a href=\"https://abp.io/features\" target=\"_blank\">recursos</a> de aplicativos.",
    "DevelopYourSolution_Description2": "No bloco de código a seguir, você pode ver como o ABP Framework se integra perfeitamente ao seu código e automatiza as tarefas repetitivas para você.",
    "DevelopYourSolution_Description3": "Mesmo neste bloco de shortcode, o ABP faz muitas coisas por você.",
    "DevelopYourSolution_Description4": "Ele fornece classes base para aplicar convenções, como <a href=\"https://docs.abp.io/en/abp/latest/Dependency-Injection\" target=\"_blank\">injeção de dependência</a> \n . Os serviços genéricos <a href=\"https://docs.abp.io/en/abp/latest/Repositories\" target=\"_blank\">de repositório</a> \n fornecem uma maneira conveniente de \n interagir com o banco de dados. <a href=\"https://docs.abp.io/en/abp/latest/Authorization\" target=\"_blank\">A autorização</a> declarativa \n funciona com um sistema de permissão ajustado.",
    "DevelopYourSolution_Description5": "O ABP automatiza completamente <a href=\"https://docs.abp.io/en/abp/latest/Unit-Of-Work\" target=\"_blank\">a unidade de trabalho</a> \n (para conexão de banco de dados e gerenciamento de transações), <a href=\"https://docs.abp.io/en/abp/latest/Exception-Handling\" target=\"_blank\">tratamento de exceções</a> \n , <a href=\"https://docs.abp.io/en/abp/latest/Validation\" target=\"_blank\">validação de</a> \n , \n e <a href=\"https://docs.abp.io/en/abp/latest/Audit-Logging\" target=\"_blank\">registro de auditoria</a> . Ele fornece muito mais blocos de construção para simplificar suas tarefas diárias de desenvolvimento e focar em seu próprio código enquanto cria aplicativos \n prontos para produção.",
    "DevelopYourSolution_Description6": "Você pode imaginar o quanto esse bloco de código pode ser longo e complicado se você fizer tudo manualmente.",
    "SuiteCrudGenerationInFewSeconds": "Além de codificar manualmente sua solução, você pode criar páginas CRUD avançadas totalmente funcionais em poucos minutos usando as ferramentas do ABP Suite. Ele gera o código em sua solução, para que você possa ajustá-lo com base em seus requisitos personalizados.",
    "DeployAnywhere_Description1": "No final das contas, você tem uma solução .NET pura. Você pode implantar sua solução em seu próprio servidor, em uma plataforma em nuvem, em Kubernetes ou em qualquer lugar que desejar. Você pode implantar em quantos servidores desejar. ABP é uma ferramenta independente do ambiente de implantação.",
    "ExpertiseAbpFramework": "Conheça a estrutura ABP",
    "ExpertiseAbpFramework_Description1": "Quer ir além do básico e adquirir experiência com a plataforma ABP.IO?",
    "FreeDownload": "Download grátis",
    "Read": "Ler",
    "HavingTrouble": "Está com problemas?",
    "HavingTrouble_Description1": "Você tem problemas para desenvolver sua solução? Estamos aqui! Use a plataforma de suporte ABP \n ou envie um e-mail para obter ajuda diretamente dos membros da equipe Core ABP Framework.",
    "WeAreHereToHelp_Description1": "Você pode navegar em nossos tópicos de ajuda ou pesquisar nas perguntas frequentes, \n ou pode nos fazer uma pergunta usando o formulário de contato.",
    "OtherModules": "Outros Módulos",
    "OtherModules_Description1": "Conta, registro de auditoria, bate-papo, kit CMS, gerenciamento de arquivos, formulários, GDPR, identidade, gerenciamento de idiomas, pagamento, Saas e muito mais...",
    "HowItWorks_DatabaseProviderOptions": "Opções de provedor de banco de dados",
    "SeeFAQ": "Veja perguntas frequentes",
    "ReleaseLogs": "Registros de liberação",
    "ReleaseLogs_Tag": "{0} Registros de lançamento",
    "ReleaseLogs_Pr": "Solicitação pull nº{0} - {1}",
    "NoLabels": "Sem rótulos",
    "DoesTheSubscriptionRenewAutomatically": "A assinatura é renovada automaticamente?",
    "DoesTheSubscriptionRenewAutomaticallyExplanation": "O ABP Comercial não possui modelo de cobrança com renovação automática. Portanto, <strong>sua assinatura não será renovada automaticamente</strong> ao final do período de licença. Se quiser continuar a usufruir dos benefícios do ABP Comercial, é necessário renová-lo manualmente na <a href=\"/my-organizations\">página de gerenciamento da organização</a> . Se você tiver várias organizações, clique no botão &quot;Gerenciar&quot; na organização que está expirando e, em seguida, clique no botão &quot;Estender agora&quot; para renovar sua licença. Você também pode dar uma olhada em O <a href=\"/faq#what-happens-when-license-ends\">que acontece quando minha licença termina?</a> seção.",
    "ExtraQuestionCreditsFaqTitle": "Posso adquirir créditos extras para perguntas de suporte?",
    "ExtraQuestionCreditsFaqExplanation": "Sim você pode. Para adquirir créditos extras para perguntas, envie um e-mail para <a href=\"mailto:info@abp.io\">info@abp.io</a> com o nome da sua organização. Aqui está a lista de preços para os créditos extras das perguntas:<ul><li> Pacote de 50 perguntas $ 999</li><li> Pacote de 25 perguntas $ 625</li><li> Pacote de 15 perguntas $ 450</li></ul>",
    "AlreadyBetaTester": "Você já ingressou no programa de testadores beta.",
    "AbpStudio": "Estúdio ABP",
    "AbpStudio_Description": "ABP Studio ainda está em desenvolvimento. Você pode preencher o formulário abaixo para ser um dos primeiros usuários.",
    "AbpStudio_Description1": "ABP Studio é um <span class=\"text-highlight-white\">aplicativo de desktop multiplataforma</span> para desenvolvedores ABP.",
    "AbpStudio_Description2": "Ele está <span class=\"text-highlight-white\">bem integrado</span> ao ABP Framework e tem como objetivo fornecer um ambiente de desenvolvimento confortável para você <span class=\"text-highlight-white\">, automatizando coisas, fornecendo insights</span> sobre sua solução, tornando muito mais fácil <span class=\"text-highlight-white\">desenvolver, executar</span> e <span class=\"text-highlight-white\">implantar</span> suas soluções.",
    "AbpStudio_ComingSoon": "Em breve <span class=\"opacity-50 ms-0 ms-md-3 d-block d-md-inline-block \">Data planejada de lançamento da versão beta: quarto trimestre de 2023.</span>",
    "AbpStudio_PlannedPreviewDate": "Data planejada de lançamento da visualização: quarto trimestre de 2023.",
    "BetaRequest": "Solicitação beta",
    "CreateNewSolutions": "Crie novas soluções",
    "CreateNewSolutions_Description1": "Você pode criar desde aplicativos simples até soluções modulares monolíticas ou de microsserviços facilmente com muitas opções. Você obtém uma solução de software básica completa e pronta para produção para o seu negócio.",
    "ArchitectYourSolutions": "Arquitete suas soluções",
    "ArchitectYourSolutions_Description1": "Crie estruturas de soluções monolíticas-modulares e de microsserviços com mais facilidade criando módulos ou serviços e estabelecendo relações entre eles. Você também pode instalar ou desinstalar módulos de aplicativos pré-construídos.",
    "ExploreYourSolution": "Explore sua solução",
    "ExploreYourSolution_Description1": "O ABP Studio mostra uma visão de alto nível dos componentes da sua solução e dos módulos dos quais ela depende. Você pode explorar entidades, serviços, APIs HTTP e muito mais sem precisar abrir sua base de código.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze": "Execute soluções de vários aplicativos ou microsserviços com rapidez",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description1": "Execute um, <span class=\"text-highlight-white\">vários</span> ou <span class=\"text-highlight-white\">todos os serviços</span> com um único clique. Desta forma, é muito fácil parar um serviço, executá-lo no Visual Studio para <span class=\"text-highlight-white\">testar</span> ou <span class=\"text-highlight-white\">depurar</span> .",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description2": "Veja uma lista de serviços, visualize <span class=\"text-highlight-white\">solicitações HTTP em tempo real</span> e <span class=\"text-highlight-white\">contagens de exceções</span> para cada serviço.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description3": "Veja todos os detalhes de todas <span class=\"text-highlight-white\">as solicitações HTTP</span> recebidas em qualquer serviço.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description4": "Explore <span class=\"text-highlight-white\">detalhes de exceção</span> em tempo real em qualquer serviço, filtre e pesquise facilmente.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description5": "Mostre os <span class=\"text-highlight-white\">logs do aplicativo</span> , filtre por nível de log ou pesquise por texto.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description6": "<span class=\"text-highlight-white\">Navegue</span> pela UI do seu aplicativo sem sair do executor de soluções.",
    "IntegrateToYourKubernetesCluster": "Integre ao seu cluster Kubernetes",
    "IntegrateToYourKubernetesCluster_Description1": "<span class=\"text-highlight-white\">Conecte seu ambiente de desenvolvimento local a um cluster Kubernetes local ou remoto</span> , onde esse cluster já executa sua solução de microsserviço.",
    "IntegrateToYourKubernetesCluster_Description2": "Acesse qualquer serviço no Kubernetes com seu nome de serviço DNS, assim como eles estão sendo executados em seu computador local.",
    "IntegrateToYourKubernetesCluster_Description3": "<span class=\"text-highlight-white\">Intercepte qualquer serviço</span> nesse cluster, para que todo o <span class=\"text-highlight-white\">tráfego do serviço interceptado seja automaticamente redirecionado para o serviço</span> que está em execução na sua máquina local. Quando seu serviço precisa usar qualquer serviço no Kubernetes, o tráfego é redirecionado de volta para o cluster, assim como seu serviço local está sendo executado dentro do Kubernetes.",
    "GetInformed": "Informe-se",
    "Studio_GetInformed_Description1": "Deixe seus dados de contato para <span class=\"text-highlight-white\">se informar</span> e <span class=\"text-highlight-white\">experimente primeiro</span> quando o ABP Studio for lançado.",
    "Studio_GetInformed_Description2": "Data planejada de lançamento da visualização: terceiro trimestre de 2023.",
    "ThankYou!": "Obrigado!",
    "SendBetaRequest": "Enviar solicitação beta",
    "YouJoinedTheBetaTesterProgram": "Você ingressou no programa beta tester do ABP Studio.",
    "PricingExplanation2": "Garantia de devolução do dinheiro em 30 dias — <a href=\"/faq#refund-policy\">Saiba mais</a>",
    "MoneyBackGuaranteeText": "* Garantia de devolução do dinheiro em 30 dias para todas as licenças! Reembolso de 100% para Team, reembolso de 60% para licenças Business e Enterprise em 30 dias.",
    "MobileApplicationStartupTemplates": "Modelos de inicialização de aplicativos móveis",
    "MobileApplicationStartupTemplates_Description1": "Modelos integrados de inicialização de aplicativos móveis para suas soluções comerciais ABP.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates": "Crie aplicativos de linha de negócios poderosos usando modelos de inicialização móvel da ABP",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description1": "ABP Commercial fornece dois modelos de inicialização de aplicativos móveis implementados com <span class=\"text-highlight\">React Native</span> e <span class=\"text-highlight\">.NET MAUI.</span> Ao criar sua nova solução baseada em ABP, você também terá aplicativos básicos de inicialização conectados às suas APIs de back-end.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description2": "O aplicativo possui um ciclo de token de autenticação pré-construído, <span class=\"text-highlight\">suporte multilíngue, suporte multilocação, login, esquecimento de senha, gerenciamento de perfil e uma página de gerenciamento de usuários</span> . Você pode adicionar sua própria lógica de negócios e personalizá-la com base em seus requisitos.",
    "TwoFrameworkOptions": "Duas opções de estrutura",
    "TwoFrameworkOptions_Description": "ABP fornece modelos de inicialização móvel <span class=\"text-highlight\">React Native</span> e <span class=\"text-highlight\">.NET MAUI</span> . Dessa forma, você pode escolher aquele que melhor se adapta às suas necessidades. Ambos os aplicativos reutilizam código na taxa mais alta entre as plataformas iOS e Android.",
    "PreIntegratedToYourBackend": "Pré-integrado ao seu back-end",
    "PreIntegratedToYourBackend_Description": "Os aplicativos ABP Mobile são pré-integrados às suas APIs de back-end. Ele obtém um token de autenticação válido do servidor e faz solicitações autenticadas.",
    "MultiLanguage": "Multi Idiomas",
    "MultiLanguage_Description": "Ele já suporta mais de 10 idiomas prontos para uso. Você também pode adicionar os próximos idiomas.",
    "Arabic": "árabe",
    "Czech": "Tcheco",
    "English": "Inglês",
    "Hungarian": "húngaro",
    "Finnish": "finlandês",
    "French": "Francês",
    "Hindi": "hindi",
    "Portuguese": "Português",
    "Italian": "italiano",
    "Russian": "russo",
    "Slovak": "Eslovaco",
    "Turkish": "turco",
    "EngageAndRetainYourCustomersWithABPMobileApps": "Envolva e retenha seus clientes com os aplicativos móveis da ABP",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description1": "Seus clientes desejam gerenciar seus produtos e assinaturas de qualquer lugar, a qualquer hora. Isso exige que as organizações criem aplicativos móveis que permitam aos clientes atender às suas solicitações de forma rápida e integrada.",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description2": "Com os aplicativos ABP Mobile, você pode criar aplicativos móveis nativos de alta qualidade para Android e iOS… Usando uma única base de código e sem comprometer a segurança, qualidade ou escalabilidade.",
    "OneCodeBaseMultipleDevices": "Vários dispositivos com base em um código",
    "OneCodeBaseMultipleDevices_Description": "Os aplicativos ABP Mobile são multiplataforma. Eles estão prontos para serem instalados e executados em dispositivos iOS e Android e se adaptam a diferentes formatos usando uma única base de código. Os desenvolvedores só precisam criar a UI e o código front-end uma vez, não há necessidade de adaptar o código para cada dispositivo que você deseja oferecer suporte.",
    "ComesWithTheSourceCode": "Vem com o código-fonte",
    "ComesWithTheSourceCode_Description": "Os aplicativos móveis são fornecidos com o código-fonte. Personalize facilmente a UX/UI dos seus aplicativos para atender às diretrizes de marca.",
    "Purchase_OneYearPrice": "Preço de 1 ano",
    "Purchase_DeveloperSeatCount": "Contagem de vagas do desenvolvedor",
    "Purchase_DevelopersAlreadyIncluded": "{0} desenvolvedores já incluídos",
    "1Year": "1 ano",
    "{0}Years": "{0} anos",
    "1YearLicense": "Licença de 1 ano",
    "{0}YearsLicense": "Licença de {0} anos",
    "1AdditionalDeveloper": "1 desenvolvedor adicional",
    "{0}AdditionalDevelopers": "{0} Desenvolvedores Adicionais",
    "Discount": "Desconto ({0}%)",
    "Summary": "Resumo",
    "TrainingPack": "Pacote de treinamento",
    "TrainingPackDiscount": "Desconto no pacote de treinamento",
    "Purchase_OnboardingTraining_Description": "Este pacote de treinamento ao vivo é válido para uma turma de 8 alunos e este desconto só é válido quando adquirido com a nova licença. <a href=\"{0}\" class=\"text-white\">Saber mais<i class=\"fa fa-external-link ms-1\"></i></a>",
    "Purchase_Save": "{0}% <span class=\"save ms-1\">de economia {1} {2}</span>",
    "RemoveBasket": "Remover da cesta",
    "WhyABPIOPlatform?": "Por que <span class=\"gradient-commercial\">plataforma ABP.IO</span> ?",
    "DocumentAim": "Este documento pretende responder à grande questão:",
    "DocumentAim_Description": "&quot;Por que você deveria usar a plataforma ABP.IO em vez de criar uma nova solução do zero?&quot;",
    "DocumentAim_Description2": "O documento apresenta os desafios da construção de uma solução de software moderna e explica como a ABP aborda esses desafios.",
    "CreatingANewSolution": "Criando uma nova solução",
    "CreatingANewSolution_Description": "Quando você precisa iniciar uma nova solução, há muitas perguntas que você precisa fazer a si mesmo e deve gastar muito tempo antes de começar a escrever seu primeiro código comercial.",
    "CreatingAnEmptySolution": "Criando uma solução vazia",
    "THEPROBLEM": "O PROBLEMA",
    "CreatingAnEmptySolution_THEPROBLEM_Description": "Até mesmo criar uma solução quase vazia é um desafio;",
    "CreatingAnEmptySolution_THEPROBLEM_Description2": "Como você organiza sua base de código entre projetos?",
    "CreatingAnEmptySolution_THEPROBLEM_Description3": "Quais são as camadas e como elas interagem?",
    "CreatingAnEmptySolution_THEPROBLEM_Description4": "Como você se integra a bibliotecas e sistemas de terceiros?",
    "CreatingAnEmptySolution_THEPROBLEM_Description5": "Como configurar os testes automatizados?",
    "ABPSOLUTION": "SOLUÇÃO ABP",
    "CreatingAnEmptySolution_ABPSOLUTION_Description": "A ABP fornece uma <a href=\"https://docs.abp.io/en/abp/latest/Startup-Templates/Application\" target=\"_blank\">solução de inicialização</a> bem arquitetada, em camadas e pronta para produção, baseada nos princípios <a href=\"https://docs.abp.io/en/abp/latest/Domain-Driven-Design\" target=\"_blank\">do Domain Driven Design</a> . A solução também inclui projetos <a href=\"https://docs.abp.io/en/abp/latest/Testing\" target=\"_blank\">de testes</a> unitários e de integração pré-configurados para cada camada.",
    "CommonLibraries": "Bibliotecas Comuns",
    "CommonLibraries_THEPROBLEM_Description": "Quais bibliotecas você deve usar para implementar requisitos comuns? O ecossistema de desenvolvimento de software é altamente dinâmico, tornando difícil acompanhar as ferramentas, bibliotecas, tendências e abordagens mais recentes.",
    "CommonLibraries_ABPSOLUTION_Description": "A ABP pré-integra bibliotecas populares, maduras e atualizadas na solução. Você não precisa perder tempo integrando-os ou fazendo com que se comuniquem entre si. Eles funcionam corretamente fora da caixa.",
    "UITheme&Layout": "Tema e layout da interface do usuário",
    "UITheme&Layout_THEPROBLEM_Description": "Ao abordar questões de UI, surge uma série de desafios. Isso inclui estabelecer a base para um kit de UI responsivo, contemporâneo e adaptável com uma aparência consistente e uma série de recursos como menus de navegação, cabeçalhos, barras de ferramentas, rodapés, widgets e muito mais.",
    "UITheme&Layout_THEPROBLEM_Description2": "Mesmo se você optar por um tema pré-concebido, integrá-lo perfeitamente ao seu projeto pode exigir dias de desenvolvimento. Um obstáculo adicional reside na atualização de tais temas. Freqüentemente, a estrutura HTML/CSS do tema fica entrelaçada com o código da IU, renderizando futuras alterações do tema ou atualizações de tarefas complexas. Esse entrelaçamento de código e design complica a flexibilidade de fazer ajustes no futuro.",
    "UITheme&Layout_ABPSOLUTION_Description": "O ABP Framework oferece um sistema de temas diferenciado que libera seu código de UI das restrições de tema. Os temas existem isoladamente, empacotados como pacotes NuGet ou NPM, tornando a instalação ou atualização do tema uma questão de minutos. Embora você mantenha a opção de desenvolver seu tema personalizado ou integrar um já existente, a ABP Commercial apresenta uma coleção de temas sofisticados e contemporâneos.",
    "UITheme&Layout_ABPSOLUTION_Description2": "Além disso, existem fornecedores de componentes de UI como Telerik e DevExpress. No entanto, esses fornecedores fornecem principalmente componentes individuais, colocando sobre você a responsabilidade de estabelecer seu sistema de layout. Ao trabalhar em projetos baseados em ABP, você pode incorporar essas bibliotecas perfeitamente, da mesma forma que faria em qualquer outro projeto.",
    "TestInfrastructure": "Infraestrutura de teste",
    "TestInfrastructure_THEPROBLEM_Description": "Estabelecer um ambiente de teste robusto é uma tarefa demorada. Envolve a configuração de projetos de teste dedicados em sua solução, selecionando cuidadosamente as ferramentas necessárias, criando simulações de serviços e bancos de dados, elaborando classes base essenciais e serviços utilitários para minimizar código redundante em testes e abordando várias tarefas relacionadas.",
    "TestInfrastructure_ABPSOLUTION_Description": "Os modelos de inicialização ABP chegam pré-equipados com projetos de teste configurados, agilizando o processo para você. Isso significa que, desde o primeiro dia, você pode começar a escrever sua unidade inicial ou código de teste de integração sem demora.",
    "CodingStandards&Training": "Padrões de codificação e treinamento",
    "CodingStandards&Training_THEPROBLEM_Description": "Depois de configurar a solução para desenvolvimento, normalmente você terá que ensinar aos desenvolvedores como o sistema funciona e como construí-lo usando os mesmos métodos acordados. Mesmo que você lhes dê treinamento, pode ser difícil manter a documentação atualizada. Com o passar do tempo, cada desenvolvedor pode escrever código à sua maneira, fazendo com que as regras para escrever código se tornem diferentes umas das outras.",
    "CodingStandards&Training_ABPSOLUTION_Description": "A solução ABP já está bem organizada e tem explicações claras. Tutoriais e guias passo a passo mostram exatamente como trabalhar em um projeto ABP.",
    "KeepingYourSolutionUpToDate": "Mantendo sua solução atualizada",
    "KeepingYourSolutionUpToDate_THEPROBLEM_Description": "Depois de iniciar o desenvolvimento, você deve acompanhar as novas versões das bibliotecas usadas para atualizações e patches.",
    "KeepingYourSolutionUpToDate_ABPSOLUTION_Description": "Atualizamos regularmente todos os pacotes para as versões mais recentes e os testamos antes do lançamento estável. Quando você atualiza o ABP Framework, todas as suas dependências são atualizadas para tecnologia de ponta.",
    "DRY": "Não se repita!",
    "DRY_Description": "A criação de uma solução base leva um tempo significativo e requer uma boa experiência arquitetônica. No entanto, este é apenas o começo! Ao começar a desenvolver, você provavelmente terá que escrever muitos códigos repetitivos; seria ótimo se tudo isso pudesse ser tratado automaticamente.",
    "DRY_Description2": "O ABP automatiza e simplifica a repetição de código tanto quanto possível, seguindo o princípio da convenção sobre configuração. No entanto, isso não o restringe quando você precisa mudar para a marcha manual. O controle está sempre em suas mãos.",
    "Authentication": "Autenticação",
    "Authentication_THEPROBLEM_Description": "Single Sign On, integração Active Directory/LDAP, integração OpenIddict, logins sociais, autenticação de dois fatores, esquecimento/redefinição de senha, ativação de e-mail, registro de novo usuário, controle de complexidade de senha, bloqueio de conta em tentativas malsucedidas, exibição de tentativas de login malsucedidas... etc. Sabemos que todos esses requisitos genéricos são familiares para você. Você não está sozinho!",
    "Authentication_ABPSOLUTION_Description": "O ABP Framework e a versão comercial fornecem todos esses itens padrão pré-implementados para você como um módulo de conta reutilizável. Você apenas habilita e configura o que precisa.",
    "CrossCuttingConcerns": "Preocupações transversais",
    "CrossCuttingConcerns_THEPROBLEM_Description": "As preocupações transversais são a lógica de repetição fundamental que deve ser implementada para cada caso de uso. Alguns exemplos;",
    "CrossCuttingConcerns_THEPROBLEM_Description2": "Iniciando transações, comprometendo-se com sucesso e revertendo erros.",
    "CrossCuttingConcerns_THEPROBLEM_Description3": "Tratamento e reporte de exceções, retornando uma resposta de erro adequada aos clientes e tratando casos de erro no lado do cliente.",
    "CrossCuttingConcerns_THEPROBLEM_Description4": "Implementar autorização e validação, retornando respostas adequadas e tratando-as do lado do cliente.",
    "CrossCuttingConcerns_ABPSOLUTION_Description": "O ABP Framework automatiza ou simplifica todas as preocupações transversais comuns. Você escreve apenas o código que é importante para o seu negócio e a ABP cuida do resto por meio de convenções.",
    "ArchitecturalInfrastructure": "Infraestrutura Arquitetônica",
    "ArchitecturalInfrastructure_THEPROBLEM_Description": "Normalmente, você precisa construir uma infraestrutura para implementar sua arquitetura adequadamente. Por exemplo, você geralmente implementa o padrão Repository. Você define algumas classes base para simplificar e padronizar a criação de entidades, serviços, controladores e outros objetos.",
    "ArchitecturalInfrastructure_ABPSOLUTION_Description": "O ABP Framework fornece tudo isso e muito mais pronto para uso. É maduro e bem documentado.",
    "EnterpriseApplicationRequirements": "Requisitos de aplicativos empresariais",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description": "Existem muitos requisitos que você implementa repetidamente em todas as aplicações de negócios;",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description2": "Sistema de permissão detalhado e gerenciamento de permissões na IU com base em funções e usuários.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description3": "Escrever logs de auditoria e históricos de entidades para rastrear quando um usuário modifica um registro de banco de dados.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description4": "Faça com que suas entidades sejam excluídas de forma reversível, para que sejam marcadas como excluídas, em vez de excluí-las fisicamente do banco de dados e filtrar automaticamente as entidades excluídas em suas consultas.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description5": "Criação de abstrações e wrappers para consumir suas APIs de back-end a partir do código de front-end.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description6": "Enfileirar e executar trabalhos em segundo plano.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description7": "Lidando com vários fusos horários em um sistema global.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description8": "Compartilhando validação, localização e lógica de autorização entre servidor e cliente.",
    "EnterpriseApplicationRequirements_ABPSOLUTION_Description": "A ABP fornece uma infraestrutura para implementar facilmente tais requisitos. Novamente, você não gasta seu valioso tempo reimplementando tudo isso repetidamente.",
    "GeneratingInitialCode&Tooling": "Gerando código inicial e ferramentas",
    "GeneratingInitialCode&Tooling_THEPROBLEM_Description": "Você construirá muitas páginas semelhantes em um aplicativo da web típico. A maioria deles realizará operações CRUD semelhantes. É muito tedioso e também sujeito a erros criar essas páginas repetidamente.",
    "GeneratingInitialCode&Tooling_ABPSOLUTION_Description": "<a href=\"/tools/suite\">O ABP Suite</a> pode gerar uma página CRUD full stack para suas entidades em segundos. O código gerado é em camadas e limpo. Todos os requisitos padrão de validação e autorização são implementados. Além disso, são geradas classes de teste de unidade. Depois de obter uma página totalmente funcional, você pode modificá-la de acordo com os requisitos do seu negócio.",
    "IntegratingTo3rdPartyLibrariesAndSystems": "Integração com bibliotecas e sistemas de terceiros",
    "IntegratingTo3rdPartyLibrariesAndSystems_THEPROBLEM_Description": "A maioria das bibliotecas é projetada como de baixo nível e normalmente você faz algum trabalho para integrá-las adequadamente, sem repetir o mesmo código de integração e configuração em toda a sua solução. Por exemplo, suponha que você deva usar RabbitMQ para implementar seu barramento de eventos distribuído. Tudo que você quer fazer é; enviar uma mensagem para uma fila e lidar com as mensagens recebidas. Mas você precisa entender os padrões de mensagens, filas e detalhes de troca. Para escrever um código eficiente, você deve criar um pool para gerenciar conexões, clientes e canais. Você também deve lidar com exceções, mensagens ACK, reconectar-se ao RabbitMQ em caso de falhas e muito mais.",
    "IntegratingTo3rdPartyLibrariesAndSystems_ABPSOLUTION_Description": "Por exemplo, a integração do RabbitMQ Distributed Event Bus da ABP abstrai todos esses detalhes. Você envia e recebe mensagens sem agitação. Você precisa escrever código de baixo nível? Não tem problema, você sempre pode fazer isso. O ABP não restringe quando você precisa usar recursos de baixo nível da biblioteca que está usando.",
    "WhyNotBuildYourOwnFramework?": "Por que não construir sua própria estrutura?",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description": "Toda a infraestrutura, mesmo da forma mais simples, leva muito tempo para ser construída, mantida e documentada. Ele fica maior com o tempo e fica difícil mantê-lo em sua solução. Separá-los em um projeto reutilizável é o ponto de partida para construir sua própria estrutura interna.",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description2": "Construir, documentar, treinar e manter uma estrutura interna é realmente difícil. Se você não tiver uma equipe de framework experiente e dedicada, sua estrutura interna rapidamente se tornará um código legado não documentado que ninguém mais consegue entender e manter. Por outro lado, esses frameworks geralmente são desenvolvidos por um ou dois desenvolvedores da equipe. E esses sujeitos estão se tornando um silo de conhecimento. É bom para eles, mas ruim para a empresa porque são o único ponto de falha do projeto <a href=\"https://en.wikipedia.org/wiki/Single_point_of_failure\">-SPOF-</a> . Depois que eles saem da empresa, o projeto vai por água abaixo.",
    "WhyNotBuildYourOwnFramework_ABPSOLUTION_Description": "ABP Framework é uma estrutura de aplicação genérica, madura e bem documentada, orientada pela comunidade. Uma equipe de desenvolvedores altamente experientes está trabalhando duro para mantê-lo atualizado, fácil de entender e confortável de usar. Usar uma estrutura tão estável faz com que você se concentre em seu próprio código de negócios e obtenha ajuda de especialistas com a estrutura sempre que precisar.",
    "ArchitecturalInfrastructure_Description": "Aplicativos SaaS, sistemas modulares ou de microsserviços são os modelos de software empresarial mais utilizados. A construção de tais sistemas não requer apenas um bom conhecimento e experiência, mas também uma forte infraestrutura de software. Caso contrário, você gastará um grande esforço para oferecer suporte a esses detalhes arquitetônicos em sua base de código.",
    "Modularity": "Modularidade",
    "Modularity_THEPROBLEM_Description": "Construir um sistema verdadeiramente modular não é fácil! Todos os aspectos do sistema (banco de dados, entidades, APIs, páginas/componentes UI) podem ser divididos em módulos, e cada módulo pode ser reutilizável sem outros. O ASP.NET Core simples não fornece uma arquitetura tão modular. Se precisar, você deve pensar nisso do zero.",
    "Modularity_ABPSOLUTION_Description": "O ABP Framework nasce para ser uma estrutura modular de desenvolvimento de aplicações. Cada recurso da estrutura é desenvolvido para ser compatível com a modularidade. A documentação e os guias explicam como desenvolver módulos reutilizáveis de maneira padrão.",
    "SaaSMultiTenancy": "SaaS / Multilocação",
    "SaaSMultiTenancy_THEPROBLEM_Description": "<a href=\"https://docs.abp.io/en/abp/latest/Multi-Tenancy\">Multi-Tenancy</a> é uma forma comum de implementar sistemas SaaS. No entanto, a implementação de uma infraestrutura multilocatária consistente pode tornar-se complicada.",
    "SaaSMultiTenancy_ABPSOLUTION_Description": "O ABP Framework fornece uma infraestrutura multilocatária completa e abstrai a complexidade do seu código de negócios. O código do seu aplicativo será principalmente compatível com multilocação, enquanto o ABP Framework isola automaticamente o banco de dados, o cache e outros detalhes dos locatários uns dos outros. Ele oferece suporte a banco de dados único, banco de dados por locatário e abordagens híbridas. Ele configura corretamente as bibliotecas como Microsoft Identity e OpenIddict, que normalmente não são compatíveis com multilocação.",
    "Microservices": "Microsserviços",
    "Microservices_THEPROBLEM_Description": "Construir um sistema de microsserviços requer muitos detalhes de infraestrutura: autenticar e autorizar aplicativos e microsserviços e implementar mensagens assíncronas e padrões de comunicação síncrona (Rest/GRPC) entre microsserviços são as questões mais fundamentais.",
    "Microservices_ABPSOLUTION_Description": "A estrutura ABP fornece serviços, <a href=\"https://docs.abp.io/en/abp/latest/Microservice-Architecture\" target=\"_blank\">guias</a> e exemplos para ajudá-lo a implementar sua solução de microsserviços usando ferramentas padrão do setor.",
    "Microservices_ABPSOLUTION_Description2": "ABP Commercial vai um passo além e fornece um <a href=\"https://docs.abp.io/en/commercial/latest/startup-templates/microservice/index\" target=\"_blank\">modelo de inicialização</a> completo para iniciar sua solução de microsserviço.",
    "PreBuiltModules": "Módulos pré-construídos",
    "PreBuiltModules_THEPROBLEM_Description": "Todos nós temos requisitos de negócios semelhantes, mas ligeiramente diferentes. No entanto, todos nós deveríamos reinventar a roda, já que nenhum código de ninguém pode funcionar diretamente em nossa solução. Todos eles são partes incorporadas de uma solução maior.",
    "PreBuiltModules_ABPSOLUTION_Description": "<a href=\"/modules\">Os módulos</a> comerciais da ABP fornecem muitos módulos de aplicativos reutilizáveis, como pagamento, chat, gerenciamento de arquivos, relatórios de log de auditoria... etc. Todos esses módulos são facilmente instalados em sua solução e funcionam diretamente. Estamos constantemente adicionando mais módulos.",
    "PreBuiltModules_ABPSOLUTION_Description2": "Todos os módulos são projetados para serem personalizáveis de acordo com as necessidades do seu negócio. Se precisar de controle total, você pode baixar o código-fonte completo de qualquer módulo e personalizá-lo completamente com base em seus requisitos de negócios específicos.",
    "ABPCommunity": "Comunidade ABP",
    "ABPCommunity_Description": "Por fim, estar em uma grande comunidade onde todos seguem estilos e princípios de codificação semelhantes e compartilham uma infraestrutura comum traz poder quando você tem problemas ou precisa de ajuda com decisões de design. Como escrevemos código de forma semelhante, podemos ajudar uns aos outros muito melhor. ABP é um projeto apoiado pela comunidade com mais de 10 mil estrelas no GitHub.",
    "ABPCommunity_Description2": "É fácil compartilhar código ou até mesmo bibliotecas reutilizáveis entre desenvolvedores ABP. Um trecho de código que funciona para você também funcionará para outras pessoas. Existem muitos exemplos e tutoriais que você pode implementar diretamente em seu aplicativo.",
    "ABPCommunity_Description3": "Ao contratar um desenvolvedor que já trabalhou com a arquitetura ABP entenderá imediatamente sua solução e iniciará o desenvolvimento em pouquíssimo tempo.",
    "WhyAbpIo_Page_Title": "Por que plataforma ABP.IO?",
    "AbpStudio_Page_Title": "Estúdio ABP",
    "CampaignInfo": "Compre uma nova licença ou renove sua licença existente e <span class=\"text-white\">ganhe 2 meses adicionais</span> sem custo adicional! Esta oferta é válida para todos os planos de licença. Aproveite esta promoção por tempo limitado para expandir seu acesso a recursos e atualizações premium.",
    "HurryUpLastDay": "Se apresse! Último dia: {0}",
    "CreatingCRUDPagesWithABPSuite": "Criando páginas CRUD com ABP Suite",
    "Testimonials": "Depoimentos",
    "MultipleYearDiscount": "Desconto para vários anos",
    "CampaignDiscountText": "Desconto na sexta-feira negra",
    "CampaignDiscountName": "Sexta-feira preta",
    "CampaignName:BlackFriday": "Sexta-feira preta"
  }
}