{
  "culture": "ro-RO",
  "texts": {
    "OrganizationManagement": "Administrarea organizaţiilor",
    "OrganizationList": "Lista organizaţiilor",
    "Volo.AbpIo.Commercial:010003": "Nu sunteţi proprietarul acestei organizaţii!",
    "OrganizationNotFoundMessage": "Nicio organizaţie găsită!",
    "DeveloperCount": "Alocaţi/total dezvoltatori",
    "QuestionCount": "Rămase/total întrebări",
    "Unlimited": "Nelimitat",
    "Owners": "Proprietari",
    "AddMember": "Adaugă membru",
    "AddOwner": "Adaugă proprietar",
    "AddDeveloper": "Adaugă dezvoltator",
    "UserName": "Nume utilizator",
    "Name": "Nume",
    "EmailAddress": "Adresă de email",
    "Developers": "Dezvoltatori",
    "LicenseType": "Tip licenţă",
    "Manage": "Administrează",
    "StartDate": "Data de început",
    "EndDate": "Data de sfârşit",
    "Modules": "Module",
    "LicenseExtendMessage": "Data expirării licenţei dumneavoastră a fost prelungită până în {0}",
    "LicenseUpgradeMessage": "Licenţa dumneavoastră a fost actualizată la {0}",
    "LicenseExtendAdnUpgradeMessage": "Licența dvs. a fost extinsă până la {0}, iar planul de licență este actualizat la {1}.",
    "LicenseAddDeveloperMessage": "{0} dezvoltatori au fost ataşaţi licenţei dumneavoastră",
    "Volo.AbpIo.Commercial:010004": "Utilizatorul nu a putut fi găsit! Acesta trebuie să se fi înregistrat deja.",
    "MyOrganizations": "Organizaţiile mele",
    "ApiKey": "Cheie API",
    "UserNameNotFound": "Nu există niciun utilizator cu numele {0}",
    "SuccessfullyAddedToNewsletter": "Vă mulţumim pentru că v-aţi abonat la newsletter-ul nostru!",
    "MyProfile": "Profilul meu",
    "EmailNotValid": "Vă rugăm să introduceţi o adresa de email validă.",
    "JoinOurMarketingNewsletter": "Alăturaţi-va newsletter-ului nostru de marketing",
    "WouldLikeToReceiveMarketingMaterials": "Aş dori să primesc materiale de marketing precum oferte şi oferte speciale.",
    "StartUsingYourLicenseNow": "Începe folosirea licenţei tale acum!",
    "WelcomePage": "Pagina de bun venit",
    "UnsubscriptionExpireEmail": "Dezabonează-te de la emailuri informative despre data expirării licenţei.",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Această abonament prin email conţine numai amintirea datei de expirare a licenţei.",
    "UnsubscribeFromLicenseExpireEmails": "Dacă nu mai doriţi să primiţi emailuri informative despre data de expirare a licenţei dumneavoastră, puteţi să vă dezabonaţi oricând.",
    "Unsubscribe": "Dezabonează-te",
    "NotOrganizationMember": "Nu sunteţi membru al niciunei organizaţii.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "V-aţi dezabonat cu succes.",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Nu veţi mai primi emailuri informative despre data de expirare a licenţei dumneavoastră.",
    "IndexPageHeroSection": "<span class=\"first-line\">A complete</span><span class=\"second-line\"> web development platform</span><span class=\"third-line\">built-on <img src=\"{0}\" width=\"110\" class=\"ml-1\" /> framework</span>",
    "AbpCommercialShortDescription": "ABP Commercial oferă module de aplicaţii pre-construite, instrumente de dezvoltare rapidă a aplicaţiilor, teme UI profesionale, asistenţă premium şi multe altele.",
    "LiveDemo": "Live Demo",
    "GetLicence": "Obţine o licenţă",
    "Application": "Application",
    "StartupTemplates": "Şabloane de lansare",
    "Startup": "Lansare",
    "Templates": "Şabloane",
    "Developer": "Dezvoltator",
    "Tools": "Unelte",
    "Premium": "Premium",
    "PremiumSupport": "Asistenţă Premium",
    "PremiumForumSupport": "Forum asistenţă premium",
    "UI": "UI",
    "Themes": "Teme",
    "JoinOurNewsletter": "Abonaţi-va newsletter-ului nostru",
    "Send": "Trimite",
    "Learn": "Învaţă",
    "AdditionalServices": "Servicii suplimentare",
    "WhatIsABPFramework": "CE ESTE FRAMEWORK-UL ABP?",
    "OpenSourceBaseFramework": "Open Source Base Framework",
    "ABPFrameworkExplanation": "<p class=\"lead\">ABP Commercial se bazează pe framework-ul ABP, un framework open source şi bazat pe comunitate pentru ASP.NET Core.</p><p>ABP Framework oferă o infrastructură excelentă pentru a scrie cod care poate fi întreţinut, extins şi testat cu cele mai bune practici.</p><p>Construit şi integrat în instrumentele populare pe care le cunoaşteţi deja. Curbă de învăţare redusă, adaptare uşoară, dezvoltare confortabilă.</p>",
    "Modular": "Modular",
    "MicroserviceCompatible": "Compatibil cu microservicii",
    "DomainDrivenDesignInfrastructure": "Domain Driven Design Infrastructure",
    "MultiTenancy": "Multi-Tenancy",
    "DistributedMessaging": "Mesaje distribuite",
    "DynamicProxying": "Proxy dinamic",
    "BackgroundJobs": "Background Jobs",
    "AuditLogging": "Înregistrarea auditului",
    "BLOBStoring": "BLOB Storing",
    "BundlingMinification": "Bundling & Minification",
    "AdvancedLocalization": "Localizare avansată",
    "ManyMore": "Multe altele",
    "ExploreTheABPFramework": "Exploraţi framework-ul ABP",
    "WhyUseTheABPCommercial": "De ce să folosiţi ABP Commercial?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\">Construirea de aplicaţii web de nivel enterprise poate fi complexă şi poate consuma mult timp.</p><p>ABP Commercial oferă infrastructura de bază pentru toate soluţiile moderne bazate pe ASP.NET Core de nivel enterprise. De la proiectare până la implementare, întregul ciclu de dezvoltare este împuternicit de funcţiile şi modulele integrate ale ABP.</p>",
    "StartupTemplatesShortDescription": "Şabloanele de pornire vă fac să începeţi proiectul în câteva secunde.",
    "UIFrameworksOptions": "UI frameworks options;",
    "DatabaseProviderOptions": "Opţiuni furnizor de bază de date;",
    "PreBuiltApplicationModules": "Module de aplicaţii pre-construite",
    "PreBuiltApplicationModulesShortDescription": "Cele mai comune cerinţe de aplicaţie sunt deja dezvoltate pentru dumneavoastră sub formă de module reutilizabile.",
    "Account": "Cont",
    "Blogging": "Blogging",
    "Identity": "Identitate",
    "IdentityServer": "Identity Server",
    "Saas": "Saas",
    "LanguageManagement": "Administrarea limbilor",
    "TextTemplateManagement": "Text Template Management",
    "See All Modules": "Vedeți toate modulele",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "ABP Suite este un instrument complementar pentru ABP Commercial.",
    "AbpSuiteExplanation": "Vă permite să creaţi pagini web în câteva minute. Este un instrument .NET Core global, care poate fi instalat din linia de comandă. Poate crea o nouă soluţie ABP, poate genera pagini CRUD, începând de la baza de date până la front-end.",
    "Details": "Detalii",
    "LeptonTheme": "Tema Lepton",
    "ProfessionalModernUIThemes": "Teme UI profesionale, moderne",
    "LeptonThemeExplanation": "Lepton oferă o gamă de teme de administrare Bootstrap, care servesc ca o bază solidă pentru orice proiect care necesită tabloul de bord de administrare.",
    "DefaultTheme": "Tema Default",
    "MaterialTheme": "Tema Material",
    "Default2Theme": "Tema Default 2",
    "DarkTheme": "Tema Dark",
    "DarkBlueTheme": "Tema Dark Blue",
    "LightTheme": "Tema Light",
    "ProudToWorkWith": "Mândru să lucrez cu",
    "OurConsumers": "Sute de întreprinderi şi dezvoltatori din peste 70 de ţări din jurul lumii se bazează pe ABP Commercial.",
    "JoinOurConsumers": "Alăturaţi-va lor şi construiţi produse uimitoare rapid.",
    "AdditionalServicesExplanation": "Aveţi nevoie de servicii suplimentare sau personalizate? <strong>Noi şi partenerii noştri vi le putem oferi;</strong>",
    "CustomProjectDevelopment": "Custom Project Development",
    "CustomProjectDevelopmentExplanation": "Dezvoltatori dedicaţi pentru proiectele dumneavoastră personalizate.",
    "PortingExistingProjects": "Portarea proiectelor existente",
    "PortingExistingProjectsExplanation": "Migrarea proiectelor dumneavoastră vechi pe platforma ABP.",
    "LiveSupport": "Asistenţă live",
    "LiveSupportExplanation": "Opţiune de asistenţă live la distanţă oricând aveţi nevoie.",
    "Training": "Instruire",
    "TrainingExplanation": "Instruire dedicată pentru dezvoltatorii dumneavoastră.",
    "OnBoarding": "Integrare",
    "OnBoardingExplanation": "Ajutor pentru configurarea dezvoltării, mediilor CI & CD.",
    "PrioritizedTechnicalSupport": "Asistenţă tehnică prioritară",
    "PremiumSupportExplanation": "Pe lângă excelentul suport comunitar al framework-ului ABP, echipa noastră de asistenţă răspunde la întrebările tehnice şi la problemele utilizatorilor comerciali cu prioritate crescută.",
    "SeeTheSupportOptions": "Vedeţi opţiunile de asistenţă",
    "Contact": "Contact",
    "TellUsWhatYouNeed": "Spuneţi-ne de ce aveţi nevoie.",
    "YourMessage": "Mesajul dumneavoastră",
    "YourFullName": "Numele dumneavoastră complet",
    "EmailField": "Adresa de email",
    "YourEmailAddress": "Adresa dumneavoastră de email",
    "HowMayWeHelpYou": "Cum vă putem ajuta?",
    "SendMessage": "Trimite mesaj",
    "Success": "Succes",
    "WeWillReplyYou": "Am primit mesajul dumneavoastră şi vă vom contacta cât de repede posibil.",
    "GoHome": "Navigaţi acasă",
    "CreateLiveDemo": "Crează Demo Live",
    "RegisterToTheNewsletter": "Înregistraţi-va la newsletter pentru a primi informaţii despre ABP.IO, inclusiv lansări noi etc.",
    "EnterYourEmailOrLogin": "Introduceţi-vă adresa de email pentru a vă crea demo-ul sau <a href=\"{0}\">Autentificaţi-vă</a> folosind contul existent.",
    "ApplicationTemplate": "Application Template",
    "ApplicationTemplateExplanation": "Şablonul de pornire a aplicaţiei este utilizat pentru a crea o nouă aplicaţie web.",
    "EfCoreProvider": "Entity Framework (susţine SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\">şi altele</a>)",
    "AlreadyIncludedInTemplateModules": "Următoarele module sunt deja incluse şi configurate în acest şablon:",
    "ApplicationTemplateArchitecture": "Acest şablon de aplicaţie susţine arhitecturi structurate pe nivele, în care nivelul UI, nivelul API şi serviciul de autentificare sunt separate fizic.",
    "SeeTheGuideOrGoToTheLiveDemo": "Consultaţi ghidul dezvoltatorului pentru informaţii tehnice despre acest şablon sau mergeţi la demo-ul live.",
    "DeveloperGuide": "Ghidul dezvoltatorului",
    "ModuleTemplate": "Module Template",
    "ModuleTemplateExplanation1": "Vreţi să creaţi un modul pe care sa-l reutilizaţi în cadrul diferitelor aplicaţii? Acest şablon de pornire pregăteşte totul pentru a putea începe să creaţi un <strong>modul</strong> sau un <strong>microserviciu</strong> reutilizabil.",
    "ModuleTemplateExplanation2": "<p>Puteţi susţine cadre UI simple sau multiple, furnizori unici sau multipli pentru baza de date pentru un singur modul. Şablonul de pornire este configurat pentru a rula <strong>şi testa modulul dumneavoastră</strong> într-o aplicaţie minimă, în plus faţă de infrastructura de testare şi integrare.</p> <p>Consultaţi ghidul dezvoltatorului pentru informaţii tehnice despre acest şablon.</p>",
    "WithAllStyleOptions": "cu toate opţiunile de stil",
    "Demo": "Demo",
    "SeeAllModules": "Vezi toate modulele",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) este un instrument de linii de comandă pentru executarea unor operaţii comune pentru soluţiile ABP.",
    "ABPSuiteEasilyCURD": "Suita ABP este un instrument care vă permite crearea cu uşurinţă a paginilor CRUD",
    "WeAreHereToHelp": "Suntem aici să <span class=\"zero-text\">Ajutăm</span>",
    "BrowseOrAskQuestion": "Puteţi răsfoi subiectele noastre de ajutor sau puteţi căuta în cadrul secţiunii întrebărilor frecvent adresate, sau ne puteţi adresa o întrebare folosind <a href=\"{0}\" class=\"text-success\">formularul de contact</a>.",
    "SearchQuestionPlaceholder": "Caută în întrebările frecvent adresate",
    "WhatIsTheABPCommercial": "Ce este ABP Commercial?",
    "WhatAreDifferencesThanAbpFramework": "Care sunt diferenţele dintre ABP Framework şi ABP Comercial?",
    "ABPCommercialExplanation": "ABP Commercial este un set de module premium, instrumente, teme şi servicii construite pe baza <a target=\"_blank\" href=\"{0}\">ABP framework</a>. ABP Commercial este dezvoltat şi întreţinut de către aceeaşi echipă din spatele ABP framework.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\">ABP framework</a> este un framework de dezvoltare de aplicaţii modulare, compatibil cu micro-servicii dedicate ASP.NET Core. Oferă o arhitectură completă şi o infrastructură puternică pentru a vă face să vă concentraţi asupra propriului cod, mai degrabă decât să vă repetaţi pentru fiecare proiect nou. Se bazează pe cele mai bune practici de dezvoltare software, şi pe instrumentele populare pe care le cunoaşteţi deja. </p><p>ABP Framework este complet gratuit, open-source şi bazat pe comunitate. De asemenea, oferă şi o temă gratuită şi câteva module pre-construite (de exemplu, gestionarea identităţii şi a chiriaşilor).</p>",
    "VisitTheFrameworkVSCommercialDocument": "Accesaţi următorul link, pentru mai multe informaţii <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial adaugă următoarele beneficii peste framework-ul ABP;",
    "Professional": "Profesional",
    "UIThemes": "Teme UI",
    "EnterpriseModules": "<a href=\"{0}\">Module de aplicaţii</a> pregătite pentru întreprinderi, bogate în funcţionalităţi, pre-construite (e.g. Identity Server management, SaaS management, language management)",
    "ToolingToSupport": "Instrumente pentru a vă susţine productivitatea de dezvoltare (e.g. <a href=\"{0}\">Suita ABP</a>)",
    "PremiumSupportLink": "<a href=\"{0}\" target=\"_blank\">Asistenţă</a> premium",
    "WhatDoIDownloadABPCommercial": "Ce descarc când cumpăr ABP Commercial?",
    "CreateUnlimitedSolutions": "Odată ce aţi cumpărat o licenţă ABP Commercial, veţi putea să creaţi soluţii nelimitate, descrise în documentul <a href=\"{0}\">Noţiuni de bază</a>.",
    "ABPCommercialSolutionExplanation": "Când creaţi o aplicaţie nouă, veţi primi o soluţie de Visual Studio (un şablon de pornire) bazat pe preferinţele dumneavoastră. Soluţia descărcată conţine module comerciale şi teme pre-instalate şi configurate pentru dumneavoastră. Puteţi şterge un modul pre-instalat sau să adăugaţi altul dacă doriţi. Toate modulele şi temele folosesc un pachet NuGet/NPM în mod implicit.",
    "StartDevelopWithTutorials": "Soluţia descărcată este bine structurată şi documentată. Puteţi începe să vă dezvoltaţi codul dumneavoastră pe baza unuia dintre <a href=\"{0}\">tutoriale</a>",
    "TryTheCommercialDemo": "Puteţi încerca versiunea <a href=\"{0}\">demo</a> pentru a vedea un exemplu de aplicaţie creată folosind şablonul de pornire ABP Commercial.",
    "HowManyProducts": "Câte produse/soluţii diferite pot construi folosind ABP Commercial?",
    "HowManyProductsExplanation": "Nu există nicio limită pentru crearea unui proiect ABP. Puteţi crea cât de multe proiecte doriţi, pe care să le dezvoltaţi sau încărcaţi pe diferite servere.",
    "HowManyDevelopers": "Câţi dezvoltatori pot lucra pe ABP Commercial?",
    "HowManyDevelopersExplanation": "Licenţele de ABP Commercial sunt per dezvoltator. Tipuri diferite de licenţă au limite diferite de dezvoltatori. Totuşi, puteţi ataşa mai mulţi dezvoltatori unei licenţe oricând doriţi. Consultaţi <a href=\"{0}\">preţurile</a> pentru tipurile de licenţă, limitele de dezvoltatori şi costurile adiţionale pentru dezvoltatori.",
    "ChangingLicenseType": "Pe viitor pot să schimb tipul licenţei?",
    "ChangingLicenseTypeExplanation": "Puteţi adăuga oricând noi dezvoltatori în licenţa dumneavoastră de acelaşi tip. Consultaţi \"Câţi dezvoltatori pot lucra pe ABP Commercial?\". De asemenea, puteţi opta pentru o licenţă superioară prin plătirea achitarea de preţ. Atunci când optaţi pentru o licenţă superioară, veţi avea parte de beneficiile noii licenţe, însă acest lucru nu va schimba data expirării licenţei.",
    "LicenseExtendUpgradeDiff": "Care este diferenţa dintre prelungirea licenţei şi îmbunătăţirea acesteia?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Prelungirea:</strong> Prin prelungirea/reînnoirea licenţei dumneavoastră, veţi continua să aveţi acces la asistenţă premium, şi veţi avea parte de actualizările majore ale modulelor şi temelor. Pe lângă asta, veţi putea în continuare să creaţi proiecte noi. Veţi putea folosi în continuare suita ABP, ceea ce va accelera dezvoltarea.<hr/><strong>Îmbunătăţirea:</strong> Prin îmbunătăţirea licenţei dumneavoastră, veţi promova la un plan de licenţă superior, care vă va permite să beneficiaţi de anumite avantaje. Consultaţi <a href=\"/pricing\">tabelul de comparare a licenţelor</a> pentru a verifica diferenţele dintre planurile de licenţă.<strong>Pe de altă parte, când îmbunătăţiţi licenţa, data de expirare a acesteia nu se va schimba!</strong>Pentru a vă extinde data de încheiere a licenţei, va trebui să vă extindeţi licenţa.",
    "LicenseRenewalCost": "Care este costul de reînnoire a licenţei dupa 1 an?",
    "LicenseRenewalCostExplanation": "Prețul de reînnoire (extindere) al licenței standard de echipă este de {0} USD, al licenței standard de afaceri este de {1} USD și al licenței standard Enterprise este de {2} USD. Dacă sunteți deja client, <a href='{3}' target='_blank'>conectați-vă la contul dvs.</a> pentru a examina prețurile de reînnoire disponibile.",
    "HowDoIRenewMyLicense": "Cum îmi reînnoiesc licenţa?",
    "HowDoIRenewMyLicenseExplanation": "Puteţi să vă reînnoiţi licenţa prin accesarea paginii <a href='{0}' target='_blank'>pagina de gestionare a organizaţiei</a>. Pentru a profita de tarifele noastre reduse de reînnoire anticipată, asiguraţi-vă că reînnoiţi înainte de expirarea licenţei. Totuşi, nu vă faceţi griji dacă nu ştiţi când expiră oportunitatea dumneavoastră de reînnoire anticipată. Veţi primi 2 e-mailuri de reamintire înainte de expirarea abonamentului. Vi le vom trimite cu 30, respectiv 7 zile înainte de expirare.",
    "IsSourceCodeIncluded": "Licenţa mea include şi codul sursă al modulelor comerciale şi a temelor?",
    "IsSourceCodeIncludedExplanation1": "Depinde de tipul de licenţă pe care aţi achiziţionat-o:",
    "IsSourceCodeIncludedExplanation2": "<strong>Team</strong>: Soluţia dumneavoastră foloseste modulele şi temele sub formă de pachete NuGet şi NPM. Nu include şi codul lor sursă. În acest mod, puteţi cu uşurinţă să îmbunătăţiţi aceste module şi teme oricând este o nouă versiune disponibilă. Totuşi, nu veţi primi codul sursă al modulelor şi temelor.",
    "IsSourceCodeIncludedExplanation3": "<strong>Business/Enterprise</strong>: Pe lângă licenţa de tip Team, veţi putea să descărcaţi codul sursă al oricărui modul sau al oricărei teme doriţi. Puteţi chiar să eliminaţi referinţele pachetelor NuGet/NPM pentru un anume modul, şi să adăugaţi codul sursă al acestuia direct în soluţia dumneavoastră pentru a-l putea modifica pe deplin.",
    "IsSourceCodeIncludedExplanation4": "<p>Includerea codului sursă al unui modul în soluţia dumneavoastră vă oferă libertate maximă de a personaliza modulul respectiv. Totuşi, atunci nu va fi posibilă actualizarea automată a modulului atunci când o nouă versiune este publicată.</p><p>Niciuna dintre licenţe nu include codul sursă al suitei ABP, care este un instrument extern care generează cod pentru dumneavoastră şi contribuie la dezvoltare.</p><p>Consultaţi <a href=\"{0}\">preţurile</a> pentru alte diferenţe între tipurile de licenţe.</p>",
    "ChangingDevelopers": "Pe viitor, pot schimba dezvoltatorii ataşaţi organizaţiei mele?",
    "ChangingDevelopersExplanation": "În plus faţă de adăugarea de noi dezvoltatori la licenţa dumneavoastră, puteţi schimba şi dezvoltatorii existenţi(puteţi elimina un dezvoltator şi adăuga unul nou în locul lui) fără costuri suplimentare.",
    "WhatHappensWhenLicenseEnds": "Ce se întâmplă când se încheie perioada licenţei mele?",
    "WhatHappensWhenLicenseEndsExplanation1": "Tipul de licență comercială ABP este <a href=\"{0}\" target=\"_blank\">licență perpetuă</a>. După expirarea licenței, puteți continua să vă dezvoltați proiectul. Și nu sunteți obligat să vă reînnoiți permisul. Licența dvs. vine cu o actualizare de un an și un plan de asistență. Pentru a beneficia în continuare de noi funcții, îmbunătățiri de performanță, remedieri de erori, asistență și pentru a continua să utilizați ABP Suite, trebuie să vă reînnoiți licența. La expirarea licenței, nu veți beneficia de următoarele beneficii;",
    "WhatHappensWhenLicenseEndsExplanation2": "Nu puteţi crea noi soluţii folosind ABP Commercial, dar puteţi continua dezvoltarea aplicaţiilor existente oricând.",
    "WhatHappensWhenLicenseEndsExplanation3": "Veți putea obține actualizări pentru modulele și temele din versiunea dvs. MAJOR (cu excepția versiunilor RC sau Preview). De exemplu; dacă utilizați v3.2.0 a unui modul, puteți obține în continuare actualizări pentru v3.x.x (v3.3.0, v3.5.2... etc.) ale acelui modul. Dar nu puteți obține actualizări pentru următoarea versiune majoră (cum ar fi v4.x, v5.x). De exemplu, când licența dvs. a expirat, cea mai recentă versiune a fost v4.4.3 și cea mai recentă versiune de previzualizare a fost v5.0.0-rc.2, puteți accesa v4.X.X, dar nu puteți accesa v5.X.X.",
    "WhatHappensWhenLicenseEndsExplanation4": "Nu puteţi instala noi module şi teme adăugate pe platforma ABP Comercial după ce se încheie licenţa dumneavoastră.",
    "WhatHappensWhenLicenseEndsExplanation5": "Nu puteţi folosi suita ABP.",
    "WhatHappensWhenLicenseEndsExplanation6": "Nu veţi mai avea parte de <a href=\"{0}\">asistenţă premium</a>.",
    "WhatHappensWhenLicenseEndsExplanation7": "Vă puteți prelungi (reînnoi) licența dacă doriți să continuați să beneficiați de aceste beneficii. Dacă vă prelungiți licența în termen de <strong>1 lună</strong> după expirarea licenței, se vor aplica următoarele reduceri: Licență de echipă {0}% reducere, Licență de afaceri {1}% reducere, Licență Enterprise {2}% reducere .",
    "WhenShouldIRenewMyLicense": "Când ar trebui să-mi reînnoiesc licenţa?",
    "WhenShouldIRenewMyLicenseExplanation": "Dacă vă reînnoiți licența în termen de <strong>o lună</strong> de la expirarea licenței, se vor aplica următoarele reduceri: Licență de echipă {0}% reducere, Licență de afaceri {1}% reducere, Licență Enterprise {2}% reducere . Dacă vă reînnoiți licența la <strong>1 lună</strong> după data de expirare a licenței, prețul de reînnoire va fi același cu prețul de achiziție a licenței și nu va exista nicio reducere la reînnoirea dvs.",
    "TrialPlan": "Aveţi un plan de încercare?",
    "TrialPlanExplanation": "Pentru moment, ABP Comercial nu include un plan de încercare. Pentru licenţa de Team oferim înapoirea banilor în termen de 30 de zile. Puteţi să solicitaţi o restituire în primele 30 de zile. Pentru licenţele de tip Business şi Enterprise, noi asigurăm restituirea a 60% din sumă în 30 de zile. Acest lucru se datorează faptului că licenţele de tip Business şi Enterprise includ codul sursă complet al tuturor modulelor şi temelor.",
    "DoYouAcceptBankWireTransfer": "Acceptaţi transfer bancar?",
    "DoYouAcceptBankWireTransferExplanation": "Da, acceptăm transfer bancar.<br />După ce ați trimis taxa de licență prin transfer bancar, trimiteți-ne un e-mail la accounting@abp.io chitanța dvs. și tipul de licență solicitat. Informațiile noastre internaționale despre contul nostru bancar:",
    "HowToUpgrade": "Cum se actualizează aplicaţiile existente atunci când este disponibilă o nouă versiune?",
    "HowToUpgradeExplanation1": "Cand creaţi o nouă aplicaţie folosind ABP Commercial, toate modulele şi tema sunt folosite sub formă de pachete NuGet şi NPM. Astfel, puteţi cu uşurinţă să actualizaţi pachetele atunci când o versiune nouă este disponibilă.",
    "HowToUpgradeExplanation2": "Pe lângă actualizările standard NuGet-NPM, <a href=\"{0}\">ABP CLI</a> furnizează o comandă de actualizare automată care identifică şi actualizează toate pachetele legate de ABP din soluţia dumneavoastră.",
    "DatabaseSupport": "Ce sisteme de baze de date sunt suportate?",
    "DatabaseSupportExplanation": "ABP Framework în sine este agnostic din punct de vedere al bazei de date, şi poate funcţiona cu orice furnizor de baze de date prin natura sa. Consultaţi <a href=\"{0}\" target=\"_blank\">documentul de acces la date</a> pentru o listă a furnizorilor implementaţi până în clipa de faţă.",
    "UISupport": "Ce UI frameworks sunt suportate?",
    "Supported": "Suportat",
    "UISupportExplanation": "ABP Framework în sine este agnostic din punct de vedere al UI framework şi poate funcţiona cu orice UI framework. Cu toate acestea, şabloanele de pornire, UI-urile modulelor şi temele nu au fost implementate pentru toate module UIs. Consultaţi <a href=\"{0}\">documentul de început</a> pentru lista actualizată a opţiunilor UI.",
    "MicroserviceSupport": "Suportă arhitectura de micro-servicii?",
    "MicroserviceSupportExplanation1": "Unul din scopurile principale ale ABP framework este să furnizeze o structură convenabilă pentru crearea soluţiilor micro-service. Consultaţi documentul <a href=\"{0}\">arhitectura micro-service</a> pentru a înţelege cum ajută la crearea sistemelor de micro-servicii.",
    "MicroserviceSupportExplanation2": "Toate modulele ABP Commercial sunt dezvoltate pentru a suporta scenarii de implementare a micro-serviciilor (cu propriul API şi bază de date) prin respectarea <a href=\"{0}\">celor mai bune practici de dezvoltare a modulelor</a>.",
    "MicroserviceSupportExplanation3": "Vă oferim <a href=\"{0}\">soluţie demo de micro-servicii</a> care demonstrează o implementare a arhitecturii de micro-servicii pentru a vă ajuta să vă creaţi propria soluţie.",
    "MicroserviceSupportExplanation4": "Deci, răspunsul pe scurt este \"<strong>da, suportă o arhitectură de micro-service</strong>\".",
    "MicroserviceSupportExplanation5": "Totuşi, un sistem de tip micro-service reprezintă o soluţie, şi fiecare soluţie va avea cerinţe diferite, topologie de reţea, scenarii de comunicare, posibilităţi de autentificare, separarea bazei de date/împărţirea deciziilor, configurări în timp real, integrări de sisteme terţe parte şi multe altele.",
    "MicroserviceSupportExplanation6": "ABP Framework şi ABP Commercial furnizează infrastructura pentru scenarii de micro-servicii, module de micro-servicii compatibile, exemple şi documentaţie pentru a vă ajuta să vă construiţi propria soluţie. Dar nu vă aşteptaţi să descărcaţi direct soluţia visurilor dumneavoastră. Veţi fi nevoit(ă) să o întelegeţi şi să puneţi câteva piese cap la cap pe baza cerinţelor dumneavoastră.",
    "WhereCanIDownloadSourceCode": "De unde pot descărca codul sursă?",
    "WhereCanIDownloadSourceCodeExplanation": "Puteţi descărca codul sursă al tuturor modulelor ABP, pachetelor Angular şi al temelor prin suita ABP sau ABP CLI. Consultaţi <a href=\"{0}\">Cum descarc codul sursă?</a>",
    "ComputerLimitation": "Pe câte calculatoare se poate autentifica un dezvoltator atunci când foloseşte ABP ABP?",
    "ComputerLimitationExplanation": "Permitem în mod specific <strong>{0} staţii</strong> per dezvoltator individual/autorizat. Ori de câte ori este nevoie ca un dezvoltator să dezvolte produse ABP Commercial pe o altă staţie, un e-mail ar trebui să fie trimis la license@abp.io pentru a explica situaţia, şi atunci vom face alocarea corespunzătoare în sistemul nostru.",
    "RefundPolicy": "Aveţi o politică de rambursare?",
    "RefundPolicyExplanation": "Puteţi solicita un ramburs în decurs de <strong>30 de zile</strong> de la cumpărarea licenţei. Licenţele de tip Business şi Enterprise au opţiune de descărcare a codului sursă, prin urmare rambursul nu este posibil pentru licenţele Business and Enterprise (şi pentru oricare altă licenţă care beneficiază de dreptul de a primi codul sursă). În plus, nu se fac rambursări pentru reînnoiri şi achiziţii de licenţe suplimentare.",
    "HowCanIRefundVat": "Cum pot deduce TVA-ul?",
    "HowCanIRefundVatExplanation1": "Dacă aţi făcut plata folosind 2Checkout, puteţi deduce TVA-ul în contul dumneavoastră 2Checkout:",
    "HowCanIRefundVatExplanation2": "Autentificaţi-vă în contul dumneavoastră <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\">2Checkout</a>",
    "HowCanIRefundVatExplanation3": "Găsiţi comanda respectivă şi apăsaţi pe \"Deducerea tardivă a TVA-ului \" (introduceţi CUI-ul dumneavoastră)",
    "HowCanIGetMyInvoice": "Cum îmi pot obţine factura?",
    "HowCanIGetMyInvoiceExplanation": "Există două procesatori de plăţi pentru cumpărarea unei licenţă: PayU şi 2Checkout. Dacă veţi cumpăra o licenţă prin procesatorul 2Checkout, vă va trimite chitanţa PDF pe adresa dumneavoastră de email, consultaţi <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How-do-invoices-work\">facturarea 2Checkout.</a> Dacă veţi cumpăra o licenţă prin procesatorul PayU gateway sau prin transfer bancar, vă vom pregăti chitanţa şi vă vom trimite. Puteţi solicita chitanţa dumneavoastră din <a href=\"{0}\">pagina de gestionare a organizaţiei.</a>",
    "Forum": "Forum",
    "SupportExplanation": "Licenţele ABP Commercial furnizează asistenţă premium pe forum din partea unei echipe alcătuite din experţi ai ABP.",
    "PrivateTicket": "Tichet privat",
    "PrivateTicketExplanation": "Licenţa de tip Enterprise include de asemenea şi asistenţă privată cu sisteme de e-mail şi tichete.",
    "AbpSuiteExplanation1": "Suita ABP vă permite să construiţi pagini web în decurs de câteva minute. Este un instrument global .NET Core care poate fi instalat din linia de comandă.",
    "AbpSuiteExplanation2": "Poate crea o nouă soluţie ABP, genera paginii CRUD începând de la baza de date şi până la front-end. Pentru o prezentare tehnică consultaţi <a href=\"{0}\">documentul</a>",
    "FastEasy": "Rapid şi usor",
    "AbpSuiteExplanation3": "Suita ABP vă permite să creaţi pagini CRUD cu uşurinţă. Trebuie doar să vă definiţi entitatea şi proprietăţile sale, şi să lăsaţi restul în seama suitei ABP! Suita ABP generează tot codul necesar pentru pagina dumneavoastră CRUD în câteva secunde. Suportă interfeţe de utilizator Angular, MVC şi Blazor.",
    "RichOptions": "Opţiuni ample",
    "AbpSuiteExplanation4": "Suita ABP suportă multiple opţiuni UI precum <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\">Pagini Razor</a> şi <a href=\"https://angular.io\">Angular</a>. Suportă de asemenea şi baze de date multiple, precum <a href=\"https://www.mongodb.com\">MongoDB</a> şi toate bazele de date suportate de <strong>EntityFramework Core</strong> (MS SQL Server, Oracle, MySql, PostgreSQL şi <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\">altele</a>).",
    "AbpSuiteExplanation5": "Partea bună este că dumneavoastră nu trebuie să vă faceţi griji despre aceste opţiuni. Suita ABP înţelege tipul proiectului dumneavoastră şi generează cod pentru proiectul dumneavoastră şi îl plasează în locul potrivit din proiect.",
    "SourceCode": "Cod sursă",
    "AbpSuiteExplanation6": "Suita ABP generează codul sursă pentru dumneavoastră! Nu generează fişiere magice pentru a genera pagina web. Suita ABP generează codul sursă petnru <strong>Entity, Repository, Application Service, Code First Migration, JavaScript/TypeScript şi CSHTML/HTML</strong> şi interfeţele necesare de asemenea. Suita ABP generează de asemenea codul respectând <strong>Cele mai bune practici</strong> ale dezvoltării software, deci nu trebuie să vă faceţi griji în legătură cu calitatea codului generat.",
    "AbpSuiteExplanation7": "Deoarece aveţi codul sursă al blocurilor de construcţie ale paginii CRUD generate în straturile de aplicaţie corecte, puteţi modifica cu uşurinţă codul sursă şi puteţi injecta logica personalizată/business a codului generat.",
    "CrossPlatform": "Platformă transversală",
    "AbpSuiteExplanation8": "Suita ABP este construită cu .NET Core şi este o platformă transversală. Se execută ca o aplicaţie web pe calculatorul dumneavoastră local. O puteţi rula pe <strong>Windows</strong>, <strong>Mac</strong> şi <strong>Linux</strong>",
    "OtherFeatures": "Alte funcţionalităţi",
    "OtherFeatures1": "Actualizeată pachetele <strong>NuGet</strong> şi <strong>NPM</strong> din soluţia dumneavoastră cu uşurinţă.",
    "OtherFeatures2": "Regenerează paginile deja generate de la zero.",
    "OtherFeatures3": "Crează noi soluţii",
    "ThanksForCreatingProject": "Mulţumim pentru că v-aţi creat proiectul!",
    "HotToRunSolution": "Cum să rulaţi soluţia dumneavoastră?",
    "HotToRunSolutionExplanation": "Consultaţi documentul de noţiuni de bază pentru a învăţa cum să vă configuraţi şi rulaţi aplicaţia.",
    "GettingStarted": "Noţiuni de bază",
    "WebAppDevTutorial": "Tutorial Web App Dev",
    "WebAppDevTutorialExplanation": "Consultaţi tutorialul de dezvoltare a aplicaţiilor web pentru un exemplu de dezvoltare pas cu pas.",
    "Document": "Document",
    "UsingABPSuiteToCURD": "Folosind suita ABp pentru generarea şi utilizarea paginilor CRUD",
    "SeeABPSuiteDocument": "Consultaţi documentaţia suitei ABP pentru a învăţa utilizarea suitei ABP.",
    "AskQuestionsOnSupport": "Puteţi adresa întrebări pe ABP Commercial Support.",
    "Documentation": "Documentaţie",
    "SeeModulesDocument": "Consultaţi documentul modulelor pentru lista tuturor modulelor comerciale(pro) şi documentele acestora.",
    "Pricing": "Preţuri",
    "PricingExplanation": "Alegeţi caracteristicile şi funcţionalitatea nevoilor afacerii dumneavoastră acum. Actualizaţi-le cu uşurinţă pe măsură ce afacerea dumneavoastră se dezvoltă.",
    "Team": "Team",
    "Business": "Business",
    "Enterprise": "Enterprise",
    "Custom": "Personalizat",
    "IncludedDeveloperLicenses": "Licenţe de dezvoltator incluse",
    "CustomLicenceOrAdditionalServices": "Aveţi nevoie de o licenţă personalizată sau de servicii suplimentare?",
    "CustomOrVolumeLicense": "Licenţă personalizată sau de volum",
    "LiveTrainingSupport": "Instruire şi asistenţă în timp real",
    "AndMore": "şi multe altele",
    "AdditionalDeveloperLicense": "Licenţă suplimentară de dezvoltator",
    "ProjectCount": "Număr de proiecte",
    "AllProModules": "Toate modulele pro",
    "AllProThemes": "Toate temele pro",
    "AllProStartupTemplates": "Toate şabloanele de pornire pro",
    "SourceCodeOfAllModules": "Codul sursă al tuturor modulelor",
    "SourceCodeOfAllThemes": "Codul sursă al tuturor temelor",
    "PerpetualLicense": "Licenţă perpetuă",
    "UnlimitedServerDeployment": "Implementări nelimitate a serverului",
    "YearUpgrade": "actualizare de 1 an",
    "YearPremiumForumSupport": "Asistenţă premium pe forum de 1 an",
    "ForumSupportIncidentCountYear": "Asistenţă pe forum număr de incidente/an",
    "PrivateTicketEmailSupport": "Tichet privat şi asistenţă pe email",
    "BuyNow": "Cumpără acum",
    "PayViaAmexCard": "Cum pot plăti folosind cardul meu AMEX?",
    "PayViaAmexCardDescription": "Procesatorul implicit 'Iyzico' s-ar putea să refuze anumite carduri AMEX ca măsură de securitate. În acest caz, puteţi plăti prin procesatorul alternativ '2Checkout'.",
    "ThankYou": "Vă mulţumim",
    "InvalidReCaptchaErrorMessage": "A intervenit o eroare în verificarea reCAPTCHA. Vă rugăm să încercaţi din nou.",
    "CompanyName": "Nume companie",
    "YourCompanyName": "Numele companiei dumneavoastră",
    "FirstName": "Nume",
    "LastName": "Prenume",
    "Optional": "Opţional",
    "YourFirstName": "Numele dumneavoastră",
    "YourLastName": "Prenumele dumneavoastră",
    "SpecialOffer": "Ofertă specială",
    "SpecialOfferMessage": "Grăbiţi-vă! Preţurile sunt disponibile pentru o perioadă limitată.",
    "DiscountRequest": "Cerere de discount",
    "DiscountRequestDescribeCustomerQuestion": "Care din următoarele vă descrie?",
    "DiscountRequestStudentEmailMessage": "Adresa de email trebuie să conţină 'edu'.",
    "DiscountRequestDeveloperCount": "Câţi dezvoltatori aveţi?",
    "DiscountRequestDeveloperCountExceedMessage": "Nu furnizăm licenţe reduse pentru companii care au peste {0} dezvoltatori.",
    "DiscountRequestOrganizationName": "Numele companiei/organizaţiei/şcolii",
    "Website": "Site web",
    "GithubUsername": "Nume de utilizator GitHub",
    "PhoneNumber": "Număr de telefon",
    "Country": "Ţara",
    "DescribeABPCommercialUsage": "Descrieţi proiectul pe care folosiţi să-l dezvoltaţi pe baza APB Commercial",
    "DiscountRequestCertifyInformationMessage": "Certific că toate informaţiile sunt adevărate şi corecte.",
    "DiscountRequestReceived": "Am primit solicitarea dumneavoastră de reducere.",
    "DiscountRequestStatusMessage": "Vă vom răspunde după verificarea informaţiilor pe care le-aţi furnizat.",
    "MVCOrRazorPages": "MVC (Razor Pages)",
    "Angular": "Angular",
    "Blazor": "Blazor",
    "New": "New",
    "MongoDB": "MongoDB",
    "EBookDDD": "E-Book Domain Driven Design",
    "PracticalGuideForImplementingDDD": "Această carte reprezintă un ghid practic pentru implementarea proiectării bazate pe domeniu în ABP Framework.",
    "IntroducingDDD": "Introducing Domain Driven Design",
    "DDDLayersAndCleanArchitecture": "DDD Layers & Clean Architecture",
    "LayeringOfADotnetSolution": "Layering of a .NET Solution",
    "ImplementingDDDBuildingBlocks": "Implementing DDD Building Blocks",
    "DomainVsApplicationLogic": "Domain Logic vs Application Logic",
    "SamplesAndDiscussions": "Exemple & Discuţii",
    "Free": "Gratuit",
    "Download": "Descarcă",
    "DDDEBook": "DDD E-book",
    "ImplementingDDD": "Implementing Domain Driven Design",
    "DDDBookExplanation": "Ghid practic pentru implementarea proiectării bazate pe domeniu în ABP Framework.",
    "Overview": "Prezentare generală",
    "DDDBookPracticalGuide": "Acesta este un ghid practic pentru implementarea proiectării bazate pe domeniu (PBD). În timp ce detaliile de implementare se bazeată pe infrastructura ABP, conceptele de bază, principiile şi modelele sunt aplicabile în orice fel de soluţie, chiar dacă nu este o soluţie .NET.",
    "TableOfContents": "Cuprins",
    "IntroductionToImplementingDDD": "Introducere în implementarea proiectării bazate pe domeniu",
    "WhatIsDDD": "Ce este proiectarea bazată pe domeniu?",
    "Implementation": "Implementare",
    "TheBigPicture": "Imaginea de ansamblu",
    "TheBuildingBlock": "The Building Block",
    "ExampleUseCase": "Exemplu de utilizare",
    "DomainAndApplicationLogic": "Domain Logic & Application Logic",
    "Author": "Autor",
    "PublishedOn": "Publicat în",
    "Page": "Pagina",
    "FreeEBook": "E-Book gratuit",
    "EBookSignInForDownload": "Pentru a descărca e-book-ul trebuie să vă autentificaţi",
    "SignIn": "Autentificare",
    "Or": "Sau",
    "TellUsAboutYourself": "Spuneţi-ne despre dumneavoastră",
    "Surname": "Nume",
    "DoYouAgreePrivacyPolicy": "Sunt de acord cu <a href=\"/TermsConditions\">Termenii şi condiţiile<a/> şi <a href=\"/Privacy\">Politica de confidenţialitate</a>.",
    "VolosoftMarketingInformationMessage": "Sunt de acord să primesc informaţii, sfaturi şi oferte despre soluţii pentru afaceri şi organizaţii şi alte produse şi servicii Volosoft.",
    "VolosoftSharingInformationMessage": "Sunt de acord ca Volosoft să partajeze informaţiile mele cu partenerii selectaţi astfel încât să primesc informaţii relevante despre produsele şi serviciile lor.",
    "WeWillSendYouADownloadLink": "Un link pentru descărcarea e-book-ului a fost trimis către {0}.<br/> Verificaţi-vă căsuţele de inbox/junk/spam!",
    "InvalidFormInputs": "Vă rugăm să introduceţi informaţia validă specificată în formular.",
    "DDDBookEmailBody": "Vă mulţumim. <br /> Pentru a descărca e-book-ul, <a href=\"{0}\">click aici</a>.",
    "FreeDDDEBook": "DDD E-Book gratuit",
    "StartFree": "Începe gratuit",
    "FreeTrial": "Încercare gratuită",
    "AcceptsMarketingCommunications": " Da, aș dori să primesc comunicări de marketing comerciale ABP.",
    "PurposeOfUsage": "Scopul utilizării",
    "Industry": "Industrie",
    "Choose": "- Alege -",
    "CompanyOrganizationName": "Numele companiei/organizației",
    "CompanySize": "Marimea companiei",
    "Next": "Următorul",
    "StartTrial": "Începeți încercarea mea gratuită",
    "ContactUsIssues": "Contactați-ne dacă aveți probleme",
    "TrialActivatedWarning": "Stimate {0}, un utilizator are dreptul la o singură perioadă de probă gratuită. Ai folosit deja perioada de probă.",
    "ActivationRequirement": "Sunteți la un pas de a începe perioada de încercare gratuită.<br>Am trimis un e-mail către <b>{0}</b> pentru a vă activa contul. Verificați-vă căsuțele de e-mail/junk/spam!",
    "SaveAndDownload": "Salvați și descărcați",
    "CompanyNameValidationMessage": "Numele companiei este prea lung!",
    "AddressValidationMessage": "Adresa este prea lungă!",
    "TaxNoValidationMessage": "TAX/TVA Nu este prea lung!",
    "NotesValidationMessage": "Câmpul de note este prea lung!",
    "CheckYourBillingInfo": "Vă puteți crea factura o singură dată! Verificați informațiile de facturare înainte de a crea factura.",
    "Volo.AbpIo.Commercial:030000": "Ai folosit deja perioada de probă.",
    "Volo.AbpIo.Commercial:030001": "Acest nume de organizație există deja.",
    "StartYourFreeTrial": "Începe perioada gratuită de testare",
    "TrialLicenseModelInvalidErrorMessage": "Unul dintre următoarele câmpuri este nevalid: Numele țării, Mărimea companiei, Industria sau Scopul utilizării.",
    "Trial": "Proces",
    "Purchased": "Cumparat",
    "PurchaseLicense": "Licență de cumpărare",
    "PurchaseTrialLicenseMessage": "Data de expirare a licenței este {0}. <br> Dacă doriți să continuați să utilizați proiectele pe care le-ați creat în timpul perioadei de probă gratuită, trebuie să schimbați cheile de licență din fișierele <code>appsettings.secrets.json</code>. Iată cheia de licență:",
    "TrialLicenseExpireMessage": "Utilizați licența de probă și licența de probă va expira pe {0}.",
    "TryForFree": "Încearcă pe gratis",
    "TrialLicenseExpiredInfo": "Perioada de licență de probă a expirat!",
    "CommercialNewsletterConfirmationMessage": "Sunt de acord cu <a href=\"https://commercial.abp.io/TermsConditions\">Termenii și condițiile</a> și cu <a href=\"https://commercial.abp.io/Privacy\">Politica de confidențialitate </a>."
  }
}