{
  "culture": "ro-RO",
  "texts": {
    "OrganizationManagement": "Administrarea organizaţiilor",
    "OrganizationList": "Lista organizaţiilor",
    "Volo.AbpIo.Commercial:010003": "Nu sunteţi proprietarul acestei organizaţii!",
    "OrganizationNotFoundMessage": "Nicio organizaţie găsită!",
    "DeveloperCount": "Alocaţi/total dezvoltatori",
    "QuestionCount": "Rămase/total întrebări",
    "Unlimited": "Nelimitat",
    "Owners": "Proprietari",
    "Owner": "Proprietar",
    "AddMember": "Adaugă membru",
    "AddNewOwner": "Adăugați un nou proprietar",
    "AddNewDeveloper": "Adăugați un nou dezvoltator",
    "UserName": "Nume utilizator",
    "Name": "Nume",
    "EmailAddress": "Adresă de email",
    "Developers": "Dezvoltatori",
    "LicenseType": "Tip licenţă",
    "Manage": "Administrează",
    "SetDefault": "Setați ca implicit",
    "DefaultOrganization": "Mod implicit",
    "StartDate": "Data de început",
    "EndDate": "Data de sfârşit",
    "Modules": "Module",
    "LicenseExtendMessage": "Data expirării licenţei dumneavoastră a fost prelungită până în {0}",
    "LicenseUpgradeMessage": "Licenţa dumneavoastră a fost actualizată la {0}",
    "LicenseExtendAdnUpgradeMessage": "Licența dvs. a fost extinsă până la {0}, iar planul de licență este actualizat la {1}.",
    "LicenseAddDeveloperMessage": "{0} dezvoltatori au fost ataşaţi licenţei dumneavoastră",
    "Volo.AbpIo.Commercial:010004": "Utilizatorul nu a putut fi găsit! Acesta trebuie să se fi înregistrat deja.",
    "MyOrganizations": "Organizaţiile mele",
    "ApiKey": "Cheie API",
    "UserNameNotFound": "Nu există niciun utilizator cu numele {0}",
    "SuccessfullyAddedToNewsletter": "Vă mulţumim pentru că v-aţi abonat la newsletter-ul nostru!",
    "MyProfile": "Profilul meu",
    "EmailNotValid": "Vă rugăm să introduceţi o adresa de email validă.",
    "JoinOurMarketingNewsletter": "Alăturaţi-va newsletter-ului nostru de marketing",
    "WouldLikeToReceiveMarketingMaterials": "Aş dori să primesc materiale de marketing precum oferte şi oferte speciale.",
    "StartUsingYourLicenseNow": "Începe folosirea licenţei tale acum!",
    "WelcomePage": "Pagina de bun venit",
    "UnsubscriptionExpireEmail": "Dezabonează-te de la emailuri informative despre data expirării licenţei.",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Această abonament prin email conţine numai amintirea datei de expirare a licenţei.",
    "UnsubscribeFromLicenseExpireEmails": "Dacă nu mai doriţi să primiţi emailuri informative despre data de expirare a licenţei dumneavoastră, puteţi să vă dezabonaţi oricând.",
    "Unsubscribe": "Dezabonează-te",
    "NotOrganizationMember": "Nu sunteţi membru al niciunei organizaţii.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "V-aţi dezabonat cu succes.",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Nu veţi mai primi emailuri informative despre data de expirare a licenţei dumneavoastră.",
    "IndexPageHeroSection": "<span class=\"first-line\">A complete</span><span class=\"second-line\"> web development platform</span><span class=\"third-line\">built-on <img src=\"{0}\" width=\"110\" class=\"ml-1\" /> framework</span>",
    "AbpCommercialShortDescription": "ABP Commercial oferă module de aplicaţii pre-construite, instrumente de dezvoltare rapidă a aplicaţiilor, teme UI profesionale, asistenţă premium şi multe altele.",
    "LiveDemo": "Live Demo",
    "LiveDemoLead": "<a href=\"{0}\">{1}</a> folosind contul ABP, <a href=\"{2}\">{3}</a> la abp.io.<br/>Sau completaţi formularul de mai jos pentru a crea un demo live acum",
    "ThereIsAlreadyAnAccountWithTheGivenEmailAddress": "Există deja un cont cu adresa de email specificată: <b>{0}</b><br/> Puteţi să vă autentificaţi cu contul dumneavoastră pentru a continua.",
    "GetLicence": "Obţine o licenţă",
    "Application": "Application",
    "StartupTemplates": "Şabloane de lansare",
    "Startup": "Lansare",
    "Templates": "Şabloane",
    "Developer": "Dezvoltator",
    "Tools": "Unelte",
    "Premium": "Premium",
    "PremiumSupport": "Asistenţă Premium",
    "PremiumForumSupport": "Forum asistenţă premium",
    "UI": "UI",
    "Themes": "Teme",
    "JoinOurNewsletter": "Abonaţi-va newsletter-ului nostru",
    "Send": "Trimite",
    "WhatIsABPFramework": "CE ESTE FRAMEWORK-UL ABP?",
    "OpenSourceBaseFramework": "Open Source Base Framework",
    "ABPFrameworkExplanation": "<p class=\"lead\">ABP Commercial se bazează pe framework-ul ABP, un framework open source şi bazat pe comunitate pentru ASP.NET Core.</p><p>ABP Framework oferă o infrastructură excelentă pentru a scrie cod care poate fi întreţinut, extins şi testat cu cele mai bune practici.</p><p>Construit şi integrat în instrumentele populare pe care le cunoaşteţi deja. Curbă de învăţare redusă, adaptare uşoară, dezvoltare confortabilă.</p>",
    "Modular": "Modular",
    "MicroserviceCompatible": "Compatibil cu microservicii",
    "DomainDrivenDesignInfrastructure": "Domain Driven Design Infrastructure",
    "MultiTenancy": "Multi-Tenancy",
    "DistributedMessaging": "Mesaje distribuite",
    "DynamicProxying": "Proxy dinamic",
    "BackgroundJobs": "Background Jobs",
    "AuditLogging": "Înregistrarea auditului",
    "BLOBStoring": "BLOB Storing",
    "BundlingMinification": "Bundling & Minification",
    "AdvancedLocalization": "Localizare avansată",
    "ManyMore": "Multe altele",
    "ExploreTheABPFramework": "Exploraţi framework-ul ABP",
    "WhyUseTheABPCommercial": "De ce să folosiţi ABP Commercial?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\">Construirea de aplicaţii web de nivel enterprise poate fi complexă şi poate consuma mult timp.</p><p>ABP Commercial oferă infrastructura de bază pentru toate soluţiile moderne bazate pe ASP.NET Core de nivel enterprise. De la proiectare până la implementare, întregul ciclu de dezvoltare este împuternicit de funcţiile şi modulele integrate ale ABP.</p>",
    "StartupTemplatesShortDescription": "Şabloanele de pornire vă fac să începeţi proiectul în câteva secunde.",
    "UIFrameworksOptions": "UI frameworks options;",
    "DatabaseProviderOptions": "Opţiuni furnizor de bază de date;",
    "PreBuiltApplicationModules": "Module de aplicaţii pre-construite",
    "PreBuiltApplicationModulesShortDescription": "Cele mai comune cerinţe de aplicaţie sunt deja dezvoltate pentru dumneavoastră sub formă de module reutilizabile.",
    "Account": "Cont",
    "Blogging": "Blogging",
    "Identity": "Identitate",
    "IdentityServer": "Identity Server",
    "Saas": "Saas",
    "LanguageManagement": "Administrarea limbilor",
    "TextTemplateManagement": "Text Template Management",
    "See All Modules": "Vedeți toate modulele",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "ABP Suite este un instrument complementar pentru ABP Commercial.",
    "AbpSuiteExplanation": "Vă permite să creaţi pagini web în câteva minute. Este un instrument .NET Core global, care poate fi instalat din linia de comandă. Poate crea o nouă soluţie ABP, poate genera pagini CRUD, începând de la baza de date până la front-end.",
    "Details": "Detalii",
    "LeptonTheme": "Tema Lepton",
    "ProfessionalModernUIThemes": "Teme UI profesionale, moderne",
    "LeptonThemeExplanation": "Lepton oferă o gamă de teme de administrare Bootstrap, care servesc ca o bază solidă pentru orice proiect care necesită tabloul de bord de administrare.",
    "DefaultTheme": "Tema Default",
    "MaterialTheme": "Tema Material",
    "Default2Theme": "Tema Default 2",
    "DarkTheme": "Tema Dark",
    "DarkBlueTheme": "Tema Dark Blue",
    "LightTheme": "Tema Light",
    "ProudToWorkWith": "Mândru să lucrez cu",
    "OurConsumers": "Sute de întreprinderi şi dezvoltatori din peste 70 de ţări din jurul lumii se bazează pe ABP Commercial.",
    "JoinOurConsumers": "Alăturaţi-va lor şi construiţi produse uimitoare rapid.",
    "AdditionalServicesExplanation": "Aveţi nevoie de servicii suplimentare sau personalizate? <strong>Noi şi partenerii noştri vi le putem oferi;</strong>",
    "CustomProjectDevelopment": "Custom Project Development",
    "CustomProjectDevelopmentExplanation": "Dezvoltatori dedicaţi pentru proiectele dumneavoastră personalizate.",
    "PortingExistingProjects": "Portarea proiectelor existente",
    "PortingExistingProjectsExplanation": "Migrarea proiectelor dumneavoastră vechi pe platforma ABP.",
    "LiveSupport": "Asistenţă live",
    "LiveSupportExplanation": "Opţiune de asistenţă live la distanţă oricând aveţi nevoie.",
    "Training": "Instruire",
    "TrainingExplanation": "Instruire dedicată pentru dezvoltatorii dumneavoastră.",
    "OnBoarding": "Integrare",
    "OnBoardingExplanation": "Ajutor pentru configurarea dezvoltării, mediilor CI & CD.",
    "PrioritizedTechnicalSupport": "Asistenţă tehnică prioritară",
    "PremiumSupportExplanation": "Pe lângă excelentul suport comunitar al framework-ului ABP, echipa noastră de asistenţă răspunde la întrebările tehnice şi la problemele utilizatorilor comerciali cu prioritate crescută.",
    "SeeTheSupportOptions": "Vedeţi opţiunile de asistenţă",
    "Contact": "Contact",
    "TellUsWhatYouNeed": "Spuneţi-ne de ce aveţi nevoie.",
    "YourMessage": "Mesajul dumneavoastră",
    "YourFullName": "Numele dumneavoastră complet",
    "FirstNameField": "Nume",
    "LastNameField": "Nume",
    "EmailField": "Adresa de email",
    "YourEmailAddress": "Adresa dumneavoastră de email",
    "ValidEmailAddressIsRequired": "Vă rugăm să introduceţi o adresă de email validă.",
    "HowMayWeHelpYou": "Cum vă putem ajuta?",
    "SendMessage": "Trimite mesaj",
    "Success": "Succes",
    "WeWillReplyYou": "Am primit mesajul dumneavoastră şi vă vom contacta cât de repede posibil.",
    "GoHome": "Navigaţi acasă",
    "CreateLiveDemo": "Crează Demo Live",
    "CreateLiveDemoDescription": "După ce trimiteţi acest formular, veţi primi un email care conţine link-ul demo-ului dumneavoastră.",
    "RegisterToTheNewsletter": "Înregistraţi-va la newsletter pentru a primi informaţii despre ABP.IO, inclusiv lansări noi etc.",
    "EnterYourEmailOrLogin": "Introduceţi-vă adresa de email pentru a vă crea demo-ul sau <a href=\"{0}\">Autentificaţi-vă</a> folosind contul existent.",
    "ApplicationTemplate": "Application Template",
    "ApplicationTemplateExplanation": "Şablonul de pornire a aplicaţiei este utilizat pentru a crea o nouă aplicaţie web.",
    "EfCoreProvider": "Entity Framework (susţine SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\">şi altele</a>)",
    "AlreadyIncludedInTemplateModules": "Următoarele module sunt deja incluse şi configurate în acest şablon:",
    "ApplicationTemplateArchitecture": "Acest şablon de aplicaţie susţine arhitecturi structurate pe nivele, în care nivelul UI, nivelul API şi serviciul de autentificare sunt separate fizic.",
    "SeeTheGuideOrGoToTheLiveDemo": "Consultaţi ghidul dezvoltatorului pentru informaţii tehnice despre acest şablon sau mergeţi la demo-ul live.",
    "DeveloperGuide": "Ghidul dezvoltatorului",
    "ModuleTemplate": "Module Template",
    "ModuleTemplateExplanation1": "Vreţi să creaţi un modul pe care sa-l reutilizaţi în cadrul diferitelor aplicaţii? Acest şablon de pornire pregăteşte totul pentru a putea începe să creaţi un <strong>modul</strong> sau un <strong>microserviciu</strong> reutilizabil.",
    "ModuleTemplateExplanation2": "<p>Puteţi susţine cadre UI simple sau multiple, furnizori unici sau multipli pentru baza de date pentru un singur modul. Şablonul de pornire este configurat pentru a rula <strong>şi testa modulul dumneavoastră</strong> într-o aplicaţie minimă, în plus faţă de infrastructura de testare şi integrare.</p> <p>Consultaţi ghidul dezvoltatorului pentru informaţii tehnice despre acest şablon.</p>",
    "WithAllStyleOptions": "cu toate opţiunile de stil",
    "Demo": "Demo",
    "SeeAllModules": "Vezi toate modulele",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) este un instrument de linii de comandă pentru executarea unor operaţii comune pentru soluţiile ABP.",
    "ABPSuiteEasilyCURD": "Suita ABP este un instrument care vă permite crearea cu uşurinţă a paginilor CRUD",
    "WeAreHereToHelp": "Suntem aici să <span class=\"zero-text\">Ajutăm</span>",
    "BrowseOrAskQuestion": "Puteţi răsfoi subiectele noastre de ajutor sau puteţi căuta în cadrul secţiunii întrebărilor frecvent adresate, sau ne puteţi adresa o întrebare folosind <a href=\"{0}\" class=\"text-success\">formularul de contact</a>.",
    "SearchQuestionPlaceholder": "Caută în întrebările frecvent adresate",
    "WhatIsTheABPCommercial": "Ce este ABP Commercial?",
    "WhatAreDifferencesThanAbpFramework": "Care sunt diferenţele dintre ABP Framework şi ABP Comercial?",
    "AbpCommercialMetaTitle": "{0} | Comercial ABP",
    "AbpCommercialMetaDescription": "O platformă cuprinzătoare de dezvoltare web pe ABP Framework cu module pre-construite, șabloane de pornire, instrumente de dezvoltare rapidă, teme pro UI și suport premium.",
    "ABPCommercialExplanation": "ABP Commercial este un set de module premium, instrumente, teme şi servicii construite pe baza <a target=\"_blank\" href=\"{0}\">ABP framework</a>. ABP Commercial este dezvoltat şi întreţinut de către aceeaşi echipă din spatele ABP framework.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\">ABP framework</a> este un framework de dezvoltare de aplicaţii modulare, compatibil cu micro-servicii dedicate ASP.NET Core. Oferă o arhitectură completă şi o infrastructură puternică pentru a vă face să vă concentraţi asupra propriului cod, mai degrabă decât să vă repetaţi pentru fiecare proiect nou. Se bazează pe cele mai bune practici de dezvoltare software, şi pe instrumentele populare pe care le cunoaşteţi deja. </p><p>ABP Framework este complet gratuit, open-source şi bazat pe comunitate. De asemenea, oferă şi o temă gratuită şi câteva module pre-construite (de exemplu, gestionarea identităţii şi a chiriaşilor).</p>",
    "VisitTheFrameworkVSCommercialDocument": "Accesaţi următorul link, pentru mai multe informaţii <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial adaugă următoarele beneficii peste framework-ul ABP;",
    "Professional": "Profesional",
    "UIThemes": "Teme UI",
    "EnterpriseModules": "<a href=\"{0}\">Module de aplicaţii</a> pregătite pentru întreprinderi, bogate în funcţionalităţi, pre-construite (e.g. Identity Server management, SaaS management, language management)",
    "ToolingToSupport": "Instrumente pentru a vă susţine productivitatea de dezvoltare (e.g. <a href=\"{0}\">Suita ABP</a>)",
    "PremiumSupportLink": "<a href=\"{0}\" target=\"_blank\">Asistenţă</a> premium",
    "WhatDoIDownloadABPCommercial": "Ce descarc când cumpăr ABP Commercial?",
    "CreateUnlimitedSolutions": "Odată ce aţi cumpărat o licenţă ABP Commercial, veţi putea să creaţi soluţii nelimitate, descrise în documentul <a href=\"{0}\">Noţiuni de bază</a>.",
    "ABPCommercialSolutionExplanation": "Când creaţi o aplicaţie nouă, veţi primi o soluţie de Visual Studio (un şablon de pornire) bazat pe preferinţele dumneavoastră. Soluţia descărcată conţine module comerciale şi teme pre-instalate şi configurate pentru dumneavoastră. Puteţi şterge un modul pre-instalat sau să adăugaţi altul dacă doriţi. Toate modulele şi temele folosesc un pachet NuGet/NPM în mod implicit.",
    "StartDevelopWithTutorials": "Soluţia descărcată este bine structurată şi documentată. Puteţi începe să vă dezvoltaţi codul dumneavoastră pe baza unuia dintre <a href=\"{0}\">tutoriale</a>",
    "TryTheCommercialDemo": "Puteţi încerca versiunea <a href=\"{0}\">demo</a> pentru a vedea un exemplu de aplicaţie creată folosind şablonul de pornire ABP Commercial.",
    "HowManyProducts": "Câte produse/soluţii diferite pot construi folosind ABP Commercial?",
    "HowManyProductsExplanation": "Nu există nicio limită pentru crearea unui proiect ABP. Puteţi crea cât de multe proiecte doriţi, pe care să le dezvoltaţi sau încărcaţi pe diferite servere.",
    "HowManyDevelopers": "Câţi dezvoltatori pot lucra pe ABP Commercial?",
    "HowManyDevelopersExplanation": "Licenţele de ABP Commercial sunt per dezvoltator. Tipuri diferite de licenţă au limite diferite de dezvoltatori. Totuşi, puteţi ataşa mai mulţi dezvoltatori unei licenţe oricând doriţi. Consultaţi <a href=\"{0}\">preţurile</a> pentru tipurile de licenţă, limitele de dezvoltatori şi costurile adiţionale pentru dezvoltatori.",
    "ChangingLicenseType": "Pe viitor pot să schimb tipul licenţei?",
    "ChangingLicenseTypeExplanation": "Puteţi adăuga oricând noi dezvoltatori în licenţa dumneavoastră de acelaşi tip. Consultaţi \"Câţi dezvoltatori pot lucra pe ABP Commercial?\". De asemenea, puteţi opta pentru o licenţă superioară prin plătirea achitarea de preţ. Atunci când optaţi pentru o licenţă superioară, veţi avea parte de beneficiile noii licenţe, însă acest lucru nu va schimba data expirării licenţei.",
    "LicenseExtendUpgradeDiff": "Care este diferenţa dintre prelungirea licenţei şi îmbunătăţirea acesteia?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Extindere:</strong> prin extinderea/reînnoirea licenței, veți continua să obțineți asistență premium și să obțineți actualizări majore sau minore pentru module și teme. În plus, vei putea continua să creezi noi proiecte. Și veți putea în continuare să utilizați ABP Suite, care vă accelerează dezvoltarea. Când vă prelungiți licența, se adaugă 1 an la data de expirare a licenței.<hr/> <strong>Actualizare:</strong> prin actualizarea licenței, veți fi promovat la un plan de licență superior, care vă va permite să obțineți beneficii suplimentare. Consultați <a href=\"/pricing\">tabelul de comparare a licențelor</a> pentru a vedea diferențele dintre planurile de licență. <strong>Pe de altă parte, când faceți upgrade, data de expirare a licenței nu se va schimba!</strong> Pentru a prelungi data de încheiere a licenței, trebuie să vă prelungiți licența.",
    "LicenseRenewalCost": "Care este costul de reînnoire a licenţei dupa 1 an?",
    "LicenseRenewalCostExplanation": "Prețul de reînnoire (extindere) al licenței standard de echipă este de {0} USD, al licenței standard de afaceri este de {1} USD și al licenței standard Enterprise este de {2} USD. Dacă sunteți deja client, <a href='{3}' target='_blank'>conectați-vă la contul dvs.</a> pentru a examina prețurile de reînnoire disponibile.",
    "HowDoIRenewMyLicense": "Cum îmi reînnoiesc licenţa?",
    "HowDoIRenewMyLicenseExplanation": "Puteţi să vă reînnoiţi licenţa prin accesarea paginii <a href='{0}' target='_blank'>pagina de gestionare a organizaţiei</a>. Pentru a profita de tarifele noastre reduse de reînnoire anticipată, asiguraţi-vă că reînnoiţi înainte de expirarea licenţei. Totuşi, nu vă faceţi griji dacă nu ştiţi când expiră oportunitatea dumneavoastră de reînnoire anticipată. Veţi primi 2 e-mailuri de reamintire înainte de expirarea abonamentului. Vi le vom trimite cu 30, respectiv 7 zile înainte de expirare.",
    "IsSourceCodeIncluded": "Licenţa mea include şi codul sursă al modulelor comerciale şi a temelor?",
    "IsSourceCodeIncludedExplanation1": "Depinde de tipul de licenţă pe care aţi achiziţionat-o:",
    "IsSourceCodeIncludedExplanation2": "<strong>Team</strong>: Soluţia dumneavoastră foloseste modulele şi temele sub formă de pachete NuGet şi NPM. Nu include şi codul lor sursă. În acest mod, puteţi cu uşurinţă să îmbunătăţiţi aceste module şi teme oricând este o nouă versiune disponibilă. Totuşi, nu veţi primi codul sursă al modulelor şi temelor.",
    "IsSourceCodeIncludedExplanation3": "<strong>Business/Enterprise</strong>: Pe lângă licenţa de tip Team, veţi putea să descărcaţi codul sursă al oricărui modul sau al oricărei teme doriţi. Puteţi chiar să eliminaţi referinţele pachetelor NuGet/NPM pentru un anume modul, şi să adăugaţi codul sursă al acestuia direct în soluţia dumneavoastră pentru a-l putea modifica pe deplin.",
    "IsSourceCodeIncludedExplanation4": "<p>Includerea codului sursă al unui modul în soluţia dumneavoastră vă oferă libertate maximă de a personaliza modulul respectiv. Totuşi, atunci nu va fi posibilă actualizarea automată a modulului atunci când o nouă versiune este publicată.</p><p>Niciuna dintre licenţe nu include codul sursă al suitei ABP, care este un instrument extern care generează cod pentru dumneavoastră şi contribuie la dezvoltare.</p><p>Consultaţi <a href=\"{0}\">preţurile</a> pentru alte diferenţe între tipurile de licenţe.</p>",
    "ChangingDevelopers": "Pe viitor, pot schimba dezvoltatorii ataşaţi organizaţiei mele?",
    "ChangingDevelopersExplanation": "În plus faţă de adăugarea de noi dezvoltatori la licenţa dumneavoastră, puteţi schimba şi dezvoltatorii existenţi(puteţi elimina un dezvoltator şi adăuga unul nou în locul lui) fără costuri suplimentare.",
    "WhatHappensWhenLicenseEnds": "Ce se întâmplă când perioada mea de licență se încheie?",
    "WhatHappensWhenLicenseEndsExplanation1": "Licența comercială ABP este o <a href=\"{0}\" target=\"_blank\">licență perpetuă</a> . După expirarea licenței, puteți continua să vă dezvoltați proiectul. Și nu sunteți obligat să vă reînnoiți permisul. Licența dvs. vine cu o actualizare de un an și un plan de asistență. Pentru a obține în continuare funcții noi, îmbunătățiri de performanță, remedieri de erori, asistență și pentru a continua să utilizați ABP Suite, trebuie să vă reînnoiți licența. Când vă expiră licența;",
    "WhatHappensWhenLicenseEndsExplanation2": "Nu puteți crea soluții noi folosind ABP Commercial, dar puteți continua să vă dezvoltați aplicațiile existente pentru totdeauna.",
    "WhatHappensWhenLicenseEndsExplanation3": "Veți putea obține actualizări pentru modulele și temele din versiunea dvs. MINOR (cu excepția versiunilor RC sau Preview). De exemplu, dacă utilizați v3.2.0 a unui modul, puteți obține în continuare actualizări pentru v3.2.x (v3.2.1, v3.2.5... etc.) ale acelui modul. Dar nu puteți obține actualizări pentru următoarea versiune majoră sau minoră (cum ar fi v3.3.0, v3.3.3, 4.xx. etc.). De exemplu, când licența dvs. a expirat, cea mai recentă versiune a fost v4.4.3, iar mai târziu, a publicat atât versiunea 4.4.4, cât și versiunea 4.5.0, veți putea accesa v4.4.X, dar nu ați fi accesați v4.5.X.",
    "WhatHappensWhenLicenseEndsExplanation4": "Nu puteți instala module și teme noi adăugate pe platforma comercială ABP după încheierea licenței.",
    "WhatHappensWhenLicenseEndsExplanation5": "Nu puteți utiliza Suita ABP.",
    "WhatHappensWhenLicenseEndsExplanation6": "Nu mai puteți obține <a href=\"{0}\">asistență premium</a> .",
    "WhatHappensWhenLicenseEndsExplanation7": "Vă puteți prelungi (reînnoi) licența dacă doriți să continuați să obțineți aceste beneficii. Dacă vă extindeți licența în termen de <strong>{3} zile</strong> de la expirarea licenței, se vor aplica următoarele reduceri: Licență de echipă {0}; Licență de afaceri {1}; Licență Enterprise {2}.",
    "discountForYears": "Reducere de {0}% pentru {1} an(i)",
    "WhatHappensWhenLicenseEndsExplanation8": "Proiectele ABP pe care le-ați generat nu sunt stocate pe serverele noastre. Prin urmare, este responsabilitatea dumneavoastră să păstrați codul sursă pe care îl descărcați. Când expiră licența, nu există nicio modalitate de a obține codul sursă al proiectului ABP generat.",
    "WhenShouldIRenewMyLicense": "Când ar trebui să-mi reînnoiesc licenţa?",
    "WhenShouldIRenewMyLicenseExplanation": "Dacă vă reînnoiți licența în termen de <strong>{3} de zile</strong> de la expirarea licenței, se vor aplica următoarele reduceri: Licență de echipă {0}% reducere, Licență de afaceri {1}% reducere, Licență Enterprise {2}% reducere . Dacă vă reînnoiți licența la <strong>{3} de zile</strong> după data de expirare a licenței, prețul de reînnoire va fi același cu prețul de achiziție a licenței și nu va exista nicio reducere la reînnoirea dvs.",
    "TrialPlan": "Aveţi un plan de încercare?",
    "TrialPlanExplanation": "Da, pentru a începe perioada de încercare gratuită, contactați <a href=\"mailto:marketing@volosoft.com?subject=ABP Commercial — Trial License Request\">marketing@volosoft.com</a> . De asemenea, oferim o garanție de rambursare a banilor de 30 de zile pentru licența Team, fără întrebări! Puteți solicita o rambursare completă în primele 30 de zile de la achiziționarea licenței. Oferim o rambursare de 60% în termen de 30 de zile pentru licențele Business și Enterprise. Acest lucru se datorează faptului că licențele Business și Enterprise conțin codul sursă complet al tuturor modulelor și temelor.",
    "DoYouAcceptBankWireTransfer": "Acceptaţi transfer bancar?",
    "DoYouAcceptBankWireTransferExplanation": "Da, acceptăm transfer bancar.<br />După ce ați trimis taxa de licență prin transfer bancar, trimiteți-ne un e-mail la accounting@abp.io chitanța dvs. și tipul de licență solicitat. Informațiile noastre internaționale despre contul nostru bancar:",
    "HowToUpgrade": "Cum se actualizează aplicaţiile existente atunci când este disponibilă o nouă versiune?",
    "HowToUpgradeExplanation1": "Cand creaţi o nouă aplicaţie folosind ABP Commercial, toate modulele şi tema sunt folosite sub formă de pachete NuGet şi NPM. Astfel, puteţi cu uşurinţă să actualizaţi pachetele atunci când o versiune nouă este disponibilă.",
    "HowToUpgradeExplanation2": "Pe lângă actualizările standard NuGet-NPM, <a href=\"{0}\">ABP CLI</a> furnizează o comandă de actualizare automată care identifică şi actualizează toate pachetele legate de ABP din soluţia dumneavoastră.",
    "DatabaseSupport": "Ce sisteme de baze de date sunt suportate?",
    "DatabaseSupportExplanation": "ABP Framework în sine este agnostic din punct de vedere al bazei de date, şi poate funcţiona cu orice furnizor de baze de date prin natura sa. Consultaţi <a href=\"{0}\" target=\"_blank\">documentul de acces la date</a> pentru o listă a furnizorilor implementaţi până în clipa de faţă.",
    "UISupport": "Ce UI frameworks sunt suportate?",
    "Supported": "Suportat",
    "UISupportExplanation": "ABP Framework în sine este agnostic din punct de vedere al UI framework şi poate funcţiona cu orice UI framework. Cu toate acestea, şabloanele de pornire, UI-urile modulelor şi temele nu au fost implementate pentru toate module UIs. Consultaţi <a href=\"{0}\">documentul de început</a> pentru lista actualizată a opţiunilor UI.",
    "MicroserviceSupport": "Suportă arhitectura de micro-servicii?",
    "MicroserviceSupportExplanation1": "Unul din scopurile principale ale ABP framework este să furnizeze o structură convenabilă pentru crearea soluţiilor micro-service. Consultaţi documentul <a href=\"{0}\">arhitectura micro-service</a> pentru a înţelege cum ajută la crearea sistemelor de micro-servicii.",
    "MicroserviceSupportExplanation2": "Toate modulele ABP Commercial sunt dezvoltate pentru a suporta scenarii de implementare a micro-serviciilor (cu propriul API şi bază de date) prin respectarea <a href=\"{0}\">celor mai bune practici de dezvoltare a modulelor</a>.",
    "MicroserviceSupportExplanation3": "Vă oferim <a href=\"{0}\">soluţie demo de micro-servicii</a> care demonstrează o implementare a arhitecturii de micro-servicii pentru a vă ajuta să vă creaţi propria soluţie.",
    "MicroserviceSupportExplanation4": "Deci, răspunsul pe scurt este \"<strong>da, suportă o arhitectură de micro-service</strong>\".",
    "MicroserviceSupportExplanation5": "Totuşi, un sistem de tip micro-service reprezintă o soluţie, şi fiecare soluţie va avea cerinţe diferite, topologie de reţea, scenarii de comunicare, posibilităţi de autentificare, separarea bazei de date/împărţirea deciziilor, configurări în timp real, integrări de sisteme terţe parte şi multe altele.",
    "MicroserviceSupportExplanation6": "ABP Framework şi ABP Commercial furnizează infrastructura pentru scenarii de micro-servicii, module de micro-servicii compatibile, exemple şi documentaţie pentru a vă ajuta să vă construiţi propria soluţie. Dar nu vă aşteptaţi să descărcaţi direct soluţia visurilor dumneavoastră. Veţi fi nevoit(ă) să o întelegeţi şi să puneţi câteva piese cap la cap pe baza cerinţelor dumneavoastră.",
    "WhereCanIDownloadSourceCode": "De unde pot descărca codul sursă?",
    "WhereCanIDownloadSourceCodeExplanation": "Puteţi descărca codul sursă al tuturor modulelor ABP, pachetelor Angular şi al temelor prin suita ABP sau ABP CLI. Consultaţi <a href=\"{0}\">Cum descarc codul sursă?</a>",
    "ComputerLimitation": "Pe câte calculatoare se poate autentifica un dezvoltator atunci când foloseşte ABP ABP?",
    "ComputerLimitationExplanation": "Permitem în mod specific <strong>{0} staţii</strong> per dezvoltator individual/autorizat. Ori de câte ori este nevoie ca un dezvoltator să dezvolte produse ABP Commercial pe o altă staţie, un e-mail ar trebui să fie trimis la license@abp.io pentru a explica situaţia, şi atunci vom face alocarea corespunzătoare în sistemul nostru.",
    "RefundPolicy": "Aveţi o politică de rambursare?",
    "RefundPolicyExplanation": "Puteţi solicita un ramburs în decurs de <strong>30 de zile</strong> de la cumpărarea licenţei. Licenţele de tip Business şi Enterprise au opţiune de descărcare a codului sursă, prin urmare rambursul nu este posibil pentru licenţele Business and Enterprise (şi pentru oricare altă licenţă care beneficiază de dreptul de a primi codul sursă). În plus, nu se fac rambursări pentru reînnoiri şi achiziţii de licenţe suplimentare.",
    "HowCanIRefundVat": "Cum pot deduce TVA-ul?",
    "HowCanIRefundVatExplanation1": "Dacă aţi făcut plata folosind 2Checkout, puteţi deduce TVA-ul în contul dumneavoastră 2Checkout:",
    "HowCanIRefundVatExplanation2": "Autentificaţi-vă în contul dumneavoastră <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\">2Checkout</a>",
    "HowCanIRefundVatExplanation3": "Găsiţi comanda respectivă şi apăsaţi pe \"Deducerea tardivă a TVA-ului \" (introduceţi CUI-ul dumneavoastră)",
    "HowCanIGetMyInvoice": "Cum îmi pot obţine factura?",
    "HowCanIGetMyInvoiceExplanation": "Există două procesatori de plăţi pentru cumpărarea unei licenţă: PayU şi 2Checkout. Dacă veţi cumpăra o licenţă prin procesatorul 2Checkout, vă va trimite chitanţa PDF pe adresa dumneavoastră de email, consultaţi <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How-do-invoices-work\">facturarea 2Checkout.</a> Dacă veţi cumpăra o licenţă prin procesatorul PayU gateway sau prin transfer bancar, vă vom pregăti chitanţa şi vă vom trimite. Puteţi solicita chitanţa dumneavoastră din <a href=\"{0}\">pagina de gestionare a organizaţiei.</a>",
    "Forum": "Forum",
    "SupportExplanation": "Licenţele ABP Commercial furnizează asistenţă premium pe forum din partea unei echipe alcătuite din experţi ai ABP.",
    "PrivateTicket": "Tichet privat",
    "PrivateTicketExplanation": "Licenţa de tip Enterprise include de asemenea şi asistenţă privată cu sisteme de e-mail şi tichete.",
    "AbpSuiteExplanation1": "Suita ABP vă permite să construiţi pagini web în decurs de câteva minute. Este un instrument global .NET Core care poate fi instalat din linia de comandă.",
    "AbpSuiteExplanation2": "Poate crea o nouă soluţie ABP, genera paginii CRUD începând de la baza de date şi până la front-end. Pentru o prezentare tehnică consultaţi <a href=\"{0}\">documentul</a>",
    "FastEasy": "Rapid şi usor",
    "AbpSuiteExplanation3": "Suita ABP vă permite să creaţi pagini CRUD cu uşurinţă. Trebuie doar să vă definiţi entitatea şi proprietăţile sale, şi să lăsaţi restul în seama suitei ABP! Suita ABP generează tot codul necesar pentru pagina dumneavoastră CRUD în câteva secunde. Suportă interfeţe de utilizator Angular, MVC şi Blazor.",
    "RichOptions": "Opţiuni ample",
    "AbpSuiteExplanation4": "Suita ABP suportă multiple opţiuni UI precum <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\">Pagini Razor</a> şi <a href=\"https://angular.io\">Angular</a>. Suportă de asemenea şi baze de date multiple, precum <a href=\"https://www.mongodb.com\">MongoDB</a> şi toate bazele de date suportate de <strong>EntityFramework Core</strong> (MS SQL Server, Oracle, MySql, PostgreSQL şi <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\">altele</a>).",
    "AbpSuiteExplanation5": "Partea bună este că dumneavoastră nu trebuie să vă faceţi griji despre aceste opţiuni. Suita ABP înţelege tipul proiectului dumneavoastră şi generează cod pentru proiectul dumneavoastră şi îl plasează în locul potrivit din proiect.",
    "SourceCode": "Cod sursă",
    "AbpSuiteExplanation6": "Suita ABP generează codul sursă pentru dumneavoastră! Nu generează fişiere magice pentru a genera pagina web. Suita ABP generează codul sursă petnru <strong>Entity, Repository, Application Service, Code First Migration, JavaScript/TypeScript şi CSHTML/HTML</strong> şi interfeţele necesare de asemenea. Suita ABP generează de asemenea codul respectând <strong>Cele mai bune practici</strong> ale dezvoltării software, deci nu trebuie să vă faceţi griji în legătură cu calitatea codului generat.",
    "AbpSuiteExplanation7": "Deoarece aveţi codul sursă al blocurilor de construcţie ale paginii CRUD generate în straturile de aplicaţie corecte, puteţi modifica cu uşurinţă codul sursă şi puteţi injecta logica personalizată/business a codului generat.",
    "CrossPlatform": "Platformă transversală",
    "AbpSuiteExplanation8": "Suita ABP este construită cu .NET Core şi este o platformă transversală. Se execută ca o aplicaţie web pe calculatorul dumneavoastră local. O puteţi rula pe <strong>Windows</strong>, <strong>Mac</strong> şi <strong>Linux</strong>",
    "OtherFeatures": "Alte funcţionalităţi",
    "OtherFeatures1": "Actualizeată pachetele <strong>NuGet</strong> şi <strong>NPM</strong> din soluţia dumneavoastră cu uşurinţă.",
    "OtherFeatures2": "Regenerează paginile deja generate de la zero.",
    "OtherFeatures3": "Crează noi soluţii",
    "ThanksForCreatingProject": "Mulţumim pentru că v-aţi creat proiectul!",
    "HotToRunSolution": "Cum să rulaţi soluţia dumneavoastră?",
    "HotToRunSolutionExplanation": "Consultaţi documentul de noţiuni de bază pentru a învăţa cum să vă configuraţi şi rulaţi aplicaţia.",
    "GettingStarted": "Noţiuni de bază",
    "WebAppDevTutorial": "Tutorial Web App Dev",
    "WebAppDevTutorialExplanation": "Consultaţi tutorialul de dezvoltare a aplicaţiilor web pentru un exemplu de dezvoltare pas cu pas.",
    "Document": "Document",
    "UsingABPSuiteToCURD": "Folosind suita ABp pentru generarea şi utilizarea paginilor CRUD",
    "SeeABPSuiteDocument": "Consultaţi documentaţia suitei ABP pentru a învăţa utilizarea suitei ABP.",
    "AskQuestionsOnSupport": "Puteţi adresa întrebări pe ABP Commercial Support.",
    "Documentation": "Documentaţie",
    "SeeModulesDocument": "Consultaţi documentul modulelor pentru lista tuturor modulelor comerciale(pro) şi documentele acestora.",
    "Pricing": "Preţuri",
    "PricingExplanation": "Alegeţi caracteristicile şi funcţionalitatea nevoilor afacerii dumneavoastră acum. Actualizaţi-le cu uşurinţă pe măsură ce afacerea dumneavoastră se dezvoltă.",
    "Team": "Team",
    "Business": "Business",
    "Enterprise": "Enterprise",
    "Custom": "Personalizat",
    "IncludedDeveloperLicenses": "Licenţe de dezvoltator incluse",
    "CustomLicenceOrAdditionalServices": "Aveţi nevoie de o licenţă personalizată sau de servicii suplimentare?",
    "CustomOrVolumeLicense": "Licenţă personalizată sau de volum",
    "LiveTrainingSupport": "Instruire şi asistenţă în timp real",
    "AndMore": "şi multe altele",
    "AdditionalDeveloperLicense": "Licenţă suplimentară de dezvoltator",
    "ProjectCount": "Număr de proiecte",
    "AllProModules": "Toate modulele pro",
    "AllProThemes": "Toate temele pro",
    "AllProStartupTemplates": "Toate şabloanele de pornire pro",
    "SourceCodeOfAllModules": "Codul sursă al tuturor modulelor",
    "SourceCodeOfAllThemes": "Codul sursă al tuturor temelor",
    "PerpetualLicense": "Licenţă perpetuă",
    "UnlimitedServerDeployment": "Implementări nelimitate a serverului",
    "YearUpgrade": "actualizare de 1 an",
    "YearPremiumForumSupport": "Asistenţă premium pe forum de 1 an",
    "ForumSupportIncidentCountYear": "Asistenţă pe forum număr de incidente/an",
    "PrivateTicketEmailSupport": "Tichet privat şi asistenţă pe email",
    "BuyNow": "Cumpără acum",
    "PayViaAmexCard": "Cum pot plăti folosind cardul meu AMEX?",
    "PayViaAmexCardDescription": "Procesatorul implicit 'Iyzico' s-ar putea să refuze anumite carduri AMEX ca măsură de securitate. În acest caz, puteţi plăti prin procesatorul alternativ '2Checkout'.",
    "ThankYou": "Vă mulţumim",
    "InvalidReCaptchaErrorMessage": "A intervenit o eroare în verificarea reCAPTCHA. Vă rugăm să încercaţi din nou.",
    "CompanyName": "Nume companie",
    "YourCompanyName": "Numele companiei dumneavoastră",
    "FirstName": "Nume",
    "LastName": "Prenume",
    "Optional": "Opţional",
    "YourFirstName": "Numele dumneavoastră",
    "YourLastName": "Prenumele dumneavoastră",
    "SpecialOffer": "Ofertă specială",
    "SpecialOfferMessage": "Grăbiţi-vă! Preţurile sunt disponibile pentru o perioadă limitată.",
    "DiscountRequest": "Cerere de discount",
    "DiscountRequestDescribeCustomerQuestion": "Care din următoarele vă descrie?",
    "DiscountRequestStudentEmailMessage": "Adresa de email trebuie să conţină 'edu'.",
    "DiscountRequestDeveloperCount": "Câţi dezvoltatori aveţi?",
    "DiscountRequestDeveloperCountExceedMessage": "Nu furnizăm licenţe reduse pentru companii care au peste {0} dezvoltatori.",
    "DiscountRequestOrganizationName": "Numele companiei/organizaţiei/şcolii",
    "Website": "Site web",
    "GithubUsername": "Nume de utilizator GitHub",
    "PhoneNumber": "Număr de telefon",
    "Country": "Ţara",
    "DescribeABPCommercialUsage": "Descrieţi proiectul pe care folosiţi să-l dezvoltaţi pe baza APB Commercial",
    "DiscountRequestCertifyInformationMessage": "Certific că toate informaţiile sunt adevărate şi corecte.",
    "DiscountRequestReceived": "Am primit solicitarea dumneavoastră de reducere.",
    "DiscountRequestStatusMessage": "Vă vom răspunde după verificarea informaţiilor pe care le-aţi furnizat.",
    "MVCOrRazorPages": "MVC (Razor Pages)",
    "Angular": "Angular",
    "Blazor": "Blazor",
    "New": "New",
    "MongoDB": "MongoDB",
    "EBookDDD": "E-Book Domain Driven Design",
    "PracticalGuideForImplementingDDD": "Această carte reprezintă un ghid practic pentru implementarea proiectării bazate pe domeniu în ABP Framework.",
    "IntroducingDDD": "Introducing Domain Driven Design",
    "DDDLayersAndCleanArchitecture": "DDD Layers & Clean Architecture",
    "LayeringOfADotnetSolution": "Layering of a .NET Solution",
    "ImplementingDDDBuildingBlocks": "Implementing DDD Building Blocks",
    "DomainVsApplicationLogic": "Domain Logic vs Application Logic",
    "SamplesAndDiscussions": "Exemple & Discuţii",
    "Free": "Gratuit",
    "Download": "Descarcă",
    "DDDEBook": "DDD E-book",
    "ImplementingDDD": "Implementing Domain Driven Design",
    "DDDBookExplanation": "Ghid practic pentru implementarea proiectării bazate pe domeniu în ABP Framework.",
    "Overview": "Prezentare generală",
    "DDDBookPracticalGuide": "Acesta este un ghid practic pentru implementarea proiectării bazate pe domeniu (PBD). În timp ce detaliile de implementare se bazeată pe infrastructura ABP, conceptele de bază, principiile şi modelele sunt aplicabile în orice fel de soluţie, chiar dacă nu este o soluţie .NET.",
    "TableOfContents": "Cuprins",
    "IntroductionToImplementingDDD": "Introducere în implementarea proiectării bazate pe domeniu",
    "WhatIsDDD": "Ce este proiectarea bazată pe domeniu?",
    "Implementation": "Implementare",
    "TheBigPicture": "Imaginea de ansamblu",
    "TheBuildingBlock": "The Building Block",
    "ExampleUseCase": "Exemplu de utilizare",
    "DomainAndApplicationLogic": "Domain Logic & Application Logic",
    "Author": "Autor",
    "PublishedOn": "Publicat în",
    "Page": "Pagina",
    "FreeEBook": "E-Book gratuit",
    "EBookSignInForDownload": "Pentru a descărca e-book-ul trebuie să vă autentificaţi",
    "SignIn": "Autentificare",
    "Or": "Sau",
    "TellUsAboutYourself": "Spuneţi-ne despre dumneavoastră",
    "Surname": "Nume de familie",
    "DoYouAgreePrivacyPolicy": "Sunt de acord cu <a href=\"/TermsConditions\">Termenii şi condiţiile<a/> şi <a href=\"/Privacy\">Politica de confidenţialitate</a>.",
    "VolosoftMarketingInformationMessage": "Sunt de acord să primesc informaţii, sfaturi şi oferte despre soluţii pentru afaceri şi organizaţii şi alte produse şi servicii Volosoft.",
    "VolosoftSharingInformationMessage": "Sunt de acord ca Volosoft să partajeze informaţiile mele cu partenerii selectaţi astfel încât să primesc informaţii relevante despre produsele şi serviciile lor.",
    "WeWillSendYouADownloadLink": "Un link pentru descărcarea e-book-ului a fost trimis către {0}.<br/> Verificaţi-vă căsuţele de inbox/junk/spam!",
    "InvalidFormInputs": "Vă rugăm să introduceţi informaţia validă specificată în formular.",
    "DDDBookEmailBody": "Vă mulţumim. <br /> Pentru a descărca e-book-ul, <a href=\"{0}\">click aici</a>.",
    "StartFree": "Începe gratuit",
    "FreeTrial": "Încercare gratuită",
    "AcceptsMarketingCommunications": " Da, aș dori să primesc comunicări de marketing comerciale ABP.",
    "PurposeOfUsage": "Scopul utilizării",
    "Choose": "- Alege -",
    "CompanyOrganizationName": "Numele companiei/organizației",
    "CompanySize": "Marimea companiei",
    "Next": "Următorul",
    "StartTrial": "Începeți încercarea mea gratuită",
    "ContactUsQuestions": "Contactați-ne dacă aveți întrebări",
    "TrialActivatedWarning": "Un utilizator are dreptul la o singură perioadă de probă gratuită. Ai folosit deja perioada de probă.",
    "ActivationRequirement": "Ești ultimul la un pas până la începerea procesului.<br> După verificarea informațiilor dvs., vă vom activa licența. Odată ce licența dvs. este activată, vă vom trimite un e-mail la <b>{0}</b> . Nu vă faceți griji, acest proces nu va dura mult!",
    "SaveAndDownload": "Salvați și descărcați",
    "CompanyNameValidationMessage": "Numele companiei este prea lung!",
    "AddressValidationMessage": "Adresa este prea lungă!",
    "TaxNoValidationMessage": "TAX/TVA Nu este prea lung!",
    "NotesValidationMessage": "Câmpul de note este prea lung!",
    "CheckYourBillingInfo": "Vă puteți crea factura o singură dată! Verificați informațiile de facturare înainte de a crea factura.",
    "StartYourFreeTrial": "Începe perioada gratuită de testare",
    "TrialLicenseModelInvalidErrorMessage": "Unul dintre următoarele câmpuri este nevalid: Numele țării, Mărimea companiei, Industria sau Scopul utilizării.",
    "Trial": "Proces",
    "Purchased": "Cumparat",
    "PurchaseNow": "Cumpara acum",
    "PurchaseTrialLicenseMessage": "Data de expirare a licenței este {0}. <br> Dacă doriți să continuați să utilizați proiectele pe care le-ați creat în timpul perioadei de probă gratuită, trebuie să schimbați cheile de licență din fișierele <code>appsettings.secrets.json</code>. Iată cheia de licență:",
    "TrialLicenseExpireMessage": "Utilizați licența de probă și licența de probă va expira pe {0}.",
    "TryForFree": "Încearcă pe gratis",
    "TrialLicenseExpiredInfo": "Perioada de licență de probă a expirat!",
    "DowngradeLicensePlan": "Pot trece la un plan de licență inferior în viitor?",
    "DowngradeLicensePlanExplanation": "Nu puteți face downgrade planului de licență existent. Dar puteți achiziționa un nou plan de licență inferioară și puteți continua dezvoltarea cu noua licență. După ce achiziționați o licență inferioară, trebuie doar să vă conectați la noul plan de licență prin comanda ABP CLI: ` abp login<username> -o<organization> `.",
    "LicenseTransfer": "Poate fi transferată o licență de la un dezvoltator la altul?",
    "LicenseTransferExplanation": "Da! Când achiziționați o licență, deveniți deținătorul licenței, deci veți avea acces la pagina de gestionare a organizației. O organizație are roluri de proprietar și de dezvoltator. Proprietarii pot gestiona locurile de dezvoltator și pot atribui dezvoltatori. Fiecare dezvoltator atribuit se va conecta prin comanda ABP CLI în sistem și va avea permisiuni de dezvoltare și suport.",
    "UserOwnerDescription": "„Proprietarul” organizației este administratorul acestui cont. El/ea gestionează organizația prin achiziționarea de licențe și alocarea de dezvoltatori. Un „Proprietar” nu poate scrie cod în proiectele comerciale ABP, nu poate descărca exemplele de proiecte ABP și nu poate pune întrebări pe site-ul de asistență. Dacă vrei să faci toate acestea, trebuie să te adaugi și tu ca dezvoltator.",
    "UserDeveloperDescription": "„Dezvoltatorii” pot scrie cod în proiectele comerciale ABP, pot descărca exemple de proiecte ABP și pot pune întrebări pe site-ul de asistență. Pe de altă parte, „Dezvoltatorii” nu pot gestiona această organizație.",
    "RemoveCurrentUserFromOrganizationWarningMessage": "Te îndepărtezi din propria organizație. Nu veți mai putea gestiona această organizație, confirmați?",
    "RenewExistingOrganizationOrCreateNewOneMessage": "Puteți reînnoi licența organizației(lor) dvs. făcând clic pe butonul(ele) de mai jos „Extindeți acum” și astfel puteți prelungi data de expirare a licenței cu 1 an. Dacă continuați să plătiți, veți avea o nouă organizație. Doriți să continuați cu o nouă organizație?",
    "PurchaseTrialOrganizationOrCreateNewOneMessage": "Ai o licență de probă. Pentru a achiziționa licența de încercare, faceți clic pe butonul Cumpărați acum. Dacă continuați să plătiți, veți avea o nouă organizație. Doriți să continuați cu o nouă organizație?",
    "ExtendNow": "Extinde acum",
    "CreateNewOrganization": "Creați o nouă organizație",
    "RenewLicenseEarly": "Dacă îmi reînnoiesc permisul mai devreme, voi primi întregul an?",
    "RenewLicenseEarylExplanation": "Când vă reînnoiți licența înainte de data expirării licenței, se va adăuga 1 an la data de expirare a licenței. De exemplu, dacă licența dvs. expiră pe {0}-06-06 și o reînnoiți pe {0}-01-01, noua dată de expirare a licenței va fi {1}-06-06.",
    "OpenSourceWebApplication": "Aplicație web open source",
    "CompleteWebDevelopment": "O dezvoltare web completă",
    "ABPFrameworkDescription": "ABP Framework este o infrastructură completă pentru a crea aplicații web moderne, urmând cele mai bune practici de dezvoltare software și convenții.",
    "CommunityDescription": "Împărtășiți-vă experiențele cu Cadrul ABP!",
    "GetStarted": "Incepe",
    "Views": "vederi",
    "LatestPosts": "Ultimele postări",
    "PreBuiltApplication": "Aplicație pre-construită",
    "DatabaseProviders": "Furnizori de baze de date",
    "UIFrameworks": "Cadre UI",
    "UsefulLinks": "Link-uri utile",
    "Platform": "Platformă",
    "CoolestCompaniesUseABPCommercial": "Cele mai tari companii folosesc deja <span class=\"fw-bold\">ABP Commercial.</span>",
    "UserInterface": "Interfața cu utilizatorul",
    "APIGateway": "Gateway API",
    "Microservice": "Microserviciu",
    "Database": "Bază de date",
    "Architecture": "Arhitectură",
    "MicroserviceArchitectureExplanation": "Aceasta este o arhitectură de soluție completă care constă din mai multe aplicații, gateway-uri API, microservicii și baze de date pentru a construi o soluție scalabilă de microservicii cu cele mai recente tehnologii.",
    "BusinessLogic": "Lociga afacerii",
    "DataAccessLayer": "Stratul de acces la date",
    "Monolith": "Monolit",
    "ModularArchitectureExplanation": "Acest șablon de pornire oferă o arhitectură de soluții stratificată, modulară și bazată pe DDD pentru a construi o bază de cod curată și care poate fi întreținută.",
    "SeeDetails": "Vezi detalii",
    "SeeDocumentation": "Consultați Documentația",
    "Bs5Compatible": "Tema profesională compatibilă cu Bootstrap 5, perfectă pentru site-ul dvs. de administrare.",
    "LeptonXTheme": "Tema LeptonX",
    "LeptonXDark": "LeptonX Dark",
    "LeptonXLight": "LeptonX Light",
    "LeptonXSemiDark": "LeptonX Semi-întunecat",
    "BuiltOnBs5Library": "Construit pe biblioteca Bootstrap 5",
    "FullyCompatibleWithBs5": "100% compatibil cu structura HTML Bootstrap 5 și clasele CSS",
    "ResponsiveAndMobileCompatible": "Suport RTL receptiv, compatibil cu dispozitivele mobile",
    "ProvidesStylesForDatatables": "Oferă stiluri pentru Datatables",
    "MultipleLayoutOptions": "Opțiuni multiple de aspect",
    "EasilyInstallAndUpgrade": "Instalați și faceți upgrade cu ușurință",
    "SupportForum": "Forum de suport",
    "TrustedBy": "De încredere",
    "OurPricing": "<span class=\"gradient-commercial\">Prețurile</span> noastre",
    "Plans": "Planuri",
    "NameSurname": "Nume Prenume",
    "Unspecified": "Nespecificat",
    "LicenceType": "Tip de licență",
    "LicenseDiscountWarning": "ACEASTA PAGINA DE REDUCERE UTILizează COD DE REDUCERE IMPLICIT ȘI PENTRU DEZVOLTATORII VOLOSOFT. LINK-UL DE CUMPĂRARE DE MAI JOS NU FUNCȚIONEAZĂ.",
    "DiscountedLicenseExplanation": "Aceste prețuri de licență sunt pentru startup-uri mici, dezvoltatori individuali, studenți, organizații non-profit și proiecte!",
    "General": "General",
    "License": "Licență",
    "Development": "Dezvoltare",
    "Payment": "Plată",
    "WatchExplainerVideo": "Sa ne intalnim! Urmăriți videoclipul explicativ",
    "LightDarkAndSemiDarkThemes": "Lumină, întunecată și semiîntunecată",
    "LeptonXThemeExplanation": "Tema Lepton vă poate schimba tema în funcție de setările sistemului.",
    "PRO": "PRO",
    "WelcomeToABPCommercial": "Bine ați venit la <span class=\"gradient-commercial\">ABP Commercial!</span>",
    "YourAccountDetails": "Detaliile contului dvs",
    "OrganizationName": "Numele Organizatiei",
    "AddDevelopers": "Adăugați dezvoltatori",
    "StartDevelopment": "Începeți dezvoltarea",
    "CreateAndRunApplicationUsingStartupTemplate": "Aflați cum să creați și să rulați o nouă aplicație web folosind șablonul de pornire ABP Commercial.",
    "CommunityDescription2": "<span class=\"fw-6\">community.abp.io</span> este un loc unde oamenii pot partaja articole legate de ABP. Căutați articole, tutoriale, mostre de cod, studii de caz și întâlniți oameni pe aceeași bandă ca și dvs.",
    "UseABPSuiteExplanation": "Utilizați ABP Suite pentru a descărca codul sursă al modulelor și temelor.",
    "ManageModulesWithSuite": "De asemenea, vă puteți gestiona modulele ABP cu Suite.",
    "LearnHowToInstallSuite": "Aflați cum să instalați și să utilizați ABP Suite.",
    "SeeMore": "Vezi mai mult",
    "SeeLess": "Vedeți mai puțin",
    "LayeredSolutionStructure": "Structură stratificată a soluției",
    "LayeredSolutionStructureExplanation": "Soluția este stratificată pe baza principiilor și modelelor de proiectare bazată pe domeniul pentru a izola logica dvs. de afaceri de infrastructură și integrări și pentru a maximiza mentenabilitatea și reutilizarea codului. ABP Framework oferă deja abstracții, clase de bază și ghiduri pentru a implementa cu adevărat DDD pentru aplicația dvs.",
    "MultipleUIOptions": "Opțiuni multiple de UI",
    "MultipleUIOptionsExplanation": "Ne plac diferitele moduri de a crea interfața cu utilizatorul. Această soluție de pornire oferă trei opțiuni diferite de cadru UI pentru aplicația dvs. de afaceri.",
    "MultipleDatabaseOptions": "Opțiuni multiple pentru baze de date",
    "MultipleDatabaseOptionsExplanation": "Aveți două opțiuni de furnizor de baze de date (în plus față de folosirea ambelor într-o singură aplicație). Utilizați Entity Framework Core pentru a lucra cu orice bază de date relațională și, opțional, utilizați Dapper atunci când trebuie să scrieți interogări de nivel scăzut pentru o performanță mai bună. MongoDB este o altă opțiune dacă trebuie să utilizați o bază de date NoSQL bazată pe documente. În timp ce acești furnizori sunt bine integrați, rezumați și pre-configurați, puteți interacționa cu orice sistem de baze de date pe care îl puteți utiliza cu .NET.",
    "ModularArchitectureExplanation2": "Modularitatea este un cetățean de primă clasă în platforma ABP.IO. Toate funcționalitățile aplicației sunt împărțite în module opționale bine izolate. Soluția de pornire vine deja cu <a href=\"/modules\" class=\"text-primary\">modulele fundamentale ABP Commercial</a> preinstalate. De asemenea, vă puteți crea propriile module pentru a construi un sistem modular pentru propria dvs. aplicație.",
    "MultiTenancyForSaasBusiness": "Multi-Tenancy pentru afacerea dvs. SaaS",
    "MultiTenancyForSaasBusinessExplanation": "ABP Commercial oferă un sistem multi-tenancy complet, end-to-end, pentru a vă crea sistemele SaaS (Software-as-a-Service). Permite chiriașilor să partajeze sau să aibă propriile baze de date cu un sistem de creare și migrare a bazelor de date din mers.",
    "MicroserviceStartupSolution": "Soluție de pornire pentru microservicii",
    "MicroserviceArchitectureExplanation2": "Îl puteți obține pentru următorul dvs. sistem de microservicii pentru a profita de soluția de bază preconstruită și de experiența distilată.",
    "PreIntegratedTools": "Pre-integrat în instrumente populare",
    "PreIntegratedToolsExplanation": "Soluția este deja integrată în instrumentele și tehnologiile standard din industrie, în timp ce le puteți schimba oricând și le puteți integra cu instrumentele preferate.",
    "SingleSignOnAuthenticationServer": "Server de autentificare cu conectare unică",
    "SingleSignOnAuthenticationServerExplanation": "Soluția are o aplicație de server de autentificare care este utilizată de celelalte aplicații ca un server de conectare unică cu funcțiile de gestionare a accesului API. Se bazează pe IdentityServer.",
    "WebAppsWithGateways": "2 aplicații web cu 2 gateway-uri API",
    "WebAppsWithGatewaysExplanation": "Soluția conține două aplicații web, fiecare având un gateway API dedicat (BFF - Backend For Frontend pattern).",
    "BackOfficeApplication": "Aplicație Back Office",
    "BackOfficeApplicationExplanation": "Aplicația web reală a sistemului dvs., cu mai multe opțiuni de cadru UI. Puteți crea orice fel de aplicație de afaceri.",
    "LandingWebsite": "Site-ul de aterizare",
    "LandingWebsiteExplanation": "Un site web de destinație/public generic care poate fi utilizat în mai multe scopuri, cum ar fi prezentarea companiei dvs., vânzarea produselor dvs. etc.",
    "ABPFrameworkEBook": "E-book Mastering ABP Framework",
    "MasteringAbpFrameworkEBookDescription": "Inclus în licența dvs. comercială ABP",
    "FullName": "Numele complet",
    "LicenseTypeNotCorrect": "Tipul de licență nu este corect!",
    "Trainings": "Antrenamente",
    "ChooseTrainingPlaceholder": "Alege antrenamentul...",
    "DoYouNeedTrainings": "Ai nevoie de unul dintre aceste antrenamente?",
    "DoYouNeedTraining": "Ai nevoie de formare {0}?",
    "GetInTouchUs": "Contactează-ne",
    "ForMoreInformationClickHere": "Pentru mai multe informații, faceți clic <a href='{0}'>aici.</a>",
    "ForMoreInformationClickHereByClass": "<span class=\"{1}\">Pentru mai multe informații, faceți clic</span> <a href='{0}'>aici.</a>",
    "IsGetOnboardingTraining": "Doriți să urmați cursuri de integrare și dezvoltare de aplicații web?",
    "OnboardingWebApplicationDevelopmentTrainingMessage": "Pentru a vă programa calendarul de antrenament, contactați {0} după crearea organizației",
    "CustomPurchaseMessage": "Pentru următorul pas, faceți clic pe {0} pentru a ne contacta.",
    "Note": "Notă",
    "AdditionalNote": "Notă suplimentară",
    "OnboardingTrainingFaqTitle": "Aveți pregătire de integrare ABP?",
    "OnboardingTrainingFaqExplanation": "Da, avem servicii de instruire ABP pentru a vă ajuta să începeți rapid proiectul dvs. ABP. Veți afla despre ABP de la un membru al echipei de bază ABP și veți obține abilitățile necesare pentru a vă începe proiectul ABP. În cadrul instruirii de onboarding, vă vom explica cum să vă configurați mediul de dezvoltare, să instalați instrumentele necesare și să creați o pagină CRUD complet funcțională. Training-ul va fi live, iar aplicația Zoom va fi folosită, suntem deschiși să folosim alte platforme de întâlnire online. Limba cursului va fi engleza. De asemenea, puteți adresa întrebări despre ABP în timpul sesiunilor. O oră și o dată convenabile vor fi planificate pentru ambele părți. Pentru a obține mai multe informații, contactați-ne la <a href=\"mailto:info@abp.io\">info@abp.io</a> .",
    "AddBasket": "Adauga in cos",
    "SendTrainingRequest": "Trimiteți cerere de instruire",
    "OnlyEnglishVersionOfThisDocumentIsTheRecentAndValid": "* Versiunea în limba engleză a acestui document este cea mai actualizată, iar versiunea în limba engleză va prevala în orice dispută.",
    "Pricing_Page_Title": "Prețuri și planuri",
    "Pricing_Page_Description": "Alegeți funcțiile și funcționalitățile de care afacerea dvs. are nevoie astăzi. Cumpărați o licență comercială ABP și creați proiecte nelimitate.",
    "Pricing_Page_HurryUp": "Grăbiţi-vă!",
    "Pricing_Page_BuyLicense": "Cumpărați o licență la <strong>prețuri 2021</strong> până pe 16 ianuarie!",
    "Pricing_Page_ValidForExistingCustomers": "Valabil și pentru clienții existenți și pentru reînnoiri de licență.",
    "Pricing_Page_Hint1": "Prețul licenței include un anumit număr de locuri de dezvoltator. Dacă aveți mai mulți dezvoltatori, puteți oricând să achiziționați locuri suplimentare.",
    "Pricing_Page_Hint2": "Puteți achiziționa mai multe licențe de dezvoltator acum sau în viitor. Licențele sunt bazate pe locuri, așa că puteți transfera un loc de la un dezvoltator la altul.",
    "Pricing_Page_Hint3": "Puteți dezvolta un număr nelimitat de produse diferite cu licența dvs.",
    "Pricing_Page_Hint4": "ABP Suite este un instrument care vă ajută dezvoltarea pentru a vă îmbunătăți productivitatea. Acceptă generarea de pagini CRUD și crearea de noi proiecte.",
    "Pricing_Page_Hint5": "Puteți utiliza toate modulele pre-construite în aplicațiile dvs.",
    "Pricing_Page_Hint6": "Puteți utiliza toate temele pre-construite în aplicațiile dvs.",
    "Pricing_Page_Hint7": "Un șablon de pornire este o soluție Visual Studio pentru a vă face să începeți proiectul. Toate modulele fundamentale sunt adăugate și pre-configurate pentru dvs.",
    "Pricing_Page_Hint8": "Cartea electronică Mastering ABP Framework explică cum să implementezi soluții .NET cu cele mai bune practici. Este vândută pe Amazon.com și puteți descărca cartea gratuit cu licența dvs.",
    "Pricing_Page_Hint9": "Puteți descărca codul sursă al oricărui modul. Poate doriți să adăugați codul sursă la soluția dvs. pentru a face modificări radicale sau pur și simplu să îl păstrați pentru dvs. din motive de securitate.",
    "Pricing_Page_Hint10": "Licențele sunt pe viață. Aceasta înseamnă că puteți continua să vă dezvoltați aplicația pentru totdeauna. Accesul la cea mai recentă versiune și obținerea de asistență sunt acordate în perioada de licență (1 an dacă nu o reînnoiți).",
    "Pricing_Page_Hint11": "Fără restricții privind implementarea! Puteți implementa pe câte servere doriți, inclusiv serviciile cloud sau on-premise.",
    "Pricing_Page_Hint12": "Puteți actualiza modulele, temele și instrumentele la cea mai recentă versiune în perioada de licență activă. După expirarea licenței, trebuie să o reînnoiți pentru a continua să primiți actualizări pentru remedieri de erori, noi funcții și îmbunătățiri.",
    "Pricing_Page_Hint13": "Puteți obține asistență premium pentru un an (vă puteți reînnoi licența pentru a o prelungi).",
    "Pricing_Page_Hint14": "Licențele de echipă și de afaceri au limită de incidente/întrebări. Dacă cumpărați licențe de dezvoltator suplimentare, limita dvs. de incident crește cu {0} (pentru Licența pentru echipă) sau cu {1} (pentru Licența pentru afaceri) per dezvoltator.",
    "Pricing_Page_Hint15": "Numai licența Enterprise include suport privat. Puteți trimite un e-mail direct echipei ABP sau puteți pune întrebări pe support.abp.io cu o opțiune de bilet privat. Biletele private nu sunt vizibile publicului.",
    "Pricing_Page_Hint16": "Puteți descărca codul sursă al tuturor temelor ABP. Poate doriți să adăugați codul sursă la soluția dvs. pentru a face modificări radicale sau pur și simplu să îl păstrați pentru dvs. din motive de securitate.",
    "Pricing_Page_Testimonial_1": "ABP Commercial a permis SC Ventures să livreze o platformă SaaS de bază de date siloz multi-chiriași de nivel bancar în 9 luni pentru a sprijini finanțarea lanțului de aprovizionare a conturilor de încasat / conturi de plătit a facturilor cu valoare semnificativă de la mai multe ancore integrate. Modularitatea ABP a făcut posibil ca echipa să livreze în timp record, să treacă toate VAPT și să implementeze stiva de microservicii containerizate prin CI/CD complet și conducte în producție.",
    "Pricing_Page_Testimonial_2": "Vedem valoarea utilizării ABP Commercial pentru a reduce cheltuielile generale ale proiectelor de dezvoltare personalizate. Echipa este capabilă să unifice modelul de cod în diferite fluxuri de proiect. Vedem mai mult potențial în cadru pentru a construi noi funcții mai rapid decât înainte. Avem încredere că vom vedea în mod constant valoarea valorificării ABP Commercial.",
    "Pricing_Page_Testimonial_3": "Ne place ABP. Nu trebuie să scriem totul de la zero. Pornim de la funcții ieșite din cutie și ne concentrăm doar pe ceea ce avem cu adevărat nevoie să scriem. De asemenea, ABP este bine proiectat și codul este de înaltă calitate, cu mai puține erori. Dacă ar trebui să scriem singuri tot ce ne trebuie, ar putea fi nevoiți să petrecem ani de zile. Încă un lucru care ne place este că noua versiune, remedierea problemelor sau îmbunătățirea apare foarte curând la fiecare două săptămâni. Nu așteptăm prea mult.",
    "Pricing_Page_Testimonial_4": "ABP Commercial este un produs fantastic pe care l-ar recomanda. Produse comerciale pe piață pentru clienții noștri într-o singură platformă configurabilă. Saltul începe că cadrul și instrumentele oferă ca orice echipă merită fiecare cent. ABP Commercial a fost cea mai potrivită pentru nevoile noastre.",
    "Pricing_Page_Testimonial_5": "ABP Framework nu este doar un cadru, ci este și un ghid pentru dezvoltarea/managementul proiectelor, deoarece oferă instruire DDD, GenericRepository, DI, Microservice și Modularity. Chiar dacă nu veți folosi cadrul în sine, vă puteți dezvolta cu docs.abp.io, care este bine pregătit și profesionist (OpenIddict, Redis, Quartz etc.). Deoarece multe lucruri sunt pre-construite, scurtează semnificativ timpul de dezvoltare a proiectului (cum ar fi pagina de conectare, gestionarea excepțiilor, filtrarea datelor, seeding, înregistrarea auditului, localizarea, controlerul automat API etc.). Ca exemplu din aplicația noastră, am folosit Local Event Bus pentru controlul stocurilor. Așadar, pot gestiona mișcările comenzilor scriind handler de stoc. Este minunat să nu pierzi timp pentru CreationTime, CreatorId. Acestea sunt completate automat.",
    "Pricing_Page_Testimonial_6": "Cadrul ABP este un cadru bun, dar are nevoie de timp pentru a înțelege diferitele straturi, clase și biblioteci pe care le folosește (în special ABP). Am petrecut mult timp citind baza de cod, dar ABP Commercial ne-a economisit timp în crearea entităților de specialitate de proiect (AR) și a depozitului legat de fiecare dintre ele. Mi-a placut si abordarea folosita in ABP este foarte matura; știm că se bazează pe DDD și monolit.",
    "Pricing_Page_Testimonial_7": "Ca startup, trebuie să repetăm rapid și să petrecem timp minim pe caracteristicile standard și non-core. \n Inginerii noștri variază de la ingineri cu înaltă experiență la ingineri juniori și aveam nevoie de o înțelegere comună și de o modalitate de a împărtăși cunoștințele tehnice și de domeniu, ABP ne-a permis să facem acest lucru datorită ghidurilor și documentației excelente. \n Există lucruri pentru care nu a trebuit să ne facem griji, deoarece funcționează de la cutie cu ABP. \n ABP ne-a ajutat să eficientizăm prototiparea și dezvoltarea rapidă, în mai puțin de 4 săptămâni de la inițierea caracteristicilor până la producție. Cu toate caracteristicile sale premium incluse în licență, ABP ne-a oferit „Startup in a Box” în partea de software.",
    "Pricing_Page_Testimonial_8": "Aș recomanda ABP comercial tuturor celor care doresc să extindă gama de produse disponibile clienților lor. Este fantastic atunci când trebuie să utilizați un mediu de întreprindere distribuit (Angular, WPF, Win&amp;Linux). Pe lângă produsele lor, ne place sprijinul lor, ceea ce ne face munca mai rapidă și mai ușoară. Știm deja că am găsit un partener excelent pentru viitor, care ne va sprijini în extinderea afacerii noastre.",
    "Pricing_Page_Testimonial_9": "Suntem o companie formată din 2 angajați, care este în activitate de peste 20 de ani. \n În ceea ce privește experiența noastră cu ABP Commercial, am fost abordați de un client care ne-a solicitat să dezvoltăm o nouă aplicație de resurse umane într-un mediu modern pentru a înlocui aplicația lor Access veche de 25 de ani. Am decis să trecem de la o soluție desktop la una bazată pe web. \n \n La acea vreme, aveam foarte puține cunoștințe despre aplicațiile web și .NET, dar am dat peste ABP Commercial și, cu ajutorul ABP Framework, documentația tehnică și ABP Suite, am putut nu numai să dezvoltăm aplicația pentru specificațiile clientului dar și să lucreze cu succes într-un mediu .NET într-un an.",
    "AbpBookDownloadArea_ClaimYourEBook": "Revendicați-vă cărțile electronice <span class='gradient-framework'>Mastering ABP Framework</span>",
    "AddMemberModal_Warning_1": "Dacă <strong>numele de utilizator</strong> pe care încercați să îl adăugați nu există în sistem, vă rugăm să cereți membrului echipei dvs. să se înregistreze pe <a href='{0}/Account/Register'>{0}</a> și să vă împărtășească numele de utilizator al contului său.",
    "MyOrganizations_Detail_WelcomeMessage": "Bun venit la organizația dvs., {0}",
    "MyOrganizations_Detail_OrganizationManagement": "<span class=\"gradient-commercial\">Managementul</span> organizației",
    "OrganizationDisplayName": "Numele afișat al organizației",
    "MyOrganizations_Detail_EditDisplayName": "Editați numele afișat",
    "MyOrganizations_Detail_UpgradeYourLicense": "Actualizați-vă licența",
    "MyOrganizations_Detail_LicenseStartAndExpiryDate": "Data de începere a licenței - Data de expirare",
    "MyOrganizations_Detail_OwnerRightInfo": "Utilizați {0} dintre drepturile dvs. de proprietar {1}.",
    "MyOrganizations_Detail_CopyApiKey": "Copiați cheia",
    "MyOrganizations_Detail_ApiKeyDescription": "Cheia API este simbolul pachetelor PRO găzduite pe <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{1}.</a>",
    "MyOrganizations_Detail_YourPrivateNugetSource": "Sursa dvs. privată NuGet este <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{0}</a>",
    "MyOrganizations_Detail_PrivateNugetSourceWarning": "Acesta este adăugat automat ca flux la NuGet.Config în soluția ABP. Nu partajați cheia dvs. privată cu utilizatori neautorizați!",
    "MyOrganizations_Detail_DeveloperSeatInfo": "Utilizați {0} din {1} locuri de dezvoltator.",
    "NeedMoreSeatsForYourTeam": "Ai nevoie de mai multe locuri pentru echipa ta?",
    "MyOrganizations_Detail_PricePerYear": "{0} / pe an",
    "MyOrganizations_Detail_PurchaseDeveloperSeats": "Achiziționați locuri pentru dezvoltatori",
    "Invoices": "Facturi",
    "RequestInvoice": "Solicitați factura",
    "OrderNumber": "Număr de ordine",
    "Date": "Data",
    "Products": "Produse",
    "TotalPrice": "Pretul total",
    "ThereIsNoInvoice": "Nu există nicio factură",
    "MyOrganizations_Detail_PaymentProviderInfo": "Dacă v-ați achiziționat licența prin gateway-ul <i>{0}</i> , acesta trimite factura PDF la adresa dvs. de e-mail, consultați <a href=\"{1}\" target=\"_blank\">{0} facturare.</a>",
    "MyOrganizations_Detail_PayUInfo": "Dacă ați achiziționat prin gateway-ul <i>Iyzico</i> , faceți clic pe butonul „Solicitare factură” și completați informațiile de facturare.",
    "MyOrganizations_Detail_ConclusionInfo": "Solicitarea dvs. de facturare va fi finalizată în termen de {0} zile lucrătoare.",
    "ExtendYourLicense": "Extindeți-vă licența <span class=\"text-primary\">{0}</span>",
    "Continue": "Continua",
    "PurchaseLicense": "Achiziționați licența {0}",
    "DownloadInvoiceModal_DownloadInvoice": "Descărcați Factură",
    "DownloadInvoiceModal_SaveInformationOnlyOnce": "Puteți salva informațiile de facturare o singură dată.",
    "InvoiceModal_EnterCompanyName": "Introduceți numele legal al companiei dvs....",
    "InvoiceModal_EnterCompanyAddress": "Introdu adresa juridică a companiei...",
    "InvoiceModal_EnterTaxNumber": "Introduceți numărul dvs. de TAX/TVA dacă este disponibil...",
    "RequestInvoiceModal_EnterNotes": "Introduceți mesajul suplimentar despre factura dvs....",
    "PrePayment_PayWithIyzico": "Vei plăti cu Iyzico",
    "ContinueToCheckout": "Continuați la Checkout",
    "PrePayment_IyzicoRedirectionInfo": "Veți fi redirecționat către Iyzico Payment Gateway pentru a finaliza achiziția în siguranță.",
    "PrePayment_IyzicoAcceptVisaAndMasterCard": "Iyzico acceptă Visa și MasterCard.",
    "Purchase": "Cumpărare",
    "AcceptTermsAndConditions": "Am citit, înțeles și accept <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">politica de confidențialitate</a> , <a href=\"{1}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">termenii și condițiile</a> și <a href=\"{2}\" target=\"_blank\" class=\"text-primary\">EULA.</a>",
    "AcceptTermsAndConditionsWarningMessage": "Vă rugăm să acceptați politica de confidențialitate și termenii și condițiile",
    "SelectGatewayToContinue": "Vă rugăm să selectați un Gateway pentru a continua!",
    "GatewaySelection_SelectGateway": "Selectați un Gateway de plată",
    "GatewaySelection_RedirectionMessage": "În continuare, veți fi redirecționat către site-ul web al gateway-ului de plată selectat pentru tranzacție.",
    "PaymentSucceed_PaymentSuccessMessage": "Plata realizată cu succes",
    "PaymentSucceed_ThanksForPurchase": "Multumesc pentru cumparaturile facute!",
    "PaymentSucceed_CreateYourOrganization": "Creați-vă organizația",
    "PaymentSucceed_AddMeAsDeveloper": "Și eu sunt dezvoltator, adaugă-mă ca dezvoltator în organizația mea.",
    "PaymentSucceed_CreateOrganization": "Creați organizație",
    "PaymentSucceed_OrganizationDescription": "O organizație este formată din dezvoltatori și proprietari. Dezvoltatorii sunt utilizatori care scriu cod în proiectul ABP și vor beneficia de site-ul <a href=\"{0}\" target=\"_blank\">{1}</a> . Proprietarii sunt utilizatori care alocă locuri de dezvoltator și gestionează licențele.",
    "PaymentSucceed_ViewOrganization": "Click aici pentru a vedea organizarea",
    "Purchase_TotalAnnualPrice": "TOTAL <small class=\"opacity-50\">(taxă anuală)</small>",
    "Purchase_TrainingPrice": "Prețul antrenamentului",
    "Purchase_OnboardingTraining": "Instruire live pentru integrare și dezvoltare de aplicații web",
    "TotalDeveloperPrice": "Prețul total pentru dezvoltatori",
    "Purchase_PricePerDeveloper": "<span>{0} {1}</span> per dezvoltator",
    "Purchase_IncludedDeveloperInfo": "{0} {1} inclus.",
    "Purchase_LicenseExtraDeveloperPurchaseMessage": "<span class=\"fw-bold\">Licența {0}</span> include dezvoltatori {1}. Puteți adăuga dezvoltatori suplimentari.",
    "StartupTemplates_Page_Title": "Șabloane de pornire ABP",
    "StartupTemplates_Page_Description": "ABP Commercial vă permite să construiți soluții cu orice nivel de complexitate. Oferă două soluții principale de pornire prefabricate. Puteți să-l selectați pe cel apropiat de cerințele dvs. și să vă construiți propria soluție personalizată pe deasupra.",
    "MicroserviceStartupSolutionForDotnet": "Soluție de pornire pentru microservicii pentru .NET",
    "MonolithSolutionForDotnet": "Soluție monolit (modulară) pentru .NET",
    "TrainingDetailsHeaderInfo_TrainingHour": "{0} oră(e)",
    "Trainings_Content": "Conținutul instruirii",
    "Trial_Page_StartYourFreeTrial": "Începe <span class=\"gradient-commercial\">perioada gratuită de testare</span>",
    "TrialLicenseFeatures": "Veți putea beneficia de toate caracteristicile comerciale ABP",
    "TrialPeriodDays": "Veți avea o licență de echipă de {0} zile",
    "TrialForumSupportIncident": "Veți avea {0} incidente de asistență pe forum",
    "Contact_Page_Title": "Contactați echipa de dezvoltare ABP",
    "Contact_Page_Description": "Contactați echipa ABP Development, dacă aveți nevoie de ajutor sau împărtășiți-vă gândurile și opiniile! Echipa de asistență ABP este gata să ajute.",
    "Demo_Page_Title": "Creați o demonstrație",
    "Demo_Page_Description": "Creați o demonstrație gratuită pentru a vedea un exemplu de aplicație creat folosind șablonul de pornire comercială ABP. Nu vă repetați pentru cerințele comune ale aplicației.",
    "Discounted_Page_Title": "Preț redus",
    "Discounted_Page_Description": "Alegeți funcțiile și funcționalitățile de care afacerea dvs. are nevoie astăzi. Cumpărați o licență comercială ABP și creați proiecte nelimitate",
    "Faq_Page_Title": "Întrebări frecvente (FAQ)",
    "Faq_Page_Description": "Aveti vreo intrebare? Căutați întrebări frecvente sau adresați-ne o întrebare folosind formularul de contact.",
    "Faq_Page_SwiftCode": "Codul SWIFT",
    "Faq_Page_BankName": "Numele băncii",
    "Faq_Page_AccountName": "Nume de cont",
    "Faq_Page_AccountNumber": "Numărul de cont",
    "Faq_Page_Currency": "Valută",
    "Faq_Page_VatNumber": "TVA",
    "Faq_Page_OtherCurrenciesInfo": "Pentru alte monede, consultați <a href='{0}'>toate conturile</a>",
    "ProjectCreatedSuccess_Page_Title": "Proiectul dvs. a fost creat",
    "ProjectCreatedSuccess_Page_Description": "Proiectul tău ABP a fost creat cu succes!",
    "Suite_Page_Title": "Suita ABP",
    "Suite_Page_Description": "ABP Commercial oferă instrumente de dezvoltare rapidă a aplicațiilor pentru a crește productivitatea dezvoltatorilor. ABP Suite vă permite să creați cu ușurință pagini CRUD.",
    "Themes_Page_Title": "Teme ABP",
    "Themes_Page_Description": "ABP Commercial oferă mai multe teme profesionale, moderne de UI. Creați o demonstrație gratuită pentru a avea o vedere rapidă a modului în care arată interfața de utilizare.",
    "Tools_Page_Title": "Instrumente de dezvoltare rapidă a aplicațiilor",
    "Tools_Page_Description": "ABP Commercial oferă instrumente de dezvoltare rapidă a aplicațiilor pentru a crește productivitatea dezvoltatorilor. ABP Suite vă permite să creați cu ușurință pagini CRUD.",
    "DeveloperPrice": "Prețul dezvoltatorului",
    "AdditionalDeveloperPaymentInfoSection_AdditionalDevelopers": "{0} <small>dezvoltatori</small>",
    "LicenseRemainingDays": "timp de <span>{0}</span> zile",
    "ExtendPaymentInfoSection_Description": "Prin extinderea/reînnoirea licenței, veți continua să beneficiați <a href=\"{0}\" target=\"_blank\">de asistență premium</a> . De asemenea, veți putea obține actualizări majore sau minore pentru module și teme. Veți putea continua să creați noi proiecte. Și veți putea în continuare să utilizați <a href=\"{1}\" target=\"_blank\">ABP Suite</a> , care vă accelerează dezvoltarea.",
    "LicenseRenewalPrice": "Preț de reînnoire a licenței",
    "LicensePrice": "Prețul licenței",
    "TrialLicensePaymentInfoSection_Description": "<strong>Achiziționați licență:</strong> prin achiziționarea unei licențe, veți continua să beneficiați <a href=\"{0}\" target=\"_blank\" rel=\"noopener\">de asistență premium</a> . De asemenea, veți putea obține actualizări majore sau minore pentru module și teme. Veți putea continua să creați noi proiecte. Și veți putea în continuare să utilizați <a href=\"{1}\" target=\"_blank\" rel=\"noopener\">ABP Suite</a> , care vă accelerează dezvoltarea.<br> Consultați <a href=\"{2}\" target=\"_blank\" rel=\"noopener\">tabelul de comparare a licențelor</a> pentru a verifica diferențele dintre tipurile de licență.",
    "SelectTargetLicense": "Selectați Licența țintă",
    "UpgradePaymentInfoSection_ExtendMyLicenseForOneYear": "Da, prelungesc data de expirare a licenței cu 1 an.",
    "UpgradePaymentInfoSection_WantToExtendLicense": "Doriți să vă prelungiți permisul cu încă un an?",
    "UpgradePaymentInfoSection_UpgradingWillNotExtendLicense": "Actualizarea nu va prelungi data de expirare a licenței!",
    "UpgradePaymentInfoSection_LicenseUpgradeDescription": "Prin actualizarea licenței, veți fi promovat la un tip de licență superior, ceea ce vă va permite să obțineți beneficii suplimentare. Consultați <a href=\"/Pricing\" target=\"_blank\">tabelul de comparare a licențelor</a> pentru a verifica diferențele dintre tipurile de licență.",
    "Landing_Page_CustomerStories": "Poveștile clienților",
    "Landing_Page_OurGreatCustomers": "Marii nostri clienti",
    "Landing_Page_WebApplicationFramework": "Cadrul aplicației web",
    "Landing_Page_WebDevelopmentPlatform": "Platforma de dezvoltare web",
    "Landing_Page_CompleteWebDevelopmentPlatform": "Platformă completă de dezvoltare web",
    "Landing_Page_TryFreeDemo": "Încercați Demo gratuită",
    "Landing_Page_StartingPointForWebApplications": "Punctul de plecare pentru aplicațiile web bazate pe ASP.NET Core! Se bazează pe Cadrul ABP pentru cea mai bună dezvoltare web.",
    "Landing_Page_AbpProvidesSoftwareInfrastructure": "ABP Framework oferă o infrastructură software pentru a dezvolta aplicații web excelente cu cele mai bune practici.",
    "Landing_Page_MicroserviceCompatibleArchitecture": "Arhitectură compatibilă cu microservicii",
    "Landing_Page_PreBuiltApplicationModulesAndThemes": "Module și teme de aplicație preconstruite",
    "Landing_Page_MultiTenantArchitecture": "Arhitectură cu mai mulți chiriași",
    "Landing_Page_MultiTenancyDescription": "Aplicații SaaS, ușor! Multi-tenancy integrat de la baza de date la UI.",
    "Landing_Page_DDDIntroduction": "Proiectat și dezvoltat pe baza modelelor și principiilor DDD. Oferă un model stratificat pentru aplicația dvs.",
    "Landing_Page_CrossCuttingConcernsInfo": "Infrastructură completă pentru autorizare, validare, gestionarea excepțiilor, stocarea în cache, înregistrarea auditului, gestionarea tranzacțiilor și multe altele.",
    "Landing_Page_PreBuiltApplicationModules": "Module de aplicații pre-construite care includ cele mai comune cerințe ale aplicațiilor web.",
    "Landing_Page_ChatModule": "conversație",
    "Landing_Page_DocsModule": "Docs",
    "Landing_Page_FileManagementModule": "Gestionarea fișierelor",
    "Landing_Page_CustomerStory_1": "ABP Commercial a permis SC Ventures să livreze o platformă SaaS de bază de date siloz multi-chiriași de nivel bancar în 9 luni pentru a sprijini finanțarea lanțului de aprovizionare a conturilor de încasat / conturi de plătit a facturilor cu valoare semnificativă de la mai multe ancore integrate. Modularitatea ABP a făcut posibil ca echipa să livreze în timp record, să treacă toate VAPT și să implementeze stiva de microservicii containerizate prin CI/CD complet și conducte în producție.",
    "Landing_Page_CustomerStory_2": "Vedem valoarea utilizării ABP Commercial pentru a reduce cheltuielile generale ale proiectelor de dezvoltare personalizate. Echipa poate unifica modelul de cod în diferite fluxuri de proiect. Vedem mai mult potențial în cadru pentru a construi noi funcții mai rapid decât înainte. Avem încredere că vom vedea în mod constant valoarea valorificării ABP Commercial.",
    "Landing_Page_CustomerStory_3": "Ne place ABP. Nu trebuie să scriem totul de la zero. Pornim de la funcții ieșite din cutie și ne concentrăm doar pe ceea ce avem cu adevărat nevoie să scriem. De asemenea, ABP este bine proiectat și codul este de înaltă calitate, cu mai puține erori. Dacă ar trebui să scriem singuri tot ce ne trebuie, ar putea fi nevoiți să petrecem ani de zile. Încă un lucru care ne place este că noua versiune, sau remedierea problemelor sau îmbunătățirea apare foarte curând \n o dată la două săptămâni. Nu așteptăm prea mult.",
    "Landing_Page_CustomerStory_4": "ABP Commercial este un produs fantastic pe care l-ar recomanda. Produse comerciale pe piață pentru clienții noștri într-o singură platformă configurabilă. Saltul începe că cadrul și instrumentele oferă ca orice echipă merită fiecare cent. ABP Commercial a fost cea mai potrivită pentru nevoile noastre.",
    "Landing_Page_AdditionalServices": "Licență personalizată sau în volum, onboarding, training live și suport, dezvoltare de proiecte personalizate, portarea proiectelor existente și multe altele...",
    "Landing_Page_IncludedDeveloperLicenses": "Incluse <strong>{0}</strong> licențe de dezvoltator",
    "Landing_Page_SeeOnDemo": "Vezi pe Demo",
    "Landing_Page_LeptonThemes": "LeptonThemes",
    "Landing_Page_AccountModuleDescription_1": "Acest modul implementează sistemul de autentificare pentru o aplicație;",
    "Landing_Page_AccountModuleDescription_2": "Oferă o pagină <strong>de conectare</strong> cu numele de utilizator și parola",
    "Landing_Page_AccountModuleDescription_3": "Oferă o pagină <strong>de înregistrare</strong> pentru a crea un cont nou.",
    "Landing_Page_AccountModuleDescription_4": "Oferă o pagină <strong>cu parola uitată</strong> pentru a trimite un link <strong>de resetare a parolei</strong> sub formă de e-mail.",
    "Landing_Page_AccountModuleDescription_5": "Oferă funcționalitate <strong>de confirmare prin e-mail</strong> cu UI.",
    "Landing_Page_AccountModuleDescription_6": "Implementează autentificarea <strong>cu doi factori</strong> (SMS și e-mail).",
    "Landing_Page_AccountModuleDescription_7": "Implementează <strong>blocarea utilizatorilor</strong> (blochează contul pentru perioada de timp stabilită atunci când apar un anumit număr de autentificări eșuate din cauza acreditărilor nevalide într-un anumit interval de timp).",
    "Landing_Page_AccountModuleDescription_8": "Implementează interfața de utilizare și funcționalitatea serverului de autentificare <strong>Identity Server</strong> .",
    "Landing_Page_AccountModuleDescription_9": "Permite <strong>comutarea între chiriași</strong> într-un mediu cu mai mulți chiriași.",
    "Landing_Page_AccountModuleDescription_10": "Permite schimbarea <strong>limbii UI</strong> a aplicației.",
    "Landing_Page_AuditLoggingModuleDescription_1": "Acest modul oferă interfața de utilizare de raportare a jurnalului de audit pentru infrastructura de audit. Permite căutarea, filtrarea și afișarea intrărilor din jurnalul de audit și jurnalele de modificare a entităților.",
    "Landing_Page_AuditLoggingModuleDescription_2": "O intrare din jurnalul de audit constă din date critice despre fiecare solicitare a clientului:",
    "Landing_Page_AuditLoggingModuleDescription_3": "URL, Browser, adresa IP, numele clientului",
    "Landing_Page_AuditLoggingModuleDescription_4": "Utilizatorul",
    "Landing_Page_AuditLoggingModuleDescription_5": "Metoda HTTP, codul de stare de returnare HTTP",
    "Landing_Page_AuditLoggingModuleDescription_6": "Succes/eșec, detalii despre excepție dacă sunt disponibile",
    "Landing_Page_AuditLoggingModuleDescription_7": "Durata de execuție a cererii",
    "Landing_Page_AuditLoggingModuleDescription_8": "Entitățile au fost create, șterse sau actualizate în această solicitare (cu proprietăți modificate).",
    "Landing_Page_BloggingModuleDescription_1": "Acest modul adaugă un blog simplu aplicației dvs. ABP;",
    "Landing_Page_BloggingModuleDescription_2": "Permite crearea mai multor bloguri într-o singură aplicație.",
    "Landing_Page_BloggingModuleDescription_3": "Acceptă formatul Markdown.",
    "Landing_Page_BloggingModuleDescription_4": "Permite să scrieți comentarii pentru o postare.",
    "Landing_Page_BloggingModuleDescription_5": "Permite atribuirea de etichete postărilor de blog.",
    "Landing_Page_BloggingModuleDescription_6": "Vedeți site-ul web <a href=\"blog.abp.io\">blog.abp.io</a> ca exemplu live al modulului de blogging.",
    "Landing_Page_ChatModuleDescription_1": "Acest modul este utilizat pentru mesageria în timp real între utilizatorii din aplicație.",
    "Landing_Page_ChatModuleDescription_2": "Mesaje în timp real pe pagina de chat.",
    "Landing_Page_ChatModuleDescription_3": "Căutați utilizatori în aplicație pentru conversații noi.",
    "Landing_Page_ChatModuleDescription_4": "Lista de contacte pentru conversațiile recente.",
    "Landing_Page_ChatModuleDescription_5": "Notificări de mesaje noi atunci când utilizatorul se uită la o altă pagină.",
    "Landing_Page_ChatModuleDescription_6": "Insigna pentru numărul total de mesaje necitite pe pictograma meniului.",
    "Landing_Page_ChatModuleDescription_7": "Număr de mesaje necitite pentru fiecare conversație.",
    "Landing_Page_ChatModuleDescription_8": "Conversații leneșe încărcate.",
    "Landing_Page_DocsModuleDescription_1": "Acest modul este utilizat pentru a crea site-uri web de documentație tehnică;",
    "Landing_Page_DocsModuleDescription_2": "<strong>Integrare GitHub</strong> încorporată: scrieți și gestionați direct documente pe GitHub.",
    "Landing_Page_DocsModuleDescription_3": "Suport <strong>pentru versiuni</strong> integrat direct în versiunile GitHub.",
    "Landing_Page_DocsModuleDescription_4": "Acceptă <strong>mai multe limbi</strong> (cu suport alternativ la limba implicită).",
    "Landing_Page_DocsModuleDescription_5": "Acceptă formatele <strong>Markdown</strong> și HTML.",
    "Landing_Page_DocsModuleDescription_6": "Oferă o secțiune <strong>de navigare</strong> și o secțiune <strong>de schiță</strong> .",
    "Landing_Page_DocsModuleDescription_7": "Permite găzduirea <strong>mai multor documentații de proiecte</strong> într-o singură aplicație.",
    "Landing_Page_DocsModuleDescription_8": "Linkuri către fișierul de pe GitHub, astfel încât oricine poate contribui cu ușurință făcând clic pe <strong>linkul Editați</strong> .",
    "Landing_Page_DocsModuleDescription_9": "În plus față de sursa GitHub, permite pur și simplu utilizarea unui folder ca sursă de documentație.",
    "Landing_Page_FileManagementModuleDescription_1": "Încărcați, descărcați și organizați fișiere într-o structură de foldere ierarhice.",
    "Landing_Page_FileManagementModuleDescription_2": "Acest modul este folosit pentru a încărca, descărca și organiza fișiere într-o structură de foldere ierarhice. De asemenea, este compatibil cu multi-tenancy și puteți determina limita de dimensiune totală pentru chiriașii dvs.",
    "Landing_Page_FileManagementModuleDescription_3": "Acest modul se bazează pe sistemul <a href=\"https://docs.abp.io/en/abp/latest/Blob-Storing\">de stocare BLOB</a> , astfel încât poate folosi diferiți furnizori de stocare pentru a stoca conținutul fișierului.",
    "Landing_Page_IdentityModuleDescription_1": "Acest modul implementează sistemul Utilizator și Rol al unei aplicații;",
    "Landing_Page_IdentityModuleDescription_2": "Construit pe biblioteca <a href=\"https://docs.microsoft.com/en-us/aspnet/core/security/authentication/identity\">Microsoft ASP.NET Core Identity</a> .",
    "Landing_Page_IdentityModuleDescription_3": "Gestionați <strong>rolurile</strong> și <strong>utilizatorii</strong> din sistem. Un utilizator are permisiunea de a avea <strong>mai multe roluri</strong> .",
    "Landing_Page_IdentityModuleDescription_4": "Setați <strong>permisiunile</strong> la niveluri de rol și utilizator.",
    "Landing_Page_IdentityModuleDescription_5": "Activați/dezactivați <strong>autentificarea cu doi factori</strong> și <strong>blocarea</strong> utilizatorilor per utilizator.",
    "Landing_Page_IdentityModuleDescription_6": "Gestionați <strong>profilul de utilizator</strong> și <strong>parola</strong> de bază.",
    "Landing_Page_IdentityModuleDescription_7": "Gestionați <strong>tipurile de revendicări</strong> în sistem, setați revendicările la roluri și utilizatori.",
    "Landing_Page_IdentityModuleDescription_8": "Pagina de setare pentru a gestiona <strong>complexitatea parolei</strong> , autentificarea utilizatorului, contul și blocarea.",
    "Landing_Page_IdentityModuleDescription_9": "Suportă autentificare <strong>LDAP</strong> .",
    "Landing_Page_IdentityModuleDescription_10": "Oferă verificarea <strong>e-mailului și a numărului de telefon</strong> .",
    "Landing_Page_IdentityModuleDescription_11": "Suportă integrări de conectare sociale (Twitter, Facebook, GitHub etc...).",
    "Landing_Page_IdentityModuleDescription_12": "Gestionați <strong>unitățile organizaționale</strong> din sistem.",
    "Landing_Page_PaymentModuleDescription_1": "Oferă integrare pentru diferite gateway-uri de plată.",
    "Landing_Page_PaymentModuleDescription_2": "Acest modul oferă integrare pentru gateway-uri de plată, astfel încât să puteți obține cu ușurință plăți de la clienții dvs.",
    "Landing_Page_PaymentModuleDescription_3": "Acest modul acceptă următoarele gateway-uri de plată",
    "Welcome_Page_UseSameCredentialForCommercialWebsites": "Folosiți aceleași acreditări atât pentru <a href=\"https://commercial.abp.io\" class=\"text-primary\">commercial.abp.io,</a> cât și <a href=\"https://support.abp.io\" class=\"text-primary\">pentru support.abp.io</a> .",
    "WatchCrudPagesVideo": "Urmărește videoclipul „Crearea paginilor CRUD cu ABP Suite”!",
    "WatchGeneratingFromDatabaseVideo": "Urmărește videoclipul „ABP Suite: Generarea de pagini CRUD din tabele de baze de date existente”!",
    "WatchTakeCloserLookVideo": "Urmărește videoclipul „Aruncă o privire mai atentă la generarea codului: ABP Suite”!",
    "ConfirmedEmailAddressRequiredToStartTrial": "Ar trebui să aveți o adresă de e-mail confirmată pentru a începe o licență de probă.",
    "EmailVerificationMailNotSent": "E-mailul de verificare a e-mailului nu a putut fi trimis.",
    "GetConfirmationEmail": "<a href=\"javascript:void(0);\" id=\"{0}\" class=\"text-decoration-underline\">Faceți clic aici pentru a primi un e-mail de verificare</a> dacă nu l-ați primit înainte.",
    "WhichLicenseTypeYouAreInterestedIn": "Ce tip de licență vă interesează?",
    "DontTakeOurWordForIt": "Nu ne crede pe cuvânt...",
    "ReadAbpCommercialUsersWantYouToKnow": "Citiți ce doresc utilizatorii ABP Commercial să știți",
    "Testimonial_ShortDescription_1": "Modularitatea ABP a făcut posibil ca echipa să livreze la timp.",
    "Testimonial_ShortDescription_2": "Creați funcții noi mai rapid decât înainte.",
    "Testimonial_ShortDescription_3": "Pornim de la funcții ieșite din cutie și ne concentrăm doar pe ceea ce avem cu adevărat nevoie să scriem.",
    "Testimonial_ShortDescription_4": "ABP Commercial a fost cea mai potrivită pentru nevoile noastre.",
    "OnlineReviewersOnAbpCommercial": "Recenzii online despre ABP Commercial",
    "SeeWhatToldAboutAbpCommercial": "Vezi ce s-a spus despre ABP Commercial și scrie-ți părerea dacă vrei.",
    "BlazoriseLicense": "Trebuie să cumpărăm o licență Blazorise?",
    "BlazoriseLicenseExplanation": "Avem un acord între Volosoft și Megabit, cu acest acord licența Blazorise este inclusă cu produsele comerciale ABP, prin urmare clienții noștri nu trebuie să achiziționeze o licență Blazorise suplimentară.",
    "ExtendPaymentInfoSection_DeveloperPrice": "{0}x Dezvoltator(i) suplimentar(i)",
    "ExtendPaymentInfoSection_DiscountRate": "Reducere de {0}%",
    "TotalNetPrice": "Preț net total",
    "EFCore": "Entity Framework Core",
    "All": "Toate",
    "Mvc": "MVC",
    "DataBaseProvider": "Furnizor de date",
    "UIFramework": "Cadrul UI",
    "LeptonXThemeForDashboard": "Tema LeptonX pentru tabloul de bord administrativ de",
    "AbpPlatform": "Platforma ABP",
    "YouDeserveGoodUXUI": "Meriți o interfață de utilizare bună și un UX mai bun. Tema LeptonX de la ABP este aici pentru a o servi.",
    "ViewLiveDemo": "Vedeți demonstrația temei live",
    "GetLeptonX": "Obțineți LeptonX acum",
    "SeeLeptonXDocumentation": "Consultați documentația LeptonX",
    "SeeLeptonDocumentation": "Consultați documentația Lepton",
    "SimplifiedMenu": "Meniu simplificat",
    "SimplifiedMenuDescription": "Puteți găsi cu ușurință pagina pe care o căutați prin filtrarea meniului",
    "YourFavoritePages": "Paginile tale preferate la îndemâna ta",
    "YourFavoritePagesDescription": "Adăugați sau eliminați cu ușurință pagina din favorite făcând clic pe pictograma stea din colțul din dreapta sus al paginii.",
    "BreadCrumbs": "Breadcrumb pentru comutare fără întreruperi",
    "BreadCrumbsDescription": "Folosind Breadcrumb, puteți trece la paginile de același nivel cu un singur clic, chiar și atunci când meniul din stânga este închis și funcționează pe tabletă și mobil responsive!",
    "YourMenu": "Meniul dvs. după cum doriți",
    "YourMenuDescription": "Personalizați pictogramele pe care se poate face clic direct și casetele drop-down din meniul utilizatorului după cum doriți. Meniul utilizatorului este complet personalizabil pentru nevoile dvs",
    "RtlSupport": "Suport RTL pentru limba dvs",
    "RtlSupportDescription": "Tema LeptonX acceptă RTL pentru limba dvs. Opțiunile de limbă sunt în meniul de setări pentru a putea schimba limba.",
    "YourColors": "Culorile dvs. în interfața de utilizare a tabloului de bord administrativ",
    "YourColorsDescription": "Tema LeptonX funcționează în funcție de preferințele dvs. de sistem și are o temă deschisă pentru tabloul de bord, temă întunecată pentru tabloul de bord și opțiuni de temă semiîntunecată pentru tabloul de bord.",
    "ArrangeContentWidth": "Aranjează-ți cu ușurință lățimea conținutului",
    "ArrangeContentWidthDescription": "Schimbați cu ușurință lățimea zonei de conținut.",
    "LeptonXCompatibleWith": "Tema LeptonX este compatibilă cu",
    "MobileResponsiveTemplate": "Șablon receptiv mobil",
    "MobileResponsiveTemplateDescription1": "Accesați tabloul de bord administrativ LeptonX de pe orice dispozitiv doriți.",
    "MobileResponsiveTemplateDescription2": "Este conceput pentru a fi utilizat cu ușurință în fiecare dispozitiv al tău. Este receptiv pe dispozitivele mobile și dimensiunile tabletelor.",
    "TopMenuLayoutOption": "Opțiune de aspect al meniului superior",
    "TopMenuLayoutOptionDescription1": "Dacă doriți să vă configurați site-ul web cu același tablou de bord de administrare, este posibil să o faceți cu tema LeptonX!",
    "TopMenuLayoutOptionDescription2": "Încercați doar aspectul meniului de sus LeptonX pentru a face acest lucru!",
    "EasilyCustomizable": "Personalizat cu ușurință pentru culorile mărcii dvs",
    "EasilyCustomizableDescription1": "Puteți personaliza tema LeptonX folosind doar câteva variabile SCSS. Fără suprascrie, fără încărcare CSS suplimentară!",
    "EasilyCustomizableDescription2": "Cu LeptonX, vă puteți aranja tabloul de bord administrativ așa cum doriți.",
    "IndependentLayout": "Aspect independent și zonă de conținut",
    "IndependentLayoutDescription1": "Infrastructura de aspect a LeptonX a fost proiectată complet separat de conținut.",
    "IndependentLayoutDescription2": "Aceasta înseamnă că vă puteți proiecta liber proiectul cu o structură de conținut diferită de Bootstrap, dacă doriți.",
    "MostUsedLibraries": "Cele mai utilizate biblioteci integrate cu LeptonX",
    "MostUsedLibrariesDescription1": "LeptonX conține cele mai utilizate biblioteci ale tale. Vă permite să utilizați biblioteci precum ApexCharts, DataTables, DropZone, FullCalender, JSTree, Select2 și Toastr fără efort.",
    "MostUsedLibrariesDescription2": "LeptonX acceptă și bibliotecile MVC Angular și Blazor specifice.",
    "CreateAndCustomize": "Creați și personalizați paginile de care aveți nevoie în câteva secunde cu paginile personalizate LeptonX",
    "CreateAndCustomizeDescription": "Folosind Tema LeptonX, aveți acces și la multe pagini HTML prefabricate. Acestea includ multe pagini, cum ar fi pagina de conectare, blog, Întrebări frecvente, lista de abonamente, factură, prețuri și gestionarea fișierelor.",
    "LeptonThemeForAdmin": "Tema Lepton pentru tabloul de bord administrativ de",
    "LeptonThemeForAdminDescription": "Tema Lepton este încă disponibilă și va fi menținută. Dacă doriți să treceți la LeptonX Theme ca utilizator Lepton Theme, puteți vedea documentația pentru a afla cum se face.",
    "LeptonCompatibleWith": "Tema Lepton este compatibilă cu",
    "BlackFridayDiscount": "Black Friday Discount",
    "UpgradePaymentInfoSection_DeveloperPrice": "{0} pentru {1} dezvoltatori suplimentari",
    "Upgrade": "Actualizare",
    "Renewal": "Reînnoire",
    "UpgradePaymentInfoSection_LicensePrice": "{0} licență",
    "UpgradePaymentInfoSection_LicenseRenewalPrice": "Reînnoirea licenței",
    "Total": "Total",
    "SupportPolicyFaqTitle": "Care este politica ta de sprijin?",
    "SupportPolicyFaqExplanation": "Acceptăm doar versiunea activă și versiunea majoră anterioară. Nu garantăm o lansare a patch-urilor pentru a treia și pentru versiunile majore mai vechi. De exemplu, dacă versiunea activă este 7.0.0, vom lansa versiuni de patch-uri atât pentru 6.xx, cât și pentru 7.xx. În plus, oferim asistență numai pentru problemele legate de ABP Framework și ABP Commercial. Aceasta înseamnă că nu se acordă suport pentru aplicațiile terță parte, serviciile cloud și alte biblioteci periferice utilizate de produsele ABP. Vom depune eforturi rezonabile din punct de vedere comercial pentru a oferi clienților noștri asistență tehnică în timpul programului oficial de lucru al „Volosoft Bilisim AS”. Pe de altă parte, nu ne angajăm cu un timp de răspuns la un acord de nivel de serviciu (SLA), dar vom încerca să răspundem la problemele tehnice cât mai repede posibil în timpul programului nostru oficial de lucru. Cu excepția cazului în care se încheie un acord special cu clientul, oferim asistență doar la https://support.abp.io. Avem, de asemenea, asistență privată prin e-mail, care este disponibil numai pentru deținătorii de licențe Enterprise.",
    "TotalDevelopers": "Total {0} dezvoltatori",
    "CustomPurchaseExplanation": "Adaptat nevoilor dumneavoastră specifice",
    "WhereDidYouHearAboutUs": "de unde ai aflat despre noi?",
    "Twitter": "Stare de nervozitate",
    "Facebook": "Facebook",
    "Youtube": "YouTube",
    "Google": "Google",
    "Github": "GitHub",
    "Friend": "De la un prieten",
    "Other": "Alte",
    "WhereDidYouHearAboutUs_explain": "Specifica ...",
    "DeletingMemberWarningMessage": "„{0}” va fi eliminat din lista de dezvoltatori. Dacă doriți, puteți atribui acest loc liber unui alt dezvoltator mai târziu.",
    "AdditionalInfo": "Dacă locurile de dezvoltator sunt peste cerințele dvs., le puteți reduce. Puteți e-mail la <a href=\"mailto:info@abp.io\">info@abp.io</a> pentru a elimina unele dintre locurile dvs. de dezvoltator. Eliminarea locurilor de dezvoltator neutilizate va reduce costul de reînnoire a licenței. Dacă doriți, puteți să recumpărați locuri de dezvoltator suplimentare în perioada de licență activă. Rețineți că, deoarece există {0} dezvoltatori în acest pachet de licență, nu puteți reduce acest număr.",
    "LinkExpiredErrorMessage": "Linkul pe care încercați să îl accesați este expirat.",
    "ExpirationDate": "Data expirării",
    "SpringCampaignDiscount": "Reducere la campania de primăvară",
    "WhyUseAbpIoPlatform": "De ce ar trebui să folosesc Platforma ABP.IO în loc să creez o nouă soluție de la zero?",
    "WhyUseAbpIoPlatformFaqExplanation": "Consultați <a href=\"/why-abp-io \">pagina respectivă</a> pentru o explicație detaliată a motivului pentru care utilizarea Platformei ABP.IO are un avantaj semnificativ față de a face totul singur.",
    "EulaPageTitle": "Acord de licență pentru utilizatorul final (EULA)",
    "PrivacyPolicyPageTitle": "Politica de confidențialitate - Politica de cookie-uri",
    "TermsConditionsPageTitle": "Termeni și condiții",
    "TrainingsPageTitle": "Pachete de formare ABP",
    "ModulesPageTitle": "Module de aplicație preconstruite ABP",
    "Volo.AbpIo.Commercial:040001": "Cheia de acces API este incorectă.",
    "GetLepton": "Ia Lepton acum",
    "MyOrganizations_Detail_LicenseStartDate": "Data de începere a licenței",
    "MyOrganizations_Detail_LicenseExpiryDate": "Data de expirare",
    "BlazoriseSupport": "Cum obțin cheia de licență Blazorise și asistență de la echipa Blazorise?",
    "BlazoriseSupportExplanation": "Urmați pașii de mai jos pentru a obține asistență din partea echipei Blazorise și pentru a obține cheia de licență Blazorise:",
    "BlazoriseSupportExplanation1": "Înscrieți-vă pentru un cont nou la <a href=\"https://blazorise.com/support/register\">blazorise.com/support/register</a> cu aceeași adresă de e-mail ca și contul abp.io. Lăsați intrarea „Cheie de licență” necompletată. <strong>Trebuie să fie aceeași adresă de e-mail ca și contul dvs. de e-mail de pe abp.io.</strong>",
    "BlazoriseSupportExplanation2": "Verificați-vă adresa de e-mail verificând caseta de e-mail. Verificați caseta de spam dacă nu vedeți un e-mail în căsuța dvs. de e-mail!",
    "BlazoriseSupportExplanation3": "Conectați-vă pe site-ul web de asistență Blazorise la <a href=\"https://blazorise.com/support/login\">blazorise.com/support/login</a> .",
    "BlazoriseSupportExplanation4": "Dacă aveți o licență comercială ABP activă, veți avea și o licență Blazorise PRO. Puteți obține cheia de licență Blazorise la <a href=\"https://blazorise.com/support/user/manage/license\">blazorise.com/support/user/manage/license</a> .",
    "BlazoriseSupportExplanation5": "Puteți posta întrebările dvs. pe site-ul web de asistență și puteți genera un simbol de produs pentru aplicația dvs.",
    "AbpLiveTrainingPackages": "Pachete de antrenament live ABP",
    "Releases": "Lansări",
    "ReleasesDescription": "Eliberați jurnalele ABP Commercial.",
    "ReleaseDate": "Data de lansare",
    "Labels": "Etichete",
    "PreRelease": "Pre-lansare",
    "AllTypes": "Toate tipurile",
    "Enhancement": "Sporire",
    "Bug": "Gândac",
    "Feature": "Caracteristică",
    "AllUIs": "Toate interfețele de utilizator",
    "MVC": "MVC",
    "BlazorServer": "Blazor Server",
    "MAUI": "MAUI",
    "HowItWorks_Page_Title": "Cum functioneaza?",
    "HowItWorks_Page_Description": "ABP Framework extinde platforma .NET. Deci, orice puteți face cu o soluție simplă .NET este deja posibil cu ABP Framework. Acest lucru face ușor să începeți cu o curbă de învățare scăzută.",
    "HowItWorks_Description1": "ABP Framework extinde platforma .NET. Deci, orice puteți face cu o soluție simplă .NET este deja posibil cu ABP Framework. Acest lucru face ușor să începeți cu o curbă de învățare scăzută.",
    "HowItWorks_Description2": "Odată ce începeți să învățați și să utilizați caracteristicile ABP Framework, dezvoltarea software-ului dvs. va fi mult mai plăcută ca niciodată.",
    "HowItWorks_Description3": "Această pagină explică practic modul în care utilizați Platforma ABP.IO ca dezvoltator .NET.",
    "CreateANewSolution": "Creați o nouă soluție .NET",
    "CreateANewSolution_Description1": "Totul începe prin crearea unei noi soluții .NET integrate ABP.",
    "StartWithStartupTemplates": "Porniți unul dintre <a href=\"/startup-templates\">șabloanele de soluție de pornire</a> pre-construite",
    "SimpleMonolithApplicationTemplate": "Șablon simplu de aplicație monolit",
    "LayeredApplicationTemplate": "Șablon de aplicație stratificat",
    "MicroserviceSolutionTemplate": "Șablon de soluție pentru microservicii",
    "CreateEmptySolutionAndUseAbp": "Sau creați o nouă soluție .NET goală și instalați singur <a href=\"https://abp.io/packages\" target=\"_blank\">pachetele</a> ABP NuGet &amp; NPM.",
    "CreatingSolutionWithMultipleOptions": "Există mai multe opțiuni de interfață utilizator și bază de date în timpul creării unei noi soluții.",
    "UIFrameworkOptions": "Opțiuni cadru UI",
    "DotnetSolutionWithoutDependency": "Acum, aveți o soluție obișnuită .NET în computerul dvs. local, care nu depinde de o platformă cloud sau de un serviciu extern.",
    "CheckTheDocumentForDetails": "Puteți verifica documentul <a href=\"{0}\" target=\"_blank\">{1}</a> pentru detalii.",
    "UIAndDatabaseIndependent": "ABP poate lucra cu orice UI și orice furnizor de baze de date acceptat de .NET. \n Cu toate acestea, acești furnizori de interfață de utilizare și de baze de date sunt preintegrați și bine documentați.",
    "InstallAbpModules": "Instalați modulele ABP",
    "DevelopYourSolution": "Dezvoltați-vă soluția",
    "DeployAnywhere": "Implementați oriunde",
    "InstallAbpModule_Description1": "ABP este un cadru modular de dezvoltare a aplicațiilor. Șabloanele de soluții de pornire vin deja cu modulele esențiale instalate. \n Dar există mai multe module de aplicație pe care poate doriți să le utilizați în soluția dvs.",
    "InstallAbpModule_Description2": "Fiecare modul constă din câteva pachete NuGet și NPM și are un document de instalare. <a href=\"/tools/suite\">ABP Suite</a> face cea mai mare parte a lucrării automat, apoi configurați sau reglați manual modulul pe baza documentației sale.",
    "DevelopYourSolution_Description1": "Infrastructura ABP vă face să vă <b class=\"text-white\">concentrați pe propriul cod de afaceri,</b> automatizând munca repetitivă și oferind infrastructură și <a href=\"https://abp.io/features\" target=\"_blank\">funcții</a> de aplicație preconstruite.",
    "DevelopYourSolution_Description2": "În următorul bloc de cod, puteți vedea cum Cadrul ABP se integrează perfect în codul dvs. și automatizează sarcinile repetitive pentru dvs.",
    "DevelopYourSolution_Description3": "Chiar și în acest bloc de coduri scurte, ABP face o mulțime de lucruri pentru tine.",
    "DevelopYourSolution_Description4": "Oferă clase de bază pentru aplicarea convențiilor, cum ar fi <a href=\"https://docs.abp.io/en/abp/latest/Dependency-Injection\" target=\"_blank\">injecția de dependență</a> \n . Serviciile generice <a href=\"https://docs.abp.io/en/abp/latest/Repositories\" target=\"_blank\">de depozit</a> \n oferă un mod convenabil \n de a interacționa cu baza de date. <a href=\"https://docs.abp.io/en/abp/latest/Authorization\" target=\"_blank\">Autorizarea</a> declarativă \n funcționează cu un sistem de permisiuni reglat fin.",
    "DevelopYourSolution_Description5": "ABP automatizează complet <a href=\"https://docs.abp.io/en/abp/latest/Unit-Of-Work\" target=\"_blank\">unitatea de lucru</a> \n (pentru conexiunea la baza de date și gestionarea tranzacțiilor), <a href=\"https://docs.abp.io/en/abp/latest/Exception-Handling\" target=\"_blank\">gestionarea excepțiilor</a> \n , <a href=\"https://docs.abp.io/en/abp/latest/Validation\" target=\"_blank\">validarea</a> \n \n și <a href=\"https://docs.abp.io/en/abp/latest/Audit-Logging\" target=\"_blank\">înregistrarea de audit</a> . Oferă multe mai multe blocuri pentru a vă simplifica sarcinile zilnice de dezvoltare și pentru a vă concentra pe propriul cod, creând în același timp aplicații \n gata de producție.",
    "DevelopYourSolution_Description6": "Vă puteți imagina cât de mult poate fi acel bloc de cod lung și complicat dacă ați face totul manual.",
    "SuiteCrudGenerationInFewSeconds": "Pe lângă codificarea manuală a soluției dvs., puteți crea pagini CRUD avansate complet funcționale în câteva minute folosind instrumentul ABP Suite. Acesta generează codul în soluția dvs., astfel încât să îl puteți regla fin în funcție de cerințele dvs. personalizate.",
    "DeployAnywhere_Description1": "La sfârșitul zilei, aveți o soluție .NET pură. Vă puteți implementa soluția pe propriul dvs. server, pe o platformă cloud, pe Kubernetes sau oriunde doriți. Puteți implementa pe câte servere doriți. ABP este un instrument agnostic al mediului de implementare.",
    "ExpertiseAbpFramework": "Expertizați Cadrul ABP",
    "ExpertiseAbpFramework_Description1": "Doriți să depășiți elementele de bază și să obțineți experiență cu Platforma ABP.IO?",
    "FreeDownload": "Descărcare gratuită",
    "Read": "Citit",
    "HavingTrouble": "A avea probleme?",
    "HavingTrouble_Description1": "Aveți probleme cu dezvoltarea soluției dvs.? Noi suntem aici! Utilizați platforma de asistență ABP \n sau trimiteți un e-mail pentru a obține ajutor direct de la membrii echipei Core ABP Framework.",
    "WeAreHereToHelp_Description1": "Puteți să răsfoiți subiectele noastre de ajutor sau să căutați în întrebările frecvente, \n sau ne puteți adresa o întrebare folosind formularul de contact.",
    "OtherModules": "Alte module",
    "OtherModules_Description1": "Cont, Înregistrare de audit, Chat, Kit CMS, Gestionare fișiere, Formulare, GDPR, Identitate, Gestionare limbă, Plată, Saas și multe altele...",
    "HowItWorks_DatabaseProviderOptions": "Opțiuni pentru furnizorul de baze de date",
    "SeeFAQ": "Consultați Întrebări frecvente",
    "ReleaseLogs": "Jurnalele de lansare",
    "ReleaseLogs_Tag": "{0} Jurnalele de lansare",
    "ReleaseLogs_Pr": "Solicitare de tragere #{0} - {1}",
    "NoLabels": "Fara etichete",
    "DoesTheSubscriptionRenewAutomatically": "Abonamentul se reînnoiește automat?",
    "DoesTheSubscriptionRenewAutomaticallyExplanation": "ABP Commercial nu are un model de facturare cu reînnoire automată. Prin urmare <strong>, abonamentul nu va fi reînnoit automat</strong> la sfârșitul perioadei de licență. Dacă doriți să beneficiați în continuare de beneficiile ABP Commercial, trebuie să îl reînnoiți manual la <a href=\"/my-organizations\">pagina de management al organizației</a> . Dacă aveți mai multe organizații, faceți clic pe butonul „Gestionați” la organizația care expiră și apoi faceți clic pe butonul „Extindeți acum” pentru a vă reînnoi licența. Poate doriți să aruncați o privire și la <a href=\"/faq#what-happens-when-license-ends\">Ce se întâmplă când se termină licența mea?</a> secțiune.",
    "ExtraQuestionCreditsFaqTitle": "Pot achiziționa credite suplimentare pentru întrebări de asistență?",
    "ExtraQuestionCreditsFaqExplanation": "Da, poti. Pentru a cumpăra credite suplimentare pentru întrebări, trimiteți un e-mail la <a href=\"mailto:info@abp.io\">info@abp.io</a> cu numele organizației dvs. Iată lista de prețuri pentru creditele suplimentare pentru întrebări:<ul><li> Pachet de 50 de întrebări 999 USD</li><li> Pachet de 25 de întrebări 625 USD</li><li> Pachet de 15 întrebări 450 USD</li></ul>",
    "AlreadyBetaTester": "V-ați alăturat deja programului de testare beta.",
    "AbpStudio": "ABP Studio",
    "AbpStudio_Description": "ABP Studio este încă în curs de dezvoltare. Puteți completa formularul de mai jos pentru a fi unul dintre primii utilizatori.",
    "AbpStudio_Description1": "ABP Studio este o <span class=\"text-highlight-white\">aplicație desktop multiplatformă</span> pentru dezvoltatorii ABP.",
    "AbpStudio_Description2": "Este <span class=\"text-highlight-white\">bine integrat</span> în cadrul ABP și își propune să vă ofere un mediu de dezvoltare confortabil prin <span class=\"text-highlight-white\">automatizarea lucrurilor, oferind informații</span> despre soluția dvs., făcând <span class=\"text-highlight-white\">dezvoltarea, rularea</span> și <span class=\"text-highlight-white\">implementarea</span> soluțiilor dvs. mult mai ușoare.",
    "AbpStudio_ComingSoon": "În curând <span class=\"opacity-50 ms-0 ms-md-3 d-block d-md-inline-block \">Data de lansare beta planificată: Q4 din 2023.</span>",
    "AbpStudio_PlannedPreviewDate": "Data de lansare a previzualizării planificată: Q4 din 2023.",
    "BetaRequest": "Solicitare beta",
    "CreateNewSolutions": "Creați soluții noi",
    "CreateNewSolutions_Description1": "Puteți crea cu ușurință de la aplicații simple la soluții monolit modulare sau microservicii cu o mulțime de opțiuni. Obțineți o soluție software de bază completă pregătită pentru producție pentru afacerea dvs.",
    "ArchitectYourSolutions": "Arhitectați soluțiile dvs",
    "ArchitectYourSolutions_Description1": "Construiți mai ușor structuri de soluții monolit-modulare și microservicii prin crearea de module sau servicii și stabilirea de relații între ele. Puteți, de asemenea, să instalați sau să dezinstalați module de aplicații prefabricate.",
    "ExploreYourSolution": "Explorați-vă soluția",
    "ExploreYourSolution_Description1": "ABP Studio arată o vedere la nivel înalt a componentelor din soluția dvs. și a modulelor de care depinde soluția dvs. Puteți explora entități, servicii, API-uri HTTP și multe altele fără a fi nevoie să vă deschideți baza de cod.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze": "Rulați rapid soluții cu aplicații multiple sau microservicii",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description1": "Rulați unul, <span class=\"text-highlight-white\">mai multe</span> sau <span class=\"text-highlight-white\">toate serviciile</span> cu un singur clic. În acest fel, este foarte ușor să opriți un serviciu, să îl rulați în Visual Studio pentru <span class=\"text-highlight-white\">a testa</span> sau <span class=\"text-highlight-white\">a depana</span> .",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description2": "Vedeți o listă de servicii, vizualizați <span class=\"text-highlight-white\">în timp real Solicitarea HTTP</span> și <span class=\"text-highlight-white\">numărul de excepții</span> pentru fiecare serviciu.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description3": "Vedeți toate detaliile tuturor <span class=\"text-highlight-white\">solicitărilor HTTP</span> care ajung la orice serviciu.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description4": "Explorați <span class=\"text-highlight-white\">detaliile excepțiilor</span> în timp real în orice serviciu, filtrați și căutați cu ușurință.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description5": "Afișați <span class=\"text-highlight-white\">jurnalele aplicației</span> , filtrați după nivel de jurnal sau căutați după text..",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description6": "<span class=\"text-highlight-white\">Răsfoiți</span> interfața de utilizare a aplicației dvs. fără a părăsi rulerul soluției.",
    "IntegrateToYourKubernetesCluster": "Integrați-vă în clusterul dvs. Kubernetes",
    "IntegrateToYourKubernetesCluster_Description1": "<span class=\"text-highlight-white\">Conectați-vă mediul de dezvoltare local la un cluster Kubernetes local sau la distanță</span> , unde acel cluster rulează deja soluția dvs. de microservicii.",
    "IntegrateToYourKubernetesCluster_Description2": "Accesați orice serviciu din Kubernetes cu numele serviciului ca DNS, la fel cum rulează pe computerul dvs. local.",
    "IntegrateToYourKubernetesCluster_Description3": "<span class=\"text-highlight-white\">Interceptați orice serviciu</span> din acel cluster, astfel încât tot <span class=\"text-highlight-white\">traficul către serviciul interceptat este redirecționat automat către serviciul dvs.</span> care rulează pe mașina dvs. locală. Când serviciul dvs. trebuie să utilizeze orice serviciu în Kubernetes, traficul este redirecționat înapoi către cluster, la fel cum serviciul dvs. local rulează în Kubernetes.",
    "GetInformed": "Informați-vă",
    "Studio_GetInformed_Description1": "Lăsați informațiile dvs. de contact pentru <span class=\"text-highlight-white\">a vă informa</span> și <span class=\"text-highlight-white\">încercați mai întâi</span> când ABP Studio a fost lansat.",
    "Studio_GetInformed_Description2": "Data de lansare a previzualizării planificată: Q3 din 2023.",
    "ThankYou!": "Mulțumesc!",
    "SendBetaRequest": "Trimiteți cererea beta",
    "YouJoinedTheBetaTesterProgram": "Te-ai alăturat programului de testare beta ABP Studio.",
    "PricingExplanation2": "30 de zile garanție de returnare a banilor — <a href=\"/faq#refund-policy\">Aflați mai multe</a>",
    "MoneyBackGuaranteeText": "* Garanție de rambursare a banilor de 30 de zile pentru toate licențele! Rambursare 100% pentru echipă, rambursare 60% pentru licențele Business și Enterprise în 30 de zile.",
    "MobileApplicationStartupTemplates": "Șabloane de pornire a aplicațiilor mobile",
    "MobileApplicationStartupTemplates_Description1": "Șabloane integrate de pornire a aplicațiilor mobile pentru soluțiile dvs. comerciale ABP.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates": "Creați aplicații puternice de linie de afaceri folosind șabloane de pornire ABP Mobile",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description1": "ABP Commercial oferă două șabloane de pornire a aplicațiilor mobile implementate cu <span class=\"text-highlight\">React Native</span> și <span class=\"text-highlight\">.NET MAUI.</span> Când vă creați noua soluție bazată pe ABP, veți avea și aplicații de pornire de bază conectate la API-urile backend.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description2": "Aplicația are un ciclu de token de autentificare pre-construit, <span class=\"text-highlight\">asistență în mai multe limbi, suport pentru mai multe locații, autentificare, parolă uitată, gestionare a profilului și o pagină de gestionare a utilizatorilor</span> . Puteți adăuga propria logică de afaceri și o puteți personaliza în funcție de cerințele dvs.",
    "TwoFrameworkOptions": "Două opțiuni de cadru",
    "TwoFrameworkOptions_Description": "ABP oferă atât șabloane <span class=\"text-highlight\">React Native</span> , cât și <span class=\"text-highlight\">.NET MAUI</span> pentru pornire mobilă. Astfel, îl poți alege pe cel care se potrivește cel mai bine nevoilor tale. Ambele aplicații reutiliza codul la cea mai mare rată între platformele iOS și Android.",
    "PreIntegratedToYourBackend": "Pre-integrat în backend-ul dvs",
    "PreIntegratedToYourBackend_Description": "Aplicațiile ABP Mobile sunt pre-integrate în API-urile dvs. de backend. Primește un token de autentificare valid de la server și face cereri autentificate.",
    "MultiLanguage": "Multi-limbi",
    "MultiLanguage_Description": "Acceptă deja mai mult de 10 limbi. De asemenea, puteți adăuga următoarele limbi.",
    "Arabic": "arabic",
    "Czech": "ceh",
    "English": "Engleză",
    "Hungarian": "maghiară",
    "Finnish": "finlandeză",
    "French": "limba franceza",
    "Hindi": "hindi",
    "Portuguese": "portugheză",
    "Italian": "Italiană",
    "Russian": "Rusă",
    "Slovak": "slovacă",
    "Turkish": "turc",
    "EngageAndRetainYourCustomersWithABPMobileApps": "Implicați-vă și păstrați-vă clienții cu aplicațiile mobile ABP",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description1": "Clienții dvs. doresc să își gestioneze produsele și abonamentele de oriunde și oricând. Acest lucru impune organizațiilor să creeze aplicații mobile care le permit clienților să-și îndeplinească cererile rapid și fără probleme.",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description2": "Cu aplicațiile ABP Mobile, puteți crea aplicații mobile native de înaltă calitate pentru Android și iOS... Folosind o singură bază de cod și fără a compromite securitatea, calitatea sau scalabilitatea.",
    "OneCodeBaseMultipleDevices": "Dispozitive multiple cu o bază de cod",
    "OneCodeBaseMultipleDevices_Description": "Aplicațiile ABP Mobile sunt multiplatforme. Sunt gata să fie instalate și rulate pe dispozitive iOS și Android și se adaptează la diferiți factori de formă folosind o singură bază de cod. Dezvoltatorii trebuie să creeze interfața de utilizare și codul front-end o singură dată, nu este nevoie să adapteze codul pentru fiecare dispozitiv pe care doriți să îl susțineți.",
    "ComesWithTheSourceCode": "Vine cu codul sursă",
    "ComesWithTheSourceCode_Description": "Aplicațiile mobile sunt furnizate cu codul sursă. Personalizați cu ușurință UX/UI al aplicațiilor dvs. pentru a respecta regulile de branding.",
    "Purchase_OneYearPrice": "Pret 1 an",
    "Purchase_DeveloperSeatCount": "Număr de locuri pentru dezvoltatori",
    "Purchase_DevelopersAlreadyIncluded": "{0} dezvoltatori deja incluși",
    "1Year": "1 an",
    "{0}Years": "{0} ani",
    "1YearLicense": "Licență de 1 an",
    "{0}YearsLicense": "Licență de {0} ani",
    "1AdditionalDeveloper": "1 Dezvoltator suplimentar",
    "{0}AdditionalDevelopers": "{0} Dezvoltatori suplimentari",
    "Discount": "Reducere ({0}%)",
    "Summary": "rezumat",
    "TrainingPack": "Pachet de antrenament",
    "TrainingPackDiscount": "Reducere la pachetul de antrenament",
    "Purchase_OnboardingTraining_Description": "Acest pachet de antrenament live este valabil pentru o clasă de 8 studenți și această reducere este valabilă numai atunci când este achiziționat cu noua licență. <a href=\"{0}\" class=\"text-white\">Află mai multe<i class=\"fa fa-external-link ms-1\"></i></a>",
    "Purchase_Save": "{0}% <span class=\"save ms-1\">Economisire {1} {2}</span>",
    "RemoveBasket": "Scoateți din coș",
    "WhyABPIOPlatform?": "De ce <span class=\"gradient-commercial\">platforma ABP.IO</span> ?",
    "DocumentAim": "Acest document își propune să răspundă la marea întrebare:",
    "DocumentAim_Description": "„De ce ar trebui să utilizați Platforma ABP.IO în loc să creați o nouă soluție de la zero?”",
    "DocumentAim_Description2": "Documentul prezintă provocările construirii unei soluții software moderne și explică modul în care ABP abordează aceste provocări.",
    "CreatingANewSolution": "Crearea unei noi soluții",
    "CreatingANewSolution_Description": "Când trebuie să începeți o nouă soluție, există o mulțime de întrebări pe care trebuie să vi le puneți și ar trebui să petreceți mult timp înainte de a începe să scrieți primul cod de afaceri.",
    "CreatingAnEmptySolution": "Crearea unei soluții goale",
    "THEPROBLEM": "PROBLEMA",
    "CreatingAnEmptySolution_THEPROBLEM_Description": "Chiar și crearea unei soluții aproape goale este o provocare;",
    "CreatingAnEmptySolution_THEPROBLEM_Description2": "Cum vă organizați baza de cod pe proiecte?",
    "CreatingAnEmptySolution_THEPROBLEM_Description3": "Care sunt straturile și cum interacționează ele?",
    "CreatingAnEmptySolution_THEPROBLEM_Description4": "Cum se integrează în biblioteci și sisteme terță parte?",
    "CreatingAnEmptySolution_THEPROBLEM_Description5": "Cum se configurează testele automate?",
    "ABPSOLUTION": "SOLUȚIE ABP",
    "CreatingAnEmptySolution_ABPSOLUTION_Description": "ABP oferă o <a href=\"https://docs.abp.io/en/abp/latest/Startup-Templates/Application\" target=\"_blank\">soluție de pornire</a> bine proiectată, stratificată și pregătită pentru producție, bazată pe principiile <a href=\"https://docs.abp.io/en/abp/latest/Domain-Driven-Design\" target=\"_blank\">Domain Driven Design</a> . Soluția include, de asemenea, o unitate preconfigurată și proiecte <a href=\"https://docs.abp.io/en/abp/latest/Testing\" target=\"_blank\">de testare</a> de integrare pentru fiecare strat.",
    "CommonLibraries": "Biblioteci comune",
    "CommonLibraries_THEPROBLEM_Description": "Ce biblioteci ar trebui să utilizați pentru a implementa cerințe comune? Ecosistemul de dezvoltare software este foarte dinamic, ceea ce face dificil să țineți pasul cu cele mai recente instrumente, biblioteci, tendințe și abordări.",
    "CommonLibraries_ABPSOLUTION_Description": "ABP preintegra în soluție biblioteci populare, mature și actualizate. Nu trebuie să petreci timp integrându-i sau făcându-i să comunice între ei. Funcționează corect din cutie.",
    "UITheme&Layout": "Tema și aspectul UI",
    "UITheme&Layout_THEPROBLEM_Description": "Atunci când abordăm preocupările legate de UI, apar o serie de provocări. Acestea includ stabilirea bazelor pentru un kit de interfață de utilizare receptiv, contemporan și adaptabil, cu un aspect consistent și o serie de funcții precum meniuri de navigare, anteturi, bare de instrumente, subsoluri, widget-uri și multe altele.",
    "UITheme&Layout_THEPROBLEM_Description2": "Chiar dacă optați pentru o temă pre-proiectată, integrarea perfectă a acesteia în proiectul dvs. ar putea necesita zile de dezvoltare. Un obstacol suplimentar constă în actualizarea unor astfel de teme. Frecvent, structura HTML/CSS a temei devine împletită cu codul dvs. UI, redând schimbări viitoare ale temei sau upgrade-uri sarcini complicate. Această împletire a codului și a designului complică flexibilitatea efectuării de ajustări pe linie.",
    "UITheme&Layout_ABPSOLUTION_Description": "ABP Framework oferă un sistem de tematică distinctiv care eliberează codul UI de constrângerile temei. Temele există izolat, ambalate ca pachete NuGet sau NPM, făcând instalarea sau upgrade-urile temei în câteva minute. În timp ce păstrați opțiunea de a vă dezvolta tema personalizată sau de a integra una existentă, ABP Commercial vă prezintă o colecție de teme șlefuite și contemporane.",
    "UITheme&Layout_ABPSOLUTION_Description2": "În plus, există furnizori de componente UI precum Telerik și DevExpress. Cu toate acestea, acești furnizori furnizează în primul rând componente individuale, punându-vă sarcina de a vă stabili sistemul de layout. Când lucrați în cadrul proiectelor bazate pe ABP, puteți încorpora fără probleme aceste biblioteci, la fel ca în orice alt proiect.",
    "TestInfrastructure": "Infrastructura de testare",
    "TestInfrastructure_THEPROBLEM_Description": "Stabilirea unui mediu de testare robust este un efort care necesită timp. Aceasta implică crearea unor proiecte de testare dedicate în cadrul soluției dvs., selectarea cu atenție a instrumentelor necesare, crearea de simulari de servicii și baze de date, crearea de clase de bază esențiale și servicii de utilitate pentru a minimiza codul redundant în teste și abordarea diferitelor sarcini conexe.",
    "TestInfrastructure_ABPSOLUTION_Description": "Șabloanele de pornire ABP vin pre-echipate cu proiecte de testare configurate, simplificând procesul pentru dvs. Aceasta înseamnă că, din prima zi, puteți începe cu ușurință să scrieți codul inițial al unității sau al testului de integrare, fără întârziere.",
    "CodingStandards&Training": "Standarde de codificare și instruire",
    "CodingStandards&Training_THEPROBLEM_Description": "După ce ați configurat soluția pentru dezvoltare, de obicei trebuie să învățați dezvoltatorii cum funcționează sistemul și cum să-l construiască folosind aceleași metode convenite. Chiar dacă le oferiți instruire, păstrarea documentației la zi poate fi dificilă. Pe măsură ce trece timpul, fiecare dezvoltator poate scrie cod în felul său, ceea ce face ca regulile de scriere a codului să devină diferite unele de altele.",
    "CodingStandards&Training_ABPSOLUTION_Description": "Soluția ABP este deja bine organizată și are explicații clare. Tutorialele și ghidurile pas cu pas vă arată exact cum să lucrați la un proiect ABP.",
    "KeepingYourSolutionUpToDate": "Țineți-vă soluția la zi",
    "KeepingYourSolutionUpToDate_THEPROBLEM_Description": "După ce începeți dezvoltarea, trebuie să urmăriți noile versiuni ale bibliotecilor pe care le utilizați pentru upgrade-uri și corecții.",
    "KeepingYourSolutionUpToDate_ABPSOLUTION_Description": "Actualizăm în mod regulat toate pachetele la cele mai recente versiuni și le testăm înainte de lansarea stabilă. Când actualizați Cadrul ABP, toate dependențele sale sunt actualizate la tehnologie de vârf.",
    "DRY": "Nu te repeta!",
    "DRY_Description": "Crearea unei soluții de bază necesită timp semnificativ și necesită o bună experiență arhitecturală. Totuși, acesta este doar începutul! Pe măsură ce începeți să dezvoltați, probabil că va trebui să scrieți o mulțime de cod repetitiv; ar fi grozav dacă toate acestea ar putea fi gestionate automat.",
    "DRY_Description2": "ABP automatizează și simplifică repetarea codului cât mai mult posibil, urmând principiul convenției asupra configurației. Cu toate acestea, nu vă limitează atunci când trebuie să treceți la treapta manuală. Controlul este întotdeauna în mâinile tale.",
    "Authentication": "Autentificare",
    "Authentication_THEPROBLEM_Description": "Conectare unică, integrare Active Directory / LDAP, integrare OpenIddict, autentificare socială, autentificare cu doi factori, uitare/resetare parolă, activare prin e-mail, înregistrare a unui utilizator nou, control al complexității parolei, blocarea contului la încercările eșuate, afișarea încercărilor de conectare nereușite... etc. Știm că toate aceste cerințe generice vă sunt familiare. Nu eşti singur!",
    "Authentication_ABPSOLUTION_Description": "ABP Framework și versiunea comercială oferă toate aceste lucruri standard pre-implementate pentru dvs. ca modul de cont reutilizabil. Doar activați și configurați ceea ce aveți nevoie.",
    "CrossCuttingConcerns": "Preocupări transversale",
    "CrossCuttingConcerns_THEPROBLEM_Description": "Preocupările transversale sunt logica repetată fundamentală care ar trebui implementată pentru fiecare caz de utilizare. Cateva exemple;",
    "CrossCuttingConcerns_THEPROBLEM_Description2": "Pornirea tranzacțiilor, angajarea succesului și derularea erorilor.",
    "CrossCuttingConcerns_THEPROBLEM_Description3": "Gestionarea și raportarea excepțiilor, returnarea unui răspuns de eroare adecvat clienților și gestionarea cazurilor de eroare din partea clientului.",
    "CrossCuttingConcerns_THEPROBLEM_Description4": "Implementarea autorizării și validării, returnarea răspunsurilor adecvate și gestionarea acestora din partea clientului.",
    "CrossCuttingConcerns_ABPSOLUTION_Description": "ABP Framework automatizează sau simplifică toate preocupările transversale comune. Scrieți doar codul care contează pentru afacerea dvs., iar ABP se ocupă de restul prin convenții.",
    "ArchitecturalInfrastructure": "Infrastructură arhitecturală",
    "ArchitecturalInfrastructure_THEPROBLEM_Description": "De obicei, trebuie să construiți o infrastructură pentru a vă implementa arhitectura în mod corespunzător. De exemplu, implementați în general modelul Repository. Definiți câteva clase de bază pentru a simplifica și a standardiza pentru a crea entități, servicii, controlere și alte obiecte.",
    "ArchitecturalInfrastructure_ABPSOLUTION_Description": "ABP Framework oferă toate acestea și multe altele din cutie. Este matur și bine documentat.",
    "EnterpriseApplicationRequirements": "Cerințe de aplicație pentru întreprinderi",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description": "Există o mulțime de cerințe pe care le implementați în mod repetat în fiecare aplicație de afaceri;",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description2": "Sistem de permisiuni detaliat și gestionarea permisiunilor pe interfața de utilizare pe baza rolurilor și utilizatorilor.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description3": "Scrierea jurnalelor de audit și a istoricelor entităților pentru a urmări când un utilizator modifică o înregistrare a bazei de date.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description4": "Ștergeți ușor entitățile dvs., astfel încât acestea să fie marcate ca șterse în loc să fie șterse fizic din baza de date și să filtreze automat entitățile șterse din interogările dvs.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description5": "Crearea de abstracții și wrapper-uri pentru a vă consuma API-urile backend din codul frontend.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description6": "Pune în coadă și executa joburi de fundal.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description7": "Gestionarea mai multor fusuri orare într-un sistem global.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description8": "Partajarea logicii de validare, localizare, autorizare între server și client.",
    "EnterpriseApplicationRequirements_ABPSOLUTION_Description": "ABP oferă o infrastructură pentru a implementa cu ușurință astfel de cerințe. Din nou, nu vă petreceți timpul prețios pentru a reimplementa toate acestea din nou și din nou.",
    "GeneratingInitialCode&Tooling": "Generarea codului inițial și a instrumentelor",
    "GeneratingInitialCode&Tooling_THEPROBLEM_Description": "Veți construi multe pagini similare într-o aplicație web tipică. Majoritatea dintre ei vor efectua operațiuni CRUD similare. Este foarte obositor și, de asemenea, predispus la erori să creezi în mod repetat astfel de pagini.",
    "GeneratingInitialCode&Tooling_ABPSOLUTION_Description": "<a href=\"/tools/suite\">ABP Suite</a> poate genera o pagină CRUD full-stack pentru entitățile tale în câteva secunde. Codul generat este stratificat și curat. Toate cerințele standard de validare și autorizare sunt implementate. În plus, sunt generate clase de test unitar. Odată ce obțineți o pagină care rulează complet, o puteți modifica în funcție de cerințele dvs. de afaceri.",
    "IntegratingTo3rdPartyLibrariesAndSystems": "Integrarea în biblioteci și sisteme terțe",
    "IntegratingTo3rdPartyLibrariesAndSystems_THEPROBLEM_Description": "Majoritatea bibliotecilor sunt proiectate ca nivel scăzut și, de obicei, faceți ceva pentru a le integra corect, fără a repeta același cod de integrare și configurare peste tot în soluția dvs. De exemplu, să presupunem că trebuie să utilizați RabbitMQ pentru a implementa magistrala de evenimente distribuită. Tot ce vrei să faci este; trimiteți un mesaj la o coadă și gestionați mesajele primite. Dar trebuie să înțelegeți tiparele de mesagerie, cozile și detaliile de schimb. Pentru a scrie cod eficient, trebuie să creați un pool pentru a gestiona conexiunile, clienții și canalele. De asemenea, trebuie să vă ocupați de excepții, mesaje ACK, reconectarea la RabbitMQ în caz de eșecuri și multe altele.",
    "IntegratingTo3rdPartyLibrariesAndSystems_ABPSOLUTION_Description": "De exemplu, integrarea ABP RabbitMQ Distributed Event Bus retrage toate aceste detalii. Trimiți și primiți mesaje fără forfotă. Trebuie să scrieți cod de nivel scăzut? Nicio problemă, poți oricând să faci asta. ABP nu vă limitează atunci când trebuie să utilizați funcții de nivel scăzut ale bibliotecii pe care o utilizați.",
    "WhyNotBuildYourOwnFramework?": "De ce nu vă construiți propriul cadru?",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description": "Toată infrastructura, chiar și în cel mai simplu mod, necesită mult timp pentru a construi, întreține și documenta. Devine mai mare în timp și devine greu să o mențineți în soluția dvs. Separarea acestora într-un proiect reutilizabil este punctul de plecare pentru construirea propriului cadru intern.",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description2": "Construirea, documentarea, instruirea și menținerea unui cadru intern este foarte dificilă. Dacă nu aveți o echipă de cadru cu experiență și dedicată, cadrul dvs. intern devine rapid un cod moștenit nedocumentat pe care nimeni nu îl mai poate înțelege și menține. Pe de altă parte, aceste cadre sunt în general dezvoltate de unul sau doi dezvoltatori din echipă. Și acești oameni devin un siloz de cunoștințe. Este bine pentru ei, dar rău pentru companie, deoarece ei sunt singurul punct de eșec al proiectului <a href=\"https://en.wikipedia.org/wiki/Single_point_of_failure\">-SPOF-</a> . Odată ce părăsesc compania, proiectul scade dramatic.",
    "WhyNotBuildYourOwnFramework_ABPSOLUTION_Description": "ABP Framework este un cadru de aplicații bazat pe comunitate, bine documentat, matur și generic. O echipă de dezvoltatori cu înaltă experiență lucrează din greu pentru a-l menține actualizat, ușor de înțeles și confortabil de utilizat. Folosirea unui cadru atât de stabil vă face să vă concentrați pe propriul cod de afaceri și să obțineți ajutor cu cadrul de la experți ori de câte ori aveți nevoie.",
    "ArchitecturalInfrastructure_Description": "Aplicațiile SaaS, sistemele modulare sau microservicii sunt cele mai utilizate modele de software pentru întreprinderi. Construirea unor astfel de sisteme nu necesită doar o bună înțelegere și experiență, dar necesită și o infrastructură software puternică. În caz contrar, veți depune un efort mare pentru a susține aceste detalii arhitecturale în baza de cod.",
    "Modularity": "Modularitate",
    "Modularity_THEPROBLEM_Description": "Construirea unui sistem cu adevărat modular nu este ușoară! Toate aspectele sistemului (bază de date, entități, API-uri, pagini/componente UI) pot fi împărțite în module, iar fiecare modul poate fi reutilizabil fără altele. ASP.NET Core simplu nu oferă o astfel de arhitectură modulară. Dacă aveți nevoie, ar trebui să vă gândiți la el de la zero.",
    "Modularity_ABPSOLUTION_Description": "Cadrul ABP sa născut pentru a fi o structură modulară de dezvoltare a aplicațiilor. Fiecare caracteristică a cadrului este dezvoltată pentru a fi compatibilă cu modularitatea. Documentația și ghidurile explică modul de dezvoltare a modulelor reutilizabile într-un mod standard.",
    "SaaSMultiTenancy": "SaaS / Multi-Tenancy",
    "SaaSMultiTenancy_THEPROBLEM_Description": "<a href=\"https://docs.abp.io/en/abp/latest/Multi-Tenancy\">Multi-Tenancy</a> este o modalitate comună de implementare a sistemelor SaaS. Cu toate acestea, implementarea unei infrastructuri consecvente multi-chiriași poate deveni complicată.",
    "SaaSMultiTenancy_ABPSOLUTION_Description": "ABP Framework oferă o infrastructură completă multi-chiriași și o complexitate abstractă din codul dvs. de afaceri. Codul aplicației dvs. va fi în mare parte conștient de multi-tenancy, în timp ce ABP Framework izolează automat baza de date, memoria cache și alte detalii ale chiriașilor unul de celălalt. Acceptă o bază de date unică, baza de date per chiriaș și abordări hibride. Configurați corect bibliotecile precum Microsoft Identity și OpenIddict, care în mod normal nu sunt compatibile cu mai multe locații.",
    "Microservices": "Microservicii",
    "Microservices_THEPROBLEM_Description": "Construirea unui sistem de microservicii necesită multe detalii de infrastructură: autentificarea și autorizarea aplicațiilor și microserviciilor și implementarea mesajelor asincrone și a modelelor de comunicare sincronă (Rest/GRPC) între microservicii sunt cele mai fundamentale probleme.",
    "Microservices_ABPSOLUTION_Description": "Cadrul ABP oferă servicii, <a href=\"https://docs.abp.io/en/abp/latest/Microservice-Architecture\" target=\"_blank\">ghiduri</a> și exemple pentru a vă ajuta să implementați soluția de microservicii folosind instrumentele standard din industrie.",
    "Microservices_ABPSOLUTION_Description2": "ABP Commercial face chiar un pas mai departe și oferă un <a href=\"https://docs.abp.io/en/commercial/latest/startup-templates/microservice/index\" target=\"_blank\">șablon complet de pornire</a> pentru a pune în funcțiune soluția dvs. de microservicii.",
    "PreBuiltModules": "Module prefabricate",
    "PreBuiltModules_THEPROBLEM_Description": "Toți avem cerințe de afaceri similare, dar ușor diferite. Cu toate acestea, cu toții ar trebui să reinventăm roata, deoarece codul nimănui nu poate funcționa direct în soluția noastră. Toate sunt părți încorporate ale unei soluții mai mari.",
    "PreBuiltModules_ABPSOLUTION_Description": "<a href=\"/modules\">Modulele</a> comerciale ABP oferă o mulțime de module de aplicație reutilizabile, cum ar fi plata, chatul, gestionarea fișierelor, raportarea jurnalului de audit... etc. Toate aceste module sunt ușor de instalat în soluția dvs. și funcționează direct. Adăugăm în mod constant mai multe module.",
    "PreBuiltModules_ABPSOLUTION_Description2": "Toate modulele sunt proiectate ca personalizabile pentru cerințele dvs. de afaceri. Dacă aveți nevoie de control complet, puteți descărca codul sursă complet al oricărui modul și puteți personaliza complet în funcție de cerințele dvs. specifice de afaceri.",
    "ABPCommunity": "Comunitatea ABP",
    "ABPCommunity_Description": "În cele din urmă, a fi într-o comunitate mare în care toată lumea urmează stiluri și principii de codare similare și împărtășește o infrastructură comună aduce putere atunci când aveți probleme sau aveți nevoie de ajutor cu deciziile de proiectare. Deoarece scriem cod în mod similar, ne putem ajuta reciproc mult mai bine. ABP este un proiect susținut de comunitate cu peste 10.000 stele pe GitHub.",
    "ABPCommunity_Description2": "Este ușor să partajați codul sau chiar bibliotecile reutilizabile între dezvoltatorii ABP. Un fragment de cod care funcționează pentru dvs. va funcționa și pentru alții. Există o mulțime de mostre și tutoriale pe care le puteți implementa direct pentru aplicația dvs.",
    "ABPCommunity_Description3": "Când angajați un dezvoltator care a lucrat înainte cu arhitectura ABP, vă va înțelege imediat soluția și va începe dezvoltarea într-un timp foarte scurt.",
    "WhyAbpIo_Page_Title": "De ce platforma ABP.IO?",
    "AbpStudio_Page_Title": "ABP Studio",
    "CampaignInfo": "Cumpărați o licență nouă sau reînnoiți-vă licența existentă și <span class=\"text-white\">obțineți încă 2 luni</span> fără costuri suplimentare! Această ofertă este valabilă pentru toate planurile de licență. Asigurați-vă că profitați de această promoție pe perioadă limitată pentru a vă extinde accesul la funcții și upgrade-uri premium.",
    "HurryUpLastDay": "Grăbiţi-vă! Ultima zi: {0}",
    "CreatingCRUDPagesWithABPSuite": "Crearea de pagini CRUD cu ABP Suite",
    "Testimonials": "Mărturii",
    "MultipleYearDiscount": "Reducere pentru mai mulți ani",
    "CampaignDiscountText": "Reducere de Vinerea Neagră",
    "CampaignDiscountName": "Vinerea Neagra",
    "CampaignName:BlackFriday": "Vinerea Neagra"
  }
}