{
  "culture": "ru",
  "texts": {
    "OrganizationManagement": "Управление организацией",
    "OrganizationList": "Список организаций",
    "Volo.AbpIo.Commercial:010003": "Вы не являетесь владельцем этой организации!",
    "OrganizationNotFoundMessage": "Не найдено ни одной организации!",
    "DeveloperCount": "Выделенные / всего разработчиков",
    "QuestionCount": "Остающиеся / всего вопросов",
    "Unlimited": "Безлимитный",
    "Owners": "Владельцы",
    "AddMember": "Добавить члена",
    "AddOwner": "Добавить владельца",
    "AddDeveloper": "Добавить разработчика",
    "UserName": "Имя пользователя",
    "Name": "Имя",
    "EmailAddress": "Адрес электронной почты",
    "Developers": "Разработчики",
    "LicenseType": "Тип лицензии",
    "Manage": "Управлять",
    "StartDate": "Дата начала",
    "EndDate": "Дата окончания",
    "Modules": "Модули",
    "LicenseExtendMessage": "Срок действия вашей лицензии продлен до {0}",
    "LicenseUpgradeMessage": "Ваша лицензия обновлена до {0}",
    "LicenseExtendAdnUpgradeMessage": "Ваша лицензия была продлена до {0}, а ваш лицензионный план повышен до {1}.",
    "LicenseAddDeveloperMessage": "К вашей лицензии добавлено {0} разработчиков",
    "Volo.AbpIo.Commercial:010004": "Не могу найти указанного пользователя! Пользователь должен быть уже зарегистрирован.",
    "MyOrganizations": "Мои организации",
    "ApiKey": "Ключ API",
    "UserNameNotFound": "Нет пользователя с именем пользователя {0}",
    "SuccessfullyAddedToNewsletter": "Спасибо за подписку на нашу рассылку!",
    "MyProfile": "Мой профайл",
    "EmailNotValid": "Пожалуйста, введите действительный адрес электронной почты.",
    "JoinOurMarketingNewsletter": "Подпишитесь на нашу маркетинговую рассылку",
    "WouldLikeToReceiveMarketingMaterials": "Я хочу получать маркетинговые материалы, такие как предложения по продуктам и специальные предложения.",
    "StartUsingYourLicenseNow": "Начните использовать свою лицензию прямо сейчас!",
    "WelcomePage": "Страница приветствия",
    "UnsubscriptionExpireEmail": "Отказаться от подписки на электронные письма с напоминанием об истечении срока действия лицензии",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Эта подписка по электронной почте содержит только напоминание о дате истечения срока действия лицензии.",
    "UnsubscribeFromLicenseExpireEmails": "Если вы не хотите получать электронные письма о дате истечения срока действия лицензии, вы можете отказаться от подписки в любое время.",
    "Unsubscribe": "Отписаться",
    "NotOrganizationMember": "Вы не являетесь членом какой-либо организации.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Подписка успешно отменена",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Вы больше не будете получать электронные письма с напоминанием об истечении срока действия лицензии.",
    "IndexPageHeroSection": "<span class = \"first-line\"> Полная </span> <span class = \"second-line\"> платформа веб-разработки </span> <span class = \"third-line\"> встроенная <img src = \"{0}\" width = \"110\" class = \"ml-1\" /> каркас </span>",
    "AbpCommercialShortDescription": "ABP Commercial предоставляет готовые модули приложений, инструменты для быстрой разработки приложений, профессиональные темы пользовательского интерфейса, поддержку премиум-класса и многое другое.",
    "LiveDemo": "Живая демонстрация",
    "GetLicence": "Получить лицензию",
    "Application": "заявка",
    "StartupTemplates": "Шаблоны запуска",
    "Startup": "Запускать",
    "Templates": "Шаблоны",
    "Developer": "Разработчик",
    "Tools": "Инструменты",
    "Premium": "Премиум",
    "PremiumSupport": "Премиум-поддержка",
    "PremiumForumSupport": "Поддержка премиум-форума",
    "UI": "UI",
    "Themes": "Темы",
    "JoinOurNewsletter": "Подпишитесь на нашу рассылку новостей",
    "Send": "послать",
    "Learn": "Учиться",
    "AdditionalServices": "Дополнительные услуги",
    "WhatIsABPFramework": "ЧТО ТАКОЕ ОСНОВА ABP?",
    "OpenSourceBaseFramework": "Базовая платформа с открытым исходным кодом",
    "ABPFrameworkExplanation": "<p class = \"lead\"> ABP Commercial основана на ABP Framework, платформе веб-приложений с открытым исходным кодом и сообществом для ASP.NET Core. </p> <p> ABP Framework предоставляет отличную инфраструктуру для написания поддерживаемых, расширяемых и тестируемый код с лучшими практиками. </p> <p> Создан и интегрирован с популярными инструментами, которые вы уже знаете. Низкая кривая обучения, легкая адаптация, комфортное развитие. </p>",
    "Modular": "Модульный",
    "MicroserviceCompatible": "Совместимость с микросервисами",
    "DomainDrivenDesignInfrastructure": "Инфраструктура проектирования на основе доменов",
    "MultiTenancy": "Мульти аренды",
    "DistributedMessaging": "Распределенный обмен сообщениями",
    "DynamicProxying": "Динамическое проксирование",
    "BackgroundJobs": "Фоновые задания",
    "AuditLogging": "Ведение журнала аудита",
    "BLOBStoring": "Хранение BLOB",
    "BundlingMinification": "Объединение и минификация",
    "AdvancedLocalization": "Расширенная локализация",
    "ManyMore": "Многое другое",
    "ExploreTheABPFramework": "Изучите ABP Framework",
    "WhyUseTheABPCommercial": "Зачем использовать рекламу ABP?",
    "WhyUseTheABPCommercialExplanation": "<p class = \"lead mt- 5\"> Создание веб-приложений корпоративного уровня может быть сложным и трудоемким. </p> <p> ABP Commercial предлагает идеальную базовую инфраструктуру, необходимую для всех современных ASP.NET Core корпоративного уровня основанные на решениях. Прямо от проектирования до развертывания весь цикл разработки обеспечивается встроенными функциями и модулями ABP. </p>",
    "StartupTemplatesShortDescription": "Шаблоны запуска позволяют вам быстро приступить к работе над проектом за несколько секунд.",
    "UIFrameworksOptions": "Параметры UI-фреймворков;",
    "DatabaseProviderOptions": "Параметры поставщика базы данных;",
    "PreBuiltApplicationModules": "Готовые модули приложений",
    "PreBuiltApplicationModulesShortDescription": "Наиболее распространенные требования к приложениям уже разработаны для вас в виде модулей многократного использования.",
    "Account": "Счет",
    "Blogging": "Ведение блога",
    "Identity": "Личность",
    "IdentityServer": "Сервер идентификации",
    "Saas": "Саас",
    "LanguageManagement": "Управление языками",
    "TextTemplateManagement": "Управление текстовыми шаблонами",
    "See All Modules": "SeeAllModules",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "ABP Suite - это дополнительный инструмент к ABP Commercial.",
    "AbpSuiteExplanation": "Он позволяет создавать веб-страницы за считанные минуты. Это глобальный инструмент .NET Core, который можно установить из командной строки. Он может создавать новое решение ABP, генерировать страницы CRUD из базы данных для внешнего интерфейса.",
    "Details": "Подробности",
    "LeptonTheme": "Лептон Тема",
    "ProfessionalModernUIThemes": "Профессиональные современные темы пользовательского интерфейса",
    "LeptonThemeExplanation": "Lepton предоставляет широкий спектр тем администрирования Bootstrap, которые служат прочной основой для любого проекта, требующего панели администратора.",
    "DefaultTheme": "Тема по умолчанию",
    "MaterialTheme": "Материал Тема",
    "Default2Theme": "Тема по умолчанию 2",
    "DarkTheme": "Темная тема",
    "DarkBlueTheme": "Темно-синяя тема",
    "LightTheme": "Светлая тема",
    "ProudToWorkWith": "Горжусь работать с",
    "OurConsumers": "Тысячи предприятий и разработчиков более чем в 70 странах мира полагаются на ABP Commercial.",
    "JoinOurConsumers": "Присоединяйтесь к ним и быстро создавайте потрясающие продукты.",
    "AdditionalServicesExplanation": "Вам нужны дополнительные или индивидуальные услуги? <strong> Мы и наши партнеры можем предоставить; </strong>",
    "CustomProjectDevelopment": "Разработка индивидуального проекта",
    "CustomProjectDevelopmentExplanation": "Специализированные разработчики для ваших индивидуальных проектов.",
    "PortingExistingProjects": "Перенос существующих проектов",
    "PortingExistingProjectsExplanation": "Перенос ваших старых проектов на платформу ABP.",
    "LiveSupport": "Живая поддержка",
    "LiveSupportExplanation": "Возможность удаленной поддержки в реальном времени, когда вам это нужно.",
    "Training": "Обучение",
    "TrainingExplanation": "Специальное обучение для ваших разработчиков.",
    "OnBoarding": "Адаптация",
    "OnBoardingExplanation": "Помогите настроить среду разработки, CI и CD.",
    "PrioritizedTechnicalSupport": "Приоритетная техническая поддержка",
    "PremiumSupportExplanation": "Помимо отличной поддержки платформы ABP сообществом, наша команда поддержки отвечает на технические вопросы и проблемы коммерческих пользователей с высоким приоритетом.",
    "SeeTheSupportOptions": "См. Варианты поддержки",
    "Contact": "Контакт",
    "TellUsWhatYouNeed": "Скажите нам, что вам нужно.",
    "YourMessage": "Твое сообщение",
    "YourFullName": "Ваше полное имя",
    "EmailField": "Адрес электронной почты",
    "YourEmailAddress": "Ваш адрес электронной почты",
    "HowMayWeHelpYou": "Как мы можем Вам помочь?",
    "SendMessage": "Отправить сообщение",
    "Success": "Успех",
    "WeWillReplyYou": "Мы получили ваше сообщение и скоро свяжемся с вами.",
    "GoHome": "Иди домой",
    "CreateLiveDemo": "Создать живую демонстрацию",
    "RegisterToTheNewsletter": "Подпишитесь на рассылку новостей, чтобы получать информацию о ABP.IO, в том числе о новых выпусках и т. Д.",
    "EnterYourEmailOrLogin": "Введите свой адрес электронной почты, чтобы создать демоверсию, или <a href=\"{0}\"> войдите </a>, используя существующую учетную запись.",
    "ApplicationTemplate": "Шаблон приложения",
    "ApplicationTemplateExplanation": "Шаблон запуска приложения используется для создания нового веб-приложения.",
    "EfCoreProvider": "Entity Framework (поддерживает SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\"> и другие </a>)",
    "AlreadyIncludedInTemplateModules": "В этот шаблон уже включены и настроены следующие модули:",
    "ApplicationTemplateArchitecture": "Этот шаблон приложения также поддерживает многоуровневую архитектуру, в которой уровень пользовательского интерфейса, уровень API и служба аутентификации физически разделены.",
    "SeeTheGuideOrGoToTheLiveDemo": "См. Руководство разработчика для получения технической информации об этом шаблоне или перейдите к действующей демонстрации.",
    "DeveloperGuide": "Руководство разработчика",
    "ModuleTemplate": "Шаблон модуля",
    "ModuleTemplateExplanation1": "Вы хотите создать модуль и повторно использовать его в разных приложениях? Этот шаблон запуска подготавливает все для начала создания многоразового <strong> модуля приложения </strong> или <strong> микросервиса </strong>.",
    "ModuleTemplateExplanation2": "<p> Вы можете поддерживать одну или несколько платформ пользовательского интерфейса, одного или нескольких поставщиков баз данных для одного модуля. Шаблон запуска настроен для запуска и <strong> тестирования вашего модуля </strong> в минимальном приложении в дополнение к инфраструктуре модульного и интеграционного тестирования. </p> <p> См. техническую информацию об этом шаблоне в руководстве разработчика. </p>",
    "WithAllStyleOptions": "со всеми вариантами стиля",
    "Demo": "Демо",
    "SeeAllModules": "Просмотреть все модули",
    "ABPCLIExplanation": "ABP CLI (интерфейс командной строки) - это инструмент командной строки для выполнения некоторых общих операций для решений на основе ABP.",
    "ABPSuiteEasilyCURD": "ABP Suite - это инструмент, который позволяет легко создавать CRUD-страницы.",
    "WeAreHereToHelp": "Мы здесь, чтобы <span class = \"zero-text\"> помочь </span>",
    "BrowseOrAskQuestion": "Вы можете просмотреть разделы справки или выполнить поиск по часто задаваемым вопросам или задать нам вопрос, используя <a href=\"{0}\" class=\"text-success\"> контактную форму </a>.",
    "SearchQuestionPlaceholder": "Искать в часто задаваемых вопросах",
    "WhatIsTheABPCommercial": "Что такое реклама ABP?",
    "WhatAreDifferencesThanAbpFramework": "В чем разница между ABP Framework с открытым исходным кодом и ABP Commercial?",
    "ABPCommercialExplanation": "ABP Commercial - это набор дополнительных модулей, инструментов, тем и сервисов, созданных на основе <a target=\"_blank\" href=\"{0}\"> платформы ABP </a> с открытым исходным кодом. ABP Commercial разрабатывается и поддерживается той же командой, что и структура ABP.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\"> ABP framework </a> - это модульная, тематическая и совместимая с микросервисами платформа разработки приложений для ASP.NET Core. Он предоставляет полную архитектуру и мощную инфраструктуру, чтобы вы могли сосредоточиться на собственном бизнес-коде, а не повторяться в каждом новом проекте. Он основан на лучших практиках разработки программного обеспечения и популярных инструментах, которые вы уже знаете. </p> <p> Платформа ABP полностью бесплатна, имеет открытый исходный код и управляется сообществом. Он также предоставляет бесплатную тему и некоторые готовые модули (например, управление идентификацией и управление арендаторами). </p>",
    "VisitTheFrameworkVSCommercialDocument": "Перейдите по следующей ссылке, чтобы получить дополнительную информацию <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial добавляет следующие преимущества поверх структуры ABP;",
    "Professional": "Профессиональный",
    "UIThemes": "Темы пользовательского интерфейса",
    "EnterpriseModules": "Готовые к работе, многофункциональные, предварительно созданные <a href=\"{0}\"> модули приложений </a> (например, управление Identity Server, управление SaaS, управление языками)",
    "ToolingToSupport": "Инструменты для поддержки продуктивности разработки (например, <a href=\"{0}\"> ABP Suite </a>)",
    "PremiumSupportLink": "Премиум <a href=\"{0}\" target=\"_blank\"> поддержка </a>",
    "WhatDoIDownloadABPCommercial": "Что я загружаю при покупке рекламы ABP?",
    "CreateUnlimitedSolutions": "Купив коммерческую лицензию ABP, вы сможете создавать неограниченное количество решений, как описано в документе <a href=\"{0}\"> Начало работы </a>.",
    "ABPCommercialSolutionExplanation": "Когда вы создаете новое приложение, вы получаете решение Visual Studio (шаблон запуска) на основе ваших предпочтений. В загруженном решении уже установлены и настроены коммерческие модули и темы. Вы можете удалить предустановленный модуль или добавить другой модуль, если хотите. Все модули и темы по умолчанию используются как пакеты NuGet / NPM.",
    "StartDevelopWithTutorials": "Загруженное решение хорошо продумано и задокументировано. Вы можете начать разработку собственного бизнес-кода на его основе, следуя <a href=\"{0}\"> руководствам </a>.",
    "TryTheCommercialDemo": "Вы можете попробовать <a href=\"{0}\"> демонстрацию </a>, чтобы увидеть образец приложения, созданного с использованием шаблона запуска ABP Commercial.",
    "HowManyProducts": "Сколько различных продуктов / решений я могу создать с помощью рекламы ABP?",
    "HowManyProductsExplanation": "Нет ограничений на создание ABP-проекта. Вы можете создавать сколько угодно проектов, разрабатывать и загружать их на разные серверы.",
    "HowManyDevelopers": "Сколько разработчиков могут работать над рекламным роликом ABP?",
    "HowManyDevelopersExplanation": "Коммерческие лицензии ABP выдаются на одного разработчика. Разные типы лицензий имеют разные ограничения для разработчиков. Однако вы можете добавить больше разработчиков к любому типу лицензии, когда вам нужно. На странице <a href=\"{0}\"> цен </a> указаны типы лицензий, ограничения для разработчиков и дополнительные расходы для разработчиков.",
    "ChangingLicenseType": "Могу ли я обновить свой тип лицензии позже?",
    "ChangingLicenseTypeExplanation": "Вы можете перейти на лицензию более высокого уровня, заплатив разницу в течение срока действия действующей лицензии. При обновлении до более высокого лицензионного плана вы получаете преимущества нового плана, но обновление лицензии не меняет дату истечения срока действия лицензии. Кроме того, вы также можете добавить новые рабочие места разработчика к существующей лицензии, см. «Сколько разработчиков может работать с ABP Commercial?»",
    "LicenseExtendUpgradeDiff": "В чем разница между продлением лицензии и обновлением?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Extending:</strong> By extending/renewing your license, you will continue to get premium support and get major updates for the modules and themes. Besides, you will be able to continue creating new projects. And you will still be able to use ABP Suite which speeds up your development.<hr/><strong>Upgrading:</strong> By upgrading your license, you will promote to a higher license plan which will allow you to get additional benefits. See the <a href=\"/pricing\">license comparison table</a> to check the differences between the license plans.<strong>On the other hand, when you upgrade, your license expiry date will not change!</strong>To extend your license end date, you need to extend your license.",
    "LicenseRenewalCost": "Какова стоимость продления лицензии через 1 год?",
    "LicenseRenewalCostExplanation": "Скорость продления (продления) всех бессрочных коммерческих лицензий ABP составляет {0} от стоимости лицензии. Стоимость продления стандартной групповой лицензии составляет {1} долл. США, стандартной бизнес-лицензии составляет {2} долл. США, а стандартной корпоративной лицензии составляет {3} долл. США. Если вы уже являетесь клиентом, <a href='{4}' target='_blank'> войдите в свою учетную запись </a>, чтобы просмотреть доступные цены на продление.",
    "HowDoIRenewMyLicense": "Как мне продлить лицензию?",
    "HowDoIRenewMyLicenseExplanation": "Вы можете продлить лицензию, перейдя на <a href='{0}' target='_blank'> страницу управления организацией </a>. Чтобы воспользоваться нашими скидками на раннее продление, убедитесь, что вы продлили подписку до истечения срока действия лицензии. Однако не беспокойтесь о том, что не знаете, когда закроется ваша возможность раннего продления. Вы получите 3 напоминания по электронной почте до истечения срока подписки. Мы отправим их за 30 дней, 7 дней и 1 день до истечения срока.",
    "IsSourceCodeIncluded": "Включает ли моя лицензия исходный код коммерческих модулей и тем?",
    "IsSourceCodeIncludedExplanation1": "Зависит от типа приобретенной лицензии:",
    "IsSourceCodeIncludedExplanation2": "<strong> Команда </strong>: ваше решение использует модули и темы как пакеты NuGet и NPM. Он не включает их исходный код. Таким образом, вы можете легко обновлять эти модули и темы всякий раз, когда доступна новая версия. Однако вы не можете получить исходный код модулей и тем.",
    "IsSourceCodeIncludedExplanation3": "<strong> Для бизнеса / предприятия </strong>: в дополнение к командной лицензии вы можете загрузить исходный код любого модуля или темы, которые вам нужны. Вы даже можете удалить ссылки на пакеты NuGet / NPM для определенного модуля и добавить его исходный код непосредственно в свое решение, чтобы полностью изменить его.",
    "IsSourceCodeIncludedExplanation4": "<p> Включение исходного кода модуля в ваше решение дает вам максимальную свободу настройки этого модуля. Однако тогда будет невозможно автоматически обновить модуль при выпуске новой версии. </p> <p> Ни одна из лицензий не включает исходный код ABP Suite, который является внешним инструментом, который генерирует код для вас и помогает к вашей разработке. </p> <p> См. <a href=\"{0}\"> страницу с ценами </a>, чтобы узнать о других различиях между типами лицензий. </p>",
    "ChangingDevelopers": "Могу ли я сменить зарегистрированных разработчиков моей организации в будущем?",
    "ChangingDevelopersExplanation": "Помимо добавления новых разработчиков к вашей лицензии, вы также можете изменить существующих разработчиков (вы можете удалить разработчика и добавить нового на то же место) без каких-либо дополнительных затрат.",
    "WhatHappensWhenLicenseEnds": "Что произойдет, когда закончится срок моей лицензии?",
    "WhatHappensWhenLicenseEndsExplanation1": "Тип коммерческой лицензии ABP - <a href=\"{0}\" target=\"_blank\"> бессрочная лицензия </a>. По истечении срока действия лицензии вы можете продолжить разработку своего проекта. И вы не обязаны продлевать лицензию. Ваша лицензия поставляется с годовым планом обновлений и поддержки. Чтобы продолжать получать новые функции, улучшения производительности, исправления ошибок, поддержку и продолжать использовать ABP Suite, не забудьте ежегодно продлевать свой план. Когда срок действия вашей лицензии истечет, вы не сможете получить больше следующих преимуществ;",
    "WhatHappensWhenLicenseEndsExplanation2": "Вы не можете создавать новые решения с помощью ABP Commercial, но вы можете продолжать разрабатывать существующие приложения бесконечно.",
    "WhatHappensWhenLicenseEndsExplanation3": "Вы сможете получать обновления для модулей и тем в вашей ОСНОВНОЙ версии. Например; если вы используете модуль v3.2.0, вы все равно можете получать обновления для v3.x.x (v3.3.0, v3.5.2 ... и т. д.) этого модуля. Но вы не можете получать обновления для следующей основной версии (например, v4.x, v5.x)",
    "WhatHappensWhenLicenseEndsExplanation4": "Вы не можете устанавливать новые модули и темы, добавленные на коммерческую платформу ABP, после истечения срока действия лицензии.",
    "WhatHappensWhenLicenseEndsExplanation5": "Вы не можете использовать ABP Suite.",
    "WhatHappensWhenLicenseEndsExplanation6": "Вы больше не можете получать <a href=\"{0}\"> премиум-поддержку </a>.",
    "WhatHappensWhenLicenseEndsExplanation7": "Вы можете продлить подписку, если хотите и дальше пользоваться этими преимуществами. Если вы продлеваете подписку в течение 1 месяца после истечения срока действия лицензии, применяется скидка 20%.",
    "WhenShouldIRenewMyLicense": "Когда мне следует продлить лицензию?",
    "WhenShouldIRenewMyLicenseExplanation1": "Если вы продлеваете лицензию в течение <strong> 1 месяца </strong> после истечения срока действия лицензии, применяется скидка 20%.",
    "WhenShouldIRenewMyLicenseExplanation2": "Если вы продлите свою лицензию через 1 месяц с даты истечения срока действия лицензии, цена продления будет такой же, как цена покупки лицензии, и не будет скидки на продление.",
    "TrialPlan": "У вас есть пробный план?",
    "TrialPlanExplanation": "На данный момент у ABP Commercial нет пробного плана. Для командных лицензий мы предоставляем 30-дневную гарантию возврата денег. Вы можете просто запросить возврат в течение первых 30 дней. Для лицензий Business и Enterprise мы возвращаем 60% в течение 30 дней. Это связано с тем, что лицензии Business и Enterprise включают полный исходный код всех модулей и тем.",
    "DoYouAcceptBankWireTransfer": "Вы принимаете банковский перевод?",
    "DoYouAcceptBankWireTransferExplanation": "Да, мы принимаем банковский перевод. <br /> После отправки платы за лицензию банковским переводом отправьте нам по электронной почте info@abp.io квитанцию и тип запрошенной лицензии. Информация о нашем международном банковском счете:",
    "HowToUpgrade": "Как обновить существующие приложения, когда доступна новая версия?",
    "HowToUpgradeExplanation1": "Когда вы создаете новое приложение с помощью ABP Commercial, все модули и тема используются как пакеты NuGet и NPM. Таким образом, вы можете легко обновить пакеты, когда станет доступна новая версия.",
    "HowToUpgradeExplanation2": "Помимо стандартных обновлений NuGet / NPM, <a href=\"{0}\"> ABP CLI </a> предоставляет команду обновления, которая автоматически находит и обновляет все связанные с ABP пакеты в вашем решении.",
    "DatabaseSupport": "Какие системы баз данных поддерживаются?",
    "DatabaseSupportExplanation": "Сама ABP Framework не зависит от базы данных и по своей природе может работать с любым поставщиком базы данных. См. <a href=\"{0}\" target=\"_blank\"> документ о доступе к данным </a> для получения списка текущих внедренных поставщиков.",
    "UISupport": "Какие фреймворки пользовательского интерфейса поддерживаются?",
    "Supported": "Поддерживается",
    "UISupportExplanation": "Сама ABP Framework не зависит от инфраструктуры пользовательского интерфейса и может работать с любой структурой пользовательского интерфейса. Однако не для всех фреймворков пользовательского интерфейса были реализованы шаблоны запуска, пользовательские интерфейсы модулей и темы. Актуальный список параметров пользовательского интерфейса см. В <a href=\"{0}\"> документе по началу работы </a>.",
    "MicroserviceSupport": "Поддерживает ли он микросервисную архитектуру?",
    "MicroserviceSupportExplanation1": "Одна из основных целей структуры ABP - предоставить удобную инфраструктуру для создания микросервисных решений. См. Документ <a href=\"{0}\"> микросервисная архитектура </a>, чтобы понять, как это помогает создавать системы микросервисов.",
    "MicroserviceSupportExplanation2": "Все коммерческие модули ABP разработаны для поддержки сценариев развертывания микросервисов (с собственным API и базой данных) в соответствии с документом <a href=\"{0}\"> передовой практики разработки модулей </a>.",
    "MicroserviceSupportExplanation3": "Мы предоставляем образец <a href=\"{0}\"> демонстрационного решения микросервисов </a>, который демонстрирует реализацию архитектуры микросервисов, чтобы помочь вам создать собственное решение.",
    "MicroserviceSupportExplanation4": "Итак, краткий ответ: «<strong> да, он поддерживает микросервисную архитектуру </strong>».",
    "MicroserviceSupportExplanation5": "Тем не менее, система микросервисов - это решение, и каждое решение будет иметь разные требования, топологию сети, сценарии связи, возможности аутентификации, решения о разделении / совместном использовании базы данных, конфигурации времени выполнения, интеграцию сторонних систем и многое другое.",
    "MicroserviceSupportExplanation6": "ABP Framework и ABP Commercial предоставляют инфраструктуру для сценариев микросервисов, совместимые с микросервисами модули, образцы и документацию, которые помогут вам создать собственное решение. Но не ожидайте, что вы сразу загрузите готовое решение вашей мечты. Вам нужно будет понять это и собрать некоторые части вместе в соответствии с вашими требованиями.",
    "WhereCanIDownloadSourceCode": "Где я могу скачать исходный код?",
    "WhereCanIDownloadSourceCodeExplanation": "Вы можете загрузить исходный код всех модулей ABP, пакетов и тем Angular через ABP Suite или ABP CLI. См. <a href=\"{0}\"> Как загрузить исходный код? </a>",
    "ComputerLimitation": "На скольких компьютерах может войти разработчик при разработке ABP?",
    "ComputerLimitationExplanation": "Мы специально разрешаем использование <strong> {0} компьютеров </strong> на одного физического лица / лицензированного разработчика. Всякий раз, когда разработчику необходимо разработать коммерческие продукты ABP на третьем компьютере, следует отправить электронное письмо на адрес license@abp.io с объяснением ситуации, и затем мы сделаем соответствующее распределение в нашей системе.",
    "RefundPolicy": "Есть ли у вас политика возврата?",
    "RefundPolicyExplanation": "Вы можете запросить возврат средств в течение <strong> 30 дней </strong> с момента покупки лицензии. Типы лицензий Business и Enterprise имеют возможность загрузки исходного кода, поэтому возврат денежных средств недоступен для Business и Enterprise (а также для любых лицензий, которые включают право на получение исходного кода). Кроме того, не производится возврат средств за продление и покупку второй лицензии.",
    "HowCanIRefundVat": "Как я могу вернуть НДС?",
    "HowCanIRefundVatExplanation1": "Если вы производили оплату с помощью 2Checkout, вы можете вернуть НДС через свою учетную запись 2Checkout:",
    "HowCanIRefundVatExplanation2": "Войдите в свою учетную запись <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\"> 2Checkout </a>.",
    "HowCanIRefundVatExplanation3": "Найдите соответствующий заказ и нажмите «Возвратить просроченный НДС» (введите свой идентификатор плательщика НДС).",
    "HowCanIGetMyInvoice": "Как я могу получить счет?",
    "HowCanIGetMyInvoiceExplanation": "There are 2 payment gateways for purchasing a license: Iyzico and 2Checkout. If you purchase your license through the 2Checkout gateway, it sends the PDF invoice to your email address, see <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How-do-invoices-work\">2Checkout invoicing.</a> If you purchase through the Iyzico gateway, with custom purchase link or via bank wire transfer, we will prepare and send your invoice. You can request or download your invoice from the <a href=\"{0}\">organization management page</a>. Before contacting us for the invoice, check your organization management page!",
    "Forum": "Форум",
    "SupportExplanation": "Коммерческие лицензии ABP обеспечивают поддержку на форуме премиум-класса командой, состоящей из экспертов по ABP Framework.",
    "PrivateTicket": "Частный билет",
    "PrivateTicketExplanation": "Enterprise License также включает частную поддержку с электронной почтой и системой тикетов.",
    "AbpSuiteExplanation1": "ABP Suite позволяет создавать веб-страницы за считанные минуты. Это глобальный инструмент .NET Core, который можно установить из командной строки.",
    "AbpSuiteExplanation2": "Он может создавать новое решение ABP, генерировать страницы CRUD из базы данных для внешнего интерфейса. Технический обзор см. В <a href=\"{0}\"> документе </a>",
    "FastEasy": "Быстро и легко",
    "AbpSuiteExplanation3": "ABP Suite позволяет легко создавать страницы CRUD. Вам просто нужно определить свою сущность и ее свойства, а остальное ABP Suite сделает за вас! ABP Suite сгенерирует весь необходимый код для вашей CRUD-страницы за несколько секунд. Он поддерживает пользовательские интерфейсы Angular, MVC и Blazor.",
    "RichOptions": "Богатые возможности",
    "AbpSuiteExplanation4": "ABP Suite поддерживает несколько параметров пользовательского интерфейса, например <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\"> Razor Pages </a> и <a href = \"https: / /angular.io\">Angular </a>. Он также поддерживает несколько баз данных, таких как <a href=\"https://www.mongodb.com\"> MongoDB </a>, и все базы данных, поддерживаемые <strong> EntityFramework Core < / strong> (MS SQL Server, Oracle, MySql, PostgreSQL и <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\"> другие </a>).",
    "AbpSuiteExplanation5": "Хорошо то, что вам не нужно беспокоиться об этих вариантах. ABP Suite понимает тип вашего проекта, генерирует код для вашего проекта и помещает сгенерированный код в нужное место в вашем проекте.",
    "SourceCode": "Исходный код",
    "AbpSuiteExplanation6": "ABP Suite генерирует исходный код для вас! Он не генерирует волшебные файлы для создания веб-страницы. ABP Suite генерирует исходный код для <strong> Entity, Repository, Application Service, Code First Migration, JavaScript / TypeScript и CSHTML / HTML </strong>, а также необходимых интерфейсов. ABP Suite также генерирует код в соответствии с <strong> лучшими практиками </strong> разработки программного обеспечения, поэтому вам не нужно беспокоиться о качестве сгенерированного кода.",
    "AbpSuiteExplanation7": "Поскольку у вас есть исходный код строительных блоков сгенерированной страницы CRUD на правильных уровнях приложения, вы можете легко изменить исходный код и внедрить свою пользовательскую / бизнес-логику в сгенерированный код.",
    "CrossPlatform": "Кроссплатформенный",
    "AbpSuiteExplanation8": "ABP Suite построен на .NET Core и является кроссплатформенным. Он работает как веб-приложение на вашем локальном компьютере. Вы можете запустить его в <strong> Windows </strong>, <strong> Mac </strong> и <strong> Linux </strong>.",
    "OtherFeatures": "Другие особенности",
    "OtherFeatures1": "Легко обновляет пакеты <strong> NuGet </strong> и <strong> NPM </strong> в вашем решении.",
    "OtherFeatures2": "Восстанавливает уже созданные страницы с нуля.",
    "OtherFeatures3": "Создает новые решения",
    "ThanksForCreatingProject": "Спасибо за создание вашего проекта!",
    "HotToRunSolution": "Как запустить ваше решение?",
    "HotToRunSolutionExplanation": "См. Документ «Начало работы», чтобы узнать, как настроить и запустить решение.",
    "GettingStarted": "Начиная",
    "WebAppDevTutorial": "Руководство разработчика веб-приложений",
    "WebAppDevTutorialExplanation": "См. Руководство по разработке веб-приложений для получения пошагового примера разработки.",
    "Document": "Документ",
    "UsingABPSuiteToCURD": "Использование ABP Suite для создания страниц CRUD и инструментов",
    "SeeABPSuiteDocument": "См. Документ ABP Suite, чтобы узнать об использовании ABP Suite.",
    "AskQuestionsOnSupport": "Вы можете задать вопросы в коммерческой поддержке ABP.",
    "Documentation": "Документация",
    "SeeModulesDocument": "См. Документацию по модулям для получения списка всех коммерческих (профессиональных) модулей и их документов.",
    "Pricing": "Ценообразование",
    "PricingExplanation": "Выберите функции и возможности, которые нужны вашему бизнесу сегодня. Легко обновляйте по мере роста вашего бизнеса.",
    "Team": "Команда",
    "Business": "Бизнес",
    "Enterprise": "Предприятие",
    "Custom": "Обычай",
    "IncludedDeveloperLicenses": "Включены лицензии разработчика",
    "CustomLicenceOrAdditionalServices": "Нужна индивидуальная лицензия или дополнительные услуги?",
    "CustomOrVolumeLicense": "Индивидуальная или корпоративная лицензия",
    "LiveTrainingSupport": "Живое обучение и поддержка",
    "AndMore": "и более",
    "AdditionalDeveloperLicense": "Дополнительная лицензия разработчика",
    "ProjectCount": "Количество проектов",
    "AllProModules": "Все про модули",
    "AllProThemes": "Все профессиональные темы",
    "AllProStartupTemplates": "Все профессиональные шаблоны стартапов",
    "SourceCodeOfAllModules": "Исходный код всех модулей",
    "SourceCodeOfAllThemes": "Исходный код всех тем",
    "PerpetualLicense": "Бессрочная лицензия",
    "UnlimitedServerDeployment": "Неограниченное развертывание сервера",
    "YearUpgrade": "1 год обновления",
    "YearPremiumForumSupport": "1 год премиум-поддержки на форуме",
    "ForumSupportIncidentCountYear": "Количество инцидентов службы поддержки форума / год",
    "PrivateTicketEmailSupport": "Частный тикет и поддержка по электронной почте",
    "BuyNow": "купить сейчас",
    "PayViaAmexCard": "Как я могу заплатить картой AMEX?",
    "PayViaAmexCardDescription": "Платежный шлюз по умолчанию Iyzico может отклонить некоторые кредитные карты AMEX из-за мер безопасности. В этом случае вы можете оплатить через альтернативный платежный шлюз 2Checkout.",
    "ThankYou": "Спасибо",
    "InvalidReCaptchaErrorMessage": "При проверке reCAPTCHA произошла ошибка. Пожалуйста, попробуйте еще раз.",
    "CompanyName": "Название компании",
    "YourCompanyName": "Название вашей компании",
    "FirstName": "Имя",
    "LastName": "Фамилия",
    "Optional": "По желанию",
    "YourFirstName": "Твое имя",
    "YourLastName": "Ваша фамилия",
    "SpecialOffer": "Специальное предложение",
    "SpecialOfferMessage": "Торопиться! Цены действительны ограниченное время.",
    "DiscountRequest": "Запрос на скидку",
    "DiscountRequestDescribeCustomerQuestion": "Что из следующего описывает вас?",
    "DiscountRequestStudentEmailMessage": "Адрес электронной почты должен содержать «edu».",
    "DiscountRequestDeveloperCount": "Сколько у вас разработчиков?",
    "DiscountRequestDeveloperCountExceedMessage": "Мы не предоставляем лицензии со скидкой для компаний, у которых более {0} разработчиков.",
    "DiscountRequestOrganizationName": "Название компании / организации / учебного заведения",
    "Website": "Веб-сайт",
    "GithubUsername": "Имя пользователя GitHub",
    "PhoneNumber": "Номер телефона",
    "Country": "Страна",
    "DescribeABPCommercialUsage": "Опишите проект, который вы планируете развивать на базе APB Commercial.",
    "DiscountRequestCertifyInformationMessage": "Я подтверждаю, что вся информация верна и верна.",
    "DiscountRequestReceived": "Мы получили ваш запрос на скидку.",
    "DiscountRequestStatusMessage": "Мы ответим вам после проверки предоставленной вами информации.",
    "MVCOrRazorPages": "MVC (Razor Pages)",
    "Angular": "Угловой",
    "Blazor": "Blazor",
    "New": "Новый",
    "MongoDB": "MongoDB",
    "EBookDDD": "Электронная книга, управляемая доменом",
    "PracticalGuideForImplementingDDD": "Эта книга представляет собой практическое руководство по реализации предметно-ориентированного дизайна с помощью ABP Framework.",
    "IntroducingDDD": "Знакомство с доменно-ориентированным дизайном",
    "DDDLayersAndCleanArchitecture": "Уровни DDD и чистая архитектура",
    "LayeringOfADotnetSolution": "Уровни решения .NET",
    "ImplementingDDDBuildingBlocks": "Реализация строительных блоков DDD",
    "DomainVsApplicationLogic": "Логика домена против логики приложения",
    "SamplesAndDiscussions": "Образцы и обсуждения",
    "Free": "Бесплатно",
    "Download": "Скачать",
    "DDDEBook": "Электронная книга DDD",
    "ImplementingDDD": "Внедрение доменно-ориентированного дизайна",
    "DDDBookExplanation": "Практическое руководство по реализации предметно-ориентированного дизайна с помощью ABP Framework.",
    "Overview": "Обзор",
    "DDDBookPracticalGuide": "Это практическое руководство по реализации доменно-ориентированного дизайна (DDD). Хотя детали реализации зависят от инфраструктуры ABP Framework, основные концепции, принципы и шаблоны применимы к любому типу решения, даже если это не решение .NET.",
    "TableOfContents": "Оглавление",
    "IntroductionToImplementingDDD": "Введение в реализацию предметно-ориентированного дизайна",
    "WhatIsDDD": "Что такое доменно-ориентированный дизайн?",
    "Implementation": "Реализация",
    "TheBigPicture": "Большая картинка",
    "TheBuildingBlock": "Строительный блок",
    "ExampleUseCase": "Пример использования",
    "DomainAndApplicationLogic": "Логика домена и логика приложения",
    "Author": "Автор",
    "PublishedOn": "Опубликован в",
    "Page": "Страница",
    "FreeEBook": "Бесплатная электронная книга",
    "EBookSignInForDownload": "Чтобы скачать электронную книгу, войдите в систему",
    "SignIn": "Войти",
    "Or": "Или",
    "TellUsAboutYourself": "Расскажи немного о себе",
    "Surname": "Фамилия",
    "DoYouAgreePrivacyPolicy": "Я согласен с <a href=\"/TermsConditions\"> Условиями использования, <a/> и <a href=\"/Privacy\"> Политикой конфиденциальности </a>.",
    "VolosoftMarketingInformationMessage": "Мне нужна информация, советы и предложения о решениях для предприятий и организаций, а также о других продуктах и услугах Volosoft.",
    "VolosoftSharingInformationMessage": "Я хочу, чтобы Volosoft поделился моей информацией с избранными партнерами, чтобы я мог получать актуальную информацию об их продуктах и услугах.",
    "WeWillSendYouADownloadLink": "Ссылка для загрузки электронной книги была отправлена на адрес {0}. <br/> Проверьте ящики входящих сообщений / нежелательной почты / спама!",
    "InvalidFormInputs": "Пожалуйста, введите действительную информацию, указанную в форме.",
    "DDDBookEmailBody": "Спасибо. <br /> Чтобы скачать книгу, <a href=\"{0}\"> нажмите здесь </a>.",
    "FreeDDDEBook": "Бесплатная электронная книга DDD",
    "StartFree": "Начать бесплатно",
    "FreeTrial": "Бесплатная пробная версия",
    "AcceptsMarketingCommunications": " Да, я хочу получать коммерческие маркетинговые сообщения ABP.",
    "PurposeOfUsage": "Цель использования",
    "Industry": "Промышленность",
    "Choose": "- Выбирать -",
    "CompanyOrganizationName": "Название компании / организации",
    "CompanySize": "Размер компании",
    "Next": "Следующий",
    "StartTrial": "Начать бесплатную пробную версию",
    "ContactUsIssues": "Свяжитесь с нами, если у вас возникнут проблемы",
    "TrialActivatedWarning": "Уважаемый {0}, пользователю предоставляется только 1 бесплатный пробный период. Вы уже использовали пробный период.",
    "ActivationRequirement": "Вы в одном шаге от начала использования бесплатной пробной версии. <br> Мы отправили электронное письмо на адрес <b> {0} </b>, чтобы активировать вашу учетную запись. Проверьте свои ящики для входящих сообщений / нежелательной почты / спама!",
    "SaveAndDownload": "Сохранить и скачать",
    "CompanyNameValidationMessage": "Название компании слишком длинное!",
    "AddressValidationMessage": "Адрес слишком длинный!",
    "TaxNoValidationMessage": "НАЛОГ / НДС Нет слишком долго!",
    "NotesValidationMessage": "Поле для заметок слишком длинное!",
    "CheckYourBillingInfo": "Вы можете выставить счет только один раз! Перед созданием счета проверьте свою платежную информацию.",
    "Volo.AbpIo.Commercial:030000": "Вы уже использовали пробный период.",
    "Volo.AbpIo.Commercial:030001": "Это название организации уже существует.",
    "StartYourFreeTrial": "Начните бесплатный пробный период",
    "TrialLicenseModelInvalidErrorMessage": "Одно из следующих полей недействительно: название страны, размер компании, отрасль или цель использования.",
    "Trial": "Испытание",
    "Purchased": "Куплено",
    "PurchaseLicense": "Купить лицензию",
    "PurchaseTrialLicenseMessage": "Срок действия вашей лицензии: {0}. <br> Если вы хотите продолжить использование проектов, созданных в течение бесплатного пробного периода, вам необходимо изменить лицензионные ключи в файлах <code> appsettings.secrets.json </code>. Вот ваш лицензионный ключ:",
    "TrialLicenseExpireMessage": "Вы используете пробную лицензию, и срок ее действия истечет {0}.",
    "TryForFree": "Попробуй бесплатно",
    "TrialLicenseExpiredInfo": "Срок действия вашей пробной лицензии истек!",
    "CommercialNewsletterConfirmationMessage": "Я согласен с <a href=\"https://commercial.abp.io/TermsConditions\"> Положениями и условиями </a> и <a href=\"https://commercial.abp.io/Privacy\"> Политикой конфиденциальности </a>."
  }
}