{
  "culture": "sk",
  "texts": {
    "OrganizationManagement": "Správa organizácii",
    "OrganizationList": "Zoznam organizácií",
    "Volo.AbpIo.Commercial:010003": "Nie ste vlastníkom tejto organizácie!",
    "OrganizationNotFoundMessage": "Nenašla sa žiadna organizácia!",
    "DeveloperCount": "Pridelené/celkový počet vývojárov",
    "QuestionCount": "Zostávajúce/všetky otázky",
    "Unlimited": "Neobmedzené",
    "Owners": "Vlastníci",
    "Owner": "Vlastník",
    "AddMember": "Pridať člena",
    "AddNewOwner": "Pridať nového vlastníka",
    "AddNewDeveloper": "Pridať nového vývojára",
    "UserName": "Používateľské meno",
    "Name": "Názov",
    "EmailAddress": "Emailová adresa",
    "Developers": "Vývojári",
    "LicenseType": "Typ licencie",
    "Manage": "Spravovať",
    "SetDefault": "Nastaviť ako predvolenú",
    "DefaultOrganization": "Predvolené",
    "StartDate": "Dátum začiatku",
    "EndDate": "Dátum ukončenia",
    "Modules": "Moduly",
    "LicenseExtendMessage": "Koniec platnosti vašej licencie je predĺžený do {0}.",
    "LicenseUpgradeMessage": "Vaša licencia je aktualizovaná na {0}",
    "LicenseExtendAdnUpgradeMessage": "Vaša licencia bola predĺžená do {0} a váš licenčný plán bol inovovaný na {1}.",
    "LicenseAddDeveloperMessage": "{0} vývojári boli pridaní do vašej licencie",
    "Volo.AbpIo.Commercial:010004": "Nie je možné nájsť zadaného používateľa! Používateľ musí už byť zaregistrovaný.",
    "MyOrganizations": "Moje organizácie",
    "ApiKey": "API kľúč",
    "UserNameNotFound": "Neexistuje žiadny používateľ s používateľským menom {0}",
    "SuccessfullyAddedToNewsletter": "Ďakujeme, že ste sa prihlásili na odber nášho newslettera!",
    "MyProfile": "Môj profil",
    "EmailNotValid": "Zadajte platnú emailovú adresu.",
    "JoinOurMarketingNewsletter": "Prihláste sa na odber reklamného newslettra",
    "WouldLikeToReceiveMarketingMaterials": "Chcem dostávať reklamné materiály, ponuky produktov a špeciálne ponuky.",
    "StartUsingYourLicenseNow": "Teraz začnite používať svoju licenciu!",
    "WelcomePage": "Uvítacia stránka",
    "UnsubscriptionExpireEmail": "Odhlásenie z odberu emailov informujúcich o dátume vypršania platnosti licencie",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Tento email obsahuje iba pripomenutie dátumu vypršania platnosti vašej licencie.",
    "UnsubscribeFromLicenseExpireEmails": "Ak nechcete dostávať emaily o dátume vypršania platnosti vašej licencie, môžete sa kedykoľvek odhlásiť.",
    "Unsubscribe": "Odhlásiť",
    "NotOrganizationMember": "Nie ste členom žiadnej organizácie.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Úspešne odhlásené",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Už nebudete dostávať emaily s upozornením na dátum vypršania platnosti licencie.",
    "IndexPageHeroSection": "<span class=\"first-line\">Kompletná</span><span class=\"second-line\"> web vývojová platforma</span><span class=\"third-line\">postavená na <img src=\"{0}\" width=\"110\" class=\"ml-1\" /> frameworku</span>",
    "AbpCommercialShortDescription": "ABP Commercial poskytuje predpripravené aplikačné moduly, nástroje na rýchly vývoj aplikácií, profesionálne témy používateľského rozhrania, prémiovú podporu a ďalšie.",
    "LiveDemo": "Live ukážka",
    "LiveDemoLead": "<a href=\"{0}\">{1}</a> použitím vášho ABP účtu, <a href=\"{2}\">{3}</a> na abp.io.<br/>Alebo vyplňte nižšie uvedený formulár a vytvorte si teraz live ukážku",
    "ThereIsAlreadyAnAccountWithTheGivenEmailAddress": "Už existuje účet s danou emailovou adresou: <b>{0}</b><br/> Môžete sa prihlásiť pomocou svojho účtu a pokračovať.",
    "GetLicence": "Získajte licenciu",
    "Application": "Aplikácia",
    "StartupTemplates": "Štartovacie šablóny",
    "Startup": "Štart",
    "Templates": "Šablóny",
    "Developer": "Vývojár",
    "Tools": "Nástroje",
    "Premium": "Premium",
    "PremiumSupport": "Prémiová podpora",
    "PremiumForumSupport": "Prémiová podpora na fóre",
    "UI": "POUŽÍVATEĽSKÉ ROZHRANIE",
    "Themes": "Témy",
    "JoinOurNewsletter": "Prihláste sa na odber newslettra",
    "Send": "Odoslať",
    "WhatIsABPFramework": "ČO JE FRAMEWORK ABP?",
    "OpenSourceBaseFramework": "Základný open source framework ",
    "ABPFrameworkExplanation": "<p class=\"lead\">ABP Commercial je založené na ABP frameworku, open source a komunitou riadenom frameworku webových aplikácií pre ASP.NET Core.</p><p>ABP Framework poskytuje vynikajúcu infraštruktúru na písanie udržiavateľného, rozšíriteľného a testovateľného kódu s osvedčenými postupmi.</p><p>Je integrovaný a postavený na populárnych nástrojoch, ktoré už poznáte. Nízka krivka učenia, jednoduché prispôsobenie, pohodlný vývoj.</p>",
    "Modular": "Modulárny",
    "MicroserviceCompatible": "Kompatibilita s mikroslužbami",
    "DomainDrivenDesignInfrastructure": "Domain Driven Design infraštruktúra",
    "MultiTenancy": "Multitenacia",
    "DistributedMessaging": "Distribuované zasielanie správ",
    "DynamicProxying": "Dynamický Proxying",
    "BackgroundJobs": "Automatické úlohy na pozadí",
    "AuditLogging": "Audit logovanie",
    "BLOBStoring": "Ukladanie BLOBov",
    "BundlingMinification": "Bundling a minifikácia",
    "AdvancedLocalization": "Pokročilá lokalizácia",
    "ManyMore": "Mnohé ďalšie",
    "ExploreTheABPFramework": "Preskúmajte ABP framework",
    "WhyUseTheABPCommercial": "Prečo používať ABP Commercial?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\">Vybudovanie webových aplikácií podnikovej úrovne môže byť zložité a časovo náročné.</p><p>ABP Commercial ponúka dokonalú základnú infraštruktúru potrebnú pre všetky moderné riešenia ASP.NET Core podnikovej úrovne. Celý vývojový cyklus, od návrhu až po nasadenie, umožňujú integrované funkcie a moduly ABP.</p>",
    "StartupTemplatesShortDescription": "Štartovacie šablóny vám umožnia spustiť projekt za niekoľko sekúnd.",
    "UIFrameworksOptions": "Možnosti používateľského rozhrania frameworku;",
    "DatabaseProviderOptions": "Možnosti poskytovateľov databáz;",
    "PreBuiltApplicationModules": "Vopred pripravené aplikačné moduly",
    "PreBuiltApplicationModulesShortDescription": "Väčšina bežných aplikačných požiadaviek je už pre vás vyvinutá v podobe znovupoužiteľných modulov.",
    "Account": "Účet",
    "Blogging": "Blogovanie",
    "Identity": "Identity",
    "IdentityServer": "Identity Server",
    "Saas": "Saas",
    "LanguageManagement": "Jazykový manažment",
    "TextTemplateManagement": "Správa textových šablón",
    "See All Modules": "Pozri všetky moduly",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "ABP Suite je doplnkový nástroj k uABP Commercial.",
    "AbpSuiteExplanation": "Umožňuje vytvárať webové stránky v priebehu niekoľkých minút. Je to globálny nástroj .NET Core, ktorý možno nainštalovať z príkazového riadka. Dokáže vytvoriť nové riešenie ABP, generovať CRUD stránky od databázy až po frontend.",
    "Details": "Podrobnosti",
    "LeptonTheme": "Lepton téma",
    "ProfessionalModernUIThemes": "Profesionálne a moderné témy používateľského rozhrania",
    "LeptonThemeExplanation": "Lepton poskytuje škálu Bootstrap admin tém, ktoré slúžia ako základ pre akýkoľvek projekt, kde je vyžadovaný administrátorský panel.",
    "DefaultTheme": "Predvolená téma",
    "MaterialTheme": "Materiál téma",
    "Default2Theme": "Predvolená téma 2",
    "DarkTheme": "Tmavá téma",
    "DarkBlueTheme": "Tmavomodrá téma",
    "LightTheme": "Téma Light",
    "ProudToWorkWith": "Hrdo spolupracujeme s",
    "OurConsumers": "Na ABP Commercial sa spoliehajú stovky podnikov a vývojárov vo viac ako 70 krajinách sveta.",
    "JoinOurConsumers": "Pridajte sa k nim a jednoducho vytvorte úžasné produkty.",
    "AdditionalServicesExplanation": "Potrebujete ďalšie alebo vlastné služby?  <strong>My a naši partneri vám ich môžeme poskytnúť;</strong>",
    "CustomProjectDevelopment": "Vývoj projektu na mieru",
    "CustomProjectDevelopmentExplanation": "Špecializovaní vývojári pre vaše vlastné projekty.",
    "PortingExistingProjects": "Prenos existujúcich projektov",
    "PortingExistingProjectsExplanation": "Migrácia starších projektov do ABP frameworku.",
    "LiveSupport": "Live podpora",
    "LiveSupportExplanation": "V prípade potreby možnosť Live podpory na diaľku.",
    "Training": "Školenie",
    "TrainingExplanation": "Školenia určené pre vašich vývojárov.",
    "OnBoarding": "Rozbehnutie",
    "OnBoardingExplanation": "Pomoc pri nastavovaní vývojárskeho prostredia, CI prostredia a CD prostredia.",
    "PrioritizedTechnicalSupport": "Prioritná technická podpora",
    "PremiumSupportExplanation": "Popri skvelej podpore od komunity ABP frameworku aj náš tím podpory zodpovedá otázky a rieši problémy komerčných zákazníkov s vysokou prioritou.",
    "SeeTheSupportOptions": "Pozrite si možnosti podpory",
    "Contact": "Kontakt",
    "TellUsWhatYouNeed": "Povedzte nám, čo potrebujete.",
    "YourMessage": "Vaša správa",
    "YourFullName": "Vaše celé meno",
    "FirstNameField": "Krstné meno",
    "LastNameField": "Priezvisko",
    "EmailField": "Emailová adresa",
    "YourEmailAddress": "Vaša emailová adresa",
    "ValidEmailAddressIsRequired": "Je potrebná platná emailová adresa.",
    "HowMayWeHelpYou": "Ako vám môžeme pomôcť?",
    "SendMessage": "Odoslať správu",
    "Success": "Úspech",
    "WeWillReplyYou": "Dostali sme vašu správu a čoskoro vás budeme kontaktovať.",
    "GoHome": "Prejsť Domov",
    "CreateLiveDemo": "Vytvoriť live ukážku",
    "CreateLiveDemoDescription": "Po odoslaní tohto formulára obdržíte e-mail obsahujúci odkaz na vašu ukážku.",
    "RegisterToTheNewsletter": "Zaregistrujte sa na odber noviniek a dostávajte informácie o ABP.IO, vrátane nových verzií atď.",
    "EnterYourEmailOrLogin": "Zadajte svoju emailovú adresu a vytvorte si ukážku alebo sa <a href=\"{0}\">prihláste</a> pomocou svojho existujúceho konta.",
    "ApplicationTemplate": "Šablóna žiadosti",
    "ApplicationTemplateExplanation": "Štartovacia šablóna aplikácie sa používa na vytvorenie novej webovej aplikácie.",
    "EfCoreProvider": "Entity Framework (podporuje SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\">a ďalšie</a>)",
    "AlreadyIncludedInTemplateModules": "V tejto šablóne sú už zahrnuté a nakonfigurované nasledujúce moduly:",
    "ApplicationTemplateArchitecture": "Táto šablóna aplikácie podporuje aj viacúrovňovú architektúru, v ktorej sú fyzicky oddelené vrstva používateľského rozhrania, vrstva API a služba overovania.",
    "SeeTheGuideOrGoToTheLiveDemo": "Technické informácie o tejto šablóne nájdete v príručke pre vývojárov alebo v live ukážke.",
    "DeveloperGuide": "Príručka pre vývojárov",
    "ModuleTemplate": "Šablóna modulu",
    "ModuleTemplateExplanation1": "Chcete vytvoriť modul a opätovne ho použiť v iných aplikáciách? Táto štartovacia šablóna pripraví všetko na vytvorenie opakovane použiteľného <strong>aplikačného modulu</strong> alebo <strong>mikroslužby</strong>.",
    "ModuleTemplateExplanation2": "<p>Môžete podporovať jeden alebo viacero používateľských rozhraní frameworku, jedného alebo viacerých poskytovateľov databáz pre jeden modul. Štartovacia šablóna je nakonfigurovaná tak, aby okrem infraštruktúry unit a integračných testov spustila a <strong>testovala váš modul</strong> v minimálnej aplikácii. </p> <p>Technické informácie o tejto šablóne nájdete v príručke pre vývojárov.</p>",
    "WithAllStyleOptions": "so všetkými možnosťami štýlov",
    "Demo": "Ukážka",
    "SeeAllModules": "Pozrite si všetky moduly",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) je nástroj v príkazovom riadku na vykonávanie niektorých bežných operácií v riešeniach založených na ABP.",
    "ABPSuiteEasilyCURD": "ABP Suite je nástroj, ktorý vám umožňuje jednoducho vytvárať CRUD stránky.",
    "WeAreHereToHelp": "Sme tu, aby sme <span class=\"zero-text\">pomohli</span>",
    "BrowseOrAskQuestion": "Môžete si prezerať témy našej nápovedy alebo vyhľadávať v často kladených otázkach, prípadne nám môžete položiť otázku pomocou <a href=\"{0}\" class=\"text-success\">kontaktného formulára</a>.",
    "SearchQuestionPlaceholder": "Vyhľadávanie v často kladených otázkach",
    "WhatIsTheABPCommercial": "Čo je to ABP Commercial?",
    "WhatAreDifferencesThanAbpFramework": "Aké sú rozdiely medzi open source ABP Framework a ABP Commercial?",
    "AbpCommercialMetaTitle": "{0} | ABP Commercial",
    "AbpCommercialMetaDescription": "Komplexná platforma na vývoj webových aplikácií na ABP Framework s vopred vytvorenými modulmi, šablónami na spustenie, rýchlymi vývojovými nástrojmi, témami profesionálneho používateľského rozhrania a prémiovou podporou.",
    "ABPCommercialExplanation": "ABP Commercial je súbor prémiových modulov, nástrojov, tém a služieb postavených na open source <a target=\"_blank\" href=\"{0}\">ABP frameworku</a>. ABP Commercial vyvíja a podporuje ten istý tím, ktorý stojí za ABP frameworkom.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\">ABP framework</a> je modulárny, témovo-upraviteľný, s mikroslužbami kompatibilný framework na vývoj aplikácií pre ASP.NET Core. Poskytuje kompletnú architektúru a silnú infraštruktúru, aby ste sa mohli sústrediť na vlastný biznis kód a nemuseli sa opakovať pri každom novom projekte. Je založený na osvedčených postupoch vývoja softvéru a populárnych nástrojoch, ktoré už poznáte.  </p> <p> ABP framework je úplne bezplatný, má otvorený zdrojový kód a je poháňaný komunitou. Poskytuje aj bezplatnú tému a niektoré predpripravené moduly (napr. správu identít a správu tenantov).</p>",
    "VisitTheFrameworkVSCommercialDocument": "Pre viac informácií navštívte nasledujúci odkaz <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial má oproti ABP systému nasledujúce výhody;",
    "Professional": "Profesionálny",
    "UIThemes": "Témy používateľského rozhrania",
    "EnterpriseModules": "Podnikovo pripravené, funkčne bohaté, predpripravené <a href=\"{0}\">aplikačné moduly</a> (napr. správa Identity Server, správa SaaS, správa jazykov)",
    "ToolingToSupport": "Nástroje na podporu produktivity vášho vývoja (napr. <a href=\"{0}\">ABP Suite</a>)",
    "PremiumSupportLink": "Prémiová <a href=\"{0}\" target=\"_blank\">podpora</a>",
    "WhatDoIDownloadABPCommercial": "Čo si stiahnem, keď si zakúpim ABP Commercial?",
    "CreateUnlimitedSolutions": "Po zakúpení licencie ABP Commercial budete môcť vytvárať neobmedzený počet riešení, ako je popísané v dokumente <a href=\"{0}\">Začíname</a>.",
    "ABPCommercialSolutionExplanation": "Pri vytváraní novej aplikácie dostanete riešenie vo Visual Studio (štartovaciu šablónu) na základe vašich preferencií. Stiahnuté riešenie má pre vás už nainštalované a nakonfigurované komerčné moduly a témy. Ak budete chcieť, môžete odstrániť predinštalovaný modul alebo pridať iný modul. Všetky predvolené moduly a témy používajú balíky NuGet/NPM.",
    "StartDevelopWithTutorials": "Stiahnuté riešenie je dobre navrhnuté a zdokumentované. Môžete na jeho základe začať vyvíjať vlastný biznis kód podľa <a href=\"{0}\">návodov</a>",
    "TryTheCommercialDemo": "Môžete vyskúšať <a href=\"{0}\">demo</a> a pozrieť si ukážku aplikácie vytvorenej pomocou štartovacej šablóny ABP Commercial.",
    "HowManyProducts": "Koľko rôznych produktov/riešení môžem vytvoriť pomocou ABP Commercial?",
    "HowManyProductsExplanation": "Vytvorenie projektu ABP nie je obmedzené. Môžete vytvoriť toľko projektov, koľko chcete, vyvíjať ich a nahrávať na rôzne servery.",
    "HowManyDevelopers": "Koľko vývojárov môže pracovať na ABP Commercial?",
    "HowManyDevelopersExplanation": "Licencie ABP Commercial sú jednotkové na vývojára. Rôzne typy licencií majú rôzne limity pre vývojárov. Ktorýkoľvek typ licencie však môžete kedykoľvek rozšíriť o ďalších vývojárov. Informácie o typoch licencií, limitoch pre vývojárov a nákladoch na ďalších vývojárov nájdete na stránke <a href=\"{0}\">ceny</a>.",
    "ChangingLicenseType": "Môžem v budúcnosti zmeniť typ licencie?",
    "ChangingLicenseTypeExplanation": "Vždy je možné pridať nových vývojárov v rovnakom type licencie. Pozrite si tiež časť \"Koľko vývojárov môže pracovať na ABP Commercial?\". Môžete tiež prejsť na vyššiu licenciu zaplatením vypočítaného cenového rozdielu. Pri prechode na vyšší licenčný plán získate výhody nového plánu, ale prechodom na vyšší licenčný plán sa nezmení dátum platnosti licencie.",
    "LicenseExtendUpgradeDiff": "Aký je rozdiel medzi rozšírením a aktualizáciou licencie?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Rozšírenie:</strong> Predĺžením/obnovením licencie budete aj naďalej získavať prémiovú podporu a väčšie alebo menšie aktualizácie pre moduly a témy. Okrem toho budete môcť pokračovať vo vytváraní nových projektov. A stále budete môcť používať ABP Suite, ktorý urýchľuje váš vývoj. Keď predĺžite licenciu, k dátumu vypršania platnosti licencie sa pripočíta 1 rok.<hr/> <strong>Inovácia:</strong> Inováciou licencie budete povýšený na plán vyššej licencie, ktorý vám umožní získať ďalšie výhody. Pozrite si <a href=\"/pricing\">porovnávaciu tabuľku licencií</a> , aby ste videli rozdiely medzi licenčnými plánmi. <strong>Na druhej strane, pri inovácii sa dátum vypršania platnosti vašej licencie nezmení!</strong> Ak chcete predĺžiť dátum ukončenia licencie, musíte predĺžiť licenciu.",
    "LicenseRenewalCost": "Aké sú náklady na obnovenie licencie po 1 roku?",
    "LicenseRenewalCostExplanation": "Cena obnovenia (predĺženia) štandardnej tímovej licencie je ${0}, štandardnej obchodnej licencie je ${1} a štandardnej podnikovej licencie je ${2}. Ak už ste zákazníkom, <a href='{3}' target='_blank'>prihláste sa do svojho účtu</a> a pozrite si dostupné ceny za obnovenie.",
    "HowDoIRenewMyLicense": "Ako si môžem obnoviť licenciu?",
    "HowDoIRenewMyLicenseExplanation": "Svoju licenciu môžete obnoviť tak, že prejdete na stránku <a href='{0}' target='_blank'> správa organizície</a>. Ak chcete využiť naše zľavnené ceny za predčasné obnovenie, uistite sa, že ste licenciu obnovili pred uplynutím jej platnosti. Netrápte sa však tým, že neviete, kedy sa vaša možnosť predčasného obnovenia skončí. Pred vypršaním platnosti predplatného dostanete 2 e-maily s pripomienkami. Budeme ich posielať o 30 dní, teda 7 dní pred vypršaním platnosti.",
    "IsSourceCodeIncluded": "Zahŕňa moja licencia zdrojový kód komerčných modulov a tém?",
    "IsSourceCodeIncludedExplanation1": "Závisí od typu zakúpenej licencie:",
    "IsSourceCodeIncludedExplanation2": "<strong>Tím</strong>: Vaše riešenie používa moduly a témy ako balíky NuGet a NPM. Neobsahuje ich zdrojový kód. Týmto spôsobom môžete tieto moduly a témy ľahko aktualizovať vždy, keď je k dispozícii nová verzia. Nemôžete však získať zdrojový kód modulov a tém.",
    "IsSourceCodeIncludedExplanation3": "<strong>Business/Enterprise</strong>: Okrem tímovej licencie si môžete stiahnuť zdrojový kód akéhokoľvek modulu alebo témy, ktorú potrebujete. Môžete dokonca odstrániť odkazy na balíky NuGet/NPM pre konkrétny modul a pridať jeho zdrojový kód priamo do svojho riešenia a úplne ho zmeniť.",
    "IsSourceCodeIncludedExplanation4": "<p>Začlenenie zdrojového kódu modulu do vášho riešenia vám dáva maximálnu slobodu prispôsobenia tohto modulu. Potom však nebude možné automaticky aktualizovať modul pri vydaní novej verzie.</p><p>Žiadna z licencií nezahŕňa zdrojový kód balíka ABP Suite, čo je externý nástroj, ktorý pre vás generuje kód a pomáha pri vývoji.</p><p>Dalšie rozdiely medzi jednotlivými typmi licencií nájdete na <a href=\"{0}\">stránke o cenách</a>.</p>",
    "ChangingDevelopers": "Môžem v budúcnosti zmeniť registrovaných vývojárov svojej organizácie?",
    "ChangingDevelopersExplanation": "Okrem pridávania nových vývojárov do licencie môžete tiež meniť existujúcich vývojárov (môžete odstrániť vývojára a pridať nového na to isté miesto) bez akýchkoľvek ďalších nákladov.",
    "WhatHappensWhenLicenseEnds": "Čo sa stane po skončení licenčného obdobia?",
    "WhatHappensWhenLicenseEndsExplanation1": "Komerčná licencia ABP je <a href=\"{0}\" target=\"_blank\">trvalá licencia</a>. Po skončení platnosti licencie môžete pokračovať vo vývoji svojho projektu. A nie ste povinní licenciu obnovovať. Vaša licencia sa dodáva s ročným plánom aktualizácií a podpory už v balení. Ak chcete naďalej získavať nové funkcie, vylepšenia výkonu, opravy chýb, podporu a pokračovať v používaní balíka ABP Suite, musíte svoju licenciu obnoviť. Keď vaša licencia vyprší;",
    "WhatHappensWhenLicenseEndsExplanation2": "Pomocou ABP Commercial nemôžete vytvárať nové riešenia, ale môžete navždy pokračovať vo vývoji existujúcich aplikácií.",
    "WhatHappensWhenLicenseEndsExplanation3": "Budete môcť získať aktualizácie modulov a tém v rámci svojej verzie MINOR (okrem verzií RC alebo Preview). Napríklad: ak používate modul vo verzii 3.2.0, stále môžete získať aktualizácie pre verziu 3.2.x (v3.2.1, v3.2.5... atď.) tohto modulu. Nemôžete však získať aktualizácie pre ďalšiu hlavnú alebo vedľajšiu verziu (napríklad v3.3.0, v3.3.3, 4.x.x... atď.). Napríklad, keď vám vypršala licencia, posledná verzia bola v4.4.3 a neskôr bola zverejnená verzia 4.4.4 aj 4.5.0, budete mať prístup k verzii v4.4.X, ale nebudete mať prístup k verzii v4.5.X.",
    "WhatHappensWhenLicenseEndsExplanation4": "Po skončení platnosti vašej licencie nemôžete inštalovať nové moduly a témy pridané do platformy ABP Commercial.",
    "WhatHappensWhenLicenseEndsExplanation5": "Balík ABP Suite nemôžete používať.",
    "WhatHappensWhenLicenseEndsExplanation6": "Už nemôžete získať <a href=\"{0}\">prémiovú podporu</a>.",
    "WhatHappensWhenLicenseEndsExplanation7": "Ak chcete naďalej využívať tieto výhody, môžete si licenciu predĺžiť (obnoviť). Ak predĺžite svoju licenciu do <strong>30 dní</strong> po vypršaní platnosti licencie, budú sa uplatňovať nasledujúce zľavy: Tímová licencia {0}; Obchodná licencia {1}; Podniková licencia {2}",
    "discountForYears": "{0} % odpusteného prívesku {1} an(ov)",
    "WhatHappensWhenLicenseEndsExplanation8": "Projekty ABP, ktoré ste vygenerovali, nie sú uložené na našich serveroch. Preto je vašou zodpovednosťou uchovávať zdrojový kód, ktorý stiahnete. Keď platnosť vašej licencie vyprší, nie je možné získať zdrojový kód vygenerovaného projektu ABP.",
    "WhenShouldIRenewMyLicense": "Kedy si mám obnoviť licenciu?",
    "WhenShouldIRenewMyLicenseExplanation": "Ak si licenciu obnovíte do <strong>30 dní</strong> po vypršaní platnosti licencie, budú sa uplatňovať tieto zľavy: Tímová licencia {0} ; Obchodná licencia {1} ; Enterprise licencia {2} . Ak si licenciu obnovíte <strong>30 dní</strong> po dátume skončenia platnosti licencie, cena za obnovenie bude rovnaká ako cena za nákup licencie a na obnovenie nebude poskytnutá žiadna zľava.",
    "TrialPlan": "Máte skúšobný plán?",
    "TrialPlanExplanation": "Áno, ak chcete začať svoju bezplatnú skúšobnú verziu, kontaktujte <a href=\"mailto:marketing@volosoft.com?subject=ABP Commercial — Trial License Request\">marketing@volosoft.com</a> . Ponúkame tiež 30-dňovú záruku vrátenia peňazí za tímovú licenciu, žiadne otázky! Počas prvých 30 dní od zakúpenia licencie môžete požiadať o vrátenie celej sumy. Za licencie Business a Enterprise poskytujeme vrátenie 60 % do 30 dní. Je to preto, že licencie Business a Enterprise obsahujú úplný zdrojový kód všetkých modulov a tém.",
    "DoYouAcceptBankWireTransfer": "Prijímate bankový prevod?",
    "DoYouAcceptBankWireTransferExplanation": "Áno, akceptujeme bankový prevod.<br />Po odoslaní licenčného poplatku bankovým prevodom nám pošlite e-mail na adresu accounting@abp.io svoje potvrdenie a požadovaný typ licencie. Informácie o našom medzinárodnom bankovom účte:",
    "HowToUpgrade": "Ako aktualizovať existujúce aplikácie, keď je k dispozícii nová verzia?",
    "HowToUpgradeExplanation1": "Pri vytváraní novej aplikácie pomocou ABP Commercial sa všetky moduly a téma použijú ako balíky NuGet a NPM. Balíky teda môžete ľahko aktualizovať, keď je k dispozícii nová verzia.",
    "HowToUpgradeExplanation2": "Okrem štandardných aktualizácií NuGet/NPM poskytuje <a href=\"{0}\">ABP CLI</a> príkaz update, ktorý automaticky nájde a aktualizuje všetky balíky súvisiace s ABP vo vašom riešení.",
    "DatabaseSupport": "Ktoré databázové systémy sú podporované?",
    "DatabaseSupportExplanation": "Samotný ABP Framework je databázovo agnostický a môže pracovať s akýmkoľvek poskytovateľom databázy. Zoznam aktuálne implementovaných poskytovateľov nájdete v <a href=\"{0}\" target=\"_blank\">dokumente o prístupe k údajom</a>.",
    "UISupport": "Ktoré používateľské rozhrania frameworku sú podporované?",
    "Supported": "Podporované",
    "UISupportExplanation": "Samotný ABP framework je agnostický a môže pracovať s akýmkoľvek UI frameworkom. Štartovacie šablóny, moduly používateľského rozhrania a témy však neboli implementované pre všetky UI frameworky. Aktuálny zoznam možností používateľského rozhrania nájdete v <a href=\"{0}\">dokumente Začíname</a>.",
    "MicroserviceSupport": "Podporuje architektúru mikroslužieb?",
    "MicroserviceSupportExplanation1": "Jedným z hlavných cieľov ABP frameworku je poskytnúť vhodnú infraštruktúru na vytváranie riešení mikroslužieb. Na lepšie pochopenie si pozrite dokument <a href=\"{0}\">architektúra mikroslužieb</a>.",
    "MicroserviceSupportExplanation2": "Všetky komerčné moduly ABP sú navrhnuté tak, aby podporovali scenáre nasadenia mikroslužieb (s vlastnou API a databázou) podľa dokumentu <a href=\"{0}\">Osvedčené postupy vývoja modulov</a>.",
    "MicroserviceSupportExplanation3": "Poskytujeme vzorové <a href=\"{0}\">micro-service demo riešenie</a>, ktoré demonštruje implementáciu architektúry mikroslužby a pomôže vám vytvoriť vlastné riešenie.",
    "MicroserviceSupportExplanation4": "Krátka odpoveď teda znie \"<strong>áno, podporuje architektúru mikroslužieb</strong>\".",
    "MicroserviceSupportExplanation5": "Riešenie je systém mikroslužieb a každé riešenie má iné požiadavky, sieťovú topológiu, komunikačné scenáre, možnosti autentifikácie, databázové rozdelenia/zdieľanie databáz, runtime konfigurácie, integrácie systémov tretích strán a mnohé ďalšie.",
    "MicroserviceSupportExplanation6": "ABP Framework a ABP Commercial poskytujú infraštruktúru pre scenáre mikroslužieb, moduly kompatibilné s mikroslužbami, vzorky a dokumentáciu, ktoré vám pomôžu vytvoriť vlastné riešenie. Neočakávajte však, že si priamo stiahnete svoje vysnívané riešenie, ktoré je pre vás vopred zostavené. Budete mu musieť porozumieť a spojiť niektoré časti na základe vašich požiadaviek.",
    "WhereCanIDownloadSourceCode": "Kde si môžem stiahnuť zdrojový kód?",
    "WhereCanIDownloadSourceCodeExplanation": "Zdrojový kód všetkých modulov ABP, balíkov Angular a tém si môžete stiahnuť prostredníctvom balíka ABP Suite alebo ABP CLI. Pozrite si <a href=\"{0}\">Ako stiahnuť zdrojový kód?</a>",
    "ComputerLimitation": "Koľko počítačov môže vývojár prihlásiť pri vývoji ABP?",
    "ComputerLimitationExplanation": "Osobitne povoľujeme <strong>{0} počítačov</strong> na jednotlivca/licencovaného vývojára. Vždy, keď je potrebné, aby vývojár vyvíjal komerčné ABP produkty na treťom počítači, je potrebné poslať e-mail na adresu license@abp.io s vysvetlením situácie a my potom vykonáme príslušné pridelenie v našom systéme.",
    "RefundPolicy": "Máte podmienky vrátenia peňazí?",
    "RefundPolicyExplanation": "O vrátenie peňazí môžete požiadať do <strong>30 dní</strong> od zakúpenia licencie. Typy licencií Business a Enterprise majú možnosť stiahnutia zdrojového kódu, preto nie je možné vrátiť peniaze za licencie Business a Enterprise (a všetky licencie, ktoré zahŕňajú právo na získanie zdrojového kódu). Okrem toho sa nevracajú peniaze za obnovenie a druhý nákup licencie.",
    "HowCanIRefundVat": "Ako môžem vrátiť DPH?",
    "HowCanIRefundVatExplanation1": "Ak ste platbu uskutočnili prostredníctvom služby 2Checkout, DPH môžete vrátiť prostredníctvom svojho účtu 2Checkout:",
    "HowCanIRefundVatExplanation2": "Prihláste sa do svojho účtu <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\">2Checkout</a>",
    "HowCanIRefundVatExplanation3": "Vyhľadajte príslušnú objednávku a stlačte tlačidlo \"Vrátiť oneskorenú DPH\" (zadajte svoje IČ DPH).",
    "HowCanIGetMyInvoice": "Ako môžem získať faktúru?",
    "HowCanIGetMyInvoiceExplanation": "Na zakúpenie licencie sú k dispozícii 2 platobné brány: PayU a 2Checkout. Ak si zakúpite licenciu prostredníctvom brány 2Checkout, odošle vám faktúru vo formáte PDF na vašu e-mailovú adresu, pozrite si <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How-do-invoices-work\">fakturovanie cez 2Checkout.</a> Ak si zakúpite licenciu prostredníctvom brány PayU alebo bankovým prevodom, pripravíme a pošleme vám faktúru. O faktúru môžete požiadať na stránke <a href=\"{0}\">správy organizácie.</a>",
    "Forum": "Fórum",
    "SupportExplanation": "Komerčné ABP licencie poskytujú prémiovú podporu fóra zloženú z tímu odborníkov na ABP Framework.",
    "PrivateTicket": "Privátny ticket",
    "PrivateTicketExplanation": "Licencia Enterprise zahŕňa aj súkromnú podporu e-mailom a ticket systém.",
    "AbpSuiteExplanation1": "Sada ABP Suite umožňuje vytvárať webové stránky v priebehu niekoľkých minút. Je to globálny nástroj .NET Core, ktorý možno nainštalovať z príkazového riadka.",
    "AbpSuiteExplanation2": "Môže vytvoriť nové riešenie ABP, generovať stránky CRUD z databázy do front-endu. Technický prehľad nájdete v <a href=\"{0}\">dokumente</a>",
    "FastEasy": "Rýchlo & jednoducho",
    "AbpSuiteExplanation3": "Sada ABP Suite umožňuje jednoducho vytvárať CRUD stránky. Stačí definovať vašu entitu a jej vlastnosti, ostatné nechajte na ABP Suite! Sada ABP Suite vygeneruje všetok potrebný kód pre vašu CRUD stránku za niekoľko sekúnd. Podporuje používateľské rozhrania Angular, MVC a Blazor.",
    "RichOptions": "Bohaté možnosti",
    "AbpSuiteExplanation4": "ABP Suite podporuje viacero možností používateľského rozhrania, ako napríklad <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\">Razor Pages</a> a <a href=\"https://angular.io\">Angular</a>. Podporuje tiež viacero databáz, ako napríklad <a href=\"https://www.mongodb.com\">MongoDB</a> a všetky databázy podporované <strong>EntityFramework Core</strong> (MS SQL Server, Oracle, MySql, PostgreSQL a <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\">ďalšie</a>).",
    "AbpSuiteExplanation5": "Dobré je, že sa o tieto možnosti nemusíte starať. ABP Suite rozumie typu vášho projektu a vygeneruje kód pre váš projekt a umiestni vygenerovaný kód na správne miesto vo vašom projekte.",
    "SourceCode": "Zdrojový kód",
    "AbpSuiteExplanation6": "ABP Suite generuje zdrojový kód za vás! Nevygeneruje magické súbory na generovanie webovej stránky. ABP Suite vygeneruje zdrojový kód pre <strong>Entity, repozitáre, aplication service, Code First Migration, JavaScript/TypeScript a CSHTML/HTML</strong> a tiež potrebné rozhrania. ABP Suite tiež generuje kód podľa <strong>Najlepších postupov</strong> vývoja softvéru, takže sa nemusíte obávať o kvalitu vygenerovaného kódu.",
    "AbpSuiteExplanation7": "Pretože máte zdrojový kód stavebných blokov vygenerovanej stránky CRUD v správnych aplikačných vrstvách, môžete zdrojový kód jednoducho upraviť a do vygenerovaného kódu vložiť vlastnú/obslužnú logiku.",
    "CrossPlatform": "Naprieč platformami",
    "AbpSuiteExplanation8": "ABP Suite je vytvorená pomocou .NET Core a je multiplatformová. Spustí sa ako webová aplikácia na vašom lokálnom počítači. Môžete ju spustiť na <strong>Windowse</strong>, <strong>Macu</strong> a <strong>Linuxe</strong>.",
    "OtherFeatures": "Ďalšie funkcie",
    "OtherFeatures1": "Ľahko aktualizuje balíky <strong>NuGet</strong> a <strong>NPM</strong> na vašom riešení.",
    "OtherFeatures2": "Obnovte už vygenerované stránky od začiatku.",
    "OtherFeatures3": "Vytvára nové riešenia",
    "ThanksForCreatingProject": "Ďakujeme za vytvorenie projektu!",
    "HotToRunSolution": "Ako spustiť vaše riešenie?",
    "HotToRunSolutionExplanation": "Pozrite si dokument Začíname a dozviete sa, ako nakonfigurovať a spustiť riešenie.",
    "GettingStarted": "Začíname",
    "WebAppDevTutorial": "Webová aplikácia Dev Tutorial",
    "WebAppDevTutorialExplanation": "Pozrite si dokument s návodom na vývoj webovej aplikácie, kde nájdete ukážku vývoja krok za krokom.",
    "Document": "Dokument",
    "UsingABPSuiteToCURD": "Použite ABP Suite na generovanie CRUD stránok a nástrojov",
    "SeeABPSuiteDocument": "Pozrite si dokument ABP Suite, v ktorom sa dozviete o používaní ABP Suite.",
    "AskQuestionsOnSupport": "Otázky môžete klásť na stránke ABP Commercial Support.",
    "Documentation": "Dokumentácia",
    "SeeModulesDocument": "Zoznam všetkých komerčných(pro) modulov a ich dokumentov nájdete v dokumente Moduly.",
    "Pricing": "Cenotvorba",
    "PricingExplanation": "Vyberte si funkcie a vlastnosti, ktoré vaša firma potrebuje. V prípade rastu ju môžete ľahko upgradovať.",
    "Team": "Tím",
    "Business": "Obchod",
    "Enterprise": "Podnik",
    "Custom": "Vlastné",
    "IncludedDeveloperLicenses": "Zahrnuté licencie pre vývojárov",
    "CustomLicenceOrAdditionalServices": "Potrebujete vlastnú licenciu alebo ďalšie služby?",
    "CustomOrVolumeLicense": "Vlastná alebo objemová licencia",
    "LiveTrainingSupport": "Live školenia a podpora",
    "AndMore": "a viac",
    "AdditionalDeveloperLicense": "Dodatočná licencia pre vývojárov",
    "ProjectCount": "Počet projektov",
    "AllProModules": "Všetky PRO moduly",
    "AllProThemes": "Všetky PRO témy",
    "AllProStartupTemplates": "Všetky PRO štartovacie šablóny",
    "SourceCodeOfAllModules": "Zdrojový kód všetkých modulov",
    "SourceCodeOfAllThemes": "Zdrojový kód všetkých tém",
    "PerpetualLicense": "Trvalá licencia",
    "UnlimitedServerDeployment": "Neobmedzené nasadenie servera",
    "YearUpgrade": "Aktualizácia na 1 rok",
    "YearPremiumForumSupport": "1 rok prémiovej podpory fóra",
    "ForumSupportIncidentCountYear": "Počet incidentov podpory fóra/rok",
    "PrivateTicketEmailSupport": "Súkromné tickety & e-mailová podpora",
    "BuyNow": "Kúpiť teraz",
    "PayViaAmexCard": "Ako môžem platiť kartou AMEX?",
    "PayViaAmexCardDescription": "Predvolená platobná brána \"Iyzico\" môže odmietnuť niektoré kreditné karty AMEX z dôvodu bezpečnostných opatrení. V takom prípade môžete platiť prostredníctvom alternatívnej platobnej brány \"2Checkout\".",
    "ThankYou": "Ďakujem",
    "InvalidReCaptchaErrorMessage": "Pri overovaní reCAPTCHA došlo k chybe. Skúste to znova prosím.",
    "CompanyName": "Meno spoločnosti",
    "YourCompanyName": "Názov vašej spoločnosti",
    "FirstName": "Krstné meno",
    "LastName": "Priezvisko",
    "Optional": "Voliteľné",
    "YourFirstName": "Tvoje krstné meno",
    "YourLastName": "Tvoje priezvisko",
    "SpecialOffer": "Špeciálna ponuka",
    "SpecialOfferMessage": "Ponáhľaj sa! Ceny sú platné po obmedzenú dobu.",
    "DiscountRequest": "Žiadosť o zľavu",
    "DiscountRequestDescribeCustomerQuestion": "Ktorá z nasledujúcich možností vás vystihuje?",
    "DiscountRequestStudentEmailMessage": "E-mailová adresa musí obsahovať „edu“.",
    "DiscountRequestDeveloperCount": "Koľko ste vývojárov?",
    "DiscountRequestDeveloperCountExceedMessage": "Spoločnostiam, ktoré majú viac ako {0} vývojárov, neposkytujeme zľavnenú licenciu.",
    "DiscountRequestOrganizationName": "Názov spoločnosti/organizácie/školy",
    "Website": "webové stránky",
    "GithubUsername": "Používateľské meno GitHub",
    "PhoneNumber": "Telefónne číslo",
    "Country": "Krajina",
    "DescribeABPCommercialUsage": "Popíšte projekt, ktorý plánujete vyvinúť na základe APB Commercial",
    "DiscountRequestCertifyInformationMessage": "Potvrdzujem, že všetky údaje sú pravdivé a správne.",
    "DiscountRequestReceived": "Dostali sme vašu žiadosť o zľavu.",
    "DiscountRequestStatusMessage": "Po skontrolovaní informácií, ktoré ste nám poskytli, vám odpovieme.",
    "MVCOrRazorPages": "MVC (Razor Pages)",
    "Angular": "Hranatý",
    "Blazor": "Blazor",
    "New": "Nový",
    "MongoDB": "MongoDB",
    "EBookDDD": "Dizajn riadený doménou elektronickej knihy",
    "PracticalGuideForImplementingDDD": "Táto kniha je praktickou príručkou na implementáciu Domain Driven Design s rámcom ABP.",
    "IntroducingDDD": "Predstavujeme Domain Driven Design",
    "DDDLayersAndCleanArchitecture": "DDD vrstvy a čistá architektúra",
    "LayeringOfADotnetSolution": "Vrstvenie riešenia .NET",
    "ImplementingDDDBuildingBlocks": "Implementácia stavebných blokov DDD",
    "DomainVsApplicationLogic": "Logika domény verzus aplikačná logika",
    "SamplesAndDiscussions": "Ukážky a diskusie",
    "Free": "zadarmo",
    "Download": "Stiahnuť ▼",
    "DDDEBook": "E-kniha DDD",
    "ImplementingDDD": "Implementácia doménou riadeného dizajnu",
    "DDDBookExplanation": "Praktická príručka pre implementáciu Domain Driven Design s rámcom ABP.",
    "Overview": "Prehľad",
    "DDDBookPracticalGuide": "Toto je praktická príručka pre implementáciu Domain Driven Design (DDD). Zatiaľ čo detaily implementácie sa spoliehajú na infraštruktúru ABP Framework, základné koncepty, princípy a vzory sú použiteľné v akomkoľvek druhu riešenia, aj keď nejde o riešenie .NET.",
    "TableOfContents": "Obsah",
    "IntroductionToImplementingDDD": "Úvod do implementácie dizajnu riadeného doménou",
    "WhatIsDDD": "Čo je to doménou riadený dizajn?",
    "Implementation": "Implementácia",
    "TheBigPicture": "Veľký obrázok",
    "TheBuildingBlock": "Stavebný blok",
    "ExampleUseCase": "Príklad prípadu použitia",
    "DomainAndApplicationLogic": "Doménová logika a aplikačná logika",
    "Author": "Autor",
    "PublishedOn": "Zverejnené dňa",
    "Page": "Stránka",
    "FreeEBook": "Bezplatná elektronická kniha",
    "EBookSignInForDownload": "Ak chcete stiahnuť e-knihu, prihláste sa",
    "SignIn": "Prihlásiť sa",
    "Or": "Alebo",
    "TellUsAboutYourself": "Povedz nám niečo o sebe",
    "Surname": "Priezvisko",
    "DoYouAgreePrivacyPolicy": "Súhlasím so <a href=\"/TermsConditions\">Zmluvnými podmienkami<a/> a <a href=\"/Privacy\">Zásadami ochrany osobných údajov</a>.",
    "VolosoftMarketingInformationMessage": "Mám záujem o informácie, tipy a ponuky o riešeniach pre podniky a organizácie a ďalších produktoch a službách Volosoft.",
    "VolosoftSharingInformationMessage": "Chcel by som, aby Volosoft zdieľal moje informácie s vybranými partnermi, aby som mohol dostávať relevantné informácie o ich produktoch a službách.",
    "WeWillSendYouADownloadLink": "Odkaz na stiahnutie e-knihy bol odoslaný na adresu {0}.<br/> Skontrolujte svoju doručenú poštu/nevyžiadanú poštu/spamové schránky!",
    "InvalidFormInputs": "Zadajte platné informácie uvedené vo formulári.",
    "DDDBookEmailBody": "Ďakujem. <br /> Ak si chcete knihu stiahnuť, <a href=\"{0}\">kliknite sem</a>.",
    "StartFree": "Začnite zadarmo",
    "FreeTrial": "Skúška zadarmo",
    "AcceptsMarketingCommunications": " Áno, chcem dostávať komerčné marketingové oznámenia ABP.",
    "PurposeOfUsage": "Účel použitia",
    "Choose": "- Vyberte si -",
    "CompanyOrganizationName": "Názov spoločnosti/organizácie",
    "CompanySize": "Veľkosť spoločnosti",
    "Next": "Ďalšie",
    "StartTrial": "Spustite moju bezplatnú skúšobnú verziu",
    "ContactUsQuestions": "Ak máte nejaké otázky, kontaktujte nás",
    "TrialActivatedWarning": "Používateľ má nárok len na 1 bezplatné skúšobné obdobie. Skúšobné obdobie ste už využili.",
    "ActivationRequirement": "Od začiatku skúšobného obdobia vás delí posledný krok.<br> Po kontrole vašich údajov aktivujeme vašu licenciu. Po aktivácii vašej licencie vám pošleme e-mail na adresu <b>{0}</b> . Nebojte sa, tento proces nebude trvať dlho!",
    "SaveAndDownload": "Uložiť a stiahnuť",
    "CompanyNameValidationMessage": "Názov spoločnosti je príliš dlhý!",
    "AddressValidationMessage": "Adresa je príliš dlhá!",
    "TaxNoValidationMessage": "Číslo DPH/DPH je príliš dlhé!",
    "NotesValidationMessage": "Pole poznámok je príliš dlhé!",
    "CheckYourBillingInfo": "Faktúru môžete vytvoriť iba raz! Pred vytvorením faktúry skontrolujte svoje fakturačné údaje.",
    "StartYourFreeTrial": "Spusťte bezplatnú skúšobnú verziu",
    "TrialLicenseModelInvalidErrorMessage": "Jedno z nasledujúcich polí je neplatné: Názov krajiny, Veľkosť spoločnosti, Odvetvie alebo Účel použitia.",
    "Trial": "Skúška",
    "Purchased": "Kúpené",
    "PurchaseNow": "Kúpiť teraz",
    "PurchaseTrialLicenseMessage": "Dátum vypršania platnosti vašej licencie je {0}. <br> Ak chcete pokračovať v používaní projektov, ktoré ste vytvorili počas bezplatného skúšobného obdobia, musíte zmeniť licenčné kľúče vo svojich súboroch <code>appsettings.secrets.json</code>. Tu je váš licenčný kľúč:",
    "TrialLicenseExpireMessage": "Používate skúšobnú licenciu a platnosť vašej skúšobnej licencie vyprší {0}.",
    "TryForFree": "Skúste zadarmo",
    "TrialLicenseExpiredInfo": "Vaše skúšobné licenčné obdobie vypršalo!",
    "DowngradeLicensePlan": "Môžem v budúcnosti prejsť na nižší licenčný plán?",
    "DowngradeLicensePlanExplanation": "Existujúci licenčný plán nemôžete znížiť. Môžete si však zakúpiť nový nižší licenčný plán a pokračovať vo vývoji s novou licenciou. Po zakúpení nižšej licencie sa stačí prihlásiť do nového licenčného plánu prostredníctvom príkazu ABP CLI: abp login <užívateľské meno> -o <organizácia> `.",
    "LicenseTransfer": "Môže sa licencia preniesť z jedného vývojára na druhého?",
    "LicenseTransferExplanation": "Áno! Keď si zakúpite licenciu, stanete sa jej držiteľom, a teda budete mať prístup na stránku správy organizácie. Organizácia má roly vlastníka a vývojára. Vlastníci môžu spravovať miesta pre vývojárov a priraďovať vývojárov. Každý pridelený vývojár sa prihlási do systému prostredníctvom príkazu ABP CLI a bude mať oprávnenia na vývoj a podporu.",
    "UserOwnerDescription": "„Vlastník“ organizácie je správcom tohto účtu. Riadi organizáciu nákupom licencií a prideľovaním vývojárov. „Vlastník“ nemôže písať kód do komerčných projektov ABP, nemôže si stiahnuť vzorové projekty ABP a nemôže klásť otázky na webovej stránke podpory. Ak to všetko chcete urobiť, musíte sa pridať aj ako vývojár.",
    "UserDeveloperDescription": "„Vývojári“ môžu napísať kód do komerčných projektov ABP, stiahnuť si vzorové projekty ABP a klásť otázky na webovej stránke podpory. Na druhej strane „Vývojári“ nemôžu riadiť túto organizáciu.",
    "RemoveCurrentUserFromOrganizationWarningMessage": "Odstraňujete sa zo svojej vlastnej organizácie. Túto organizáciu už nebudete môcť spravovať, potvrdzujete?",
    "RenewExistingOrganizationOrCreateNewOneMessage": "Licenciu svojej organizácie (organizácií) môžete obnoviť kliknutím na tlačidlo „Predĺžiť teraz“ nižšie, čím môžete predĺžiť dátum vypršania platnosti licencie o 1 rok. Ak budete pokračovať v pokladni, budete mať novú organizáciu. Chcete pokračovať v novej organizácii?",
    "PurchaseTrialOrganizationOrCreateNewOneMessage": "Máte skúšobnú licenciu. Ak chcete zakúpiť skúšobnú licenciu, kliknite na tlačidlo Kúpiť teraz. Ak budete pokračovať v pokladni, budete mať novú organizáciu. Chcete pokračovať v novej organizácii?",
    "ExtendNow": "Rozšírte teraz",
    "CreateNewOrganization": "Vytvorte novú organizáciu",
    "RenewLicenseEarly": "Ak si predčasne obnovím licenciu, dostanem celý rok?",
    "RenewLicenseEarylExplanation": "Keď obnovíte svoju licenciu pred dátumom vypršania platnosti licencie, k dátumu vypršania platnosti licencie sa pripočíta 1 rok. Ak napríklad platnosť vašej licencie vyprší dňa {0}-06-06 a obnovíte ju dňa {0}-01-01, dátum skončenia platnosti vašej novej licencie bude {1}-06-06.",
    "OpenSourceWebApplication": "Open source webová aplikácia",
    "CompleteWebDevelopment": "Kompletný vývoj webu",
    "ABPFrameworkDescription": "ABP Framework je kompletná infraštruktúra na vytváranie moderných webových aplikácií dodržiavaním osvedčených postupov vývoja softvéru a konvencií.",
    "CommunityDescription": "Podeľte sa o svoje skúsenosti s ABP Framework!",
    "GetStarted": "Začať",
    "Views": "názory",
    "LatestPosts": "Najnovšie príspevky",
    "PreBuiltApplication": "Vopred zostavená aplikácia",
    "DatabaseProviders": "Poskytovatelia databáz",
    "UIFrameworks": "Rámce používateľského rozhrania",
    "UsefulLinks": "užitočné odkazy",
    "Platform": "Plošina",
    "CoolestCompaniesUseABPCommercial": "Najlepšie spoločnosti už používajú <span class=\"fw-bold\">ABP Commercial.</span>",
    "UserInterface": "Používateľské rozhranie",
    "APIGateway": "Brána API",
    "Microservice": "Mikroservis",
    "Database": "Databáza",
    "Architecture": "Architektúra",
    "MicroserviceArchitectureExplanation": "Ide o kompletnú architektúru riešenia, ktorá pozostáva z viacerých aplikácií, brán API, mikroslužieb a databáz na vytvorenie škálovateľného riešenia mikroslužieb s najnovšími technológiami.",
    "BusinessLogic": "Obchodná logika",
    "DataAccessLayer": "Vrstva prístupu k údajom",
    "Monolith": "Monolit",
    "ModularArchitectureExplanation": "Táto štartovacia šablóna poskytuje vrstvenú, modulárnu architektúru riešenia založenú na DDD na vybudovanie čistej a udržiavateľnej kódovej základne.",
    "SeeDetails": "Pozri detaily",
    "SeeDocumentation": "Pozrite si dokumentáciu",
    "Bs5Compatible": "Profesionálna téma kompatibilná s Bootstrap 5, ideálna pre váš web správcu.",
    "LeptonXTheme": "Téma LeptonX",
    "LeptonXDark": "LeptonX Dark",
    "LeptonXLight": "Svetlo LeptonX",
    "LeptonXSemiDark": "LeptonX polotmavý",
    "BuiltOnBs5Library": "Postavené na knižnici Bootstrap 5",
    "FullyCompatibleWithBs5": "100% kompatibilný so štruktúrou HTML Bootstrap 5 a triedami CSS",
    "ResponsiveAndMobileCompatible": "Responzívna, mobilná kompatibilita, podpora RTL",
    "ProvidesStylesForDatatables": "Poskytuje štýly pre dátové tabuľky",
    "MultipleLayoutOptions": "Viacero možností rozloženia",
    "EasilyInstallAndUpgrade": "Jednoduchá inštalácia a upgrade",
    "SupportForum": "Fórum podpory",
    "TrustedBy": "Trusted By",
    "OurPricing": "Naše <span class=\"gradient-commercial\">ceny</span>",
    "Plans": "Plány",
    "NameSurname": "Meno Priezvisko",
    "Unspecified": "Nešpecifikované",
    "LicenceType": "Typ licencie",
    "LicenseDiscountWarning": "TÁTO ZĽAVOVÁ STRÁNKA POUŽÍVA ŠTANDARDNÝ ZĽAVOVÝ KÓD A PRE VÝVOJOV VOLOSOFT. ODKAZY NA NÁKUP NIŽŠIE NEFUNGUJÚ.",
    "DiscountedLicenseExplanation": "Tieto ceny licencií sú pre malé startupy, individuálnych vývojárov, študentov, neziskové organizácie a projekty!",
    "General": "generál",
    "License": "Licencia",
    "Development": "rozvoj",
    "Payment": "Platba",
    "WatchExplainerVideo": "Stretnime sa! Pozrite si vysvetľujúce video",
    "LightDarkAndSemiDarkThemes": "Svetlé, tmavé a polotmavé",
    "LeptonXThemeExplanation": "Lepton Theme môže zmeniť vašu tému podľa vašich nastavení systému.",
    "PRO": "PRO",
    "WelcomeToABPCommercial": "Vitajte v <span class=\"gradient-commercial\">ABP Commercial!</span>",
    "YourAccountDetails": "Podrobnosti o vašom účte",
    "OrganizationName": "Názov organizácie",
    "AddDevelopers": "Pridať vývojárov",
    "StartDevelopment": "Začnite s vývojom",
    "CreateAndRunApplicationUsingStartupTemplate": "Zistite, ako vytvoriť a spustiť novú webovú aplikáciu pomocou štartovacej šablóny ABP Commercial.",
    "CommunityDescription2": "<span class=\"fw-6\">community.abp.io</span> je miesto, kde môžu ľudia zdieľať články súvisiace s ABP. Hľadajte články, návody, ukážky kódu, prípadové štúdie a stretávajte sa s ľuďmi v rovnakom pruhu ako vy.",
    "UseABPSuiteExplanation": "Použite ABP Suite na stiahnutie zdrojového kódu modulov a tém.",
    "ManageModulesWithSuite": "Svoje moduly ABP môžete spravovať aj pomocou balíka Suite.",
    "LearnHowToInstallSuite": "Zistite, ako nainštalovať a používať ABP Suite.",
    "SeeMore": "Pozrieť viac",
    "SeeLess": "Pozri Menej",
    "LayeredSolutionStructure": "Štruktúra vrstveného riešenia",
    "LayeredSolutionStructureExplanation": "Riešenie je vrstvené na základe princípov a vzorov Domain Driven Design, aby sa izolovala vaša obchodná logika od infraštruktúry a integrácií a aby sa maximalizovala udržiavateľnosť a opakovaná použiteľnosť kódu. ABP Framework už poskytuje abstrakcie, základné triedy a návody na skutočnú implementáciu DDD pre vašu aplikáciu.",
    "MultipleUIOptions": "Viacero možností používateľského rozhrania",
    "MultipleUIOptionsExplanation": "Máme radi rôzne spôsoby vytvárania používateľského rozhrania. Toto spúšťacie riešenie poskytuje tri rôzne možnosti rámca používateľského rozhrania pre vašu podnikovú aplikáciu.",
    "MultipleDatabaseOptions": "Viac možností databázy",
    "MultipleDatabaseOptionsExplanation": "Máte dve možnosti poskytovateľa databázy (okrem použitia oboch v jednej aplikácii). Použite Entity Framework Core na prácu s akoukoľvek relačnou databázou a voliteľne použite Dapper, keď potrebujete písať nízkoúrovňové dotazy pre lepší výkon. MongoDB je ďalšou možnosťou, ak potrebujete použiť databázu NoSQL založenú na dokumentoch. Aj keď sú títo poskytovatelia dobre integrovaní, abstrahovaní a predkonfigurovaní, v skutočnosti môžete interagovať s akýmkoľvek databázovým systémom, ktorý môžete použiť s .NET.",
    "ModularArchitectureExplanation2": "Modularita je prvotriednym občanom v platforme ABP.IO. Všetky funkcie aplikácie sú rozdelené do dobre izolovaných voliteľných modulov. Spúšťacie riešenie už prichádza so základnými predinštalovanými <a href=\"/modules\" class=\"text-primary\">modulmi ABP Commercial</a> . Môžete si tiež vytvoriť svoje vlastné moduly na zostavenie modulárneho systému pre vašu vlastnú aplikáciu.",
    "MultiTenancyForSaasBusiness": "Viacnásobný prenájom pre vaše podnikanie v oblasti SaaS",
    "MultiTenancyForSaasBusinessExplanation": "ABP Commercial poskytuje kompletný komplexný systém s viacerými nájomcami na vytváranie vašich systémov SaaS (Software-as-a-Service). Umožňuje nájomníkom zdieľať alebo mať svoje vlastné databázy pomocou systému vytvárania a migrácie databáz za chodu.",
    "MicroserviceStartupSolution": "Startup Solution Microservice",
    "MicroserviceArchitectureExplanation2": "Môžete ho získať pre svoj ďalší mikroservisný systém, aby ste využili výhody vopred pripraveného základného riešenia a destilovaných skúseností.",
    "PreIntegratedTools": "Vopred integrované do populárnych nástrojov",
    "PreIntegratedToolsExplanation": "Riešenie je už integrované do štandardných nástrojov a technológií, pričom ich môžete kedykoľvek zmeniť a integrovať do svojich obľúbených nástrojov.",
    "SingleSignOnAuthenticationServer": "Single Sign-on Authentication Server",
    "SingleSignOnAuthenticationServerExplanation": "Riešenie obsahuje aplikáciu autentifikačného servera, ktorú ostatné aplikácie používajú ako server s jedným prihlásením s funkciami správy prístupu k API. Je založený na IdentityServer.",
    "WebAppsWithGateways": "2 webová aplikácia s 2 bránami API",
    "WebAppsWithGatewaysExplanation": "Riešenie obsahuje dve webové aplikácie, každá má vyhradenú API bránu (BFF - Backend For Frontend pattern).",
    "BackOfficeApplication": "Aplikácia Back Office",
    "BackOfficeApplicationExplanation": "Skutočná webová aplikácia vášho systému s viacerými možnosťami rámca používateľského rozhrania. Môžete vytvoriť akúkoľvek obchodnú aplikáciu.",
    "LandingWebsite": "Vstupná webová stránka",
    "LandingWebsiteExplanation": "Všeobecná vstupná/verejná webová stránka, ktorú možno použiť na niekoľko účelov, ako je predstavenie vašej spoločnosti, predaj vašich produktov atď.",
    "ABPFrameworkEBook": "E-kniha Mastering ABP Framework",
    "MasteringAbpFrameworkEBookDescription": "Zahrnuté vo vašej obchodnej licencii ABP",
    "FullName": "Celé meno",
    "LicenseTypeNotCorrect": "Typ licencie nie je správny!",
    "Trainings": "Školenia",
    "ChooseTrainingPlaceholder": "Vyberte si tréning...",
    "DoYouNeedTrainings": "Potrebujete jedno z týchto školení?",
    "DoYouNeedTraining": "Potrebujete školenie {0}?",
    "GetInTouchUs": "spojte sa s nami",
    "ForMoreInformationClickHere": "Pre viac informácií kliknite <a href='{0}'>sem.</a>",
    "ForMoreInformationClickHereByClass": "<span class=\"{1}\">Pre viac informácií kliknite</span> <a href='{0}'>sem.</a>",
    "IsGetOnboardingTraining": "Chceli by ste absolvovať školenie v oblasti onboardingu a vývoja webových aplikácií?",
    "OnboardingWebApplicationDevelopmentTrainingMessage": "Ak chcete naplánovať svoj tréningový kalendár, po vytvorení organizácie kontaktujte {0}",
    "CustomPurchaseMessage": "Pre ďalší krok kliknite na {0} a kontaktujte nás.",
    "Note": "Poznámka",
    "AdditionalNote": "Dodatočná poznámka",
    "OnboardingTrainingFaqTitle": "Máte školenie ABP onboarding?",
    "OnboardingTrainingFaqExplanation": "Áno, máme školiace služby ABP, ktoré vám pomôžu rýchlo spustiť váš projekt ABP. Dozviete sa o ABP od hlavného člena tímu ABP a získate zručnosti na začatie vášho projektu ABP. Na onboardingovom školení vám vysvetlíme, ako nastaviť vaše vývojové prostredie, nainštalovať požadované nástroje, vytvoriť plne funkčnú stránku CRUD. Školenie bude prebiehať naživo a bude sa používať aplikácia Zoom a sme otvorení využívaniu ďalších platforiem online stretnutí. Jazykom školenia bude angličtina. Svoje otázky o ABP môžete klásť aj počas sedení. Pre obe strany bude naplánovaný vhodný čas a dátum. Ak chcete získať ďalšie informácie, kontaktujte nás na adrese <a href=\"mailto:info@abp.io\">info@abp.io</a>.",
    "AddBasket": "Pridať do košíka",
    "SendTrainingRequest": "Odoslať žiadosť o školenie",
    "OnlyEnglishVersionOfThisDocumentIsTheRecentAndValid": "* Anglická verzia tohto dokumentu je najaktuálnejšia a v akomkoľvek spore bude rozhodujúca anglická verzia.",
    "Pricing_Page_Title": "Ceny a plány",
    "Pricing_Page_Description": "Vyberte si funkcie a funkcie, ktoré vaša firma dnes potrebuje. Kúpte si licenciu ABP Commercial a vytvorte neobmedzené projekty.",
    "Pricing_Page_HurryUp": "Ponáhľaj sa!",
    "Pricing_Page_BuyLicense": "Kúpte si licenciu za <strong>ceny 2021</strong> do 16. januára!",
    "Pricing_Page_ValidForExistingCustomers": "Platí aj pre existujúcich zákazníkov a obnovy licencií.",
    "Pricing_Page_Hint1": "Cena licencie zahŕňa určitý počet miest pre vývojárov. Ak máte viac vývojárov, vždy si môžete zakúpiť ďalšie miesta.",
    "Pricing_Page_Hint2": "Teraz alebo v budúcnosti si môžete zakúpiť ďalšie vývojárske licencie. Licencie sú založené na mieste, takže si môžete preniesť miesto z jedného vývojára na druhého.",
    "Pricing_Page_Hint3": "S vašou licenciou môžete vyvinúť neobmedzený počet rôznych produktov.",
    "Pricing_Page_Hint4": "ABP Suite je nástroj, ktorý vám pomôže pri vývoji a zlepší vašu produktivitu. Podporuje generovanie CRUD stránok a vytváranie nových projektov.",
    "Pricing_Page_Hint5": "Vo svojich aplikáciách môžete použiť všetky predpripravené moduly.",
    "Pricing_Page_Hint6": "Vo svojich aplikáciách môžete použiť všetky predpripravené témy.",
    "Pricing_Page_Hint7": "Spúšťacia šablóna je riešením Visual Studio, ktoré vám umožní spustiť projekt. Všetky základné moduly sú pridané a predkonfigurované pre vás.",
    "Pricing_Page_Hint8": "Elektronická kniha Mastering ABP Framework vysvetľuje, ako implementovať riešenia .NET s osvedčenými postupmi. Predáva sa na Amazon.com a s licenciou si ju môžete stiahnuť zadarmo.",
    "Pricing_Page_Hint9": "Môžete si stiahnuť zdrojový kód akéhokoľvek modulu. Možno budete chcieť pridať zdrojový kód do svojho riešenia, aby ste urobili radikálne zmeny, alebo si ho z bezpečnostných dôvodov jednoducho ponechajte pre seba.",
    "Pricing_Page_Hint10": "Licencie sú na celý život. To znamená, že môžete pokračovať vo vývoji svojej aplikácie navždy. Prístup k najnovšej verzii a získanie podpory sú poskytované v rámci licenčného obdobia (1 rok, pokiaľ si ju neobnovíte).",
    "Pricing_Page_Hint11": "Žiadne obmedzenia nasadenia! Môžete nasadiť na toľko serverov, koľko chcete, vrátane cloudových služieb alebo lokálnych služieb.",
    "Pricing_Page_Hint12": "Moduly, témy a nástroje môžete aktualizovať na najnovšiu verziu v rámci aktívneho licenčného obdobia. Po vypršaní platnosti licencie si ju musíte obnoviť, aby ste mohli naďalej dostávať aktualizácie opráv chýb, nových funkcií a vylepšení.",
    "Pricing_Page_Hint13": "Prémiovú podporu môžete získať na jeden rok (obnovením licencie si ju môžete predĺžiť).",
    "Pricing_Page_Hint14": "Tímové a obchodné licencie majú limit počtu incidentov/otázok. Ak si zakúpite ďalšie vývojárske licencie, váš limit incidentov sa zvýši o {0} (pre tímovú licenciu) alebo {1} (pre obchodnú licenciu) na vývojára.",
    "Pricing_Page_Hint15": "Iba Enterprise License zahŕňa súkromnú podporu. Môžete poslať e-mail priamo tímu ABP alebo klásť otázky na support.abp.io s možnosťou súkromného lístka. Súkromné vstupenky nie sú viditeľné pre verejnosť.",
    "Pricing_Page_Hint16": "Môžete si stiahnuť zdrojový kód všetkých tém ABP. Možno budete chcieť pridať zdrojový kód do svojho riešenia, aby ste urobili radikálne zmeny, alebo si ho z bezpečnostných dôvodov jednoducho ponechajte pre seba.",
    "Pricing_Page_Testimonial_1": "ABP Commercial umožnila spoločnosti SC Ventures dodať bankovú silo-databázovú platformu SaaS na úrovni bánk za 9 mesiacov na podporu financovania pohľadávok/záväzkov dodávateľského reťazca faktúr s vysokou hodnotou z viacerých integrovaných kotiev. Modularita ABP umožnila tímu dodávať v rekordnom čase, prejsť všetkými VAPT a nasadiť kontajnerový balík mikroslužieb prostredníctvom úplného CI/CD a potrubí do výroby.",
    "Pricing_Page_Testimonial_2": "Vidíme hodnotu používania ABP Commercial na zníženie réžie projektov vlastného vývoja. Tím je schopný zjednotiť vzor kódu v rôznych projektových tokoch. V rámci vidíme väčší potenciál, aby sme mohli vytvárať nové funkcie rýchlejšie ako predtým. Veríme, že budeme neustále vidieť hodnotu využívania ABP Commercial.",
    "Pricing_Page_Testimonial_3": "Milujeme ABP. Nemusíme písať všetko od začiatku. Začíname od hotových funkcií a sústredíme sa len na to, čo skutočne potrebujeme napísať. ABP má tiež dobrú architektúru a kód je vysoko kvalitný s menším počtom chýb. Ak by sme mali všetko potrebné napísať sami, možno by sme museli stráviť roky. Ešte jedna vec, ktorá sa nám páči, je, že nová verzia, oprava problémov alebo vylepšenie vychádza veľmi skoro každý druhý týždeň. Nečakáme príliš dlho.",
    "Pricing_Page_Testimonial_4": "ABP Commercial je fantastický produkt, ktorý by som odporučil. Komerčné produkty na trh pre našich zákazníkov na jedinej konfigurovateľnej platforme. Začína skok, že rámec a nástroje, ktoré poskytuje každý tím, stoja za každý cent. ABP Commercial najlepšie vyhovovala našim potrebám.",
    "Pricing_Page_Testimonial_5": "ABP Framework nie je len rámec, ale je aj sprievodcom pre vývoj/riadenie projektov, pretože poskytuje školenia DDD, GenericRepository, DI, Microservice a Modularity. Aj keď samotný framework nebudete používať, môžete sa rozvíjať pomocou docs.abp.io, ktoré je dobre a profesionálne pripravené (OpenIddict, Redis, Quartz atď.). Pretože veľa vecí je vopred vytvorených, výrazne to skracuje čas vývoja projektu (ako prihlasovacia stránka, spracovanie výnimiek, filtrovanie údajov, seedovanie, protokolovanie auditu, lokalizácia, automatický ovládač API atď.). Ako príklad z našej aplikácie som na riadenie zásob použil Local Event Bus. Takže som schopný riadiť pohyby objednávok napísaním skladového manipulátora. Je úžasné nestrácať čas pre CreationTime, CreatorId. Plnia sa automaticky.",
    "Pricing_Page_Testimonial_6": "ABP Framework je dobrý rámec, ale potrebuje čas na pochopenie rôznych vrstiev, tried a knižníc, ktoré používa (najmä ABP). Strávil som veľa času čítaním kódovej základne, ale ABP Commercial nám ušetril čas pri vytváraní špeciálnych entít projektu (AR) a úložiska prepojeného s každou z nich. Páčil sa mi aj prístup používaný v ABP je veľmi vyspelý; vieme, že je založený na DDD a monolit.",
    "Pricing_Page_Testimonial_7": "Ako startup musíme rýchlo opakovať a venovať minimálny čas štandardným a vedľajším funkciám. \n Naši inžinieri siahajú od veľmi skúsených až po juniorských inžinierov a potrebovali sme spoločné porozumenie a spôsob zdieľania technických a doménových znalostí. ABP nám to umožnila vďaka ich skvelým sprievodcom a dokumentácii. \n Sú veci, o ktoré sme sa nemuseli starať, keďže fungujú hneď po vybalení s ABP. \n ABP nám pomohol zefektívniť rýchle prototypovanie a vývoj za menej ako 4 týždne od začiatku funkcie až po výrobu. So všetkými svojimi prémiovými funkciami zahrnutými v licencii nám spoločnosť ABP poskytla „Spustenie v krabici“ na strane softvérového inžinierstva.",
    "Pricing_Page_Testimonial_8": "ABP commercial by som odporučil všetkým, ktorí chcú rozšíriť ponuku produktov pre svojich zákazníkov. Je to fantastické, keď potrebujete použiť distribuované podnikové prostredie (Angular, WPF, Win&amp;Linux). Okrem ich produktov milujeme aj ich podporu, vďaka ktorej je naša práca rýchlejšia a jednoduchšia. Už teraz vieme, že sme našli skvelého partnera do budúcnosti, ktorý nás podporí v rozširovaní nášho podnikania.",
    "Pricing_Page_Testimonial_9": "Sme spoločnosť s 2 zamestnancami, ktorá pôsobí na trhu už viac ako 20 rokov. \n Z hľadiska našich skúseností s ABP Commercial nás oslovil klient s požiadavkou, aby sme vyvinuli novú aplikáciu ľudských zdrojov v modernom prostredí, ktorá by nahradila ich 25 rokov starú aplikáciu Access. Rozhodli sme sa prejsť z desktopového riešenia na webové. \n \n V tom čase sme mali veľmi málo vedomostí o webových aplikáciách a .NET, ale narazili sme na ABP Commercial as pomocou ABP Framework, technickej dokumentácie a ABP Suite sme boli schopní nielen vyvinúť aplikáciu špecifikácie klienta, ale do roka úspešne fungujú aj v prostredí .NET.",
    "AbpBookDownloadArea_ClaimYourEBook": "Požiadajte o svoju elektronickú knihu <span class='gradient-framework'>Mastering ABP Framework</span>",
    "AddMemberModal_Warning_1": "Ak <strong>používateľské meno</strong> , ktoré sa pokúšate pridať, v systéme neexistuje, požiadajte člena tímu, aby sa zaregistroval na <a href='{0}/Account/Register'>{0}</a> a zdieľal s vami používateľské meno svojho účtu.",
    "MyOrganizations_Detail_WelcomeMessage": "Vitajte vo svojej organizácii, {0}",
    "MyOrganizations_Detail_OrganizationManagement": "<span class=\"gradient-commercial\">Riadenie</span> organizácie",
    "OrganizationDisplayName": "Zobrazovaný názov organizácie",
    "MyOrganizations_Detail_EditDisplayName": "Upraviť zobrazovaný názov",
    "MyOrganizations_Detail_UpgradeYourLicense": "Aktualizujte si licenciu",
    "MyOrganizations_Detail_LicenseStartAndExpiryDate": "Dátum začatia licencie – dátum vypršania platnosti",
    "MyOrganizations_Detail_OwnerRightInfo": "Používate {0} zo svojich {1} práv vlastníka.",
    "MyOrganizations_Detail_CopyApiKey": "Skopírujte kľúč",
    "MyOrganizations_Detail_ApiKeyDescription": "Kľúč API je token balíkov PRO hostených na <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{1}.</a>",
    "MyOrganizations_Detail_YourPrivateNugetSource": "Váš súkromný zdroj NuGet je <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{0}</a>",
    "MyOrganizations_Detail_PrivateNugetSourceWarning": "Toto sa automaticky pridá ako informačný kanál do vášho NuGet.Config vo vašom riešení ABP. Nezdieľajte svoj súkromný kľúč s neoprávnenými používateľmi!",
    "MyOrganizations_Detail_DeveloperSeatInfo": "Používate {0} zo svojich {1} miest pre vývojárov.",
    "NeedMoreSeatsForYourTeam": "Potrebujete viac miest pre váš tím?",
    "MyOrganizations_Detail_PricePerYear": "{0} ročne",
    "MyOrganizations_Detail_PurchaseDeveloperSeats": "Kúpte si miesta pre vývojárov",
    "Invoices": "faktúry",
    "RequestInvoice": "Vyžiadať faktúru",
    "OrderNumber": "Číslo objednávky",
    "Date": "Dátum",
    "Products": "Produkty",
    "TotalPrice": "Celková cena",
    "ThereIsNoInvoice": "Neexistuje žiadna faktúra",
    "MyOrganizations_Detail_PaymentProviderInfo": "Ak ste si licenciu zakúpili prostredníctvom brány <i>{0}</i> , odošle faktúru vo formáte PDF na vašu e-mailovú adresu, pozri <a href=\"{1}\" target=\"_blank\">fakturáciu {0}.</a>",
    "MyOrganizations_Detail_PayUInfo": "Ak ste nakúpili cez bránu <i>Iyzico</i> , kliknite na tlačidlo „Vyžiadať faktúru“ a vyplňte fakturačné údaje.",
    "MyOrganizations_Detail_ConclusionInfo": "Vaša žiadosť o faktúru bude uzatvorená do {0} pracovných dní.",
    "ExtendYourLicense": "Predĺžte si licenciu <span class=\"text-primary\">{0}</span>",
    "Continue": "ďalej",
    "PurchaseLicense": "Kúpiť licenciu {0}",
    "DownloadInvoiceModal_DownloadInvoice": "Stiahnite si faktúru",
    "DownloadInvoiceModal_SaveInformationOnlyOnce": "Svoje fakturačné údaje môžete uložiť iba raz.",
    "InvoiceModal_EnterCompanyName": "Zadajte názov svojej spoločnosti...",
    "InvoiceModal_EnterCompanyAddress": "Zadajte adresu svojej spoločnosti...",
    "InvoiceModal_EnterTaxNumber": "Zadajte svoje DIČ/DIČ, ak je k dispozícii...",
    "RequestInvoiceModal_EnterNotes": "Zadajte dodatočnú správu o vašej faktúre...",
    "PrePayment_PayWithIyzico": "Budete platiť cez Iyzico",
    "ContinueToCheckout": "Pokračujte do pokladne",
    "PrePayment_IyzicoRedirectionInfo": "Budete presmerovaní na platobnú bránu Iyzico, aby ste bezpečne dokončili nákup.",
    "PrePayment_IyzicoAcceptVisaAndMasterCard": "Iyzico akceptuje karty Visa a MasterCard.",
    "Purchase": "Nákup",
    "AcceptTermsAndConditions": "Prečítal som si, rozumiem a súhlasím so <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">zásadami ochrany osobných údajov</a> , <a href=\"{1}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">zmluvnými podmienkami</a> a <a href=\"{2}\" target=\"_blank\" class=\"text-primary\">EULA.</a>",
    "AcceptTermsAndConditionsWarningMessage": "Prijmite prosím zásady ochrany osobných údajov a zmluvné podmienky",
    "SelectGatewayToContinue": "Ak chcete pokračovať, vyberte bránu!",
    "GatewaySelection_SelectGateway": "Vyberte platobnú bránu",
    "GatewaySelection_RedirectionMessage": "Následne budete presmerovaní na webovú stránku vybranej platobnej brány pre transakciu.",
    "PaymentSucceed_PaymentSuccessMessage": "Platba úspešná",
    "PaymentSucceed_ThanksForPurchase": "Ďakujem za Váš nákup!",
    "PaymentSucceed_CreateYourOrganization": "Vytvorte si organizáciu",
    "PaymentSucceed_AddMeAsDeveloper": "Som tiež vývojár, pridajte ma ako vývojára do svojej organizácie.",
    "PaymentSucceed_CreateOrganization": "Vytvoriť organizáciu",
    "PaymentSucceed_OrganizationDescription": "Organizácia pozostáva z vývojárov a vlastníkov. Vývojári sú používatelia, ktorí píšu kód do projektu ABP a budú mať prospech z webovej stránky <a href=\"{0}\" target=\"_blank\">{1}</a> . Vlastníci sú používatelia, ktorí prideľujú miesta pre vývojárov a spravujú licencovanie.",
    "PaymentSucceed_ViewOrganization": "Kliknutím sem zobrazíte organizáciu",
    "Purchase_TotalAnnualPrice": "TOTAL <small class=\"opacity-50\">(ročný poplatok)</small>",
    "Purchase_TrainingPrice": "Cena školenia",
    "Purchase_OnboardingTraining": "Živé školenie o onboardingu a vývoji webových aplikácií",
    "TotalDeveloperPrice": "Celková cena vývojára",
    "Purchase_PricePerDeveloper": "<span>{0} {1}</span> na vývojára",
    "Purchase_IncludedDeveloperInfo": "Vrátane {0} {1}.",
    "Purchase_LicenseExtraDeveloperPurchaseMessage": "<span class=\"fw-bold\">Licencia {0}</span> zahŕňa {1} vývojárov. Môžete pridať ďalších vývojárov.",
    "StartupTemplates_Page_Title": "ABP Startup Templates",
    "StartupTemplates_Page_Description": "ABP Commercial vám umožňuje vytvárať riešenia s akoukoľvek úrovňou zložitosti. Poskytuje dve hlavné predpripravené riešenia na spustenie. Môžete si vybrať ten, ktorý sa približuje vašim požiadavkám, a vytvoriť si na ňom svoje vlastné riešenie.",
    "MicroserviceStartupSolutionForDotnet": "Microservice Startup Solution for .NET",
    "MonolithSolutionForDotnet": "Monolitické (modulárne) riešenie pre .NET",
    "TrainingDetailsHeaderInfo_TrainingHour": "{0} hod.",
    "Trainings_Content": "Obsah školenia",
    "Trial_Page_StartYourFreeTrial": "Spusťte <span class=\"gradient-commercial\">bezplatnú skúšobnú verziu</span>",
    "TrialLicenseFeatures": "Budete môcť využívať všetky komerčné funkcie ABP",
    "TrialPeriodDays": "Budete mať tímovú licenciu na {0} dní",
    "TrialForumSupportIncident": "Budete mať {0} incidentov podpory fóra",
    "Contact_Page_Title": "Kontaktujte vývojový tím ABP",
    "Contact_Page_Description": "Ak potrebujete pomoc alebo sa podeľte o svoje myšlienky a názory, kontaktujte vývojový tím ABP! Tím podpory ABP je pripravený pomôcť.",
    "Demo_Page_Title": "Vytvorte ukážku",
    "Demo_Page_Description": "Vytvorte si bezplatné demo, aby ste videli vzorovú aplikáciu vytvorenú pomocou štartovacej šablóny ABP Commercial. Neopakujte sa pri bežných požiadavkách aplikácie.",
    "Discounted_Page_Title": "Zvýhodnená cena",
    "Discounted_Page_Description": "Vyberte si funkcie a funkcie, ktoré vaša firma dnes potrebuje. Kúpte si licenciu ABP Commercial a vytvorte neobmedzené projekty",
    "Faq_Page_Title": "Často kladené otázky (FAQ)",
    "Faq_Page_Description": "Máte nejaké otázky? Vyhľadajte často kladené otázky alebo nám položte otázku pomocou kontaktného formulára.",
    "Faq_Page_SwiftCode": "SWIFT kód",
    "Faq_Page_BankName": "Meno banky",
    "Faq_Page_AccountName": "Názov účtu",
    "Faq_Page_AccountNumber": "Číslo účtu",
    "Faq_Page_Currency": "mena",
    "Faq_Page_VatNumber": "identifikačné číslo DPH",
    "Faq_Page_OtherCurrenciesInfo": "Pre ostatné meny pozri <a href='{0}'>všetky účty</a>",
    "ProjectCreatedSuccess_Page_Title": "Váš projekt bol vytvorený",
    "ProjectCreatedSuccess_Page_Description": "Váš projekt ABP bol úspešne vytvorený!",
    "Suite_Page_Title": "Suita ABP",
    "Suite_Page_Description": "ABP Commercial poskytuje nástroje na rýchly vývoj aplikácií na zvýšenie produktivity vývojárov. ABP Suite vám umožňuje jednoducho vytvárať stránky CRUD.",
    "Themes_Page_Title": "Témy ABP",
    "Themes_Page_Description": "ABP Commercial poskytuje viacero profesionálnych, moderných tém používateľského rozhrania. Vytvorte si bezplatnú ukážku, aby ste mali rýchly prehľad o tom, ako vyzerá používateľské rozhranie.",
    "Tools_Page_Title": "Nástroje na rýchly vývoj aplikácií",
    "Tools_Page_Description": "ABP Commercial poskytuje nástroje na rýchly vývoj aplikácií na zvýšenie produktivity vývojárov. ABP Suite vám umožňuje jednoducho vytvárať stránky CRUD.",
    "DeveloperPrice": "Cena vývojára",
    "AdditionalDeveloperPaymentInfoSection_AdditionalDevelopers": "{0} <small>vývojárov</small>",
    "LicenseRemainingDays": "po dobu <span>{0}</span> dní",
    "ExtendPaymentInfoSection_Description": "Predĺžením/obnovením licencie budete naďalej získavať <a href=\"{0}\" target=\"_blank\">prémiovú podporu</a> . Budete tiež môcť získať veľké alebo menšie aktualizácie pre moduly a témy. Budete môcť pokračovať vo vytváraní nových projektov. A stále budete môcť používať <a href=\"{1}\" target=\"_blank\">ABP Suite</a> , ktorý urýchľuje váš vývoj.",
    "LicenseRenewalPrice": "Cena za obnovenie licencie",
    "LicensePrice": "Cena licencie",
    "TrialLicensePaymentInfoSection_Description": "<strong>Zakúpiť licenciu:</strong> Zakúpením licencie budete aj naďalej získavať <a href=\"{0}\" target=\"_blank\" rel=\"noopener\">prémiovú podporu</a> . Budete tiež môcť získať veľké alebo menšie aktualizácie pre moduly a témy. Budete môcť pokračovať vo vytváraní nových projektov. A stále budete môcť používať <a href=\"{1}\" target=\"_blank\" rel=\"noopener\">ABP Suite</a> , ktorý urýchľuje váš vývoj.<br> Pozrite si <a href=\"{2}\" target=\"_blank\" rel=\"noopener\">porovnávaciu tabuľku licencií</a> a skontrolujte rozdiely medzi typmi licencií.",
    "SelectTargetLicense": "Vyberte Cieľovú licenciu",
    "UpgradePaymentInfoSection_ExtendMyLicenseForOneYear": "Áno, predĺžiť platnosť mojej licencie o 1 rok.",
    "UpgradePaymentInfoSection_WantToExtendLicense": "Chcete si predĺžiť licenciu o 1 rok?",
    "UpgradePaymentInfoSection_UpgradingWillNotExtendLicense": "Inovácia nepredĺži dátum vypršania platnosti licencie!",
    "UpgradePaymentInfoSection_LicenseUpgradeDescription": "Inováciou vašej licencie budete povýšený na vyšší typ licencie, čo vám umožní získať ďalšie výhody. Pozrite si <a href=\"/Pricing\" target=\"_blank\">porovnávaciu tabuľku licencií</a> a skontrolujte rozdiely medzi typmi licencií.",
    "Landing_Page_CustomerStories": "Príbehy zákazníkov",
    "Landing_Page_OurGreatCustomers": "Naši skvelí zákazníci",
    "Landing_Page_WebApplicationFramework": "Web Application Framework",
    "Landing_Page_WebDevelopmentPlatform": "Web Development Platform",
    "Landing_Page_CompleteWebDevelopmentPlatform": "Kompletná platforma pre vývoj webu",
    "Landing_Page_TryFreeDemo": "Vyskúšajte bezplatné demo",
    "Landing_Page_StartingPointForWebApplications": "Východiskový bod pre webové aplikácie založené na ASP.NET Core! Je založený na ABP Framework pre najlepší vývoj webu.",
    "Landing_Page_AbpProvidesSoftwareInfrastructure": "ABP Framework poskytuje softvérovú infraštruktúru na vývoj vynikajúcich webových aplikácií s osvedčenými postupmi.",
    "Landing_Page_MicroserviceCompatibleArchitecture": "Architektúra kompatibilná s mikroslužbami",
    "Landing_Page_PreBuiltApplicationModulesAndThemes": "Vopred zostavené aplikačné moduly a témy",
    "Landing_Page_MultiTenantArchitecture": "Architektúra viacerých nájomníkov",
    "Landing_Page_MultiTenancyDescription": "Aplikácie SaaS sú jednoduché! Integrovaný multiprenájom z databázy do používateľského rozhrania.",
    "Landing_Page_DDDIntroduction": "Navrhnuté a vyvinuté na základe vzorov a princípov DDD. Poskytuje vrstvený model pre vašu aplikáciu.",
    "Landing_Page_CrossCuttingConcernsInfo": "Kompletná infraštruktúra pre autorizáciu, validáciu, spracovanie výnimiek, ukladanie do vyrovnávacej pamäte, protokolovanie auditu, správu transakcií a ďalšie.",
    "Landing_Page_PreBuiltApplicationModules": "Vopred zostavené aplikačné moduly, ktoré zahŕňajú najbežnejšie požiadavky na webové aplikácie.",
    "Landing_Page_ChatModule": "Chat",
    "Landing_Page_DocsModule": "Docs",
    "Landing_Page_FileManagementModule": "Správa súborov",
    "Landing_Page_CustomerStory_1": "ABP Commercial umožnila SC Ventures dodať bankovú silo-databázovú platformu SaaS na úrovni bánk za 9 mesiacov na podporu financovania pohľadávok/záväzkov dodávateľského reťazca faktúr s vysokou hodnotou z viacerých integrovaných kotiev. Modularita ABP umožnila tímu dodávať v rekordnom čase, prejsť všetkými VAPT a nasadiť kontajnerový balík mikroslužieb prostredníctvom úplného CI/CD a potrubí do výroby.",
    "Landing_Page_CustomerStory_2": "Vidíme hodnotu používania ABP Commercial na zníženie réžie projektov vlastného vývoja. Tím môže zjednotiť vzor kódu v rôznych prúdoch projektu. V rámci vidíme väčší potenciál, aby sme mohli vytvárať nové funkcie rýchlejšie ako predtým. Veríme, že budeme neustále vidieť hodnotu využívania ABP Commercial.",
    "Landing_Page_CustomerStory_3": "Milujeme ABP. Nemusíme písať všetko od začiatku. Začíname od hotových funkcií a sústredíme sa len na to, čo skutočne potrebujeme napísať. ABP má tiež dobrú architektúru a kód je vysoko kvalitný s menším počtom chýb. Ak by sme mali všetko potrebné napísať sami, možno by sme museli stráviť roky. Ešte jedna vec, ktorá sa nám páči, je, že nová verzia alebo oprava problému alebo vylepšenie vychádza veľmi skoro \n každý druhý týždeň. Nečakáme príliš dlho.",
    "Landing_Page_CustomerStory_4": "ABP Commercial je fantastický produkt, ktorý by som odporučil. Komerčné produkty na trh pre našich zákazníkov na jedinej konfigurovateľnej platforme. Začína skok, že rámec a nástroje, ktoré poskytuje každý tím, stoja za každý cent. ABP Commercial najlepšie vyhovovala našim potrebám.",
    "Landing_Page_AdditionalServices": "Vlastná alebo objemová licencia, onboarding, živé školenia a podpora, vlastný vývoj projektov, portovanie existujúcich projektov a ďalšie...",
    "Landing_Page_IncludedDeveloperLicenses": "Zahrnuté licencie pre vývojárov <strong>: {0}</strong>",
    "Landing_Page_SeeOnDemo": "Pozri na Demo",
    "Landing_Page_LeptonThemes": "LeptonTémy",
    "Landing_Page_AccountModuleDescription_1": "Tento modul implementuje autentifikačný systém pre aplikáciu;",
    "Landing_Page_AccountModuleDescription_2": "Poskytuje <strong>prihlasovaciu</strong> stránku s používateľským menom a heslom",
    "Landing_Page_AccountModuleDescription_3": "Poskytuje <strong>registračnú</strong> stránku na vytvorenie nového účtu.",
    "Landing_Page_AccountModuleDescription_4": "Poskytuje stránku <strong>so zabudnutým heslom</strong> na odoslanie odkazu <strong>na obnovenie hesla</strong> ako e-mail.",
    "Landing_Page_AccountModuleDescription_5": "Poskytuje funkciu <strong>potvrdenia e-mailom</strong> s používateľským rozhraním.",
    "Landing_Page_AccountModuleDescription_6": "Implementuje <strong>dvojfaktorovú</strong> autentifikáciu (SMS a e-mail).",
    "Landing_Page_AccountModuleDescription_7": "Implementuje <strong>uzamknutie používateľa</strong> (uzamkne účet na nastavený čas, keď dôjde k určitému počtu neúspešných prihlásení z dôvodu neplatných poverení v určitom časovom intervale).",
    "Landing_Page_AccountModuleDescription_8": "Implementuje používateľské rozhranie a funkčnosť autentifikačného servera <strong>Identity Server</strong> .",
    "Landing_Page_AccountModuleDescription_9": "Umožňuje <strong>prepínať medzi nájomníkmi</strong> v prostredí viacerých nájomníkov.",
    "Landing_Page_AccountModuleDescription_10": "Umožňuje zmeniť <strong>jazyk používateľského rozhrania</strong> aplikácie.",
    "Landing_Page_AuditLoggingModuleDescription_1": "Tento modul poskytuje používateľské rozhranie na vykazovanie protokolu auditu pre infraštruktúru auditu. Umožňuje vyhľadávať, filtrovať a zobrazovať záznamy denníka auditu a denníky zmien entity.",
    "Landing_Page_AuditLoggingModuleDescription_2": "Záznam protokolu auditu obsahuje kritické údaje o každej požiadavke klienta:",
    "Landing_Page_AuditLoggingModuleDescription_3": "URL, prehliadač, IP adresa, meno klienta",
    "Landing_Page_AuditLoggingModuleDescription_4": "Používateľ",
    "Landing_Page_AuditLoggingModuleDescription_5": "Metóda HTTP, návratový stavový kód HTTP",
    "Landing_Page_AuditLoggingModuleDescription_6": "Úspech/neúspech, podrobnosti o výnimke, ak sú k dispozícii",
    "Landing_Page_AuditLoggingModuleDescription_7": "Trvanie realizácie žiadosti",
    "Landing_Page_AuditLoggingModuleDescription_8": "V tejto žiadosti boli entity vytvorené, odstránené alebo aktualizované (so zmenenými vlastnosťami).",
    "Landing_Page_BloggingModuleDescription_1": "Tento modul pridá jednoduchý blog do vašej aplikácie ABP;",
    "Landing_Page_BloggingModuleDescription_2": "Umožňuje vytvárať viacero blogov v jednej aplikácii.",
    "Landing_Page_BloggingModuleDescription_3": "Podporuje formát Markdown.",
    "Landing_Page_BloggingModuleDescription_4": "Umožňuje napísať komentár k príspevku.",
    "Landing_Page_BloggingModuleDescription_5": "Umožňuje priradiť značky k blogovým príspevkom.",
    "Landing_Page_BloggingModuleDescription_6": "Pozrite si webovú stránku <a href=\"blog.abp.io\">blog.abp.io</a> ako živý príklad modulu blogovania.",
    "Landing_Page_ChatModuleDescription_1": "Tento modul sa používa na zasielanie správ v reálnom čase medzi používateľmi v aplikácii.",
    "Landing_Page_ChatModuleDescription_2": "Správy v reálnom čase na stránke rozhovoru.",
    "Landing_Page_ChatModuleDescription_3": "Vyhľadajte používateľov v aplikácii pre nové konverzácie.",
    "Landing_Page_ChatModuleDescription_4": "Zoznam kontaktov pre nedávne konverzácie.",
    "Landing_Page_ChatModuleDescription_5": "Upozornenia na nové správy, keď sa používateľ pozerá na inú stránku.",
    "Landing_Page_ChatModuleDescription_6": "Odznak celkového počtu neprečítaných správ na ikone ponuky.",
    "Landing_Page_ChatModuleDescription_7": "Počet neprečítaných správ pre každú konverzáciu.",
    "Landing_Page_ChatModuleDescription_8": "Lenivé nabité konverzácie.",
    "Landing_Page_DocsModuleDescription_1": "Tento modul sa používa na vytváranie webových stránok s technickou dokumentáciou;",
    "Landing_Page_DocsModuleDescription_2": "Zabudovaná <strong>integrácia GitHub</strong> : Priamo píšte a spravujte dokumenty na GitHub.",
    "Landing_Page_DocsModuleDescription_3": "Podpora <strong>verzií</strong> priamo integrovaná do vydaní GitHub.",
    "Landing_Page_DocsModuleDescription_4": "Podporuje <strong>viacjazyčnosť</strong> (s záložnou podporou predvoleného jazyka).",
    "Landing_Page_DocsModuleDescription_5": "Podporuje formáty <strong>Markdown</strong> a HTML.",
    "Landing_Page_DocsModuleDescription_6": "Poskytuje <strong>navigáciu</strong> a časť <strong>s prehľadom</strong> .",
    "Landing_Page_DocsModuleDescription_7": "Umožňuje hosťovať <strong>viac projektovej</strong> dokumentácie v jednej aplikácii.",
    "Landing_Page_DocsModuleDescription_8": "Odkazy na súbor na GitHub, takže ktokoľvek môže jednoducho prispieť kliknutím na <strong>odkaz Upraviť</strong> .",
    "Landing_Page_DocsModuleDescription_9": "Okrem zdroja GitHub umožňuje jednoducho použiť priečinok ako zdroj dokumentácie.",
    "Landing_Page_FileManagementModuleDescription_1": "Nahrávajte, sťahujte a organizujte súbory v hierarchickej štruktúre priečinkov.",
    "Landing_Page_FileManagementModuleDescription_2": "Tento modul sa používa na nahrávanie, sťahovanie a organizovanie súborov v hierarchickej štruktúre priečinkov. Je tiež kompatibilný s viacnásobným prenájmom a môžete určiť limit celkovej veľkosti pre svojich nájomníkov.",
    "Landing_Page_FileManagementModuleDescription_3": "Tento modul je založený na systéme <a href=\"https://docs.abp.io/en/abp/latest/Blob-Storing\">BLOB Storing</a> , takže na ukladanie obsahu súborov môže využívať rôznych poskytovateľov úložiska.",
    "Landing_Page_IdentityModuleDescription_1": "Tento modul implementuje systém používateľov a rolí aplikácie;",
    "Landing_Page_IdentityModuleDescription_2": "Postavené na knižnici <a href=\"https://docs.microsoft.com/en-us/aspnet/core/security/authentication/identity\">Microsoft ASP.NET Core Identity</a> .",
    "Landing_Page_IdentityModuleDescription_3": "Spravujte <strong>roly</strong> a <strong>používateľov</strong> v systéme. Používateľ môže mať <strong>viacero rolí</strong> .",
    "Landing_Page_IdentityModuleDescription_4": "Nastavte <strong>povolenia</strong> na úrovniach rolí a používateľov.",
    "Landing_Page_IdentityModuleDescription_5": "Povoliť/zakázať <strong>dvojfaktorové overenie</strong> a <strong>uzamknutie</strong> používateľa na používateľa.",
    "Landing_Page_IdentityModuleDescription_6": "Spravujte základný <strong>používateľský profil</strong> a <strong>heslo</strong> .",
    "Landing_Page_IdentityModuleDescription_7": "Spravujte <strong>typy nárokov</strong> v systéme, nastavte nároky na roly a používateľov.",
    "Landing_Page_IdentityModuleDescription_8": "Stránka s nastaveniami na správu <strong>zložitosti hesla</strong> , prihlásenia používateľa, účtu a uzamknutia.",
    "Landing_Page_IdentityModuleDescription_9": "Podporuje autentifikáciu <strong>LDAP</strong> .",
    "Landing_Page_IdentityModuleDescription_10": "Poskytuje overenie <strong>e-mailu a telefónneho čísla</strong> .",
    "Landing_Page_IdentityModuleDescription_11": "Podporuje integráciu sociálnych prihlásení (Twitter, Facebook, GitHub atď...).",
    "Landing_Page_IdentityModuleDescription_12": "Spravujte <strong>organizačné jednotky</strong> v systéme.",
    "Landing_Page_PaymentModuleDescription_1": "Poskytuje integráciu pre rôzne platobné brány.",
    "Landing_Page_PaymentModuleDescription_2": "Tento modul poskytuje integráciu pre platobné brány, takže môžete jednoducho získať platbu od svojich zákazníkov.",
    "Landing_Page_PaymentModuleDescription_3": "Tento modul podporuje nasledujúce platobné brány",
    "Welcome_Page_UseSameCredentialForCommercialWebsites": "Použite rovnaké prihlasovacie údaje pre <a href=\"https://commercial.abp.io\" class=\"text-primary\">commercial.abp.io</a> aj <a href=\"https://support.abp.io\" class=\"text-primary\">support.abp.io</a> .",
    "WatchCrudPagesVideo": "Pozrite si video „Vytváranie stránok CRUD s ABP Suite“!",
    "WatchGeneratingFromDatabaseVideo": "Pozrite si video „ABP Suite: Generovanie stránok CRUD z existujúcich databázových tabuliek“!",
    "WatchTakeCloserLookVideo": "Pozrite si video „Pozrite sa bližšie na generovanie kódu: ABP Suite“!",
    "ConfirmedEmailAddressRequiredToStartTrial": "Na spustenie skúšobnej licencie by ste mali mať potvrdenú e-mailovú adresu.",
    "EmailVerificationMailNotSent": "E-mail na overenie e-mailu sa nepodarilo odoslať.",
    "GetConfirmationEmail": "<a href=\"javascript:void(0);\" id=\"{0}\" class=\"text-decoration-underline\">Kliknutím sem dostanete overovací e-mail,</a> ak ste ho ešte nedostali.",
    "WhichLicenseTypeYouAreInterestedIn": "O aký typ licencie máte záujem?",
    "DontTakeOurWordForIt": "Neberte nás za slovo...",
    "ReadAbpCommercialUsersWantYouToKnow": "Prečítajte si, čo chcú používatelia ABP Commercial vedieť",
    "Testimonial_ShortDescription_1": "Modularita ABP umožnila tímu dodať včas.",
    "Testimonial_ShortDescription_2": "Vytvárajte nové funkcie rýchlejšie ako predtým.",
    "Testimonial_ShortDescription_3": "Začíname od hotových funkcií a sústredíme sa len na to, čo skutočne potrebujeme napísať.",
    "Testimonial_ShortDescription_4": "ABP Commercial najlepšie vyhovovala našim potrebám.",
    "OnlineReviewersOnAbpCommercial": "Online recenzie na ABP Commercial",
    "SeeWhatToldAboutAbpCommercial": "Pozrite sa, čo bolo povedané o ABP Commercial, a ak chcete, napíšte svoje myšlienky.",
    "BlazoriseLicense": "Musíme si kúpiť licenciu Blazorise?",
    "BlazoriseLicenseExplanation": "Máme dohodu medzi spoločnosťami Volosoft a Megabit, na základe ktorej je licencia Blazorise pribalená k produktom ABP Commercial, preto si naši zákazníci nemusia kupovať ďalšiu licenciu Blazorise.",
    "ExtendPaymentInfoSection_DeveloperPrice": "{0}x ďalší vývojári",
    "ExtendPaymentInfoSection_DiscountRate": "Zľava {0} %",
    "TotalNetPrice": "Celková čistá cena",
    "EFCore": "Entity Framework Core",
    "All": "Všetky",
    "Mvc": "MVC",
    "DataBaseProvider": "Poskytovateľ údajov",
    "UIFramework": "UI Framework",
    "LeptonXThemeForDashboard": "Téma LeptonX pre váš administračný panel od",
    "AbpPlatform": "Platforma ABP",
    "YouDeserveGoodUXUI": "Zaslúžite si dobré používateľské rozhranie a lepšie používateľské rozhranie. Téma LeptonX od ABP je tu, aby to poslúžila.",
    "ViewLiveDemo": "Pozrite si živú ukážku témy",
    "GetLeptonX": "Získajte LeptonX teraz",
    "SeeLeptonXDocumentation": "Pozrite si dokumentáciu LeptonX",
    "SeeLeptonDocumentation": "Pozrite si dokumentáciu Lepton",
    "SimplifiedMenu": "Zjednodušené menu",
    "SimplifiedMenuDescription": "Hľadanú stránku ľahko nájdete filtrovaním ponuky",
    "YourFavoritePages": "Vaše obľúbené stránky na dosah",
    "YourFavoritePagesDescription": "Stránku môžete jednoducho pridať alebo odstrániť z obľúbených kliknutím na ikonu hviezdičky v pravom hornom rohu stránky.",
    "BreadCrumbs": "Breadcrumb pre bezproblémové prepínanie",
    "BreadCrumbsDescription": "Pomocou Breadcrumb sa môžete jedným kliknutím prepínať na stránky na rovnakej úrovni, aj keď je ľavé menu zatvorené, a funguje to na tabletoch a mobilných zariadeniach!",
    "YourMenu": "Vaše menu podľa vášho želania",
    "YourMenuDescription": "Prispôsobte si ikony a rozbaľovacie polia v používateľskej ponuke, na ktoré je možné priamo kliknúť, podľa svojich predstáv. Používateľské menu je úplne prispôsobiteľné vašim potrebám",
    "RtlSupport": "Podpora RTL pre váš jazyk",
    "RtlSupportDescription": "Téma LeptonX podporuje RTL pre váš jazyk. Možnosti jazyka sú v ponuke nastavení, kde môžete zmeniť jazyk.",
    "YourColors": "Vaše farby v používateľskom rozhraní hlavného panela správcu",
    "YourColorsDescription": "Téma LeptonX funguje podľa vašich systémových preferencií a má možnosti svetlej témy palubnej dosky, tmavého motívu palubnej dosky a polotmavej témy palubnej dosky.",
    "ArrangeContentWidth": "Ľahko usporiadajte šírku obsahu",
    "ArrangeContentWidthDescription": "Ľahko zmeňte šírku oblasti obsahu.",
    "LeptonXCompatibleWith": "Téma LeptonX je kompatibilná s",
    "MobileResponsiveTemplate": "Mobilná responzívna šablóna",
    "MobileResponsiveTemplateDescription1": "Získajte prístup k svojmu správcovskému panelu LeptonX z akéhokoľvek zariadenia, ktoré sa vám páči.",
    "MobileResponsiveTemplateDescription2": "Je navrhnutý tak, aby ste ho mohli jednoducho používať v každom vašom zariadení. Je responzívny na mobilných zariadeniach a veľkostiach tabletov.",
    "TopMenuLayoutOption": "Možnosť rozloženia horného menu",
    "TopMenuLayoutOptionDescription1": "Ak by ste chceli nastaviť svoju webovú stránku s rovnakým administračným panelom, je možné to urobiť pomocou témy LeptonX!",
    "TopMenuLayoutOptionDescription2": "Stačí vyskúšať rozloženie horného menu LeptonX, aby sa to stalo!",
    "EasilyCustomizable": "Ľahko prispôsobiteľné pre farby vašej značky",
    "EasilyCustomizableDescription1": "Tému LeptonX si môžete prispôsobiť pomocou niekoľkých premenných SCSS. Žiadne prepisovanie, žiadne ďalšie zaťaženie CSS!",
    "EasilyCustomizableDescription2": "S LeptonX si môžete usporiadať svoj administračný panel tak, ako chcete.",
    "IndependentLayout": "Nezávislé rozloženie a obsahová oblasť",
    "IndependentLayoutDescription1": "Infraštruktúra rozloženia LeptonX bola navrhnutá úplne oddelene od obsahu.",
    "IndependentLayoutDescription2": "To znamená, že ak chcete, môžete svoj projekt voľne navrhnúť s inou štruktúrou obsahu ako Bootstrap.",
    "MostUsedLibraries": "Najpoužívanejšie knižnice integrované s LeptonX",
    "MostUsedLibrariesDescription1": "LeptonX obsahuje vaše najpoužívanejšie knižnice. Umožňuje vám bez námahy používať knižnice ako ApexCharts, DataTables, DropZone, FullCalender, JSTree, Select2 a Toastr.",
    "MostUsedLibrariesDescription2": "LeptonX tiež podporuje knižnice špecifické pre MVC Angular a Blazor.",
    "CreateAndCustomize": "Vytvorte a prispôsobte si potrebné stránky v priebehu niekoľkých sekúnd pomocou vlastných stránok LeptonX",
    "CreateAndCustomizeDescription": "Pomocou témy LeptonX máte tiež prístup k mnohým predpripraveným HTML stránkam. Patria sem mnohé stránky, ako je prihlasovacia stránka, blog, často kladené otázky, zoznam odberov, faktúra, ceny a správa súborov.",
    "LeptonThemeForAdmin": "Téma Lepton pre váš administračný panel od",
    "LeptonThemeForAdminDescription": "Téma Lepton je stále k dispozícii a bude udržiavaná. Ak chcete prejsť na tému LeptonX ako používateľ témy Lepton, pozrite si dokumentáciu, kde sa dozviete, ako na to.",
    "LeptonCompatibleWith": "Téma Lepton je kompatibilná s",
    "BlackFridayDiscount": "Black Friday zľava",
    "UpgradePaymentInfoSection_DeveloperPrice": "{0} pre ďalších vývojárov (počet: {1})",
    "Upgrade": "Inovovať",
    "Renewal": "Obnova",
    "UpgradePaymentInfoSection_LicensePrice": "licencia {0}",
    "UpgradePaymentInfoSection_LicenseRenewalPrice": "Obnovenie licencie",
    "Total": "Celkom",
    "SupportPolicyFaqTitle": "Aká je vaša politika podpory?",
    "SupportPolicyFaqExplanation": "Podporujeme iba aktívnu a predchádzajúcu hlavnú verziu. Nezaručujeme vydanie opravy pre 3. a staršiu hlavnú verziu. Napríklad, ak je aktívna verzia 7.0.0, vydáme opravné verzie pre 6.x.x aj 7.x.x. Okrem toho poskytujeme podporu len pre problémy súvisiace s ABP Framework a ABP Commercial. To znamená, že neposkytujeme podporu pre aplikácie tretích strán, cloudové služby a iné periférne knižnice používané produktmi ABP. Vynaložíme komerčne primerané úsilie, aby sme našim zákazníkom poskytli technickú podporu počas oficiálnej pracovnej doby spoločnosti \"Volosoft Bilisim A.S\". Na druhej strane sa nezaväzujeme k času odozvy podľa dohody o úrovni služieb (SLA), ale budeme sa snažiť reagovať na technické problémy čo najrýchlejšie v rámci našej oficiálnej pracovnej doby. Ak sa so zákazníkom nedohodnete inak, poskytujeme podporu len na adrese https://support.abp.io. Máme aj súkromnú e-mailovú podporu, ktorá je k dispozícii len držiteľom licencie Enterprise.",
    "TotalDevelopers": "Celkový počet vývojárov: {0}",
    "CustomPurchaseExplanation": "Prispôsobené vašim špecifickým potrebám",
    "WhereDidYouHearAboutUs": "Kde ste sa o nás dozvedeli?",
    "Twitter": "Twitter",
    "Facebook": "Facebook",
    "Youtube": "YouTube",
    "Google": "Google",
    "Github": "GitHub",
    "Friend": "Od kamaráta",
    "Other": "Iné",
    "WhereDidYouHearAboutUs_explain": "Uveďte...",
    "DeletingMemberWarningMessage": "„{0}“ bude odstránený zo zoznamu vývojárov. Ak chcete, toto prázdne miesto môžete neskôr prideliť inému vývojárovi.",
    "AdditionalInfo": "Ak sú miesta pre vývojárov nad vašimi požiadavkami, môžete ich znížiť. Môžete poslať e-mail na <a href=\"mailto:info@abp.io\">adresu info@abp.io</a> , aby ste odstránili niektoré svoje miesta pre vývojárov. Vymazaním nevyužitých miest pre vývojárov sa znížia náklady na obnovenie licencie. Ak chcete, môžete si počas aktívneho licenčného obdobia znova zakúpiť ďalšie miesta pre vývojárov. Upozorňujeme, že keďže tento licenčný balík obsahuje {0} vývojárov, tento počet nemôžete znížiť.",
    "LinkExpiredErrorMessage": "Platnosť odkazu, ku ktorému sa pokúšate získať prístup, vypršala.",
    "ExpirationDate": "Dátum spotreby",
    "SpringCampaignDiscount": "Jarná kampaňová zľava",
    "WhyUseAbpIoPlatform": "Prečo by som mal používať platformu ABP.IO namiesto vytvárania nového riešenia od začiatku?",
    "WhyUseAbpIoPlatformFaqExplanation": "Na <a href=\"/why-abp-io \">tejto stránke</a> nájdete podrobné vysvetlenie, prečo má používanie platformy ABP.IO významnú výhodu v porovnaní s tým, že všetko robíte sami.",
    "EulaPageTitle": "Licenčná zmluva koncového používateľa (EULA)",
    "PrivacyPolicyPageTitle": "Zásady ochrany osobných údajov – Zásady používania súborov cookie",
    "TermsConditionsPageTitle": "Podmienky",
    "TrainingsPageTitle": "Školenia ABP",
    "ModulesPageTitle": "Vopred zostavené aplikačné moduly ABP",
    "Volo.AbpIo.Commercial:040001": "Prístupový kľúč API je nesprávny.",
    "GetLepton": "Získajte Lepton teraz",
    "MyOrganizations_Detail_LicenseStartDate": "Dátum začiatku licencie",
    "MyOrganizations_Detail_LicenseExpiryDate": "Dátum spotreby",
    "BlazoriseSupport": "Ako získam licenčný kľúč Blazorise a podporu od tímu Blazorise?",
    "BlazoriseSupportExplanation": "Ak chcete získať podporu od tímu Blazorise a získať licenčný kľúč Blazorise, postupujte podľa nasledujúcich krokov:",
    "BlazoriseSupportExplanation1": "Zaregistrujte si nový účet na <a href=\"https://blazorise.com/support/register\">blazorise.com/support/register</a> s rovnakou e-mailovou adresou ako váš účet abp.io. Položku „Licenčný kľúč“ nechajte prázdnu. <strong>Musí to byť rovnaká e-mailová adresa ako váš e-mailový účet na abp.io.</strong>",
    "BlazoriseSupportExplanation2": "Overte svoju e-mailovú adresu kontrolou e-mailovej schránky. Ak v doručenej pošte nevidíte žiadny e-mail, skontrolujte si schránku spamu!",
    "BlazoriseSupportExplanation3": "Prihláste sa na webovú stránku podpory Blazorise na <a href=\"https://blazorise.com/support/login\">adrese blazorise.com/support/login</a> .",
    "BlazoriseSupportExplanation4": "Ak máte aktívnu licenciu ABP Commercial, budete mať aj licenciu Blazorise PRO. Licenčný kľúč Blazorise môžete získať na <a href=\"https://blazorise.com/support/user/manage/license\">adrese blazorise.com/support/user/manage/license</a> .",
    "BlazoriseSupportExplanation5": "Svoje otázky môžete uverejniť na webovej stránke podpory a vygenerovať token produktu pre svoju aplikáciu.",
    "AbpLiveTrainingPackages": "ABP Live Training Packages",
    "Releases": "Vydania",
    "ReleasesDescription": "Uvoľnite denníky ABP Commercial.",
    "ReleaseDate": "Dátum vydania",
    "Labels": "Štítky",
    "PreRelease": "Predbežné vydanie",
    "AllTypes": "Všetky druhy",
    "Enhancement": "Vylepšenie",
    "Bug": "Bug",
    "Feature": "Funkcia",
    "AllUIs": "Všetky používateľské rozhrania",
    "MVC": "MVC",
    "BlazorServer": "Server Blazor",
    "MAUI": "MAUI",
    "HowItWorks_Page_Title": "Ako to funguje?",
    "HowItWorks_Page_Description": "ABP Framework rozširuje platformu .NET. Takže všetko, čo môžete robiť s obyčajným riešením .NET, je už možné s ABP Frameworkom. Vďaka tomu je ľahké začať s nízkou krivkou učenia.",
    "HowItWorks_Description1": "ABP Framework rozširuje platformu .NET. Takže všetko, čo môžete robiť s obyčajným riešením .NET, je už možné s ABP Frameworkom. Vďaka tomu je ľahké začať s nízkou krivkou učenia.",
    "HowItWorks_Description2": "Keď sa začnete učiť a používať funkcie ABP Framework, vývoj vášho softvéru bude oveľa príjemnejší ako kedykoľvek predtým.",
    "HowItWorks_Description3": "Táto stránka v podstate vysvetľuje, ako používate platformu ABP.IO ako vývojár .NET.",
    "CreateANewSolution": "Vytvorte nové riešenie .NET",
    "CreateANewSolution_Description1": "Všetko začína vytvorením nového integrovaného .NET riešenia ABP.",
    "StartWithStartupTemplates": "Spustite jednu z vopred vytvorených <a href=\"/startup-templates\">šablón riešenia pri spustení</a>",
    "SimpleMonolithApplicationTemplate": "Jednoduchá šablóna aplikácie monolitu",
    "LayeredApplicationTemplate": "Vrstvená šablóna aplikácie",
    "MicroserviceSolutionTemplate": "Šablóna mikroservisného riešenia",
    "CreateEmptySolutionAndUseAbp": "Alebo vytvorte nové prázdne riešenie .NET a nainštalujte si <a href=\"https://abp.io/packages\" target=\"_blank\">balíčky</a> ABP NuGet &amp; NPM sami.",
    "CreatingSolutionWithMultipleOptions": "Pri vytváraní nového riešenia existuje viacero možností používateľského rozhrania a databázy.",
    "UIFrameworkOptions": "Možnosti rámca používateľského rozhrania",
    "DotnetSolutionWithoutDependency": "Teraz máte vo svojom lokálnom počítači bežné riešenie .NET, ktoré nezávisí od cloudovej platformy alebo externej služby.",
    "CheckTheDocumentForDetails": "Podrobnosti nájdete v dokumente <a href=\"{0}\" target=\"_blank\">{1}</a> .",
    "UIAndDatabaseIndependent": "ABP môže pracovať s akýmkoľvek používateľským rozhraním a akýmkoľvek poskytovateľom databázy podporovaným .NET. \n Avšak títo poskytovatelia používateľského rozhrania a databáz sú vopred integrovaní a dobre zdokumentovaní.",
    "InstallAbpModules": "Nainštalujte moduly ABP",
    "DevelopYourSolution": "Rozviňte svoje riešenie",
    "DeployAnywhere": "Nasadiť kdekoľvek",
    "InstallAbpModule_Description1": "ABP je modulárny rámec pre vývoj aplikácií. Šablóny riešení pri spustení sa už dodávajú s nainštalovanými základnými modulmi. \n Existuje však viac aplikačných modulov, ktoré možno budete chcieť použiť vo svojom riešení.",
    "InstallAbpModule_Description2": "Každý modul pozostáva z niekoľkých balíkov NuGet a NPM a má inštalačný dokument. <a href=\"/tools/suite\">ABP Suite</a> robí väčšinu práce automaticky, potom manuálne konfigurujete alebo dolaďujete modul na základe jeho dokumentácie.",
    "DevelopYourSolution_Description1": "Infraštruktúra ABP vám umožňuje <b class=\"text-white\">zamerať sa na váš vlastný obchodný kód</b> automatizáciou opakovanej práce a poskytovaním vopred vytvorenej infraštruktúry a <a href=\"https://abp.io/features\" target=\"_blank\">funkcií</a> aplikácií.",
    "DevelopYourSolution_Description2": "V nasledujúcom bloku kódu môžete vidieť, ako sa ABP Framework hladko integruje do vášho kódu a automatizuje za vás opakujúce sa úlohy.",
    "DevelopYourSolution_Description3": "Aj v tomto bloku krátkych kódov za vás ABP robí veľa vecí.",
    "DevelopYourSolution_Description4": "Poskytuje základné triedy na použitie konvencií, ako je <a href=\"https://docs.abp.io/en/abp/latest/Dependency-Injection\" target=\"_blank\">injekcia závislosti</a> \n . Všeobecné služby <a href=\"https://docs.abp.io/en/abp/latest/Repositories\" target=\"_blank\">úložiska</a> \n poskytujú pohodlný spôsob interakcie s databázou \n . Deklaratívna <a href=\"https://docs.abp.io/en/abp/latest/Authorization\" target=\"_blank\">autorizácia</a> \n funguje s vyladeným systémom povolení.",
    "DevelopYourSolution_Description5": "ABP úplne automatizuje <a href=\"https://docs.abp.io/en/abp/latest/Unit-Of-Work\" target=\"_blank\">jednotku práce</a> \n (pre pripojenie k databáze a správu transakcií), <a href=\"https://docs.abp.io/en/abp/latest/Exception-Handling\" target=\"_blank\">spracovanie výnimiek</a> \n , <a href=\"https://docs.abp.io/en/abp/latest/Validation\" target=\"_blank\">validáciu</a> \n \n a <a href=\"https://docs.abp.io/en/abp/latest/Audit-Logging\" target=\"_blank\">protokolovanie auditu</a> . Poskytuje oveľa viac stavebných blokov na zjednodušenie vašich každodenných úloh vývoja a zameranie sa na váš vlastný kód pri vytváraní aplikácií \n pripravených na výrobu.",
    "DevelopYourSolution_Description6": "Viete si predstaviť, ako veľmi môže byť tento blok kódu dlhý a komplikovaný, ak by ste to všetko robili manuálne.",
    "SuiteCrudGenerationInFewSeconds": "Okrem ručného kódovania vášho riešenia môžete vytvoriť plne funkčné pokročilé CRUD stránky za pár minút pomocou nástrojov ABP Suite. Vygeneruje kód do vášho riešenia, takže ho môžete doladiť na základe vlastných požiadaviek.",
    "DeployAnywhere_Description1": "Na konci dňa máte čisté riešenie .NET. Svoje riešenie môžete nasadiť na svoj vlastný server, na cloudovú platformu, na Kubernetes alebo kdekoľvek chcete. Môžete nasadiť na toľko serverov, koľko chcete. ABP je agnostický nástroj prostredia nasadenia.",
    "ExpertiseAbpFramework": "Znalosť rámca ABP",
    "ExpertiseAbpFramework_Description1": "Chcete ísť nad rámec základov a získať odborné znalosti s platformou ABP.IO?",
    "FreeDownload": "Bezplatné stiahnutie",
    "Read": "Čítať",
    "HavingTrouble": "Mať problémy?",
    "HavingTrouble_Description1": "Máte problémy s vývojom svojho riešenia? Sme tu! Ak chcete získať pomoc priamo od členov tímu Core ABP Framework, použite platformu podpory ABP \n alebo pošlite e-mail.",
    "WeAreHereToHelp_Description1": "Môžete si prezerať naše témy pomoci alebo hľadať v často kladených otázkach, \n alebo nám môžete položiť otázku pomocou kontaktného formulára.",
    "OtherModules": "Iné moduly",
    "OtherModules_Description1": "Účet, Protokolovanie auditu, Chat, CMS Kit, Správa súborov, Formuláre, GDPR, Identita, Správa jazykov, Platby, Saas a ďalšie...",
    "HowItWorks_DatabaseProviderOptions": "Možnosti poskytovateľa databázy",
    "SeeFAQ": "Pozrite si FAQ",
    "ReleaseLogs": "Denníky uvoľnenia",
    "ReleaseLogs_Tag": "{0} Denníky vydania",
    "ReleaseLogs_Pr": "Vytiahnuť požiadavku č. {0} – {1}",
    "NoLabels": "Žiadne štítky",
    "DoesTheSubscriptionRenewAutomatically": "Obnovuje sa predplatné automaticky?",
    "DoesTheSubscriptionRenewAutomaticallyExplanation": "ABP Commercial nemá fakturačný model automatického obnovenia. <strong>Vaše predplatné sa preto na konci licenčného obdobia automaticky neobnoví</strong> . Ak chcete aj naďalej využívať výhody ABP Commercial, musíte si ho manuálne obnoviť na <a href=\"/my-organizations\">stránke správy organizácie</a> . Ak máte viacero organizácií, kliknite na tlačidlo „Spravovať“ vo vašej organizácii, ktorej platnosť vypršala, a potom kliknite na tlačidlo „Predĺžiť teraz“, aby ste si obnovili licenciu. Môžete sa tiež pozrieť na stránku <a href=\"/faq#what-happens-when-license-ends\">Čo sa stane, keď sa skončí moja licencia?</a> oddiele.",
    "ExtraQuestionCreditsFaqTitle": "Môžem si kúpiť ďalšie kredity na otázky podpory?",
    "ExtraQuestionCreditsFaqExplanation": "Áno môžeš. Ak si chcete kúpiť ďalšie kredity na otázky, pošlite e-mail na adresu <a href=\"mailto:info@abp.io\">info@abp.io</a> s názvom vašej organizácie. Tu je cenník kreditov za ďalšie otázky:<ul><li> Balík 50 otázok za 999 dolárov</li><li> Balík 25 otázok za 625 dolárov</li><li> Balík 15 otázok 450 dolárov</li></ul>",
    "AlreadyBetaTester": "Už ste sa zapojili do programu beta testerov.",
    "AbpStudio": "Štúdio ABP",
    "AbpStudio_Description": "ABP Studio je stále vo vývoji. Ak chcete byť jedným z prvých používateľov, môžete vyplniť formulár nižšie.",
    "AbpStudio_Description1": "ABP Studio je <span class=\"text-highlight-white\">multiplatformová desktopová aplikácia</span> pre vývojárov ABP.",
    "AbpStudio_Description2": "Je <span class=\"text-highlight-white\">dobre integrovaný</span> do rámca ABP a jeho cieľom je poskytnúť vám pohodlné vývojové prostredie <span class=\"text-highlight-white\">automatizáciou vecí, poskytnutím prehľadov</span> o vašom riešení, oveľa jednoduchším <span class=\"text-highlight-white\">vývojom, prevádzkou</span> a <span class=\"text-highlight-white\">nasadením</span> vašich riešení.",
    "AbpStudio_ComingSoon": "Už čoskoro <span class=\"opacity-50 ms-0 ms-md-3 d-block d-md-inline-block \">Plánovaný dátum vydania beta: 4. štvrťrok 2023.</span>",
    "AbpStudio_PlannedPreviewDate": "Plánovaný dátum vydania ukážky: 4. štvrťrok 2023.",
    "BetaRequest": "Beta žiadosť",
    "CreateNewSolutions": "Vytvárajte nové riešenia",
    "CreateNewSolutions_Description1": "Môžete ľahko vytvárať od jednoduchých aplikácií až po modulárne monolitné alebo mikroservisné riešenia s množstvom možností. Získate úplné základné softvérové riešenie pripravené na výrobu pre vaše podnikanie.",
    "ArchitectYourSolutions": "Navrhnite svoje riešenia",
    "ArchitectYourSolutions_Description1": "Jednoduchšie budovanie štruktúr monolitných modulárnych a mikroservisných riešení vytváraním modulov alebo služieb a vytváraním vzťahov medzi nimi. Môžete tiež nainštalovať alebo odinštalovať vopred zostavené aplikačné moduly.",
    "ExploreYourSolution": "Preskúmajte svoje riešenie",
    "ExploreYourSolution_Description1": "ABP Studio zobrazuje vysokoúrovňový pohľad na komponenty vášho riešenia a moduly, na ktorých vaše riešenie závisí. Môžete skúmať entity, služby, HTTP API a oveľa viac bez toho, aby ste museli otvárať svoju kódovú základňu.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze": "Spustite multiaplikačné alebo mikroservisné riešenia v rýchlosti",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description1": "Spustite jednu, <span class=\"text-highlight-white\">viacero</span> alebo <span class=\"text-highlight-white\">všetky služby</span> jediným kliknutím. Týmto spôsobom je veľmi jednoduché zastaviť službu, spustiť ju vo Visual Studiu na <span class=\"text-highlight-white\">testovanie</span> alebo <span class=\"text-highlight-white\">ladenie</span> .",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description2": "Pozrite si zoznam služieb, zobrazte <span class=\"text-highlight-white\">požiadavku HTTP v reálnom čase</span> a <span class=\"text-highlight-white\">počet výnimiek</span> pre každú službu.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description3": "Pozrite si všetky podrobnosti o všetkých <span class=\"text-highlight-white\">požiadavkách HTTP</span> prichádzajúcich do akejkoľvek služby.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description4": "Preskúmajte <span class=\"text-highlight-white\">podrobnosti o výnimkách</span> v reálnom čase v akejkoľvek službe, jednoducho filtrujte a vyhľadávajte.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description5": "Zobrazte <span class=\"text-highlight-white\">denníky aplikácie</span> , filtrujte podľa úrovne denníka alebo hľadajte podľa textu.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description6": "<span class=\"text-highlight-white\">Prehliadajte</span> používateľské rozhranie svojej aplikácie bez toho, aby ste opustili riešenie.",
    "IntegrateToYourKubernetesCluster": "Integrujte sa do svojho klastra Kubernetes",
    "IntegrateToYourKubernetesCluster_Description1": "<span class=\"text-highlight-white\">Pripojte svoje miestne vývojové prostredie k lokálnemu alebo vzdialenému klastru Kubernetes</span> , kde už tento klaster prevádzkuje vaše mikroservisné riešenie.",
    "IntegrateToYourKubernetesCluster_Description2": "Pristupujte k akejkoľvek službe v Kubernetes pomocou názvu služby ako DNS, rovnako ako sú spustené vo vašom lokálnom počítači.",
    "IntegrateToYourKubernetesCluster_Description3": "<span class=\"text-highlight-white\">Zachyťte akúkoľvek službu</span> v tomto klastri, takže všetka <span class=\"text-highlight-white\">prevádzka zachytenej služby bude automaticky presmerovaná na vašu službu</span> , ktorá je spustená na vašom lokálnom počítači. Keď vaša služba potrebuje používať akúkoľvek službu v Kubernetes, prenos sa presmeruje späť do klastra, rovnako ako vaša lokálna služba beží v Kubernetes.",
    "GetInformed": "Informujte sa",
    "Studio_GetInformed_Description1": "Nechajte svoje kontaktné informácie, aby <span class=\"text-highlight-white\">ste boli informovaní</span> , a <span class=\"text-highlight-white\">vyskúšajte to najskôr</span> po spustení ABP Studio.",
    "Studio_GetInformed_Description2": "Plánovaný dátum vydania ukážky: 3. štvrťrok 2023.",
    "ThankYou!": "Ďakujem!",
    "SendBetaRequest": "Odoslať žiadosť o beta verziu",
    "YouJoinedTheBetaTesterProgram": "Zapojili ste sa do programu beta testerov ABP Studio.",
    "PricingExplanation2": "30-dňová záruka vrátenia peňazí — <a href=\"/faq#refund-policy\">Zistite viac</a>",
    "MoneyBackGuaranteeText": "* 30-dňová záruka vrátenia peňazí na všetky licencie! 100 % refundácia pre Team, 60 % refundácia pre Business a Enterprise licencie do 30 dní.",
    "MobileApplicationStartupTemplates": "Šablóny spustenia mobilnej aplikácie",
    "MobileApplicationStartupTemplates_Description1": "Integrované šablóny na spustenie mobilných aplikácií pre vaše komerčné riešenia ABP.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates": "Vytvárajte výkonné podnikové aplikácie pomocou šablón ABP Mobile Startup Templates",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description1": "ABP Commercial poskytuje dve šablóny na spustenie mobilných aplikácií implementované pomocou <span class=\"text-highlight\">React Native</span> a <span class=\"text-highlight\">.NET MAUI.</span> Keď vytvoríte svoje nové riešenie založené na ABP, budete mať k vašim backendovým rozhraniam API pripojené aj základné spúšťacie aplikácie.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description2": "Aplikácia má vopred vytvorený cyklus autentifikačných tokenov, <span class=\"text-highlight\">podporu viacerých jazykov, podporu viacerých prenájmov, prihlásenie, zabudnuté heslo, správu profilu a stránku správy používateľov</span> . Môžete pridať svoju vlastnú obchodnú logiku a prispôsobiť ju podľa svojich požiadaviek.",
    "TwoFrameworkOptions": "Dve možnosti rámca",
    "TwoFrameworkOptions_Description": "ABP poskytuje mobilné spúšťacie šablóny <span class=\"text-highlight\">React Native</span> aj <span class=\"text-highlight\">.NET MAUI</span> . Týmto spôsobom si môžete vybrať ten, ktorý najlepšie vyhovuje vašim potrebám. Obe aplikácie opätovne používajú kód v najvyššej miere medzi platformami iOS a Android.",
    "PreIntegratedToYourBackend": "Vopred integrované do vášho backendu",
    "PreIntegratedToYourBackend_Description": "Aplikácie ABP Mobile sú vopred integrované do vašich backendových API. Získa platný overovací token zo servera a odošle overené požiadavky.",
    "MultiLanguage": "Viacjazyčné",
    "MultiLanguage_Description": "Už po vybalení podporuje viac ako 10 jazykov. Môžete tiež pridať ďalšie jazyky.",
    "Arabic": "arabčina",
    "Czech": "český",
    "English": "Angličtina",
    "Hungarian": "maďarský",
    "Finnish": "fínsky",
    "French": "francúzsky",
    "Hindi": "hindčina",
    "Portuguese": "portugalčina",
    "Italian": "taliansky",
    "Russian": "ruský",
    "Slovak": "slovenský",
    "Turkish": "turecký",
    "EngageAndRetainYourCustomersWithABPMobileApps": "Zapojte a udržte si svojich zákazníkov pomocou mobilných aplikácií ABP",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description1": "Vaši zákazníci chcú spravovať svoje produkty a predplatné odkiaľkoľvek a kedykoľvek. To si vyžaduje, aby organizácie vytvárali mobilné aplikácie, ktoré zákazníkom umožnia rýchlo a hladko splniť ich požiadavky.",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description2": "Pomocou aplikácií ABP Mobile môžete vytvárať vysokokvalitné natívne mobilné aplikácie pre Android a iOS... Pomocou jedinej kódovej základne a bez kompromisov v oblasti bezpečnosti, kvality alebo škálovateľnosti.",
    "OneCodeBaseMultipleDevices": "Jedna kódová základňa viacerých zariadení",
    "OneCodeBaseMultipleDevices_Description": "Mobilné aplikácie ABP sú multiplatformové. Sú pripravené na inštaláciu a spustenie na zariadeniach so systémom iOS a Android a prispôsobujú sa rôznym tvarovým faktorom pomocou jedinej kódovej základne. Vývojári potrebujú vytvoriť používateľské rozhranie a front-end kód iba raz, nie je potrebné upravovať kód pre každé zariadenie, ktoré chcete podporovať.",
    "ComesWithTheSourceCode": "Dodáva sa so zdrojovým kódom",
    "ComesWithTheSourceCode_Description": "Mobilné aplikácie sú dodávané so zdrojovým kódom. Jednoducho si prispôsobte UX/UI svojich aplikácií tak, aby spĺňali pokyny pre budovanie značky.",
    "Purchase_OneYearPrice": "Cena za 1 rok",
    "Purchase_DeveloperSeatCount": "Počet vývojárov",
    "Purchase_DevelopersAlreadyIncluded": "Už je zahrnutých {0} vývojárov",
    "1Year": "1 rok",
    "{0}Years": "{0} rokov",
    "1YearLicense": "Licencia na 1 rok",
    "{0}YearsLicense": "Licencia na {0} rokov",
    "1AdditionalDeveloper": "1 Ďalší vývojár",
    "{0}AdditionalDevelopers": "{0} Ďalší vývojári",
    "Discount": "Zľava ({0} %)",
    "Summary": "Zhrnutie",
    "TrainingPack": "Tréningový balík",
    "TrainingPackDiscount": "Zľava na tréningový balíček",
    "Purchase_OnboardingTraining_Description": "Tento živý tréningový balík platí pre triedu 8 študentov a táto zľava platí len pri kúpe s novou licenciou. <a href=\"{0}\" class=\"text-white\">Uč sa viac<i class=\"fa fa-external-link ms-1\"></i></a>",
    "Purchase_Save": "<span class=\"save ms-1\">Úspora {0}% {1} {2}</span>",
    "RemoveBasket": "Odstráňte z košíka",
    "WhyABPIOPlatform?": "Prečo <span class=\"gradient-commercial\">platforma ABP.IO</span> ?",
    "DocumentAim": "Cieľom tohto dokumentu je odpovedať na veľkú otázku:",
    "DocumentAim_Description": "&quot;Prečo by ste mali používať platformu ABP.IO namiesto vytvárania nového riešenia od začiatku?&quot;",
    "DocumentAim_Description2": "Dokument predstavuje výzvy pri budovaní moderného softvérového riešenia a vysvetľuje, ako ABP tieto výzvy rieši.",
    "CreatingANewSolution": "Vytvorenie nového riešenia",
    "CreatingANewSolution_Description": "Keď potrebujete začať s novým riešením, musíte si položiť veľa otázok a mali by ste stráviť veľa času, kým začnete písať svoj úplne prvý obchodný kód.",
    "CreatingAnEmptySolution": "Vytvorenie prázdneho riešenia",
    "THEPROBLEM": "PROBLÉM",
    "CreatingAnEmptySolution_THEPROBLEM_Description": "Aj vytvorenie takmer prázdneho riešenia je náročné;",
    "CreatingAnEmptySolution_THEPROBLEM_Description2": "Ako organizujete svoju kódovú základňu medzi projektmi?",
    "CreatingAnEmptySolution_THEPROBLEM_Description3": "Čo sú to vrstvy a ako sa navzájom ovplyvňujú?",
    "CreatingAnEmptySolution_THEPROBLEM_Description4": "Ako sa integrujete do knižníc a systémov tretích strán?",
    "CreatingAnEmptySolution_THEPROBLEM_Description5": "Ako nastaviť automatické testy?",
    "ABPSOLUTION": "RIEŠENIE ABP",
    "CreatingAnEmptySolution_ABPSOLUTION_Description": "ABP poskytuje dobre navrhnuté, vrstvené a na výrobu pripravené <a href=\"https://docs.abp.io/en/abp/latest/Startup-Templates/Application\" target=\"_blank\">štartovacie riešenie</a> založené na princípoch <a href=\"https://docs.abp.io/en/abp/latest/Domain-Driven-Design\" target=\"_blank\">Domain Driven Design</a> . Súčasťou riešenia je aj vopred nakonfigurovaná jednotka a integračné <a href=\"https://docs.abp.io/en/abp/latest/Testing\" target=\"_blank\">testovacie</a> projekty pre každú vrstvu.",
    "CommonLibraries": "Spoločné knižnice",
    "CommonLibraries_THEPROBLEM_Description": "Ktoré knižnice by ste mali použiť na implementáciu spoločných požiadaviek? Ekosystém vývoja softvéru je vysoko dynamický, takže je náročné držať krok s najnovšími nástrojmi, knižnicami, trendmi a prístupmi.",
    "CommonLibraries_ABPSOLUTION_Description": "ABP vopred integruje populárne, vyspelé a aktuálne knižnice do riešenia. Nemusíte tráviť čas ich integráciou alebo prinútením ich vzájomnej komunikácie. Po vybalení z krabice fungujú správne.",
    "UITheme&Layout": "Téma a rozloženie používateľského rozhrania",
    "UITheme&Layout_THEPROBLEM_Description": "Pri riešení problémov používateľského rozhrania sa objavuje celý rad problémov. Patrí medzi ne vytvorenie základov pre citlivú, modernú a prispôsobiteľnú súpravu používateľského rozhrania s konzistentným vzhľadom a množstvom funkcií, ako sú navigačné ponuky, hlavičky, panely nástrojov, päty, miniaplikácie a ďalšie.",
    "UITheme&Layout_THEPROBLEM_Description2": "Aj keď sa rozhodnete pre vopred navrhnutú tému, bezproblémová integrácia do vášho projektu si môže vyžadovať niekoľko dní vývoja. Ďalšia prekážka spočíva v inovácii takýchto tém. Štruktúra HTML/CSS témy sa často prelína s vaším kódom používateľského rozhrania, čím sa budúce zmeny tém alebo inovácie vykresľujú zložitými úlohami. Toto prelínanie kódu a dizajnu komplikuje flexibilitu pri vykonávaní úprav.",
    "UITheme&Layout_ABPSOLUTION_Description": "ABP Framework ponúka charakteristický systém tém, ktorý oslobodzuje váš kód používateľského rozhrania od obmedzení tém. Témy existujú izolovane, zabalené ako balíčky NuGet alebo NPM, vďaka čomu je inštalácia alebo aktualizácia témy otázkou niekoľkých minút. Zatiaľ čo si ponecháte možnosť vytvoriť si vlastnú tému alebo integrovať existujúcu tému, ABP Commercial predstavuje kolekciu leštených a súčasných tém.",
    "UITheme&Layout_ABPSOLUTION_Description2": "Okrem toho existujú poskytovatelia komponentov používateľského rozhrania ako Telerik a DevExpress. Títo poskytovatelia však dodávajú predovšetkým jednotlivé komponenty, pričom je na vás, aby ste si vytvorili svoj systém rozloženia. Pri práci v rámci projektov založených na ABP môžete tieto knižnice bez problémov začleniť, podobne ako v akomkoľvek inom projekte.",
    "TestInfrastructure": "Testovacia infraštruktúra",
    "TestInfrastructure_THEPROBLEM_Description": "Vytvorenie robustného testovacieho prostredia je časovo náročné úsilie. Zahŕňa to nastavenie vyhradených testovacích projektov v rámci vášho riešenia, starostlivý výber potrebných nástrojov, vytváranie simulácií služieb a databáz, vytváranie základných základných tried a pomocných služieb na minimalizáciu nadbytočného kódu v testoch a riešenie rôznych súvisiacich úloh.",
    "TestInfrastructure_ABPSOLUTION_Description": "ABP Startup Templates prichádzajú vopred vybavené nakonfigurovanými testovacími projektmi, čo zjednodušuje proces za vás. To znamená, že od prvého dňa môžete okamžite začať písať svoj počiatočný kód jednotky alebo integračného testu.",
    "CodingStandards&Training": "Štandardy kódovania a školenia",
    "CodingStandards&Training_THEPROBLEM_Description": "Po nastavení riešenia na vývoj zvyčajne musíte vývojárov naučiť, ako systém funguje a ako ho zostaviť pomocou rovnakých dohodnutých metód. Aj keď ich zaškolíte, udržiavanie aktuálnej dokumentácie môže byť náročné. Ako čas plynie, každý vývojár môže písať kód vlastným spôsobom, čo spôsobí, že pravidlá pre písanie kódu sa budú navzájom líšiť.",
    "CodingStandards&Training_ABPSOLUTION_Description": "Riešenie ABP je už prehľadne usporiadané a má jasné vysvetlenia. Návody a návody krok za krokom vám ukážu, ako presne pracovať na projekte ABP.",
    "KeepingYourSolutionUpToDate": "Udržiavanie vášho riešenia aktuálne",
    "KeepingYourSolutionUpToDate_THEPROBLEM_Description": "Po spustení vývoja musíte sledovať nové verzie knižníc, ktoré používate na aktualizácie a opravy.",
    "KeepingYourSolutionUpToDate_ABPSOLUTION_Description": "Všetky balíčky pravidelne aktualizujeme na najnovšie verzie a testujeme ich pred stabilným vydaním. Keď aktualizujete rámec ABP, všetky jeho závislosti sa upgradujú na špičkovú technológiu.",
    "DRY": "Neopakuj sa!",
    "DRY_Description": "Vytvorenie základného riešenia si vyžaduje značný čas a vyžaduje dobré architektonické skúsenosti. Toto je však len začiatok! Keď začnete s vývojom, pravdepodobne budete musieť napísať veľa opakujúceho sa kódu; to by bolo skvelé, keby sa to všetko dalo zvládnuť automaticky.",
    "DRY_Description2": "ABP čo najviac automatizuje a zjednodušuje opakovanie kódu dodržiavaním zásady konfigurácie. Neobmedzuje vás však, keď potrebujete preradiť na manuálnu prevodovku. Ovládanie je vždy vo vašich rukách.",
    "Authentication": "Overenie",
    "Authentication_THEPROBLEM_Description": "Single Sign On, integrácia Active Directory / LDAP, integrácia OpenIddict, sociálne prihlásenie, dvojfaktorová autentifikácia, zabudnuté/resetovať heslo, aktivácia e-mailu, registrácia nového používateľa, kontrola zložitosti hesla, uzamknutie účtu pri neúspešných pokusoch, zobrazenie neúspešných pokusov o prihlásenie... atď. Vieme, že všetky tieto všeobecné požiadavky poznáte. Nie si sám!",
    "Authentication_ABPSOLUTION_Description": "ABP Framework a komerčná verzia poskytujú všetky tieto štandardné veci predimplementované pre vás ako opätovne použiteľný modul účtu. Stačí povoliť a nakonfigurovať to, čo potrebujete.",
    "CrossCuttingConcerns": "Prierezové obavy",
    "CrossCuttingConcerns_THEPROBLEM_Description": "Prierezové obavy sú základnou opakujúcou sa logikou, ktorá by sa mala implementovať pre každý prípad použitia. Niektoré príklady;",
    "CrossCuttingConcerns_THEPROBLEM_Description2": "Spustenie transakcií, zaviazanie sa na úspech a vrátenie pri chybách.",
    "CrossCuttingConcerns_THEPROBLEM_Description3": "Spracovanie a hlásenie výnimiek, vrátenie správnej chybovej odpovede klientom a riešenie chybových prípadov na strane klienta.",
    "CrossCuttingConcerns_THEPROBLEM_Description4": "Implementácia autorizácie a validácie, vrátenie správnych odpovedí a ich spracovanie na strane klienta.",
    "CrossCuttingConcerns_ABPSOLUTION_Description": "ABP Framework automatizuje alebo zjednodušuje všetky bežné prierezové problémy. Napíšete iba kód, ktorý je dôležitý pre vaše podnikanie, a ABP sa postará o zvyšok podľa konvencií.",
    "ArchitecturalInfrastructure": "Architektonická infraštruktúra",
    "ArchitecturalInfrastructure_THEPROBLEM_Description": "Na správnu implementáciu architektúry zvyčajne potrebujete vybudovať infraštruktúru. Vo všeobecnosti napríklad implementujete vzor úložiska. Definujete niektoré základné triedy na zjednodušenie a štandardizáciu na vytváranie entít, služieb, ovládačov a iných objektov.",
    "ArchitecturalInfrastructure_ABPSOLUTION_Description": "ABP Framework poskytuje všetky tieto a ešte viac hneď po vybalení. Je zrelý a dobre zdokumentovaný.",
    "EnterpriseApplicationRequirements": "Požiadavky na podnikové aplikácie",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description": "Existuje veľa požiadaviek, ktoré opakovane implementujete v každej obchodnej aplikácii;",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description2": "Podrobný systém povolení a správa povolení v používateľskom rozhraní na základe rolí a používateľov.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description3": "Písanie protokolov auditu a histórie entít na sledovanie, keď používateľ upraví záznam databázy.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description4": "Urobte z vašich entít mäkké mazanie, aby boli označené ako odstránené namiesto fyzického odstránenia z databázy a automatického filtrovania odstránených entít vo vašich dotazoch.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description5": "Vytváranie abstrakcií a obalov na využitie vašich backendových API z frontendového kódu.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description6": "Zaraďovanie a vykonávanie úloh na pozadí.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description7": "Spracovanie viacerých časových pásiem v globálnom systéme.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description8": "Zdieľanie validácie, lokalizácie, autorizačnej logiky medzi serverom a klientom.",
    "EnterpriseApplicationRequirements_ABPSOLUTION_Description": "ABP poskytuje infraštruktúru na jednoduchú implementáciu takýchto požiadaviek. Opäť nemusíte míňať svoj drahocenný čas na to, aby ste to všetko znova a znova implementovali.",
    "GeneratingInitialCode&Tooling": "Generovanie počiatočného kódu a nástrojov",
    "GeneratingInitialCode&Tooling_THEPROBLEM_Description": "V typickej webovej aplikácii vytvoríte veľa podobných stránok. Väčšina z nich bude vykonávať podobné operácie CRUD. Opakované vytváranie takýchto stránok je veľmi únavné a tiež náchylné na chyby.",
    "GeneratingInitialCode&Tooling_ABPSOLUTION_Description": "<a href=\"/tools/suite\">ABP Suite</a> dokáže vygenerovať kompletnú stránku CRUD pre vaše entity v priebehu niekoľkých sekúnd. Vygenerovaný kód je vrstvený a čistý. Všetky štandardné požiadavky na validáciu a autorizáciu sú implementované. Navyše sa generujú triedy unit testov. Keď získate plne spustenú stránku, môžete ju upraviť podľa vašich obchodných požiadaviek.",
    "IntegratingTo3rdPartyLibrariesAndSystems": "Integrácia do knižníc a systémov tretích strán",
    "IntegratingTo3rdPartyLibrariesAndSystems_THEPROBLEM_Description": "Väčšina knižníc je navrhnutá ako nízkoúrovňová a zvyčajne vykonáte nejakú prácu, aby ste ich správne integrovali bez toho, aby ste všade vo svojom riešení opakovali rovnaký integračný a konfiguračný kód. Predpokladajme napríklad, že na implementáciu distribuovanej zbernice udalostí musíte použiť RabbitMQ. Všetko, čo chcete urobiť, je; poslať správu do frontu a spracovať prichádzajúce správy. Musíte však porozumieť vzorom správ, frontám a podrobnostiam výmeny. Ak chcete napísať efektívny kód, musíte vytvoriť oblasť na správu pripojení, klientov a kanálov. Musíte sa tiež vysporiadať s výnimkami, správami ACK, opätovným pripojením k RabbitMQ pri zlyhaniach a ďalšími.",
    "IntegratingTo3rdPartyLibrariesAndSystems_ABPSOLUTION_Description": "Napríklad integrácia RabbitMQ Distributed Event Bus od ABP abstrahuje všetky tieto detaily. Posielate a prijímate správy bez zhonu. Potrebujete napísať nízkoúrovňový kód? Žiadny problém, vždy to môžete urobiť. ABP vás neobmedzuje, keď potrebujete používať nízkoúrovňové funkcie knižnice, ktorú používate.",
    "WhyNotBuildYourOwnFramework?": "Prečo si nevybudovať svoj vlastný rámec?",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description": "Vybudovanie, údržba a dokumentácia celej infraštruktúry, dokonca aj tým najjednoduchším spôsobom, zaberie veľa času. Časom sa zväčšuje a je ťažké ho udržať vo vašom riešení. Ich oddelenie do opätovne použiteľného projektu je východiskovým bodom pre budovanie vášho vlastného interného rámca.",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description2": "Budovanie, dokumentovanie, školenie a udržiavanie interného rámca je naozaj ťažké. Ak nemáte skúsený, špecializovaný tím rámcov, váš interný rámec sa rýchlo stane nezdokumentovaným starým kódom, ktorému už nikto nemôže rozumieť a udržiavať ho. Na druhej strane tieto rámce vo všeobecnosti vyvíja jeden alebo dvaja vývojári v tíme. A títo borci sa stávajú silo vedomostí. Je to dobré pre nich, ale zlé pre spoločnosť, pretože sú jediným bodom zlyhania projektu <a href=\"https://en.wikipedia.org/wiki/Single_point_of_failure\">- SPOF-</a> . Akonáhle opustia spoločnosť, projekt dramaticky klesá.",
    "WhyNotBuildYourOwnFramework_ABPSOLUTION_Description": "ABP Framework je komunitou riadený, dobre zdokumentovaný, vyspelý a generický aplikačný rámec. Tím veľmi skúsených vývojárov tvrdo pracuje na tom, aby bol aktuálny, ľahko zrozumiteľný a pohodlný na používanie. Používanie takéhoto stabilného rámca vás núti sústrediť sa na svoj vlastný obchodný kód a získať pomoc s rámcom od odborníkov, kedykoľvek to budete potrebovať.",
    "ArchitecturalInfrastructure_Description": "SaaS aplikácie, modulárne alebo mikroservisné systémy sú najpoužívanejšie modely podnikového softvéru. Budovanie takýchto systémov si vyžaduje nielen dobré porozumenie a skúsenosti, ale vyžaduje si aj silnú softvérovú infraštruktúru. V opačnom prípade zistíte, že vynaložíte veľké úsilie na podporu týchto architektonických detailov vo vašej kódovej základni.",
    "Modularity": "Modularita",
    "Modularity_THEPROBLEM_Description": "Vybudovanie skutočne modulárneho systému nie je jednoduché! Všetky aspekty systému (databáza, entity, API, stránky/komponenty používateľského rozhrania) môžu byť rozdelené do modulov a každý modul môže byť opätovne použiteľný bez ďalších. Obyčajné ASP.NET Core neposkytuje takú modulárnu architektúru. Ak to potrebujete, mali by ste o tom premýšľať od začiatku.",
    "Modularity_ABPSOLUTION_Description": "ABP Framework sa zrodil ako modulárna štruktúra vývoja aplikácií. Každá funkcia v rámci je vyvinutá tak, aby bola kompatibilná s modularitou. Dokumentácia a príručky vysvetľujú, ako vytvoriť opätovne použiteľné moduly štandardným spôsobom.",
    "SaaSMultiTenancy": "SaaS / Multi-Tenancy",
    "SaaSMultiTenancy_THEPROBLEM_Description": "<a href=\"https://docs.abp.io/en/abp/latest/Multi-Tenancy\">Multi-Tenancy</a> je bežný spôsob implementácie systémov SaaS. Implementácia konzistentnej infraštruktúry pre viacerých nájomcov sa však môže skomplikovať.",
    "SaaSMultiTenancy_ABPSOLUTION_Description": "ABP Framework poskytuje kompletnú infraštruktúru pre viacerých nájomníkov a abstraktnú zložitosť z vášho obchodného kódu. Kód vašej aplikácie bude väčšinou oboznámený s viacerými nájomníkmi, zatiaľ čo ABP Framework od seba automaticky izoluje databázu, vyrovnávaciu pamäť a ďalšie podrobnosti o nájomcoch. Podporuje jednu databázu, databázu podľa nájomníkov a hybridné prístupy. Správne nakonfiguruje knižnice ako Microsoft Identity a OpenIddict, ktoré zvyčajne nie sú kompatibilné s viacerými nájomcami.",
    "Microservices": "Mikroslužby",
    "Microservices_THEPROBLEM_Description": "Vybudovanie systému mikroslužieb si vyžaduje veľa podrobností o infraštruktúre: Autentifikácia a autorizácia aplikácií a mikroslužieb a implementácia asynchrónneho zasielania správ a synchrónnych (Rest/GRPC) komunikačných vzorov medzi mikroslužbami sú najzákladnejšie problémy.",
    "Microservices_ABPSOLUTION_Description": "ABP Framework poskytuje služby, <a href=\"https://docs.abp.io/en/abp/latest/Microservice-Architecture\" target=\"_blank\">príručky</a> a vzorky, ktoré vám pomôžu implementovať vaše mikroservisné riešenie pomocou štandardných priemyselných nástrojov.",
    "Microservices_ABPSOLUTION_Description2": "ABP Commercial ide ešte o krok ďalej a poskytuje kompletnú <a href=\"https://docs.abp.io/en/commercial/latest/startup-templates/microservice/index\" target=\"_blank\">štartovaciu šablónu</a> na naštartovanie vášho mikroservisného riešenia.",
    "PreBuiltModules": "Vopred zostavené moduly",
    "PreBuiltModules_THEPROBLEM_Description": "Všetci máme podobné, ale trochu iné obchodné požiadavky. Všetci by sme však mali znovu vynájsť koleso, pretože žiadny kód nemôže priamo fungovať v našom riešení. Všetky sú súčasťou väčšieho riešenia.",
    "PreBuiltModules_ABPSOLUTION_Description": "Komerčné <a href=\"/modules\">moduly</a> ABP poskytujú množstvo opätovne použiteľných aplikačných modulov, ako sú platby, chat, správa súborov, reportovanie protokolov auditu... atď. Všetky tieto moduly sa jednoducho inštalujú do vášho riešenia a priamo fungujú. Neustále pridávame ďalšie moduly.",
    "PreBuiltModules_ABPSOLUTION_Description2": "Všetky moduly sú navrhnuté ako prispôsobiteľné pre vaše obchodné požiadavky. Ak potrebujete úplnú kontrolu, môžete si stiahnuť úplný zdrojový kód ľubovoľného modulu a úplne ho prispôsobiť na základe vašich špecifických obchodných požiadaviek.",
    "ABPCommunity": "Spoločenstvo ABP",
    "ABPCommunity_Description": "Nakoniec, byť vo veľkej komunite, kde každý dodržiava podobné štýly a princípy kódovania a zdieľa spoločnú infraštruktúru, prináša silu, keď máte problémy alebo potrebujete pomoc s rozhodnutiami o dizajne. Keďže kód píšeme podobne, môžeme si navzájom oveľa lepšie pomáhať. ABP je komunitou podporovaný projekt s viac ako 10 000 hviezdami na GitHub.",
    "ABPCommunity_Description2": "Je ľahké zdieľať kód alebo dokonca znovu použiteľné knižnice medzi vývojármi ABP. Útržok kódu, ktorý funguje pre vás, bude fungovať aj pre ostatných. Existuje množstvo ukážok a tutoriálov, ktoré môžete priamo implementovať pre svoju aplikáciu.",
    "ABPCommunity_Description3": "Keď si najmete vývojára, ktorý predtým pracoval s architektúrou ABP, okamžite pochopí vaše riešenie a začne s vývojom vo veľmi krátkom čase.",
    "WhyAbpIo_Page_Title": "Prečo platforma ABP.IO?",
    "AbpStudio_Page_Title": "Štúdio ABP",
    "CampaignInfo": "Kúpte si novú licenciu alebo obnovte svoju existujúcu licenciu a <span class=\"text-white\">získajte ďalšie 2 mesiace</span> bez dodatočných nákladov! Táto ponuka platí pre všetky licenčné plány. Uistite sa, že využijete túto časovo obmedzenú akciu na rozšírenie svojho prístupu k prémiovým funkciám a aktualizáciám.",
    "HurryUpLastDay": "Ponáhľaj sa! Posledný deň: {0}",
    "CreatingCRUDPagesWithABPSuite": "Vytváranie stránok CRUD s ABP Suite",
    "Testimonials": "Posudky",
    "MultipleYearDiscount": "Viacročná zľava",
    "CampaignDiscountText": "Čierny piatok zľava",
    "CampaignDiscountName": "Čierny piatok",
    "CampaignName:BlackFriday": "Čierny piatok"
  }
}