{
  "culture": "sk",
  "texts": {
    "OrganizationManagement": "Správa organizácii",
    "OrganizationList": "Zoznam organizácií",
    "Volo.AbpIo.Commercial:010003": "Nie ste vlastníkom tejto organizácie!",
    "OrganizationNotFoundMessage": "Nenašla sa žiadna organizácia!",
    "DeveloperCount": "Pridelené / celkový počet vývojárov",
    "QuestionCount": "Zostávajúce / všetky otázky",
    "Unlimited": "Neobmedzené",
    "Owners": "Vlastníci",
    "AddMember": "Pridať člena",
    "AddOwner": "Pridať vlastníka",
    "AddDeveloper": "Pridať vývojára",
    "UserName": "Používateľské meno",
    "Name": "Názov",
    "EmailAddress": "Emailová adresa",
    "Developers": "Vývojári",
    "LicenseType": "Typ licencie",
    "Manage": "Spravovať",
    "StartDate": "Dátum začiatku",
    "EndDate": "Dátum ukončenia",
    "Modules": "Moduly",
    "LicenseExtendMessage": "Koniec platnosti vašej licencie je predĺžený do {0}.",
    "LicenseUpgradeMessage": "Vaša licencia je aktualizovaná na {0}",
    "LicenseAddDeveloperMessage": "{0} vývojári boli pridaní do vašej licencie",
    "Volo.AbpIo.Commercial:010004": "Nie je možné nájsť zadaného používateľa! Používateľ musí už byť zaregistrovaný.",
    "MyOrganizations": "Moje organizácie",
    "ApiKey": "API kľúč",
    "UserNameNotFound": "Neexistuje žiadny používateľ s používateľským menom {0}",
    "SuccessfullyAddedToNewsletter": "Ďakujeme, že ste sa prihlásili na odber nášho newslettera!",
    "MyProfile": "Môj profil",
    "EmailNotValid": "Zadajte platnú emailovú adresu.",
    "JoinOurMarketingNewsletter": "Prihláste sa na odber reklamného newslettra",
    "WouldLikeToReceiveMarketingMaterials": "Chcem dostávať reklamné materiály, ponuky produktov a špeciálne ponuky.",
    "StartUsingYourLicenseNow": "Teraz začnite používať svoju licenciu!",
    "WelcomePage": "Uvítacia stránka",
    "UnsubscriptionExpireEmail": "Odhlásenie z odberu emailov informujúcich o dátume vypršania platnosti licencie",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Tento email obsahuje iba pripomenutie dátumu vypršania platnosti vašej licencie.",
    "UnsubscribeFromLicenseExpireEmails": "Ak nechcete dostávať emaily o dátume vypršania platnosti vašej licencie, môžete sa kedykoľvek odhlásiť.",
    "Unsubscribe": "Odhlásiť",
    "NotOrganizationMember": "Nie ste členom žiadnej organizácie.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Úspešne odhlásené",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Už nebudete dostávať emaily s upozornením na dátum vypršania platnosti licencie.",
    "IndexPageHeroSection": "<span class=\"first-line\">Kompletná</span><span class=\"second-line\"> web vývojová platforma</span><span class=\"third-line\">postavená na <img src=\"{0}\" width=\"110\" class=\"ml-1\" /> frameworku</span>",
    "AbpCommercialShortDescription": "ABP Commercial poskytuje predpripravené aplikačné moduly, nástroje na rýchly vývoj aplikácií, profesionálne témy používateľského rozhrania, prémiovú podporu a ďalšie.",
    "LiveDemo": "Live ukážka",
    "GetLicence": "Získajte licenciu",
    "Application": "Aplikácia",
    "StartupTemplates": "Štartovacie šablóny",
    "Startup": "Štart",
    "Templates": "Šablóny",
    "Developer": "Vývojár",
    "Tools": "Nástroje",
    "Premium": "Premium",
    "PremiumSupport": "Prémiová podpora",
    "PremiumForumSupport": "Prémiová podpora na fóre",
    "UI": "POUŽÍVATEĽSKÉ ROZHRANIE",
    "Themes": "Témy",
    "JoinOurNewsletter": "Prihláste sa na odber newslettra",
    "Send": "Odoslať",
    "Learn": "Učiť sa",
    "AdditionalServices": "Ďalšie služby",
    "WhatIsABPFramework": "ČO JE FRAMEWORK ABP?",
    "OpenSourceBaseFramework": "Základný open source framework ",
    "ABPFrameworkExplanation": "<p class=\"lead\">ABP Commercial je založené na ABP frameworku, open source a komunitou riadenom frameworku webových aplikácií pre ASP.NET Core.</p><p>ABP Framework poskytuje vynikajúcu infraštruktúru na písanie udržiavateľného, rozšíriteľného a testovateľného kódu s osvedčenými postupmi.</p><p>Je integrovaný a postavený na populárnych nástrojoch, ktoré už poznáte. Nízka krivka učenia, jednoduché prispôsobenie, pohodlný vývoj.</p>",
    "Modular": "Modulárny",
    "MicroserviceCompatible": "Kompatibilita s mikroslužbami",
    "DomainDrivenDesignInfrastructure": "Domain Driven Design infraštruktúra",
    "MultiTenancy": "Multitenacia",
    "DistributedMessaging": "Distribuované zasielanie správ",
    "DynamicProxying": "Dynamický Proxying",
    "BackgroundJobs": "Automatické úlohy na pozadí",
    "AuditLogging": "Audit logovanie",
    "BLOBStoring": "Ukladanie BLOBov",
    "BundlingMinification": "Bundling a minifikácia",
    "AdvancedLocalization": "Pokročilá lokalizácia",
    "ManyMore": "Mnohé ďalšie",
    "ExploreTheABPFramework": "Preskúmajte ABP framework",
    "WhyUseTheABPCommercial": "Prečo používať ABP Commercial?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt- 5\">Vybudovanie webových aplikácií podnikovej úrovne môže byť zložité a časovo náročné.</p><p>ABP Commercial ponúka dokonalú základnú infraštruktúru potrebnú pre všetky moderné riešenia ASP.NET Core podnikovej úrovne. Celý vývojový cyklus, od návrhu až po nasadenie, umožňujú integrované funkcie a moduly ABP.</p>",
    "StartupTemplatesShortDescription": "Štartovacie šablóny vám umožnia spustiť projekt za niekoľko sekúnd.",
    "UIFrameworksOptions": "Možnosti používateľského rozhrania frameworku;",
    "DatabaseProviderOptions": "Možnosti poskytovateľov databáz;",
    "PreBuiltApplicationModules": "Vopred pripravené aplikačné moduly",
    "PreBuiltApplicationModulesShortDescription": "Väčšina bežných aplikačných požiadaviek je už pre vás vyvinutá v podobe znovupoužiteľných modulov.",
    "Account": "Účet",
    "Blogging": "Blogovanie",
    "Identity": "Identity",
    "IdentityServer": "Identity Server",
    "Saas": "Saas",
    "LanguageManagement": "Jazykový manažment",
    "TextTemplateManagement": "Správa textových šablón",
    "See All Modules": "Pozri všetky moduly",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "ABP Suite je doplnkový nástroj k uABP Commercial.",
    "AbpSuiteExplanation": "Umožňuje vytvárať webové stránky v priebehu niekoľkých minút. Je to globálny nástroj .NET Core, ktorý možno nainštalovať z príkazového riadka. Dokáže vytvoriť nové riešenie ABP, generovať CRUD stránky od databázy až po frontend.",
    "Details": "Podrobnosti",
    "LeptonTheme": "Lepton téma",
    "ProfessionalModernUIThemes": "Profesionálne a moderné témy používateľského rozhrania",
    "LeptonThemeExplanation": "Lepton poskytuje škálu Bootstrap admin tém, ktoré slúžia ako základ pre akýkoľvek projekt, kde je vyžadovaný administrátorský panel.",
    "DefaultTheme": "Predvolená téma",
    "MaterialTheme": "Materiál téma",
    "Default2Theme": "Predvolená téma 2",
    "DarkTheme": "Tmavá téma",
    "DarkBlueTheme": "Tmavomodrá téma",
    "LightTheme": "Téma Light",
    "ProudToWorkWith": "Hrdo spolupracujeme s",
    "OurConsumers": "Na ABP Commercial sa spoliehajú stovky podnikov a vývojárov vo viac ako 70 krajinách sveta.",
    "JoinOurConsumers": "Pridajte sa k nim a jednoducho vytvorte úžasné produkty.",
    "AdditionalServicesExplanation": "Potrebujete ďalšie alebo vlastné služby?  <strong>My a naši partneri vám ich môžeme poskytnúť;</strong>",
    "CustomProjectDevelopment": "Vývoj projektu na mieru",
    "CustomProjectDevelopmentExplanation": "Špecializovaní vývojári pre vaše vlastné projekty.",
    "PortingExistingProjects": "Prenos existujúcich projektov",
    "PortingExistingProjectsExplanation": "Migrácia starších projektov do ABP frameworku.",
    "LiveSupport": "Live podpora",
    "LiveSupportExplanation": "V prípade potreby možnosť Live podpory na diaľku.",
    "Training": "Školenie",
    "TrainingExplanation": "Školenia určené pre vašich vývojárov.",
    "OnBoarding": "Rozbehnutie",
    "OnBoardingExplanation": "Pomoc pri nastavovaní vývojárskeho prostredia, CI prostredia a CD prostredia.",
    "PrioritizedTechnicalSupport": "Prioritná technická podpora",
    "PremiumSupportExplanation": "Popri skvelej podpore od komunity ABP frameworku aj náš tím podpory zodpovedá otázky a rieši problémy komerčných zákazníkov s vysokou prioritou.",
    "SeeTheSupportOptions": "Pozrite si možnosti podpory",
    "Contact": "Kontakt",
    "TellUsWhatYouNeed": "Povedzte nám, čo potrebujete.",
    "YourMessage": "Vaša správa",
    "YourFullName": "Vaše celé meno",
    "EmailField": "Emailová adresa",
    "YourEmailAddress": "Vaša emailová adresa",
    "HowMayWeHelpYou": "Ako vám môžeme pomôcť?",
    "SendMessage": "Odoslať správu",
    "Success": "Úspech",
    "WeWillReplyYou": "Dostali sme vašu správu a čoskoro vás budeme kontaktovať.",
    "GoHome": "Prejsť Domov",
    "CreateLiveDemo": "Vytvoriť live ukážku",
    "RegisterToTheNewsletter": "Zaregistrujte sa na odber noviniek a dostávajte informácie o ABP.IO, vrátane nových verzií atď.",
    "EnterYourEmailOrLogin": "Zadajte svoju emailovú adresu a vytvorte si ukážku alebo sa <a href=\"{0}\">prihláste</a> pomocou svojho existujúceho konta.",
    "ApplicationTemplate": "Šablóna žiadosti",
    "ApplicationTemplateExplanation": "Štartovacia šablóna aplikácie sa používa na vytvorenie novej webovej aplikácie.",
    "EfCoreProvider": "Entity Framework (podporuje SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\">a ďalšie</a>)",
    "AlreadyIncludedInTemplateModules": "V tejto šablóne sú už zahrnuté a nakonfigurované nasledujúce moduly:",
    "ApplicationTemplateArchitecture": "Táto šablóna aplikácie podporuje aj viacúrovňovú architektúru, v ktorej sú fyzicky oddelené vrstva používateľského rozhrania, vrstva API a služba overovania.",
    "SeeTheGuideOrGoToTheLiveDemo": "Technické informácie o tejto šablóne nájdete v príručke pre vývojárov alebo v live ukážke.",
    "DeveloperGuide": "Príručka pre vývojárov",
    "ModuleTemplate": "Šablóna modulu",
    "ModuleTemplateExplanation1": "Chcete vytvoriť modul a opätovne ho použiť v iných aplikáciách? Táto štartovacia šablóna pripraví všetko na vytvorenie opakovane použiteľného <strong>aplikačného modulu</strong> alebo <strong>mikroslužby</strong>.",
    "ModuleTemplateExplanation2": "<p>Môžete podporovať jeden alebo viacero používateľských rozhraní frameworku, jedného alebo viacerých poskytovateľov databáz pre jeden modul. Štartovacia šablóna je nakonfigurovaná tak, aby okrem infraštruktúry unit a integračných testov spustila a <strong>testovala váš modul</strong> v minimálnej aplikácii. </p> <p>Technické informácie o tejto šablóne nájdete v príručke pre vývojárov.</p>",
    "WithAllStyleOptions": "so všetkými možnosťami štýlov",
    "Demo": "Ukážka",
    "SeeAllModules": "Pozrite si všetky moduly",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) je nástroj v príkazovom riadku na vykonávanie niektorých bežných operácií v riešeniach založených na ABP.",
    "ABPSuiteEasilyCURD": "ABP Suite je nástroj, ktorý vám umožňuje jednoducho vytvárať CRUD stránky.",
    "WeAreHereToHelp": "Sme tu, aby sme <span class=\"zero-text\">pomohli</span>",
    "BrowseOrAskQuestion": "Môžete si prezerať témy našej nápovedy alebo vyhľadávať v často kladených otázkach, prípadne nám môžete položiť otázku pomocou <a href=\"{0}\" class=\"text-success\">kontaktného formulára</a>.",
    "SearchQuestionPlaceholder": "Vyhľadávanie v často kladených otázkach",
    "WhatIsTheABPCommercial": "Čo je to ABP Commercial?",
    "WhatAreDifferencesThanAbpFramework": "Aké sú rozdiely medzi open source ABP Framework a ABP Commercial?",
    "ABPCommercialExplanation": "ABP Commercial je súbor prémiových modulov, nástrojov, tém a služieb postavených na open source <a target=\"_blank\" href=\"{0}\">ABP frameworku</a>. ABP Commercial vyvíja a podporuje ten istý tím, ktorý stojí za ABP frameworkom.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\">ABP framework</a> je modulárny, témovo-upraviteľný, s mikroslužbami kompatibilný framework na vývoj aplikácií pre ASP.NET Core. Poskytuje kompletnú architektúru a silnú infraštruktúru, aby ste sa mohli sústrediť na vlastný biznis kód a nemuseli sa opakovať pri každom novom projekte. Je založený na osvedčených postupoch vývoja softvéru a populárnych nástrojoch, ktoré už poznáte.  </p> <p> ABP framework je úplne bezplatný, má otvorený zdrojový kód a je poháňaný komunitou. Poskytuje aj bezplatnú tému a niektoré predpripravené moduly (napr. správu identít a správu tenantov).</p>",
    "VisitTheFrameworkVSCommercialDocument": "Pre viac informácií navštívte nasledujúci odkaz <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial má oproti ABP systému nasledujúce výhody;",
    "Professional": "Profesionálny",
    "UIThemes": "Témy používateľského rozhrania",
    "EnterpriseModules": "Podnikovo pripravené, funkčne bohaté, predpripravené <a href=\"{0}\">aplikačné moduly</a> (napr. správa Identity Server, správa SaaS, správa jazykov)",
    "ToolingToSupport": "Nástroje na podporu produktivity vášho vývoja (napr. <a href=\"{0}\">ABP Suite</a>)",
    "PremiumSupportLink": "Prémiová <a href=\"{0}\" target=\"_blank\">podpora</a>",
    "WhatDoIDownloadABPCommercial": "Čo si stiahnem, keď si zakúpim ABP Commercial?",
    "CreateUnlimitedSolutions": "Po zakúpení licencie ABP Commercial budete môcť vytvárať neobmedzený počet riešení, ako je popísané v dokumente <a href=\"{0}\">Začíname</a>.",
    "ABPCommercialSolutionExplanation": "Pri vytváraní novej aplikácie dostanete riešenie vo Visual Studio (štartovaciu šablónu) na základe vašich preferencií. Stiahnuté riešenie má pre vás už nainštalované a nakonfigurované komerčné moduly a témy. Ak budete chcieť, môžete odstrániť predinštalovaný modul alebo pridať iný modul. Všetky predvolené moduly a témy používajú balíky NuGet/NPM.",
    "StartDevelopWithTutorials": "Stiahnuté riešenie je dobre navrhnuté a zdokumentované. Môžete na jeho základe začať vyvíjať vlastný biznis kód podľa <a href=\"{0}\">návodov</a>",
    "TryTheCommercialDemo": "Môžete vyskúšať <a href=\"{0}\">demo</a> a pozrieť si ukážku aplikácie vytvorenej pomocou štartovacej šablóny ABP Commercial.",
    "HowManyProducts": "Koľko rôznych produktov/riešení môžem vytvoriť pomocou ABP Commercial?",
    "HowManyProductsExplanation": "Vytvorenie projektu ABP nie je obmedzené. Môžete vytvoriť toľko projektov, koľko chcete, vyvíjať ich a nahrávať na rôzne servery.",
    "HowManyDevelopers": "Koľko vývojárov môže pracovať na ABP Commercial?",
    "HowManyDevelopersExplanation": "Licencie ABP Commercial sú jednotkové na vývojára. Rôzne typy licencií majú rôzne limity pre vývojárov. Ktorýkoľvek typ licencie však môžete kedykoľvek rozšíriť o ďalších vývojárov. Informácie o typoch licencií, limitoch pre vývojárov a nákladoch na ďalších vývojárov nájdete na stránke <a href=\"{0}\">ceny</a>.",
    "ChangingLicenseType": "Môžem v budúcnosti zmeniť typ licencie?",
    "ChangingLicenseTypeExplanation": "Vždy je možné pridať nových vývojárov v rovnakom type licencie. Pozrite si tiež časť \"Koľko vývojárov môže pracovať na ABP Commercial?\". Môžete tiež prejsť na vyššiu licenciu zaplatením vypočítaného cenového rozdielu. Pri prechode na vyšší licenčný plán získate výhody nového plánu, ale prechodom na vyšší licenčný plán sa nezmení dátum platnosti licencie.",
    "LicenseExtendUpgradeDiff": "Aký je rozdiel medzi rozšírením a aktualizáciou licencie?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Predĺženie:</strong> Predĺžením/obnovením licencie budete naďalej dostávať prémiovú podporu a hlavné aktualizácie modulov a tém. Okrem toho budete môcť pokračovať vo vytváraní nových projektov, naďalej používať balík ABP Suite, ktorý urýchľuje váš vývoj. <hr/><strong>Podpísanie licencie:</strong> Rozšírením licencie postúpite na vyšší licenčný plán, ktorý vám umožní získať ďalšie výhody. Pozrite si <a href=\"/pricing\">tabuľku porovnania licencií</a> a skontrolujte rozdiely medzi licenčnými plánmi.<strong>Na druhej strane, pri upgrade sa dátum skončenia platnosti vašej licencie nezmení!</strong> Ak chcete predĺžiť dátum skončenia platnosti vašej licencie, musíte si licenciu predĺžiť.",
    "LicenseRenewalCost": "Aké sú náklady na obnovenie licencie po 1 roku?",
    "LicenseRenewalCostExplanation": "Sadzba za obnovenie (predĺženie) všetkých trvalých licencií ABP Commercial je {0} z cenníkovej ceny licencie. Cena za obnovenie štandardnej tímovej licencie je {1} USD, štandardnej obchodnej licencie je {2} USD a štandardnej podnikovej licencie je {3} USD. Ak už ste zákazníkom, <a href='{4}' target='_blank'>prihláste sa do svojho konta</a> a prezrite si dostupné ceny za obnovenie.",
    "HowDoIRenewMyLicense": "Ako si môžem obnoviť licenciu?",
    "HowDoIRenewMyLicenseExplanation": "Svoju licenciu môžete obnoviť tak, že prejdete na stránku <a href='{0}' target='_blank'> správa organizície</a>. Ak chcete využiť naše zľavnené ceny za predčasné obnovenie, uistite sa, že ste licenciu obnovili pred uplynutím jej platnosti. Netrápte sa však tým, že neviete, kedy sa vaša možnosť predčasného obnovenia skončí. Pred vypršaním platnosti predplatného dostanete 2 e-maily s pripomienkami. Budeme ich posielať o 30 dní, teda 7 dní pred vypršaním platnosti.",
    "IsSourceCodeIncluded": "Zahŕňa moja licencia zdrojový kód komerčných modulov a tém?",
    "IsSourceCodeIncludedExplanation1": "Závisí od typu zakúpenej licencie:",
    "IsSourceCodeIncludedExplanation2": "<strong>Tím</strong>: Vaše riešenie používa moduly a témy ako balíky NuGet a NPM. Neobsahuje ich zdrojový kód. Týmto spôsobom môžete tieto moduly a témy ľahko aktualizovať vždy, keď je k dispozícii nová verzia. Nemôžete však získať zdrojový kód modulov a tém.",
    "IsSourceCodeIncludedExplanation3": "<strong>Business/Enterprise</strong>: Okrem tímovej licencie si môžete stiahnuť zdrojový kód akéhokoľvek modulu alebo témy, ktorú potrebujete. Môžete dokonca odstrániť odkazy na balíky NuGet/NPM pre konkrétny modul a pridať jeho zdrojový kód priamo do svojho riešenia a úplne ho zmeniť.",
    "IsSourceCodeIncludedExplanation4": "<p>Začlenenie zdrojového kódu modulu do vášho riešenia vám dáva maximálnu slobodu prispôsobenia tohto modulu. Potom však nebude možné automaticky aktualizovať modul pri vydaní novej verzie.</p><p>Žiadna z licencií nezahŕňa zdrojový kód balíka ABP Suite, čo je externý nástroj, ktorý pre vás generuje kód a pomáha pri vývoji.</p><p>Dalšie rozdiely medzi jednotlivými typmi licencií nájdete na <a href=\"{0}\">stránke o cenách</a>.</p>",
    "ChangingDevelopers": "Môžem v budúcnosti zmeniť registrovaných vývojárov svojej organizácie?",
    "ChangingDevelopersExplanation": "Okrem pridávania nových vývojárov do licencie môžete tiež meniť existujúcich vývojárov (môžete odstrániť vývojára a pridať nového na to isté miesto) bez akýchkoľvek ďalších nákladov.",
    "WhatHappensWhenLicenseEnds": "Čo sa stane po skončení platnosti licencie?",
    "WhatHappensWhenLicenseEndsExplanation1": "Typ komerčnej licencie ABP je <a href=\"{0}\" target=\"_blank\">trvalá licencia</a>. Po uplynutí platnosti licencie môžete pokračovať vo vývoji svojho projektu. A nie ste povinní obnoviť svoju licenciu. Vaša licencia sa dodáva s ročným plánom aktualizácií a podpory už v balení. Ak chcete aj naďalej dostávať nové funkcie, vylepšenia výkonu, opravy chýb, podporu a pokračovať v používaní balíka ABP Suite, nezabudnite si plán každý rok obnoviť. Po skončení platnosti vašej licencie nebudete môcť získať ďalšie z nasledujúcich výhod;",
    "WhatHappensWhenLicenseEndsExplanation2": "Pomocou ABP Commercial nemôžete vytvárať nové riešenia, ale navždy môžete pokračovať vo vývoji existujúcich aplikácií.",
    "WhatHappensWhenLicenseEndsExplanation3": "Budete môcť získať aktualizácie modulov a tém v rámci vašej hlavnej verzie. Ak napríklad používate modul vo verzii 3.2.0, stále môžete získať aktualizácie pre verziu 3.x.x (v3.3.0, v3.5.2... atď.) tohto modulu. Nemôžete však získať aktualizácie pre ďalšiu hlavnú verziu (napr. v4.x, v5.x).",
    "WhatHappensWhenLicenseEndsExplanation4": "Po skončení platnosti vašej licencie nemôžete inštalovať nové moduly a témy pridané do platformy ABP Commercial.",
    "WhatHappensWhenLicenseEndsExplanation5": "Balík ABP Suite nemôžete používať.",
    "WhatHappensWhenLicenseEndsExplanation6": "Už nemôžete získať <a href=\"{0}\">prémiovú podporu</a>.",
    "WhatHappensWhenLicenseEndsExplanation7": "Ak chcete tieto výhody využívať aj naďalej, môžete si predplatné obnoviť. Pri obnovení predplatného sa poskytuje 20 % zľava.",
    "WhenShouldIRenewMyLicense": "Kedy si mám obnoviť licenciu?",
    "WhenShouldIRenewMyLicenseExplanation1": "Ak si licenciu obnovíte do <strong>1 mesiaca</strong> po vypršaní platnosti licencie, na celkovú cenu licencie bude uplatnená zľava 20%.",
    "WhenShouldIRenewMyLicenseExplanation2": "Ak obnovíte licenciu po uplynutí 1 mesiaca od dátumu vypršania platnosti licencie, cena za obnovenie bude rovnaká ako cena za nákup licencie a na obnovenie nebude poskytnutá žiadna zľava.",
    "TrialPlan": "Máte skúšobný plán?",
    "TrialPlanExplanation": "Spoločnosť ABP Commercial zatiaľ nemá skúšobný plán. Pre tímové licencie poskytujeme 30-dňovú záruku vrátenia peňazí. Stačí požiadať o vrátenie peňazí počas prvých 30 dní. V prípade licencií Business a Enterprise poskytujeme 60% vrátenie peňazí do 30 dní. Je to preto, že licencie Business a Enterprise obsahujú úplný zdrojový kód všetkých modulov a tém.",
    "DoYouAcceptBankWireTransfer": "Prijímate bankový prevod?",
    "DoYouAcceptBankWireTransferExplanation": "Áno, akceptujeme bankový prevod.<br />Po zaslaní sumy za licenciu bankovým prevodom nám pošlite potvrdenie a požadovaný typ licencie e-mailom.<br />Naše informácie o medzinárodnom bankovom účte:",
    "HowToUpgrade": "Ako aktualizovať existujúce aplikácie, keď je k dispozícii nová verzia?",
    "HowToUpgradeExplanation1": "Pri vytváraní novej aplikácie pomocou ABP Commercial sa všetky moduly a téma použijú ako balíky NuGet a NPM. Balíky teda môžete ľahko aktualizovať, keď je k dispozícii nová verzia.",
    "HowToUpgradeExplanation2": "Okrem štandardných aktualizácií NuGet/NPM poskytuje <a href=\"{0}\">ABP CLI</a> príkaz update, ktorý automaticky nájde a aktualizuje všetky balíky súvisiace s ABP vo vašom riešení.",
    "DatabaseSupport": "Ktoré databázové systémy sú podporované?",
    "DatabaseSupportExplanation": "Samotný ABP Framework je databázovo agnostický a môže pracovať s akýmkoľvek poskytovateľom databázy. Zoznam aktuálne implementovaných poskytovateľov nájdete v <a href=\"{0}\" target=\"_blank\">dokumente o prístupe k údajom</a>.",
    "UISupport": "Ktoré používateľské rozhrania frameworku sú podporované?",
    "Supported": "Podporované",
    "UISupportExplanation": "Samotný ABP framework je agnostický a môže pracovať s akýmkoľvek UI frameworkom. Štartovacie šablóny, moduly používateľského rozhrania a témy však neboli implementované pre všetky UI frameworky. Aktuálny zoznam možností používateľského rozhrania nájdete v <a href=\"{0}\">dokumente Začíname</a>.",
    "MicroserviceSupport": "Podporuje architektúru mikroslužieb?",
    "MicroserviceSupportExplanation1": "Jedným z hlavných cieľov ABP frameworku je poskytnúť vhodnú infraštruktúru na vytváranie riešení mikroslužieb. Na lepšie pochopenie si pozrite dokument <a href=\"{0}\">architektúra mikroslužieb</a>.",
    "MicroserviceSupportExplanation2": "Všetky komerčné moduly ABP sú navrhnuté tak, aby podporovali scenáre nasadenia mikroslužieb (s vlastnou API a databázou) podľa dokumentu <a href=\"{0}\">Osvedčené postupy vývoja modulov</a>.",
    "MicroserviceSupportExplanation3": "Poskytujeme vzorové <a href=\"{0}\">micro-service demo riešenie</a>, ktoré demonštruje implementáciu architektúry mikroslužby a pomôže vám vytvoriť vlastné riešenie.",
    "MicroserviceSupportExplanation4": "Krátka odpoveď teda znie \"<strong>áno, podporuje architektúru mikroslužieb</strong>\".",
    "MicroserviceSupportExplanation5": "Riešenie je systém mikroslužieb a každé riešenie má iné požiadavky, sieťovú topológiu, komunikačné scenáre, možnosti autentifikácie, databázové rozdelenia/zdieľanie databáz, runtime konfigurácie, integrácie systémov tretích strán a mnohé ďalšie.",
    "MicroserviceSupportExplanation6": "ABP Framework a ABP Commercial poskytujú infraštruktúru pre scenáre mikroslužieb, moduly kompatibilné s mikroslužbami, vzorky a dokumentáciu, ktoré vám pomôžu vytvoriť vlastné riešenie. Neočakávajte však, že si priamo stiahnete svoje vysnívané riešenie, ktoré je pre vás vopred zostavené. Budete mu musieť porozumieť a spojiť niektoré časti na základe vašich požiadaviek.",
    "WhereCanIDownloadSourceCode": "Kde si môžem stiahnuť zdrojový kód?",
    "WhereCanIDownloadSourceCodeExplanation": "Zdrojový kód všetkých modulov ABP, balíkov Angular a tém si môžete stiahnuť prostredníctvom balíka ABP Suite alebo ABP CLI. Pozrite si <a href=\"{0}\">Ako stiahnuť zdrojový kód?</a>",
    "ComputerLimitation": "Koľko počítačov môže vývojár prihlásiť pri vývoji ABP?",
    "ComputerLimitationExplanation": "Osobitne povoľujeme <strong>{0} počítačov</strong> na jednotlivca/licencovaného vývojára. Vždy, keď je potrebné, aby vývojár vyvíjal komerčné ABP produkty na treťom počítači, je potrebné poslať e-mail na adresu license@abp.io s vysvetlením situácie a my potom vykonáme príslušné pridelenie v našom systéme.",
    "RefundPolicy": "Máte podmienky vrátenia peňazí?",
    "RefundPolicyExplanation": "O vrátenie peňazí môžete požiadať do <strong>30 dní</strong> od zakúpenia licencie. Typy licencií Business a Enterprise majú možnosť stiahnutia zdrojového kódu, preto nie je možné vrátiť peniaze za licencie Business a Enterprise (a všetky licencie, ktoré zahŕňajú právo na získanie zdrojového kódu). Okrem toho sa nevracajú peniaze za obnovenie a druhý nákup licencie.",
    "HowCanIRefundVat": "Ako môžem vrátiť DPH?",
    "HowCanIRefundVatExplanation1": "Ak ste platbu uskutočnili prostredníctvom služby 2Checkout, DPH môžete vrátiť prostredníctvom svojho účtu 2Checkout:",
    "HowCanIRefundVatExplanation2": "Prihláste sa do svojho účtu <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\">2Checkout</a>",
    "HowCanIRefundVatExplanation3": "Vyhľadajte príslušnú objednávku a stlačte tlačidlo \"Vrátiť oneskorenú DPH\" (zadajte svoje IČ DPH).",
    "HowCanIGetMyInvoice": "Ako môžem získať faktúru?",
    "HowCanIGetMyInvoiceExplanation": "Na zakúpenie licencie sú k dispozícii 2 platobné brány: PayU a 2Checkout. Ak si zakúpite licenciu prostredníctvom brány 2Checkout, odošle vám faktúru vo formáte PDF na vašu e-mailovú adresu, pozrite si <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How-do-invoices-work\">fakturovanie cez 2Checkout.</a> Ak si zakúpite licenciu prostredníctvom brány PayU alebo bankovým prevodom, pripravíme a pošleme vám faktúru. O faktúru môžete požiadať na stránke <a href=\"{0}\">správy organizácie.</a>",
    "Forum": "Fórum",
    "SupportExplanation": "Komerčné ABP licencie poskytujú prémiovú podporu fóra zloženú z tímu odborníkov na ABP Framework.",
    "PrivateTicket": "Privátny ticket",
    "PrivateTicketExplanation": "Licencia Enterprise zahŕňa aj súkromnú podporu e-mailom a ticket systém.",
    "AbpSuiteExplanation1": "Sada ABP Suite umožňuje vytvárať webové stránky v priebehu niekoľkých minút. Je to globálny nástroj .NET Core, ktorý možno nainštalovať z príkazového riadka.",
    "AbpSuiteExplanation2": "Môže vytvoriť nové riešenie ABP, generovať stránky CRUD z databázy do front-endu. Technický prehľad nájdete v <a href=\"{0}\">dokumente</a>",
    "FastEasy": "Rýchlo & jednoducho",
    "AbpSuiteExplanation3": "Sada ABP Suite umožňuje jednoducho vytvárať CRUD stránky. Stačí definovať vašu entitu a jej vlastnosti, ostatné nechajte na ABP Suite! Sada ABP Suite vygeneruje všetok potrebný kód pre vašu CRUD stránku za niekoľko sekúnd. Podporuje používateľské rozhrania Angular, MVC a Blazor.",
    "RichOptions": "Bohaté možnosti",
    "AbpSuiteExplanation4": "ABP Suite podporuje viacero možností používateľského rozhrania, ako napríklad <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\">Razor Pages</a> a <a href=\"https://angular.io\">Angular</a>. Podporuje tiež viacero databáz, ako napríklad <a href=\"https://www.mongodb.com\">MongoDB</a> a všetky databázy podporované <strong>EntityFramework Core</strong> (MS SQL Server, Oracle, MySql, PostgreSQL a <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\">ďalšie</a>).",
    "AbpSuiteExplanation5": "Dobré je, že sa o tieto možnosti nemusíte starať. ABP Suite rozumie typu vášho projektu a vygeneruje kód pre váš projekt a umiestni vygenerovaný kód na správne miesto vo vašom projekte.",
    "SourceCode": "Zdrojový kód",
    "AbpSuiteExplanation6": "ABP Suite generuje zdrojový kód za vás! Nevygeneruje magické súbory na generovanie webovej stránky. ABP Suite vygeneruje zdrojový kód pre <strong>Entity, repozitáre, aplication service, Code First Migration, JavaScript/TypeScript a CSHTML/HTML</strong> a tiež potrebné rozhrania. ABP Suite tiež generuje kód podľa <strong>Najlepších postupov</strong> vývoja softvéru, takže sa nemusíte obávať o kvalitu vygenerovaného kódu.",
    "AbpSuiteExplanation7": "Pretože máte zdrojový kód stavebných blokov vygenerovanej stránky CRUD v správnych aplikačných vrstvách, môžete zdrojový kód jednoducho upraviť a do vygenerovaného kódu vložiť vlastnú/obslužnú logiku.",
    "CrossPlatform": "Naprieč platformami",
    "AbpSuiteExplanation8": "ABP Suite je vytvorená pomocou .NET Core a je multiplatformová. Spustí sa ako webová aplikácia na vašom lokálnom počítači. Môžete ju spustiť na <strong>Windowse</strong>, <strong>Macu</strong> a <strong>Linuxe</strong>.",
    "OtherFeatures": "Ďalšie funkcie",
    "OtherFeatures1": "Ľahko aktualizuje balíky <strong>NuGet</strong> a <strong>NPM</strong> na vašom riešení.",
    "OtherFeatures2": "Obnovte už vygenerované stránky od začiatku.",
    "OtherFeatures3": "Vytvára nové riešenia",
    "ThanksForCreatingProject": "Ďakujeme za vytvorenie projektu!",
    "HotToRunSolution": "Ako spustiť vaše riešenie?",
    "HotToRunSolutionExplanation": "Pozrite si dokument Začíname a dozviete sa, ako nakonfigurovať a spustiť riešenie.",
    "GettingStarted": "Začíname",
    "WebAppDevTutorial": "Webová aplikácia Dev Tutorial",
    "WebAppDevTutorialExplanation": "Pozrite si dokument s návodom na vývoj webovej aplikácie, kde nájdete ukážku vývoja krok za krokom.",
    "Document": "Dokument",
    "UsingABPSuiteToCURD": "Použite ABP Suite na generovanie CRUD stránok a nástrojov",
    "SeeABPSuiteDocument": "Pozrite si dokument ABP Suite, v ktorom sa dozviete o používaní ABP Suite.",
    "AskQuestionsOnSupport": "Otázky môžete klásť na stránke ABP Commercial Support.",
    "Documentation": "Dokumentácia",
    "SeeModulesDocument": "Zoznam všetkých komerčných (pro) modulov a ich dokumentov nájdete v dokumente Moduly.",
    "Pricing": "Cenotvorba",
    "PricingExplanation": "Vyberte si funkcie a vlastnosti, ktoré vaša firma potrebuje. V prípade rastu ju môžete ľahko upgradovať.",
    "Team": "Tím",
    "Business": "Obchod",
    "Enterprise": "Podnik",
    "Custom": "Vlastné",
    "IncludedDeveloperLicenses": "Zahrnuté licencie pre vývojárov",
    "CustomLicenceOrAdditionalServices": "Potrebujete vlastnú licenciu alebo ďalšie služby?",
    "CustomOrVolumeLicense": "Vlastná alebo objemová licencia",
    "LiveTrainingSupport": "Live školenia a podpora",
    "AndMore": "a viac",
    "AdditionalDeveloperLicense": "Dodatočná licencia pre vývojárov",
    "ProjectCount": "Počet projektov",
    "AllProModules": "Všetky PRO moduly",
    "AllProThemes": "Všetky PRO témy",
    "AllProStartupTemplates": "Všetky PRO štartovacie šablóny",
    "SourceCodeOfAllModules": "Zdrojový kód všetkých modulov",
    "SourceCodeOfAllThemes": "Zdrojový kód všetkých tém",
    "PerpetualLicense": "Trvalá licencia",
    "UnlimitedServerDeployment": "Neobmedzené nasadenie servera",
    "YearUpgrade": "Aktualizácia na 1 rok",
    "YearPremiumForumSupport": "1 rok prémiovej podpory fóra",
    "ForumSupportIncidentCountYear": "Počet incidentov podpory fóra/rok",
    "PrivateTicketEmailSupport": "Súkromné tickety & e-mailová podpora",
    "BuyNow": "Kúpiť teraz",
    "PayViaAmexCard": "Ako môžem platiť kartou AMEX?",
    "PayViaAmexCardDescription": "Predvolená platobná brána \"Iyzico\" môže odmietnuť niektoré kreditné karty AMEX z dôvodu bezpečnostných opatrení. V takom prípade môžete platiť prostredníctvom alternatívnej platobnej brány \"2Checkout\".",
    "ThankYou": "Ďakujem",
    "InvalidReCaptchaErrorMessage": "Pri overovaní reCAPTCHA došlo k chybe. Skúste to znova prosím."
  }
}