{
  "culture": "sl",
  "texts": {
    "OrganizationManagement": "Upravljanje organizacije",
    "OrganizationList": "Seznam organizacij",
    "Volo.AbpIo.Commercial:010003": "Niste lastnik te organizacije!",
    "OrganizationNotFoundMessage": "Nobene organizacije ni bilo mogoče najti!",
    "DeveloperCount": "Dodeljeni/skupno število razvijalcev",
    "QuestionCount": "Preostala/skupno število vprašanj",
    "Unlimited": "Neomejeno",
    "Owners": "Lastniki",
    "Owner": "Lastnik",
    "AddMember": "Dodaj člana",
    "AddNewOwner": "Dodaj novega lastnika",
    "AddNewDeveloper": "Dodaj novega razvijalca",
    "UserName": "Uporabniško ime",
    "Name": "Ime",
    "EmailAddress": "E-poštni naslov",
    "Developers": "Razvijalci",
    "LicenseType": "Tip licence",
    "Manage": "Upravljaj",
    "SetDefault": "Nastavi na privzeto",
    "DefaultOrganization": "Privzeto",
    "StartDate": "Datum začetka",
    "EndDate": "Datum konca",
    "Modules": "Moduli",
    "LicenseExtendMessage": "Končni datum veljavnosti licence je podaljšan na {0}",
    "LicenseUpgradeMessage": "Vaša licenca je nadgrajena na {0}",
    "LicenseExtendAdnUpgradeMessage": "Vaša licenca je bila podaljšana do {0}, vaš licenčni načrt pa je nadgrajen na {1}.",
    "LicenseAddDeveloperMessage": "{0} razvijalcev je bilo dodanih k vaši licenci",
    "Volo.AbpIo.Commercial:010004": "Navedenega uporabnika ni mogoče najti! Uporabnik mora biti registriran.",
    "MyOrganizations": "Moje organizacije",
    "ApiKey": "Ključ API",
    "UserNameNotFound": "Ni uporabnika z uporabniškim imenom {0}",
    "SuccessfullyAddedToNewsletter": "Hvala, ker ste se naročili na naše novice!",
    "MyProfile": "Moj profil",
    "EmailNotValid": "Vnesite veljaven e-poštni naslov.",
    "JoinOurMarketingNewsletter": "Pridružite se našemu marketinškemu glasilu",
    "WouldLikeToReceiveMarketingMaterials": "Rad bi prejel marketinško gradivo, kot so ponudbe izdelkov in posebne ponudbe.",
    "StartUsingYourLicenseNow": "Začnite uporabljati svojo licenco zdaj!",
    "WelcomePage": "Dobrodošli stran",
    "UnsubscriptionExpireEmail": "Odjavite se od e-poštnih opomnikov o datumu poteka licence",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Ta e-poštna naročnina vsebuje samo opomnik na datum poteka licence.",
    "UnsubscribeFromLicenseExpireEmails": "Če ne želite prejemati e-poštnih sporočil o datumu poteka veljavnosti licence, se lahko kadar koli odjavite.",
    "Unsubscribe": "Odjavi se",
    "NotOrganizationMember": "Niste član nobene organizacije.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Uspešno odjavljen",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "E-poštnih sporočil z opomnikom o datumu poteka licence ne boste več prejemali.",
    "IndexPageHeroSection": "<span class=\"first-line\">Popolna</span><span class=\"second-line\"> platforma za spletno razvoj</span><span class=\"third-line\">vgrajena <img src= \"{0}\" width=\"110\" class=\"ml-1\" /> okvir</span>",
    "AbpCommercialShortDescription": "ABP Commercial ponuja vnaprej izdelane aplikacijske module, orodja za hiter razvoj aplikacij, profesionalne teme uporabniškega vmesnika, vrhunsko podporo in še več.",
    "LiveDemo": "Demo v živo",
    "LiveDemoLead": "<a href=\"{0}\">{1}</a> s svojim ABP računom, <a href=\"{2}\">{3}</a> na abp.io.<br/>Ali izpolnite spodnji obrazec, da ustvarite demo v živo zdaj",
    "ThereIsAlreadyAnAccountWithTheGivenEmailAddress": "Za navedeni e-poštni naslov že obstaja račun: <b>{0}</b><br/> Lahko se prijavite s svojim računom, da nadaljujete.",
    "GetLicence": "Pridobite licenco",
    "Application": "Aplikacija",
    "StartupTemplates": "Predloge za zagon",
    "Startup": "Začeti",
    "Templates": "Predloge",
    "Developer": "Razvijalec",
    "Tools": "Orodja",
    "Premium": "Premium",
    "PremiumSupport": "Premium podpora",
    "PremiumForumSupport": "Premium forum podpora",
    "UI": "uporabniški vmesnik",
    "Themes": "Teme",
    "JoinOurNewsletter": "Pridružite se našemu glasilu",
    "Send": "Pošlji",
    "WhatIsABPFramework": "KAJ JE OKVIR ABP?",
    "OpenSourceBaseFramework": "Odprtokodni osnovni okvir",
    "ABPFrameworkExplanation": "<p class=\"lead\">ABP Commercial temelji na ABP Framework, odprtokodnem in skupnostno usmerjenem ogrodju spletnih aplikacij za ASP.NET Core.</p><p>ABP Framework zagotavlja odlično infrastrukturo za pisanje, ki jo je mogoče vzdrževati in je razširljivo. in kodo, ki jo je mogoče preizkusiti z najboljšimi praksami.</p><p>Vgrajeno in integrirano v priljubljena orodja, ki jih že poznate. Nizka krivulja učenja, enostavna prilagoditev, udoben razvoj.</p>",
    "Modular": "Modularno",
    "MicroserviceCompatible": "Združljivo z mikroservisom",
    "DomainDrivenDesignInfrastructure": "Domain Driven Design Infrastruktura",
    "MultiTenancy": "Več najemno",
    "DistributedMessaging": "Porazdeljeno sporočanje",
    "DynamicProxying": "Dinamično proxy",
    "BackgroundJobs": "Delovna mesta v ozadju",
    "AuditLogging": "Revizijsko beleženje",
    "BLOBStoring": "Shranjevanje BLOB-jev",
    "BundlingMinification": "Združevanje in pomanjševanje",
    "AdvancedLocalization": "Napredna lokalizacija",
    "ManyMore": "Veliko več",
    "ExploreTheABPFramework": "Raziščite okvir ABP",
    "WhyUseTheABPCommercial": "Zakaj uporabljati reklamo ABP?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\">Izdelava spletnih aplikacij za podjetja je lahko zapletena in dolgotrajna.</p><p>ABP Commercial ponuja popolno osnovno infrastrukturo, potrebno za vse sodobne ASP.NET Core poslovnega razreda zasnovane rešitve. Celoten razvojni cikel je pooblaščen z vgrajenimi funkcijami in moduli ABP od zasnove do uvajanja.</p>",
    "StartupTemplatesShortDescription": "Predloge za zagon omogočajo, da v nekaj sekundah preskočite svoj projekt.",
    "UIFrameworksOptions": "možnosti okvirjev uporabniškega vmesnika;",
    "DatabaseProviderOptions": "Možnosti ponudnika baz podatkov;",
    "PreBuiltApplicationModules": "Vnaprej izdelani aplikacijski moduli",
    "PreBuiltApplicationModulesShortDescription": "Najpogostejše zahteve za aplikacije so že razvite za vas kot module za večkratno uporabo.",
    "Account": "račun",
    "Blogging": "Bloganje",
    "Identity": "Identiteta",
    "IdentityServer": "Identity Server",
    "Saas": "Saas",
    "LanguageManagement": "Jezikovno upravljanje",
    "TextTemplateManagement": "Upravljanje besedilnih predlog",
    "See All Modules": "Glej vse module",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "ABP Suite je dopolnilno orodje k ABP Commercial.",
    "AbpSuiteExplanation": "Omogoča vam izdelavo spletnih strani v nekaj minutah. To je globalno orodje .NET Core, ki ga je mogoče namestiti iz ukazne vrstice. Lahko ustvari novo rešitev ABP, generira strani CRUD iz baze podatkov na front-end.",
    "Details": "Podrobnosti",
    "LeptonTheme": "Leptonova tema",
    "ProfessionalModernUIThemes": "Profesionalne, sodobne teme uporabniškega vmesnika",
    "LeptonThemeExplanation": "Lepton ponuja paleto skrbniških tem Bootstrap, ki služijo kot trdna podlaga za vsak projekt, ki zahteva skrbniško nadzorno ploščo.",
    "DefaultTheme": "Privzeta tema",
    "MaterialTheme": "Materialna tema",
    "Default2Theme": "Privzeta 2 tema",
    "DarkTheme": "Temna tema",
    "DarkBlueTheme": "Temno modra tema",
    "LightTheme": "Svetla tema",
    "ProudToWorkWith": "Ponosen na sodelovanje",
    "OurConsumers": "Na tisoče podjetij in razvijalcev v več kot 70 državah po vsem svetu se zanaša na ABP Commercial.",
    "JoinOurConsumers": "Pridružite se jim in hitro sestavite neverjetne izdelke.",
    "AdditionalServicesExplanation": "Potrebujete dodatne storitve ali storitve po meri? <strong>Mi in naši partnerji lahko zagotovimo;</strong>",
    "CustomProjectDevelopment": "Razvoj projekta po meri",
    "CustomProjectDevelopmentExplanation": "Namenski razvijalci za vaše projekte po meri.",
    "PortingExistingProjects": "Prenos obstoječih projektov",
    "PortingExistingProjectsExplanation": "Selitev vaših starih projektov na platformo ABP.",
    "LiveSupport": "Podpora v živo",
    "LiveSupportExplanation": "Možnost podpore na daljavo v živo, ko jo potrebujete.",
    "Training": "Usposabljanje",
    "TrainingExplanation": "Namensko usposabljanje za vaše razvijalce.",
    "OnBoarding": "Na vkrcanje",
    "OnBoardingExplanation": "Pomagajte pri nastavitvi okolja za razvoj, CI in CD.",
    "PrioritizedTechnicalSupport": "Prednostna tehnična podpora",
    "PremiumSupportExplanation": "Poleg velike podpore skupnosti za okvir ABP, naša skupina za podporo odgovarja na tehnična vprašanja in težave komercialnih uporabnikov z visoko prednostjo.",
    "SeeTheSupportOptions": "Glejte Možnosti podpore",
    "Contact": "Kontakt",
    "TellUsWhatYouNeed": "Povejte nam, kaj potrebujete.",
    "YourMessage": "Tvoje sporočilo",
    "YourFullName": "Tvoje polno ime",
    "FirstNameField": "Ime",
    "LastNameField": "Priimek",
    "EmailField": "Email naslov",
    "YourEmailAddress": "Vaš email naslov",
    "ValidEmailAddressIsRequired": "Veljaven e-poštni naslov je obvezen",
    "HowMayWeHelpYou": "Kako vam lahko pomagamo?",
    "SendMessage": "Pošlji sporočilo",
    "Success": "uspeh",
    "WeWillReplyYou": "Prejeli smo vaše sporočilo in vas bomo v kratkem kontaktirali.",
    "GoHome": "Pojdi domov",
    "CreateLiveDemo": "Ustvari demo v živo",
    "CreateLiveDemoDescription": "Ko pošljete ta obrazec, boste prejeli e-poštno sporočilo s povezavo do svojega demo.",
    "RegisterToTheNewsletter": "Registrirajte se za glasilo, če želite prejemati informacije o ABP.IO, vključno z novimi izdajami itd.",
    "EnterYourEmailOrLogin": "Vnesite svoj e-poštni naslov, če želite ustvariti predstavitev, ali <a href=\"{0}\">Prijavite se</a> z obstoječim računom.",
    "ApplicationTemplate": "Predloga aplikacije",
    "ApplicationTemplateExplanation": "Predloga za zagon aplikacije se uporablja za ustvarjanje nove spletne aplikacije.",
    "EfCoreProvider": "Entity Framework (podpira SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\">in druge</a>)",
    "AlreadyIncludedInTemplateModules": "Naslednji moduli so že vključeni in konfigurirani v tej predlogi:",
    "ApplicationTemplateArchitecture": "Ta predloga aplikacije podpira tudi večstopenjsko arhitekturo, kjer so sloj uporabniškega vmesnika, sloj API in storitev preverjanja pristnosti fizično ločeni.",
    "SeeTheGuideOrGoToTheLiveDemo": "Za tehnične informacije o tej predlogi si oglejte vodnik za razvijalce ali obiščite demo v živo.",
    "DeveloperGuide": "Vodnik za razvijalce",
    "ModuleTemplate": "Predloga modula",
    "ModuleTemplateExplanation1": "Želite ustvariti modul in ga ponovno uporabiti v različnih aplikacijah? Ta zagonska predloga pripravi vse za začetek ustvarjanja <strong>aplikacijskega modula</strong> ali <strong>mikrostoritve</strong> za večkratno uporabo.",
    "ModuleTemplateExplanation2": "<p>Za en sam modul lahko podpirate eno ali več ogrodij uporabniškega vmesnika, enega ali več ponudnikov baz podatkov. Predloga za zagon je konfigurirana za zagon in <strong>preskušanje vašega modula</strong> v minimalni aplikaciji poleg infrastrukture za testiranje enote in integracije. </p> <p>Oglejte si vodnik za razvijalce za tehnične informacije o tej predlogi.</p>",
    "WithAllStyleOptions": "z vsemi stilskimi možnostmi",
    "Demo": "Demo",
    "SeeAllModules": "Glejte Vsi moduli",
    "ABPCLIExplanation": "ABP CLI (vmesnik ukazne vrstice) je orodje ukazne vrstice za izvajanje nekaterih običajnih operacij za rešitve, ki temeljijo na ABP.",
    "ABPSuiteEasilyCURD": "ABP Suite je orodje, ki vam omogoča preprosto ustvarjanje strani CRUD",
    "WeAreHereToHelp": "Tukaj smo za <span class=\"zero-text\">pomoč</span>",
    "BrowseOrAskQuestion": "Brskate lahko po naših temah pomoči ali iščete po pogostih vprašanjih ali pa nam postavite vprašanje z uporabo <a href=\"{0}\" class=\"text-success\">kontaktnega obrazca</a>.",
    "SearchQuestionPlaceholder": "Iščite v pogosto zastavljenih vprašanjih",
    "WhatIsTheABPCommercial": "Kaj je reklama ABP?",
    "WhatAreDifferencesThanAbpFramework": "Kakšne so razlike med odprtokodnim okvirom ABP in ABP Commercial?",
    "AbpCommercialMetaTitle": "{0} | ABP Commercial",
    "AbpCommercialMetaDescription": "Celovita platforma za spletni razvoj na ogrodju ABP z vnaprej zgrajenimi moduli, zagonskimi predlogami, orodji za hiter razvoj, temami profesionalnega uporabniškega vmesnika in vrhunsko podporo.",
    "ABPCommercialExplanation": "ABP Commercial je nabor vrhunskih modulov, orodij, tem in storitev, zgrajenih na vrhu odprtokodnega <a target=\"_blank\" href=\"{0}\">okvirja ABP</a>. ABP Commercial razvija in podpira ista ekipa, ki stoji za okvirom ABP.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\">Ogrodje ABP</a> je modularno, tematsko ogrodje za razvoj aplikacij za ASP.NET Core, združljivo z mikro storitvami. Zagotavlja popolno arhitekturo in močno infrastrukturo, da se osredotočite na lastno poslovno kodo, namesto da se ponavljate za vsak nov projekt. Temelji na najboljših praksah razvoja programske opreme in priljubljenih orodjih, ki jih že poznate. </p> <p> Okvir ABP je popolnoma brezplačen, odprtokoden in usmerjen v skupnost. Ponuja tudi brezplačno temo in nekaj vnaprej izdelanih modulov (npr. upravljanje identitete in upravljanje najemnikov).</p>",
    "VisitTheFrameworkVSCommercialDocument": "Za več informacij obiščite naslednjo povezavo <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial poleg okvira ABP dodaja naslednje prednosti;",
    "Professional": "Profesionalni",
    "UIThemes": "Teme uporabniškega vmesnika",
    "EnterpriseModules": "Za podjetja pripravljeni, bogati s funkcijami, vnaprej izdelani <a href=\"{0}\">aplikacijski moduli</a> (npr. upravljanje strežnika Identity Server, upravljanje SaaS, upravljanje jezikov)",
    "ToolingToSupport": "Orodja za podporo vaši razvojni produktivnosti (npr. <a href=\"{0}\">ABP Suite</a>)",
    "PremiumSupportLink": "Premium <a href=\"{0}\" target=\"_blank\">podpora</a>",
    "WhatDoIDownloadABPCommercial": "Kaj prenesem, ko kupim ABP Commercial?",
    "CreateUnlimitedSolutions": "Ko kupite licenco ABP Commercial, boste lahko ustvarili neomejene rešitve, kot je opisano v dokumentu <a href=\"{0}\">Kako začeti</a>.",
    "ABPCommercialSolutionExplanation": "Ko ustvarite novo aplikacijo, dobite rešitev Visual Studio (zagonsko predlogo), ki temelji na vaših željah. Prenesena rešitev ima komercialne module in teme že nameščene in konfigurirane za vas. Če želite, lahko odstranite vnaprej nameščen modul ali dodate drug modul. Vsi moduli in teme se privzeto uporabljajo kot paketi NuGet/NPM.",
    "StartDevelopWithTutorials": "Prenesena rešitev je dobro zasnovana in dokumentirana. Na podlagi <a href=\"{0}\">vadnic</a> lahko začnete razvijati svojo poslovno kodo",
    "TryTheCommercialDemo": "Poskusite lahko <a href=\"{0}\">demo</a> in si ogledate vzorčno aplikacijo, ustvarjeno s pomočjo zagonske predloge ABP Commercial.",
    "HowManyProducts": "Koliko različnih izdelkov/rešitev lahko izdelam z uporabo ABP Commerciala?",
    "HowManyProductsExplanation": "Za ustvarjanje projekta ABP ni omejitev. Ustvarite lahko toliko projektov, kot želite, jih razvijete in naložite na različne strežnike.",
    "HowManyDevelopers": "Koliko razvijalcev lahko dela na reklami ABP?",
    "HowManyDevelopersExplanation": "Licence ABP Commercial so na razvijalca. Različne vrste licenc imajo različne omejitve za razvijalce. Vendar pa lahko vsaki vrsti licence dodate več razvijalcev, kadar koli potrebujete. Za vrste licenc, omejitve razvijalcev in dodatne stroške razvijalcev si oglejte <a href=\"{0}\">stran s cenami</a>.",
    "ChangingLicenseType": "Ali lahko pozneje nadgradim svojo vrsto licence?",
    "ChangingLicenseTypeExplanation": "Lahko nadgradite na višjo licenco tako, da doplačate razliko v obdobju aktivne licence. Ko nadgradite na višji licenčni načrt, prejmete prednosti novega načrta, vendar nadgradnja licence ne spremeni datuma poteka licence. Poleg tega lahko svoji obstoječi licenci dodate tudi nova mesta za razvijalce, glejte »Koliko razvijalcev lahko dela na ABP Commercial?«",
    "LicenseExtendUpgradeDiff": "Kakšna je razlika med podaljšanjem licence in nadgradnjo?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Razširitev:</strong> s podaljšanjem/obnovitvijo licence boste še naprej prejemali vrhunsko podporo in prejemali večje ali manjše posodobitve za module in teme. Poleg tega boste lahko nadaljevali z ustvarjanjem novih projektov. In še vedno boste lahko uporabljali ABP Suite, ki pospeši vaš razvoj. Ko licenco podaljšate, se datumu poteka licence doda 1 leto.<hr/> <strong>Nadgradnja:</strong> Z nadgradnjo licence boste napredovali v višji licenčni načrt, kar vam bo omogočilo dodatne ugodnosti. Oglejte si <a href=\"/pricing\">primerjalno tabelo licenc</a> , da vidite razlike med licenčnimi načrti. <strong>Po drugi strani pa se ob nadgradnji datum poteka licence ne spremeni!</strong> Če želite podaljšati datum konca licence, morate podaljšati licenco.",
    "LicenseRenewalCost": "Kakšni so stroški podaljšanja licence po 1 letu?",
    "LicenseRenewalCostExplanation": "Cena podaljšanja (podaljšanja) standardne licence ekipe je {0} $, standardne poslovne licence {1} $ in standardne licence za podjetje je {2} $. Če ste že stranka, se <a href='{3}' target='_blank'>prijavite v svoj račun</a> in si oglejte razpoložljive cene za podaljšanje.",
    "HowDoIRenewMyLicense": "Kako podaljšam licenco?",
    "HowDoIRenewMyLicenseExplanation": "Licenco lahko podaljšate tako, da se pomaknete na <a href='{0}' target='_blank'>stran za upravljanje organizacije</a>. Če želite izkoristiti naše znižane cene zgodnjega podaljšanja, se prepričajte, da ste jo podaljšali, preden vam poteče licenca. Ne skrbite, da ne boste vedeli, kdaj se izteče vaša priložnost za zgodnjo obnovo. Pred potekom naročnine boste prejeli 3 e-poštna sporočila z opomnikom. Poslali jih bomo 30 dni, 7 dni in 1 dan pred iztekom.",
    "IsSourceCodeIncluded": "Ali moja licenca vključuje izvorno kodo komercialnih modulov in tem?",
    "IsSourceCodeIncludedExplanation1": "Odvisno od vrste licence, ki ste jo kupili:",
    "IsSourceCodeIncludedExplanation2": "<strong>Ekipa</strong>: Vaša rešitev uporablja module in teme kot paketa NuGet in NPM. Ne vključuje njihove izvorne kode. Na ta način lahko te module in teme enostavno nadgradite, kadar koli je na voljo nova različica. Vendar pa ne morete dobiti izvorne kode modulov in tem.",
    "IsSourceCodeIncludedExplanation3": "<strong>Podjetje/podjetje</strong>: Poleg licence ekipe lahko prenesete izvorno kodo katerega koli modula ali teme, ki jo potrebujete. Lahko celo odstranite reference paketa NuGet/NPM za določen modul in dodate njegovo izvorno kodo neposredno svoji rešitvi, da jo popolnoma spremenite.",
    "IsSourceCodeIncludedExplanation4": "<p>Vključitev izvorne kode modula v vašo rešitev vam daje največjo svobodo pri prilagajanju tega modula. Vendar takrat modula ne bo mogoče samodejno nadgraditi, ko bo izdana nova različica.</p><p>Nobena od licenc ne vključuje izvorne kode zbirke ABP Suite, ki je zunanje orodje, ki za vas ustvari kodo in vam pomaga. za vaš razvoj.</p><p>Glejte <a href=\"{0}\">stran s cenami</a> za druge razlike med vrstami licenc.</p>",
    "ChangingDevelopers": "Ali lahko v prihodnosti spremenim registrirane razvijalce svoje organizacije?",
    "ChangingDevelopersExplanation": "Poleg dodajanja novih razvijalcev vaši licenci lahko spremenite tudi obstoječe razvijalce (lahko odstranite razvijalca in dodate novega na isto mesto) brez dodatnih stroškov.",
    "WhatHappensWhenLicenseEnds": "Kaj se zgodi, ko se moje licenčno obdobje konča?",
    "WhatHappensWhenLicenseEndsExplanation1": "Komercialna licenca ABP je <a href=\"{0}\" target=\"_blank\">trajna</a> . Po poteku licence lahko nadaljujete z razvojem svojega projekta. In licence vam ni treba podaljšati. Vaša licenca je že pripravljena z enoletno posodobitvijo in podpornim načrtom. Če želite še naprej prejemati nove funkcije, izboljšave zmogljivosti, popravke napak, podporo in še naprej uporabljati ABP Suite, morate obnoviti licenco. Ko vam licenca poteče;",
    "WhatHappensWhenLicenseEndsExplanation2": "Z uporabo ABP Commercial ne morete ustvarjati novih rešitev, lahko pa nenehno razvijate obstoječe aplikacije.",
    "WhatHappensWhenLicenseEndsExplanation3": "Prejeli boste lahko posodobitve za module in teme znotraj svoje MANJŠE različice (razen različic RC ali Preview). Na primer, če uporabljate v3.2.0 modula, lahko še vedno dobite posodobitve za v3.2.x (v3.2.1, v3.2.5 ... itd.) tega modula. Vendar ne morete prejeti posodobitev za naslednjo večjo ali manjšo različico (na primer v3.3.0, v3.3.3, 4.xx itd.). Na primer, ko je vaša licenca potekla, je bila zadnja izdaja v4.4.3, pozneje pa je bila objavljena različica 4.4.4 in različica 4.5.0, bi lahko dostopali do v4.4.X, vendar ne bi dostop do v4.5.X.",
    "WhatHappensWhenLicenseEndsExplanation4": "Po prenehanju veljavnosti licence ne morete namestiti novih modulov in tem, dodanih na platformo ABP Commercial.",
    "WhatHappensWhenLicenseEndsExplanation5": "Ne morete uporabljati zbirke ABP.",
    "WhatHappensWhenLicenseEndsExplanation6": "Ne morete več dobiti <a href=\"{0}\">premium podpore</a> .",
    "WhatHappensWhenLicenseEndsExplanation7": "Licenco lahko podaljšate (obnovite), če želite še naprej prejemati te ugodnosti. Če svojo licenco podaljšate v <strong>{3} dneh</strong> po izteku licence, bodo uveljavljeni naslednji popusti: Ekipna licenca {0}; Poslovna licenca {1}; Licenca podjetja {2}.",
    "discountForYears": "{0}% popusta za toliko let: {1}",
    "WhatHappensWhenLicenseEndsExplanation8": "Projekti ABP, ki ste jih ustvarili, niso shranjeni na naših strežnikih. Zato je vaša odgovornost, da obdržite izvorno kodo, ki jo prenesete. Ko vaša licenca poteče, ne morete več dobiti ustvarjene izvorne kode projekta ABP.",
    "WhenShouldIRenewMyLicense": "Kdaj naj podaljšam licenco?",
    "WhenShouldIRenewMyLicenseExplanation": "Če licenco podaljšate v <strong>{3} dni</strong> po poteku licence, bodo uporabljeni naslednji popusti: licenca za ekipo {0} % popusta, poslovna licenca {1} % popusta, licenca za podjetje {2} % popusta . Če podaljšate licenco <strong>{3} dni</strong> po datumu poteka veljavnosti licence, bo cena podaljšanja enaka nakupni ceni licence in pri podaljšanju ne bo popusta.",
    "TrialPlan": "Ali imate poskusni načrt?",
    "TrialPlanExplanation": "Da, za začetek brezplačnega preizkusa se obrnite na <a href=\"mailto:marketing@volosoft.com?subject=ABP Commercial — Trial License Request\">marketing@volosoft.com</a> . Ponujamo tudi 30-dnevno garancijo vračila denarja za licenco Team, brez vprašanj! V prvih 30 dneh po nakupu licence lahko zahtevate celotno vračilo. Zagotavljamo 60 % povračilo v 30 dneh za poslovne in poslovne licence. To je zato, ker licenci Business in Enterprise vsebujeta celotno izvorno kodo vseh modulov in tem.",
    "DoYouAcceptBankWireTransfer": "Ali sprejemate bančno nakazilo?",
    "DoYouAcceptBankWireTransferExplanation": "Da, sprejemamo bančno nakazilo.<br />Ko pošljete licenčnino prek bančnega nakazila, nam pošljite e-pošto na accounting@abp.io vaše potrdilo o prejemu in vrsto zahtevane licence. Naši podatki o mednarodnem bančnem računu:",
    "HowToUpgrade": "Kako nadgraditi obstoječe aplikacije, ko je na voljo nova različica?",
    "HowToUpgradeExplanation1": "Ko ustvarite novo aplikacijo z uporabo ABP Commercial, se vsi moduli in tema uporabljajo kot paketa NuGet in NPM. Tako lahko preprosto nadgradite pakete, ko je na voljo nova različica.",
    "HowToUpgradeExplanation2": "Poleg standardnih nadgradenj NuGet/NPM ponuja <a href=\"{0}\">ABP CLI</a> ukaz za posodobitev, ki samodejno poišče in nadgradi vse pakete, povezane z ABP, v vaši rešitvi.",
    "DatabaseSupport": "Kateri sistemi baz podatkov so podprti?",
    "DatabaseSupportExplanation": "Sam ABP Framework je agnostičen za bazo podatkov in lahko po svoji naravi deluje s katerim koli ponudnikom baz podatkov. Za seznam trenutno implementiranih ponudnikov glejte <a href=\"{0}\" target=\"_blank\">dokument za dostop do podatkov</a>.",
    "UISupport": "Kateri okvirji uporabniškega vmesnika so podprti?",
    "Supported": "Podprto",
    "UISupportExplanation": "Sam ABP Framework je agnostičen za okvir uporabniškega vmesnika in lahko deluje s katerim koli ogrodjem uporabniškega vmesnika. Vendar zagonske predloge, uporabniški vmesniki modulov in teme niso bili implementirani za vse okvire uporabniškega vmesnika. Za posodobljen seznam možnosti uporabniškega vmesnika si oglejte <a href=\"{0}\">dokument za začetek</a>.",
    "MicroserviceSupport": "Ali podpira arhitekturo mikro storitev?",
    "MicroserviceSupportExplanation1": "Eden od glavnih ciljev okvira ABP je zagotoviti priročno infrastrukturo za ustvarjanje rešitev za mikro storitve. Oglejte si dokument <a href=\"{0}\">arhitekture mikro storitev</a>, če želite razumeti, kako pomaga pri ustvarjanju sistemov mikrostoritev.",
    "MicroserviceSupportExplanation2": "Vsi moduli ABP Commercial so zasnovani tako, da podpirajo scenarije uvajanja mikro storitev (z lastnim API-jem in bazo podatkov) z upoštevanjem dokumenta <a href=\"{0}\">najboljše prakse za razvoj modulov</a>.",
    "MicroserviceSupportExplanation3": "Ponujamo vzorčno <a href=\"{0}\">demo rešitev mikro storitev</a>, ki prikazuje izvedbo arhitekture mikro storitev, ki vam pomaga ustvariti lastno rešitev.",
    "MicroserviceSupportExplanation4": "Kratek odgovor je torej \"<strong>da, podpira arhitekturo mikro storitev</strong>\".",
    "MicroserviceSupportExplanation5": "Vendar pa je sistem mikro storitev rešitev in vsaka rešitev bo imela različne zahteve, topologijo omrežja, komunikacijske scenarije, možnosti preverjanja pristnosti, odločitve o ločevanju/souporabi baz podatkov, konfiguracije izvajanja, sistemske integracije tretjih oseb in še veliko več.",
    "MicroserviceSupportExplanation6": "ABP Framework in ABP Commercial zagotavljata infrastrukturo za scenarije mikro storitev, module, združljive z mikro storitvami, vzorce in dokumentacijo, ki vam pomaga zgraditi lastno rešitev. Vendar ne pričakujte, da boste neposredno prenesli svojo sanjsko rešitev, ki je bila vnaprej izdelana za vas. Morali ga boste razumeti in združiti nekatere dele glede na vaše zahteve.",
    "WhereCanIDownloadSourceCode": "Kje lahko prenesem izvorno kodo?",
    "WhereCanIDownloadSourceCodeExplanation": "Izvorno kodo vseh modulov ABP, paketov Angular in tem lahko prenesete prek ABP Suite ali ABP CLI. Glejte <a href=\"{0}\">Kako prenesti izvorno kodo?</a>",
    "ComputerLimitation": "Koliko računalnikov se lahko razvijalec prijavi pri razvoju ABP?",
    "ComputerLimitationExplanation": "Izrecno dovoljujemo <strong>{0} računalnikov</strong> na posameznega/licenciranega razvijalca. Kadar koli potrebuje razvijalec, da razvije izdelke ABP Commercial na tretjem računalniku, je treba na naslov licence@abp.io poslati e-pošto z razlago situacije in nato bomo v našem sistemu izvedli ustrezno dodelitev.",
    "RefundPolicy": "Ali imate politiko vračila?",
    "RefundPolicyExplanation": "Vračilo kupnine lahko zahtevate v <strong>30 dneh</strong> po nakupu licence. Vrste licenc Business in Enterprise imajo možnost prenosa izvorne kode, zato vračila niso na voljo za podjetja in podjetja (in vse licence, ki vključujejo pravico do prejema izvorne kode). Poleg tega se za podaljšanje in nakup druge licence ne vračajo.",
    "HowCanIRefundVat": "Kako lahko vrnem DDV?",
    "HowCanIRefundVatExplanation1": "Če ste plačilo izvedli z uporabo 2Checkout, lahko DDV povrnete preko svojega računa 2Checkout:",
    "HowCanIRefundVatExplanation2": "Prijavite se v svoj račun <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\">2Checkout</a>",
    "HowCanIRefundVatExplanation3": "Poiščite ustrezno naročilo in pritisnite \"Vračilo zamudnega DDV-ja\" (vnesite vaš ID za DDV)",
    "HowCanIGetMyInvoice": "Kako lahko dobim svoj račun?",
    "HowCanIGetMyInvoiceExplanation": "Obstajata 2 plačilna prehoda za nakup licence: Iyzico in 2Checkout. Če licenco kupite prek prehoda 2Checkout, ta pošlje račun PDF na vaš e-poštni naslov, glejte <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How- do-invoices-work\">2Izstavljanje računov na blagajni.</a> Če kupujete prek prehoda Iyzico, s povezavo za nakup po meri ali z bančnim nakazilom, bomo pripravili in poslali vaš račun. Račun lahko zahtevate ali prenesete na <a href=\"{0}\">strani za upravljanje organizacije</a>. Preden nas kontaktirate za račun, preverite stran za upravljanje vaše organizacije!",
    "Forum": "Forum",
    "SupportExplanation": "Licence ABP Commercial zagotavljajo vrhunsko forumsko podporo skupine, ki jo sestavljajo strokovnjaki za ABP Framework.",
    "PrivateTicket": "Zasebna vstopnica",
    "PrivateTicketExplanation": "Enterprise License vključuje tudi zasebno podporo z e-pošto in sistemom vstopnic.",
    "AbpSuiteExplanation1": "ABP Suite vam omogoča izdelavo spletnih strani v nekaj minutah. To je globalno orodje .NET Core, ki ga je mogoče namestiti iz ukazne vrstice.",
    "AbpSuiteExplanation2": "Lahko ustvari novo rešitev ABP, generira strani CRUD iz baze podatkov na front-end. Za tehnični pregled glejte <a href=\"{0}\">dokument</a>",
    "FastEasy": "Hitro & enostavno",
    "AbpSuiteExplanation3": "ABP Suite vam omogoča preprosto ustvarjanje strani CRUD. Samo definirati morate svojo entiteto in njene lastnosti, ostalo prepustite ABP Suite namesto vas! ABP Suite ustvari vso potrebno kodo za vašo stran CRUD v nekaj sekundah. Podpira uporabniške vmesnike Angular, MVC in Blazor.",
    "RichOptions": "Bogate možnosti",
    "AbpSuiteExplanation4": "ABP Suite supports multiple UI options like <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\">Razor Pages</a> and <a href=\"https://angular.io\">Angular</a>.It also supports multiple databases like <a href=\"https://www.mongodb.com\">MongoDB</a> and all databases supported by <strong>EntityFramework Core</strong> (MS SQL Server, Oracle, MySql, PostgreSQL and <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\">more</a>).",
    "AbpSuiteExplanation5": "Dobra stvar je, da vam za te možnosti ni treba skrbeti. ABP Suite razume vaš tip projekta in ustvari kodo za vaš projekt ter ustvarjeno kodo postavi na pravo mesto v vašem projektu.",
    "SourceCode": "Izvorna koda",
    "AbpSuiteExplanation6": "ABP Suite ustvari izvorno kodo za vas! Ne ustvarja čarobnih datotek za ustvarjanje spletne strani. ABP Suite ustvari izvorno kodo za <strong>Entity, Repository, Application Service, Code First Migration, JavaScript/TypeScript in CSHTML/HTML</strong> ter potrebne vmesnike. ABP Suite tudi generira kodo v skladu z <strong>najboljšimi praksami</strong> razvoja programske opreme, tako da vam ni treba skrbeti za kakovost ustvarjene kode.",
    "AbpSuiteExplanation7": "Ker imate izvorno kodo gradnikov ustvarjene strani CRUD v pravilnih slojih aplikacije, lahko preprosto spremenite izvorno kodo in v ustvarjeno kodo vnesete svojo logiko po meri/poslovno.",
    "CrossPlatform": "Navzkrižna platforma",
    "AbpSuiteExplanation8": "ABP Suite je zgrajen z .NET Core in je med platformo. Deluje kot spletna aplikacija na vašem lokalnem računalniku. Zaženete ga lahko v <strong>Windows</strong>, <strong>Mac</strong> in <strong>Linux</strong>",
    "OtherFeatures": "Druge funkcije",
    "OtherFeatures1": "Preprosto posodobi pakete <strong>NuGet</strong> in <strong>NPM</strong> na vaši rešitvi.",
    "OtherFeatures2": "Regenerira že ustvarjene strani iz nič.",
    "OtherFeatures3": "Ustvarja nove rešitve",
    "ThanksForCreatingProject": "Hvala, ker ste ustvarili svoj projekt!",
    "HotToRunSolution": "Kako zagnati svojo rešitev?",
    "HotToRunSolutionExplanation": "Če želite izvedeti, kako konfigurirati in zagnati svojo rešitev, glejte dokument o začetnih korakih.",
    "GettingStarted": "Kako začeti",
    "WebAppDevTutorial": "Vadnica za razvijalce spletnih aplikacij",
    "WebAppDevTutorialExplanation": "Glejte vadnico za razvoj spletnih aplikacij za vzorec razvoja po korakih.",
    "Document": "dokument",
    "UsingABPSuiteToCURD": "Uporaba zbirke ABP za generiranje strani in orodja CRUD",
    "SeeABPSuiteDocument": "Glejte dokument ABP Suite, če želite izvedeti, kako uporabljati ABP Suite.",
    "AskQuestionsOnSupport": "Vprašanja lahko postavite na ABP Commercial Support.",
    "Documentation": "Dokumentacija",
    "SeeModulesDocument": "Glejte dokument modulov za seznam vseh komercialnih(pro) modulov in njihovih dokumentov.",
    "Pricing": "Cenitev",
    "PricingExplanation": "Izberite funkcije in funkcionalnosti, ki jih vaše podjetje potrebuje danes. Enostavno nadgradite, ko vaše podjetje raste.",
    "Team": "Ekipa",
    "Business": "Posel",
    "Enterprise": "Enterprise",
    "Custom": "Po meri",
    "IncludedDeveloperLicenses": "Vključene licence za razvijalce",
    "CustomLicenceOrAdditionalServices": "Potrebujete licenco po meri ali dodatne storitve?",
    "CustomOrVolumeLicense": "Licenca po meri ali količinska licenca",
    "LiveTrainingSupport": "Usposabljanje in podpora v živo",
    "AndMore": "in več",
    "AdditionalDeveloperLicense": "Dodatna licenca za razvijalce",
    "ProjectCount": "Število projektov",
    "AllProModules": "Vsi profesionalni moduli",
    "AllProThemes": "Vse profesionalne teme",
    "AllProStartupTemplates": "Vse profesionalne predloge za zagon",
    "SourceCodeOfAllModules": "Izvorna koda vseh modulov",
    "SourceCodeOfAllThemes": "Izvorna koda vseh tem",
    "PerpetualLicense": "Trajna licenca",
    "UnlimitedServerDeployment": "Neomejena namestitev strežnika",
    "YearUpgrade": "1-letna nadgradnja",
    "YearPremiumForumSupport": "1 leto premium forumske podpore",
    "ForumSupportIncidentCountYear": "Število incidentov za podporo forumu/leto",
    "PrivateTicketEmailSupport": "Podpora za zasebne vstopnice in e-pošto",
    "BuyNow": "Kupi zdaj",
    "PayViaAmexCard": "Kako lahko plačam s kartico AMEX?",
    "PayViaAmexCardDescription": "Privzeti plačilni prehod 'Iyzico' lahko zaradi varnostnih ukrepov zavrne nekatere kreditne kartice AMEX. V tem primeru lahko plačate prek alternativnega plačilnega prehoda '2Checkout'.",
    "ThankYou": "Hvala vam",
    "InvalidReCaptchaErrorMessage": "Pri preverjanju reCAPTCHA je prišlo do napake. Prosim poskusite ponovno.",
    "CompanyName": "Ime podjetja",
    "YourCompanyName": "Ime vašega podjetja",
    "FirstName": "Ime",
    "LastName": "Priimek",
    "Optional": "Neobvezno",
    "YourFirstName": "Vaše ime",
    "YourLastName": "Tvoj priimek",
    "SpecialOffer": "Posebna ponudba",
    "SpecialOfferMessage": "Pohiti! Cene veljajo omejen čas.",
    "DiscountRequest": "Zahteva za popust",
    "DiscountRequestDescribeCustomerQuestion": "Kaj od naslednjega vas opisuje?",
    "DiscountRequestStudentEmailMessage": "E-poštni naslov mora vsebovati »edu«.",
    "DiscountRequestDeveloperCount": "Koliko razvijalcev ste?",
    "DiscountRequestDeveloperCountExceedMessage": "Ne ponujamo znižane licence za podjetja, ki imajo več kot {0} razvijalcev.",
    "DiscountRequestOrganizationName": "Ime podjetja/organizacije/šole",
    "Website": "Spletna stran",
    "GithubUsername": "Uporabniško ime GitHub",
    "PhoneNumber": "Telefonska številka",
    "Country": "Država",
    "DescribeABPCommercialUsage": "Opišite projekt, ki ga nameravate razviti na podlagi APB Commercial",
    "DiscountRequestCertifyInformationMessage": "Potrjujem, da so vsi podatki resnični in točni.",
    "DiscountRequestReceived": "Prejeli smo vašo zahtevo za popust.",
    "DiscountRequestStatusMessage": "Odgovorili vam bomo po preverjanju podatkov, ki ste jih posredovali.",
    "MVCOrRazorPages": "MVC (razor Pages)",
    "Angular": "Kotna",
    "Blazor": "Blazor",
    "New": "Novo",
    "MongoDB": "MongoDB",
    "EBookDDD": "Oblikovanje na podlagi domene e-knjig",
    "PracticalGuideForImplementingDDD": "Ta knjiga je praktičen vodnik za implementacijo domensko vodenega oblikovanja z ogrodjem ABP.",
    "IntroducingDDD": "Predstavljamo domensko vodeno oblikovanje",
    "DDDLayersAndCleanArchitecture": "DDD plasti in čista arhitektura",
    "LayeringOfADotnetSolution": "Plasti rešitve .NET",
    "ImplementingDDDBuildingBlocks": "Izvajanje gradnikov DDD",
    "DomainVsApplicationLogic": "Logika domene proti logiki aplikacij",
    "SamplesAndDiscussions": "Vzorci in razprave",
    "Free": "prost",
    "Download": "Prenesi",
    "DDDEBook": "E-knjiga DDD",
    "ImplementingDDD": "Izvajanje domensko vodenega dizajna",
    "DDDBookExplanation": "Praktični vodnik za implementacijo domensko vodenega oblikovanja z ogrodjem ABP.",
    "Overview": "Pregled",
    "DDDBookPracticalGuide": "To je praktičen vodnik za implementacijo Domain Driven Design (DDD). Medtem ko se podrobnosti o implementaciji zanašajo na infrastrukturo ABP Framework, so temeljni koncepti, načela in vzorci uporabni v kakršni koli rešitvi, tudi če ni rešitev .NET.",
    "TableOfContents": "Kazalo",
    "IntroductionToImplementingDDD": "Uvod v izvajanje domensko vodenega oblikovanja",
    "WhatIsDDD": "Kaj je domensko vodeno oblikovanje?",
    "Implementation": "Izvajanje",
    "TheBigPicture": "Velika slika",
    "TheBuildingBlock": "Gradnik",
    "ExampleUseCase": "Primer uporabe",
    "DomainAndApplicationLogic": "Logika domene in logika aplikacij",
    "Author": "Avtor",
    "PublishedOn": "Objavljeno na",
    "Page": "stran",
    "FreeEBook": "Brezplačna e-knjiga",
    "EBookSignInForDownload": "Če želite prenesti e-knjigo, se prijavite",
    "SignIn": "Prijaviti se",
    "Or": "ali",
    "TellUsAboutYourself": "Povejte nam malo o sebi",
    "Surname": "Priimek",
    "DoYouAgreePrivacyPolicy": "Strinjam se s <a href=\"/TermsConditions\">pogoji in določili<a/> in <a href=\"/Privacy\">pravilnikom o zasebnosti</a>.",
    "VolosoftMarketingInformationMessage": "Želim informacije, nasvete in ponudbe o rešitvah za podjetja in organizacije ter drugih Volosoftovih izdelkih in storitvah.",
    "VolosoftSharingInformationMessage": "Želim, da Volosoft deli moje podatke z izbranimi partnerji, da bom lahko prejemal ustrezne informacije o njihovih izdelkih in storitvah.",
    "WeWillSendYouADownloadLink": "Povezava za prenos e-knjige je bila poslana na {0}.<br/> Preverite svojo mapo »Prejeto«/neželeno/neželeno pošto!",
    "InvalidFormInputs": "Prosimo, vnesite veljavne podatke, navedene v obrazcu.",
    "DDDBookEmailBody": "Hvala vam. <br /> Če želite prenesti svojo knjigo, <a href=\"{0}\">kliknite tukaj</a>.",
    "StartFree": "Začnite brezplačno",
    "FreeTrial": "Brezplačen preizkus",
    "AcceptsMarketingCommunications": " Da, rad bi prejemal marketinška sporočila ABP Commercial.",
    "PurposeOfUsage": "Namen uporabe",
    "Choose": "-Izberi -",
    "CompanyOrganizationName": "Ime podjetja/organizacije",
    "CompanySize": "Velikost podjetja",
    "Next": "Naslednji",
    "StartTrial": "Začnite moj brezplačni preizkus",
    "ContactUsQuestions": "Kontaktirajte nas, če imate kakršna koli vprašanja",
    "TrialActivatedWarning": "Uporabnik ima pravico do samo 1 brezplačnega preizkusnega obdobja. Preizkusno obdobje ste že izkoristili.",
    "ActivationRequirement": "Še zadnji korak vas loči od začetka preizkusa.<br> Po preverjanju vaših podatkov bomo aktivirali vašo licenco. Ko bo vaša licenca aktivirana, bomo poslali e-pošto na <b>{0}</b> . Ne skrbite, ta postopek ne bo trajal dolgo!",
    "SaveAndDownload": "Shrani in prenesi",
    "CompanyNameValidationMessage": "Ime podjetja je predolgo!",
    "AddressValidationMessage": "Naslov je predolg!",
    "TaxNoValidationMessage": "Št. DDV/DDV je predolga!",
    "NotesValidationMessage": "Polje za opombe je predolgo!",
    "CheckYourBillingInfo": "Račun lahko ustvarite samo enkrat! Preden ustvarite račun, preverite svoje podatke za obračun.",
    "StartYourFreeTrial": "Začnite brezplačno preskusno obdobje",
    "TrialLicenseModelInvalidErrorMessage": "Eno od naslednjih polj je neveljavno: ime države, velikost podjetja, panoga ali namen uporabe.",
    "Trial": "Sojenje",
    "Purchased": "Kupljeno",
    "PurchaseNow": "Kupi zdaj",
    "PurchaseTrialLicenseMessage": "Datum poteka vaše licence je {0}. <br> Če želite še naprej uporabljati projekte, ki ste jih ustvarili med brezplačnim preizkusnim obdobjem, morate spremeniti licenčne ključe v datotekah <code>appsettings.secrets.json</code>. Tukaj je vaš licenčni ključ:",
    "TrialLicenseExpireMessage": "Uporabljate preizkusno licenco in vaša preizkusna licenca bo potekla {0}.",
    "TryForFree": "Poskusite brezplačno",
    "TrialLicenseExpiredInfo": "Vaša preizkusna licenca je potekla!",
    "DowngradeLicensePlan": "Ali lahko v prihodnosti preklopim na nižji licenčni načrt?",
    "DowngradeLicensePlanExplanation": "Obstoječega licenčnega načrta ne morete znižati. Lahko pa kupite nov nižji licenčni načrt in nadaljujete z razvojem na novi licenci. Ko kupite nižjo licenco, se morate samo prijaviti v svoj novi licenčni načrt prek ukaza ABP CLI: ` abp login<username> -o<organization> `.",
    "LicenseTransfer": "Ali je mogoče licenco prenesti z enega razvijalca na drugega?",
    "LicenseTransferExplanation": "ja! Ko kupite licenco, postanete imetnik licence, zato boste imeli dostop do strani za upravljanje organizacije. Organizacija ima vlogi lastnika in razvijalca. Lastniki lahko upravljajo s sedeži razvijalcev in dodeljujejo razvijalce. Vsak dodeljeni razvijalec se bo prek ukaza ABP CLI prijavil v sistem in bo imel dovoljenja za razvoj in podporo.",
    "UserOwnerDescription": "&#39;Lastnik&#39; organizacije je skrbnik tega računa. Organizira z nakupom licenc in dodeljevanjem razvijalcev. &#39;Lastnik&#39; ne more pisati kode v komercialnih projektih ABP, ne more prenesti vzorčnih projektov ABP in ne more postavljati vprašanj na spletnem mestu za podporo. Če želite narediti vse to, se morate dodati tudi kot razvijalec.",
    "UserDeveloperDescription": "&#39;Razvijalci&#39; lahko pišejo kodo v komercialnih projektih ABP, prenesejo vzorčne projekte ABP in postavljajo vprašanja na spletnem mestu za podporo. Po drugi strani pa &#39;Razvijalci&#39; ne morejo upravljati te organizacije.",
    "RemoveCurrentUserFromOrganizationWarningMessage": "Odstranjujete se iz lastne organizacije. Ne boste mogli več upravljati te organizacije, potrjujete?",
    "RenewExistingOrganizationOrCreateNewOneMessage": "Licenco svoje organizacije lahko obnovite s klikom na spodnji gumb(e) &quot;Podaljšaj zdaj&quot; in tako lahko podaljšate datum poteka licence za 1 leto. Če nadaljujete z blagajno, boste imeli novo organizacijo. Ali želite nadaljevati z novo organizacijo?",
    "PurchaseTrialOrganizationOrCreateNewOneMessage": "Imate poskusno licenco. Če želite kupiti preizkusno licenco, kliknite gumb Nakup zdaj. Če nadaljujete z blagajno, boste imeli novo organizacijo. Ali želite nadaljevati z novo organizacijo?",
    "ExtendNow": "Podaljšaj zdaj",
    "CreateNewOrganization": "Ustvarite novo organizacijo",
    "RenewLicenseEarly": "Če licenco podaljšam predčasno, ali bom dobil celotno leto?",
    "RenewLicenseEarylExplanation": "Ko licenco obnovite pred datumom poteka licence, se datumu poteka licence doda 1 leto. Na primer, če vam licenca poteče {0}-06-06 in jo obnovite {0}-01-01, bo vaš novi datum poteka licence {1}-06-06.",
    "OpenSourceWebApplication": "Odprtokodna spletna aplikacija",
    "CompleteWebDevelopment": "Popoln spletni razvoj",
    "ABPFrameworkDescription": "ABP Framework je popolna infrastruktura za ustvarjanje sodobnih spletnih aplikacij z upoštevanjem najboljših praks razvoja programske opreme in konvencij.",
    "CommunityDescription": "Delite svoje izkušnje z ogrodjem ABP!",
    "GetStarted": "Začeti",
    "Views": "pogledi",
    "LatestPosts": "Najnovejše objave",
    "PreBuiltApplication": "Vnaprej zgrajena aplikacija",
    "DatabaseProviders": "Ponudniki baz podatkov",
    "UIFrameworks": "Ogrodja uporabniškega vmesnika",
    "UsefulLinks": "Uporabne povezave",
    "Platform": "Platforma",
    "CoolestCompaniesUseABPCommercial": "Najbolj kul podjetja že uporabljajo <span class=\"fw-bold\">ABP Commercial.</span>",
    "UserInterface": "Uporabniški vmesnik",
    "APIGateway": "API Gateway",
    "Microservice": "Mikrostoritev",
    "Database": "Baza podatkov",
    "Architecture": "Arhitektura",
    "MicroserviceArchitectureExplanation": "To je celovita arhitektura rešitve, ki je sestavljena iz več aplikacij, prehodov API, mikrostoritev in baz podatkov za izgradnjo razširljive mikrostoritvene rešitve z najnovejšimi tehnologijami.",
    "BusinessLogic": "Poslovna logika",
    "DataAccessLayer": "Plast dostopa do podatkov",
    "Monolith": "Monolit",
    "ModularArchitectureExplanation": "Ta zagonska predloga zagotavlja večplastno, modularno arhitekturo rešitve, ki temelji na DDD, za izgradnjo čiste kodne baze, ki jo je mogoče vzdrževati.",
    "SeeDetails": "Glej Podrobnosti",
    "SeeDocumentation": "Preverite dokumentacijo",
    "Bs5Compatible": "Profesionalna tema, združljiva z Bootstrap 5, popolna za vaše skrbniško spletno mesto.",
    "LeptonXTheme": "Tema LeptonX",
    "LeptonXDark": "LeptonX Dark",
    "LeptonXLight": "LeptonX Light",
    "LeptonXSemiDark": "LeptonX Semi-Dark",
    "BuiltOnBs5Library": "Zgrajeno na knjižnici Bootstrap 5",
    "FullyCompatibleWithBs5": "100 % združljiv s strukturo HTML Bootstrap 5 in razredi CSS",
    "ResponsiveAndMobileCompatible": "Odziven, združljiv z mobilnimi napravami, podpora RTL",
    "ProvidesStylesForDatatables": "Zagotavlja sloge za podatkovne tabele",
    "MultipleLayoutOptions": "Več možnosti postavitve",
    "EasilyInstallAndUpgrade": "Preprosta namestitev in nadgradnja",
    "SupportForum": "Forum za podporo",
    "TrustedBy": "Zaupa",
    "OurPricing": "Naše <span class=\"gradient-commercial\">cene</span>",
    "Plans": "Načrti",
    "NameSurname": "Ime priimek",
    "Unspecified": "Neopredeljeno",
    "LicenceType": "Vrsta licence",
    "LicenseDiscountWarning": "TA STRAN ZA POPUST UPORABLJA PRIVZETO KODO ZA POPUST IN ZA RAZVIJALCE VOLOSOFTA. SPODNJE POVEZAVE ZA NAKUP NE DELUJEJO.",
    "DiscountedLicenseExplanation": "Te cene licenc so za mala zagonska podjetja, posamezne razvijalce, študente, neprofitne organizacije in projekte!",
    "General": "Splošno",
    "License": "Licenca",
    "Development": "Razvoj",
    "Payment": "Plačilo",
    "WatchExplainerVideo": "Spoznajva se! Oglejte si video s pojasnilom",
    "LightDarkAndSemiDarkThemes": "Svetlo, temno in poltemno",
    "LeptonXThemeExplanation": "Tema Lepton lahko spremeni vašo temo glede na vaše sistemske nastavitve.",
    "PRO": "PRO",
    "WelcomeToABPCommercial": "Dobrodošli v <span class=\"gradient-commercial\">ABP Commercial!</span>",
    "YourAccountDetails": "Podrobnosti vašega računa",
    "OrganizationName": "ime organizacije",
    "AddDevelopers": "Dodajte razvijalce",
    "StartDevelopment": "Začetek razvoja",
    "CreateAndRunApplicationUsingStartupTemplate": "Naučite se ustvariti in zagnati novo spletno aplikacijo z uporabo zagonske predloge ABP Commercial.",
    "CommunityDescription2": "<span class=\"fw-6\">community.abp.io</span> je mesto, kjer lahko ljudje delijo članke, povezane z ABP. Iščite članke, vadnice, vzorce kode, študije primerov in spoznajte ljudi na istem pasu kot vi.",
    "UseABPSuiteExplanation": "Uporabite ABP Suite za prenos izvorne kode modulov in tem.",
    "ManageModulesWithSuite": "Svoje module ABP lahko upravljate tudi s programsko opremo Suite.",
    "LearnHowToInstallSuite": "Naučite se namestiti in uporabljati ABP Suite.",
    "SeeMore": "Poglej več",
    "SeeLess": "Glej manj",
    "LayeredSolutionStructure": "Večplastna struktura rešitve",
    "LayeredSolutionStructureExplanation": "Rešitev je večplastna in temelji na načelih in vzorcih načrtovanja, ki jih vodi domena, da izolira vašo poslovno logiko od infrastrukture in integracij ter poveča možnost vzdrževanja in ponovne uporabe kode. Ogrodje ABP že ponuja abstrakcije, osnovne razrede in vodnike za resnično implementacijo DDD za vašo aplikacijo.",
    "MultipleUIOptions": "Več možnosti uporabniškega vmesnika",
    "MultipleUIOptionsExplanation": "Všeč so nam različni načini ustvarjanja uporabniškega vmesnika. Ta zagonska rešitev ponuja tri različne možnosti ogrodja uporabniškega vmesnika za vašo poslovno aplikacijo.",
    "MultipleDatabaseOptions": "Več možnosti baze podatkov",
    "MultipleDatabaseOptionsExplanation": "Imate dve možnosti ponudnika baze podatkov (poleg uporabe obeh v eni aplikaciji). Uporabite Entity Framework Core za delo s katero koli relacijsko bazo podatkov in po želji uporabite Dapper, ko morate pisati nizkonivojske poizvedbe za boljšo zmogljivost. MongoDB je še ena možnost, če morate uporabiti bazo podatkov NoSQL, ki temelji na dokumentih. Medtem ko so ti ponudniki dobro integrirani, abstrahirani in vnaprej konfigurirani, lahko dejansko komunicirate s katerim koli sistemom baze podatkov, ki ga lahko uporabljate z .NET.",
    "ModularArchitectureExplanation2": "Modularnost je prvorazredni državljan v platformi ABP.IO. Vse funkcionalnosti aplikacije so razdeljene v dobro izolirane izbirne module. Zagonska rešitev je že opremljena s prednameščenimi osnovnimi <a href=\"/modules\" class=\"text-primary\">moduli ABP Commercial</a> . Ustvarite lahko tudi lastne module za izdelavo modularnega sistema za svojo aplikacijo.",
    "MultiTenancyForSaasBusiness": "Multi-Tenancy za vaše podjetje SaaS",
    "MultiTenancyForSaasBusinessExplanation": "ABP Commercial ponuja popoln sistem z več najemniki od konca do konca za ustvarjanje vaših sistemov SaaS (programska oprema kot storitev). Najemnikom omogoča skupno rabo ali lastne baze podatkov s sprotnim sistemom za ustvarjanje in selitev baz podatkov.",
    "MicroserviceStartupSolution": "Zagonska rešitev Microservice",
    "MicroserviceArchitectureExplanation2": "Dobite ga lahko za svoj naslednji mikrostoritveni sistem, da izkoristite vnaprej izdelano osnovno rešitev in destilirano izkušnjo.",
    "PreIntegratedTools": "Vnaprej integrirano v priljubljena orodja",
    "PreIntegratedToolsExplanation": "Rešitev je že integrirana v standardna orodja in tehnologije, medtem ko jih lahko kadar koli spremenite in integrirate v svoja priljubljena orodja.",
    "SingleSignOnAuthenticationServer": "Strežnik za preverjanje pristnosti z enotno prijavo",
    "SingleSignOnAuthenticationServerExplanation": "Rešitev ima strežniško aplikacijo za preverjanje pristnosti, ki jo uporabljajo druge aplikacije kot strežnik za enojno prijavo s funkcijami upravljanja dostopa API. Temelji na IdentityServerju.",
    "WebAppsWithGateways": "2 spletni aplikaciji z 2 prehodoma API",
    "WebAppsWithGatewaysExplanation": "Rešitev vsebuje dve spletni aplikaciji, vsaka ima namenski API prehod (BFF - Backend For Frontend pattern).",
    "BackOfficeApplication": "Aplikacija Back Office",
    "BackOfficeApplicationExplanation": "Dejanska spletna aplikacija vašega sistema z več možnostmi ogrodja uporabniškega vmesnika. Ustvarite lahko katero koli poslovno aplikacijo.",
    "LandingWebsite": "Pristajalno spletno mesto",
    "LandingWebsiteExplanation": "Splošno ciljno/javno spletno mesto, ki se lahko uporablja za več namenov, kot je predstavitev vašega podjetja, prodaja vaših izdelkov itd.",
    "ABPFrameworkEBook": "E-knjiga Mastering ABP Framework",
    "MasteringAbpFrameworkEBookDescription": "Vključeno v vašo komercialno licenco ABP",
    "FullName": "Polno ime",
    "LicenseTypeNotCorrect": "Vrsta licence ni pravilna!",
    "Trainings": "Treningi",
    "ChooseTrainingPlaceholder": "Izberite trening...",
    "DoYouNeedTrainings": "Ali potrebujete enega od teh izobraževanj?",
    "DoYouNeedTraining": "Ali potrebujete usposabljanje za {0}?",
    "GetInTouchUs": "Stopite v stik z nami",
    "ForMoreInformationClickHere": "Za več informacij kliknite <a href='{0}'>tukaj.</a>",
    "ForMoreInformationClickHereByClass": "<span class=\"{1}\">Za več informacij kliknite</span> <a href='{0}'>tukaj.</a>",
    "IsGetOnboardingTraining": "Bi se radi udeležili usposabljanja za vkrcanje in razvoj spletnih aplikacij?",
    "OnboardingWebApplicationDevelopmentTrainingMessage": "Če želite načrtovati svoj koledar usposabljanja, se po ustvarjanju organizacije obrnite na {0}",
    "CustomPurchaseMessage": "Za naslednji korak kliknite {0}, da nas kontaktirate.",
    "Note": "Opomba",
    "AdditionalNote": "Dodatna opomba",
    "OnboardingTrainingFaqTitle": "Ali imate ABP uvodno usposabljanje?",
    "OnboardingTrainingFaqExplanation": "Da, imamo storitve usposabljanja ABP, ki vam pomagajo hitro začeti projekt ABP. O ABP se boste naučili od člana ožje ekipe ABP in pridobili boste veščine za začetek svojega projekta ABP. V uvodnem usposabljanju vam bomo razložili, kako nastaviti svoje razvojno okolje, namestiti potrebna orodja in ustvariti popolnoma delujočo stran CRUD. Usposabljanje bo potekalo v živo, uporabljala se bo aplikacija Zoom, odprti pa smo tudi za uporabo drugih spletnih platform za srečanja. Jezik usposabljanja bo angleščina. Med sejami lahko postavite tudi svoja vprašanja o ABP. Ugoden čas in datum bosta načrtovana za obe strani. Za več informacij nas kontaktirajte na <a href=\"mailto:info@abp.io\">info@abp.io</a> .",
    "AddBasket": "Dodaj v košarico",
    "SendTrainingRequest": "Pošljite zahtevo za usposabljanje",
    "OnlyEnglishVersionOfThisDocumentIsTheRecentAndValid": "* Angleška različica tega dokumenta je najsodobnejša in v vseh sporih bo prevladala angleška različica.",
    "Pricing_Page_Title": "Cene in načrti",
    "Pricing_Page_Description": "Izberite funkcije in funkcije, ki jih vaše podjetje potrebuje že danes. Kupite licenco ABP Commercial in ustvarite neomejeno število projektov.",
    "Pricing_Page_HurryUp": "Pohiti!",
    "Pricing_Page_BuyLicense": "Kupite licenco po <strong>cenah 2021</strong> do 16. januarja!",
    "Pricing_Page_ValidForExistingCustomers": "Velja tudi za obstoječe stranke in obnove licenc.",
    "Pricing_Page_Hint1": "Cena licence vključuje določeno število razvijalskih mest. Če imate več razvijalcev, lahko vedno kupite dodatne sedeže.",
    "Pricing_Page_Hint2": "Zdaj ali v prihodnosti lahko kupite več licenc za razvijalce. Licence temeljijo na sedežu, tako da lahko sedež prenesete z enega razvijalca na drugega.",
    "Pricing_Page_Hint3": "S svojo licenco lahko razvijete neomejeno število različnih izdelkov.",
    "Pricing_Page_Hint4": "ABP Suite je orodje za pomoč pri razvoju in izboljšanju vaše produktivnosti. Podpira ustvarjanje strani CRUD in ustvarjanje novih projektov.",
    "Pricing_Page_Hint5": "V svojih aplikacijah lahko uporabite vse vnaprej zgrajene module.",
    "Pricing_Page_Hint6": "V svojih aplikacijah lahko uporabite vse vnaprej pripravljene teme.",
    "Pricing_Page_Hint7": "Predloga za zagon je rešitev Visual Studio, s katero lahko hitro začnete svoj projekt. Vsi osnovni moduli so dodani in vnaprej konfigurirani za vas.",
    "Pricing_Page_Hint8": "E-knjiga Mastering ABP Framework razlaga, kako implementirati rešitve .NET z najboljšimi praksami. Prodaja se na Amazon.com in z licenco lahko brezplačno prenesete knjigo.",
    "Pricing_Page_Hint9": "Prenesete lahko izvorno kodo katerega koli modula. Morda boste želeli svoji rešitvi dodati izvorno kodo, da naredite korenite spremembe, ali pa jo zaradi varnosti obdržite zase.",
    "Pricing_Page_Hint10": "Licence so doživljenjske. To pomeni, da lahko še vedno razvijate svojo aplikacijo. Dostop do najnovejše različice in pridobitev podpore sta omogočena v licenčnem obdobju (1 leto, razen če jo obnovite).",
    "Pricing_Page_Hint11": "Brez omejitev pri uvajanju! Razmestite ga lahko v poljubno število strežnikov, vključno s storitvami v oblaku ali na mestu uporabe.",
    "Pricing_Page_Hint12": "Module, teme in orodja lahko posodobite na najnovejšo različico v obdobju aktivne licence. Ko vaša licenca poteče, jo morate obnoviti, če želite še naprej prejemati posodobitve za popravke napak, nove funkcije in izboljšave.",
    "Pricing_Page_Hint13": "Premium podporo lahko dobite za eno leto (licenco lahko podaljšate, če jo želite podaljšati).",
    "Pricing_Page_Hint14": "Ekipne in poslovne licence imajo omejitev števila incidentov/vprašanj. Če kupite dodatne licence za razvijalce, se vaša omejitev incidentov poveča za {0} (za ekipno licenco) ali {1} (za poslovno licenco) na razvijalca.",
    "Pricing_Page_Hint15": "Samo Enterprise License vključuje zasebno podporo. Lahko pošljete e-pošto neposredno ekipi ABP ali postavite vprašanja na support.abp.io z možnostjo zasebne vstopnice. Zasebne vstopnice niso vidne javnosti.",
    "Pricing_Page_Hint16": "Prenesete lahko izvorno kodo vseh tem ABP. Morda boste želeli svoji rešitvi dodati izvorno kodo, da naredite korenite spremembe, ali pa jo zaradi varnosti obdržite zase.",
    "Pricing_Page_Testimonial_1": "ABP Commercial je podjetju SC Ventures dovolil, da v 9 mesecih dobavi platformo SaaS za več najemnikov silosne podatkovne baze bančnega razreda za podporo financiranja dobavne verige terjatev/obveznosti računov z veliko vrednostjo iz več integriranih sidrišč. Modularnost ABP je ekipi omogočila dostavo v rekordnem času, opravila vse VAPT in razmestila kontejnerski sklad mikrostoritev prek celotnega CI/CD in cevovodov v produkcijo.",
    "Pricing_Page_Testimonial_2": "Vidimo vrednost uporabe ABP Commercial za zmanjšanje režijskih stroškov razvojnih projektov po meri. Ekipa lahko poenoti vzorec kode v različnih projektnih tokovih. V okviru vidimo več potenciala za hitrejšo gradnjo novih funkcij kot prej. Verjamemo, da bomo nenehno ugotavljali vrednost izkoriščanja ABP Commercial.",
    "Pricing_Page_Testimonial_3": "Ljubimo ABP. Ni nam treba pisati vsega od začetka. Izhajamo iz že pripravljenih funkcij in se osredotočamo na tisto, kar resnično moramo napisati. Poleg tega je ABP dobro zasnovan in koda je visoke kakovosti z manj napakami. Če bi morali sami napisati vse, kar potrebujemo, bi morda morali porabiti leta. Še ena stvar, ki nam je všeč, je, da nova različica, popravek težave ali izboljšava izide zelo kmalu vsak drugi teden. Ne čakamo predolgo.",
    "Pricing_Page_Testimonial_4": "ABP Commercial je fantastičen izdelek, ki ga priporočam. Komercialni izdelki za trženje naših strank v eni konfiguracijski platformi. Skok se začne s tem, da okvir in orodja zagotavljajo, da je vsaka ekipa vredna vsakega centa. ABP Commercial je najbolj ustrezal našim potrebam.",
    "Pricing_Page_Testimonial_5": "Ogrodje ABP ni le ogrodje, ampak je tudi vodnik za razvoj/upravljanje projektov, saj zagotavlja usposabljanje za DDD, GenericRepository, DI, Microservice in modularnost. Tudi če ne boste uporabljali samega ogrodja, se lahko razvijate z docs.abp.io, ki je dobro in strokovno pripravljen (OpenIddict, Redis, Quartz itd.). Ker je veliko stvari vnaprej zgrajenih, znatno skrajša čas razvoja projekta (kot so prijavna stran, obravnavanje izjem, filtriranje podatkov, sejanje, revizijsko beleženje, lokalizacija, samodejni krmilnik API itd.). Kot primer iz naše aplikacije sem uporabil Local Event Bus za nadzor zalog. Tako lahko upravljam premike naročil s pisanjem programa za obdelavo zalog. Čudovito je ne izgubljati časa za CreationTime, CreatorId. Polnijo se samodejno.",
    "Pricing_Page_Testimonial_6": "Ogrodje ABP je dobro ogrodje, vendar potrebuje čas, da razume različne plasti, razrede in knjižnice, ki jih uporablja (zlasti ABP). Veliko časa sem porabil za branje kodne baze, vendar nam je ABP Commercial prihranil čas pri ustvarjanju projektnih posebnih entitet (AR) in repozitorija, povezanega z vsako od njih. Všeč mi je bil tudi pristop, uporabljen v ABP, ki je zelo zrel; vemo, da temelji na DDD in monolitu.",
    "Pricing_Page_Testimonial_7": "Kot startup moramo hitro izvajati iteracije in porabiti čim manj časa za standardne in stranske funkcije. \n Naši inženirji segajo od zelo izkušenih do mlajših inženirjev in potrebovali smo skupno razumevanje ter način za deljenje tehničnega in domenskega znanja. ABP nam je to omogočil zaradi svojih odličnih vodnikov in dokumentacije. \n Obstajajo stvari, za katere nam ni bilo treba skrbeti, saj z ABP delujejo takoj. \n ABP nam je pomagal racionalizirati hitro izdelavo prototipov in razvoj, manj kot 4 tedne od začetka funkcije do proizvodnje. Z vsemi svojimi vrhunskimi funkcijami, ki so vključene v licenco, nam je ABP na strani programskega inženiringa dal &quot;Zagon v škatli&quot;.",
    "Pricing_Page_Testimonial_8": "ABP komercialo priporočam vsem, ki želite razširiti ponudbo izdelkov, ki so na voljo svojim strankam. To je fantastično, ko je treba uporabiti porazdeljeno poslovno okolje (Angular, WPF, Win&amp;Linux). Poleg njihovih produktov nam je všeč njihova podpora, ki nam omogoča hitrejše in lažje delo. Vemo že, da smo našli odličnega partnerja za prihodnost, ki nas bo podpiral pri širitvi poslovanja.",
    "Pricing_Page_Testimonial_9": "Smo podjetje z 2 zaposlenima, ki posluje že več kot 20 let. \n V zvezi z našimi izkušnjami z ABP Commercial se je na nas obrnil naročnik, ki je zahteval razvoj nove kadrovske aplikacije v sodobnem okolju, ki bi nadomestila njihovo 25 let staro aplikacijo Access. Odločili smo se za prehod z namizne rešitve na spletno. \n \n Takrat smo imeli zelo malo znanja o spletnih aplikacijah in .NET-u, vendar smo naleteli na ABP Commercial in s pomočjo ABP Framework, tehnične dokumentacije in ABP Suite nam je uspelo ne le razviti aplikacije za naročnikovih specifikacijah, ampak tudi v enem letu uspešno delujejo v okolju .NET.",
    "AbpBookDownloadArea_ClaimYourEBook": "Zahtevajte svojo e-knjigo <span class='gradient-framework'>Mastering ABP Framework</span>",
    "AddMemberModal_Warning_1": "Če <strong>uporabniško ime</strong> , ki ga poskušate dodati, ne obstaja v sistemu, prosite svojega člana ekipe, da se registrira na <a href='{0}/Account/Register'>{0}</a> in z vami deli uporabniško ime svojega računa.",
    "MyOrganizations_Detail_WelcomeMessage": "Dobrodošli v vaši organizaciji, {0}",
    "MyOrganizations_Detail_OrganizationManagement": "<span class=\"gradient-commercial\">Upravljanje</span> organizacije",
    "OrganizationDisplayName": "Prikazno ime organizacije",
    "MyOrganizations_Detail_EditDisplayName": "Uredi prikazano ime",
    "MyOrganizations_Detail_UpgradeYourLicense": "Nadgradite svojo licenco",
    "MyOrganizations_Detail_LicenseStartAndExpiryDate": "Začetni datum licence – Datum poteka veljavnosti",
    "MyOrganizations_Detail_OwnerRightInfo": "Uporabljate {0} od svojih {1} lastniških pravic.",
    "MyOrganizations_Detail_CopyApiKey": "Kopirajte ključ",
    "MyOrganizations_Detail_ApiKeyDescription": "Ključ API je žeton paketov PRO, ki gostujejo na <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{1}.</a>",
    "MyOrganizations_Detail_YourPrivateNugetSource": "Vaš zasebni vir NuGet je <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">{0}</a>",
    "MyOrganizations_Detail_PrivateNugetSourceWarning": "To se samodejno doda kot vir v vaš NuGet.Config v vaši rešitvi ABP. Ne delite svojega zasebnega ključa z nepooblaščenimi uporabniki!",
    "MyOrganizations_Detail_DeveloperSeatInfo": "Uporabljate {0} od {1} mest za razvijalce.",
    "NeedMoreSeatsForYourTeam": "Potrebujete več sedežev za svojo ekipo?",
    "MyOrganizations_Detail_PricePerYear": "{0} / na leto",
    "MyOrganizations_Detail_PurchaseDeveloperSeats": "Nakup sedežev za razvijalce",
    "Invoices": "Računi",
    "RequestInvoice": "Zahtevaj račun",
    "OrderNumber": "Številka naročila",
    "Date": "Datum",
    "Products": "Izdelki",
    "TotalPrice": "Skupna cena",
    "ThereIsNoInvoice": "Ni računa",
    "MyOrganizations_Detail_PaymentProviderInfo": "Če ste licenco kupili prek prehoda <i>{0}</i> , ta pošlje račun PDF na vaš e-poštni naslov, glejte <a href=\"{1}\" target=\"_blank\">{0} izdajanje računov.</a>",
    "MyOrganizations_Detail_PayUInfo": "Če ste kupili prek prehoda <i>Iyzico</i> , kliknite gumb &quot;Zahtevaj račun&quot; in izpolnite podatke za obračun.",
    "MyOrganizations_Detail_ConclusionInfo": "Vaša zahteva za račun bo zaključena v {0} delovnih dneh.",
    "ExtendYourLicense": "Podaljšajte licenco za <span class=\"text-primary\">{0}</span>",
    "Continue": "Nadaljuj",
    "PurchaseLicense": "Nakup licence {0}",
    "DownloadInvoiceModal_DownloadInvoice": "Prenesi račun",
    "DownloadInvoiceModal_SaveInformationOnlyOnce": "Podatke za obračun lahko shranite samo enkrat.",
    "InvoiceModal_EnterCompanyName": "Vnesite uradno ime podjetja ...",
    "InvoiceModal_EnterCompanyAddress": "Vnesite uradni naslov podjetja ...",
    "InvoiceModal_EnterTaxNumber": "Vnesite svojo davčno/DDV številko, če je na voljo...",
    "RequestInvoiceModal_EnterNotes": "Vnesite vaše dodatno sporočilo o vašem računu ...",
    "PrePayment_PayWithIyzico": "Plačali boste z Iyzico",
    "ContinueToCheckout": "Naprej na blagajno",
    "PrePayment_IyzicoRedirectionInfo": "Preusmerjeni boste na Iyzico Payment Gateway za varno dokončanje nakupa.",
    "PrePayment_IyzicoAcceptVisaAndMasterCard": "Iyzico sprejema kartice Visa in MasterCard.",
    "Purchase": "Nakup",
    "AcceptTermsAndConditions": "Prebral sem, razumem in sprejemam <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">politiko zasebnosti</a> , <a href=\"{1}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">določila in pogoje</a> ter <a href=\"{2}\" target=\"_blank\" class=\"text-primary\">EULA.</a>",
    "AcceptTermsAndConditionsWarningMessage": "Sprejmite pravilnik o zasebnosti ter določila in pogoje",
    "SelectGatewayToContinue": "Za nadaljevanje izberite prehod!",
    "GatewaySelection_SelectGateway": "Izberite plačilni prehod",
    "GatewaySelection_RedirectionMessage": "Nato boste preusmerjeni na spletno stran izbranega plačilnega prehoda za transakcijo.",
    "PaymentSucceed_PaymentSuccessMessage": "Plačilo uspešno",
    "PaymentSucceed_ThanksForPurchase": "Zahvaljujemo se vam za nakup!",
    "PaymentSucceed_CreateYourOrganization": "Ustvarite svojo organizacijo",
    "PaymentSucceed_AddMeAsDeveloper": "Tudi jaz sem razvijalec, dodajte me kot razvijalca v mojo organizacijo.",
    "PaymentSucceed_CreateOrganization": "Ustvari organizacijo",
    "PaymentSucceed_OrganizationDescription": "Organizacijo sestavljajo razvijalci in lastniki. Razvijalci so uporabniki, ki pišejo kodo za projekt ABP in jim bo koristilo spletno mesto <a href=\"{0}\" target=\"_blank\">{1}</a> . Lastniki so uporabniki, ki dodeljujejo mesta za razvijalce in upravljajo licenciranje.",
    "PaymentSucceed_ViewOrganization": "Kliknite tukaj za ogled organizacije",
    "Purchase_TotalAnnualPrice": "SKUPAJ <small class=\"opacity-50\">(letna pristojbina)</small>",
    "Purchase_TrainingPrice": "Cena usposabljanja",
    "Purchase_OnboardingTraining": "Usposabljanje v živo za uvajanje in razvoj spletnih aplikacij",
    "TotalDeveloperPrice": "Skupna cena za razvijalce",
    "Purchase_PricePerDeveloper": "<span>{0} {1}</span> na razvijalca",
    "Purchase_IncludedDeveloperInfo": "{0} {1} vključeno.",
    "Purchase_LicenseExtraDeveloperPurchaseMessage": "<span class=\"fw-bold\">Licenca {0}</span> vključuje {1} razvijalcev. Dodate lahko dodatne razvijalce.",
    "StartupTemplates_Page_Title": "Zagonske predloge ABP",
    "StartupTemplates_Page_Description": "ABP Commercial vam omogoča izdelavo rešitev s katero koli stopnjo kompleksnosti. Ponuja dve glavni vnaprej zgrajeni zagonski rešitvi. Izberete lahko tisto, ki je blizu vašim zahtevam, in na njej zgradite lastno rešitev po meri.",
    "MicroserviceStartupSolutionForDotnet": "Zagonska rešitev Microservice za .NET",
    "MonolithSolutionForDotnet": "Monolitna (modularna) rešitev za .NET",
    "TrainingDetailsHeaderInfo_TrainingHour": "{0} ura(e)",
    "Trainings_Content": "Vsebina usposabljanja",
    "Trial_Page_StartYourFreeTrial": "Začnite <span class=\"gradient-commercial\">brezplačni preizkus</span>",
    "TrialLicenseFeatures": "Izkoristili boste lahko vse komercialne funkcije ABP",
    "TrialPeriodDays": "Imeli boste {0}-dnevno ekipno licenco",
    "TrialForumSupportIncident": "Imeli boste {0} incidentov s podporo foruma",
    "Contact_Page_Title": "Stik z razvojno ekipo ABP",
    "Contact_Page_Description": "Obrnite se na skupino za razvoj ABP, če potrebujete pomoč ali delite svoje misli in mnenja! Ekipa za podporo ABP je pripravljena pomagati.",
    "Demo_Page_Title": "Ustvarite predstavitev",
    "Demo_Page_Description": "Ustvarite brezplačno predstavitev in si oglejte vzorčno aplikacijo, ustvarjeno s predlogo za zagon ABP Commercial. Ne ponavljajte se za običajne zahteve za prijavo.",
    "Discounted_Page_Title": "Znižana cena",
    "Discounted_Page_Description": "Izberite funkcije in funkcije, ki jih vaše podjetje potrebuje že danes. Kupite licenco ABP Commercial in ustvarite neomejeno število projektov",
    "Faq_Page_Title": "Pogosto zastavljena vprašanja (FAQ)",
    "Faq_Page_Description": "Imaš kakšno vprašanje? Poiščite pogosto zastavljena vprašanja ali nam zastavite vprašanje s pomočjo kontaktnega obrazca.",
    "Faq_Page_SwiftCode": "Koda SWIFT",
    "Faq_Page_BankName": "Ime banke",
    "Faq_Page_AccountName": "Ime računa",
    "Faq_Page_AccountNumber": "Številka računa",
    "Faq_Page_Currency": "Valuta",
    "Faq_Page_VatNumber": "Davčna številka",
    "Faq_Page_OtherCurrenciesInfo": "Za druge valute si oglejte <a href='{0}'>vse račune</a>",
    "ProjectCreatedSuccess_Page_Title": "Vaš projekt ustvarjen",
    "ProjectCreatedSuccess_Page_Description": "Vaš projekt ABP je bil uspešno ustvarjen!",
    "Suite_Page_Title": "Apartma ABP",
    "Suite_Page_Description": "ABP Commercial ponuja orodja za hiter razvoj aplikacij za povečanje produktivnosti razvijalcev. ABP Suite vam omogoča enostavno ustvarjanje strani CRUD.",
    "Themes_Page_Title": "Teme ABP",
    "Themes_Page_Description": "ABP Commercial ponuja več profesionalnih, sodobnih tem uporabniškega vmesnika. Ustvarite brezplačno predstavitev za hiter vpogled v to, kako izgleda uporabniški vmesnik.",
    "Tools_Page_Title": "Orodja za hitri razvoj aplikacij",
    "Tools_Page_Description": "ABP Commercial ponuja orodja za hiter razvoj aplikacij za povečanje produktivnosti razvijalcev. ABP Suite vam omogoča enostavno ustvarjanje strani CRUD.",
    "DeveloperPrice": "Cena za razvijalce",
    "AdditionalDeveloperPaymentInfoSection_AdditionalDevelopers": "{0} <small>razvijalci</small>",
    "LicenseRemainingDays": "za <span>{0}</span> dni",
    "ExtendPaymentInfoSection_Description": "S podaljšanjem/obnovitvijo licence boste še naprej prejemali <a href=\"{0}\" target=\"_blank\">vrhunsko podporo</a> . Dobili boste lahko tudi večje ali manjše posodobitve za module in teme. Lahko boste nadaljevali z ustvarjanjem novih projektov. In še vedno boste lahko uporabljali <a href=\"{1}\" target=\"_blank\">ABP Suite</a> , ki pospeši vaš razvoj.",
    "LicenseRenewalPrice": "Cena podaljšanja licence",
    "LicensePrice": "Cena licence",
    "TrialLicensePaymentInfoSection_Description": "<strong>Nakup licence:</strong> Z nakupom licence boste še naprej prejemali <a href=\"{0}\" target=\"_blank\" rel=\"noopener\">vrhunsko podporo</a> . Dobili boste lahko tudi večje ali manjše posodobitve za module in teme. Lahko boste nadaljevali z ustvarjanjem novih projektov. In še vedno boste lahko uporabljali <a href=\"{1}\" target=\"_blank\" rel=\"noopener\">ABP Suite</a> , ki pospeši vaš razvoj.<br> Oglejte si <a href=\"{2}\" target=\"_blank\" rel=\"noopener\">primerjalno tabelo licenc</a> , da preverite razlike med vrstami licenc.",
    "SelectTargetLicense": "Izberite ciljno licenco",
    "UpgradePaymentInfoSection_ExtendMyLicenseForOneYear": "Da, podaljšaj moj rok veljavnosti licence za 1 leto.",
    "UpgradePaymentInfoSection_WantToExtendLicense": "Ali želite licenco podaljšati še za 1 leto?",
    "UpgradePaymentInfoSection_UpgradingWillNotExtendLicense": "Nadgradnja ne bo podaljšala datuma veljavnosti vaše licence!",
    "UpgradePaymentInfoSection_LicenseUpgradeDescription": "Z nadgradnjo licence boste napredovali v višjo vrsto licence, kar vam bo omogočilo dodatne ugodnosti. Oglejte si <a href=\"/Pricing\" target=\"_blank\">primerjalno tabelo licenc</a> , da preverite razlike med vrstami licenc.",
    "Landing_Page_CustomerStories": "Zgodbe strank",
    "Landing_Page_OurGreatCustomers": "Naše odlične stranke",
    "Landing_Page_WebApplicationFramework": "Ogrodje spletne aplikacije",
    "Landing_Page_WebDevelopmentPlatform": "Platforma za spletni razvoj",
    "Landing_Page_CompleteWebDevelopmentPlatform": "Popolna platforma za spletni razvoj",
    "Landing_Page_TryFreeDemo": "Preizkusite brezplačno predstavitev",
    "Landing_Page_StartingPointForWebApplications": "Izhodišče za spletne aplikacije, ki temeljijo na ASP.NET Core! Temelji na ogrodju ABP za najboljši spletni razvoj.",
    "Landing_Page_AbpProvidesSoftwareInfrastructure": "ABP Framework zagotavlja programsko infrastrukturo za razvoj odličnih spletnih aplikacij z najboljšimi praksami.",
    "Landing_Page_MicroserviceCompatibleArchitecture": "Arhitektura, združljiva z mikrostoritvijo",
    "Landing_Page_PreBuiltApplicationModulesAndThemes": "Vnaprej zgrajeni aplikacijski moduli in teme",
    "Landing_Page_MultiTenantArchitecture": "Arhitektura z več najemniki",
    "Landing_Page_MultiTenancyDescription": "Aplikacije SaaS so preproste! Integrirano večnajemništvo od baze podatkov do uporabniškega vmesnika.",
    "Landing_Page_DDDIntroduction": "Oblikovan in razvit na podlagi vzorcev in načel DDD. Zagotavlja večplastni model za vašo aplikacijo.",
    "Landing_Page_CrossCuttingConcernsInfo": "Popolna infrastruktura za avtorizacijo, validacijo, obravnavanje izjem, predpomnjenje, revizijsko beleženje, upravljanje transakcij in drugo.",
    "Landing_Page_PreBuiltApplicationModules": "Vnaprej zgrajeni aplikacijski moduli, ki vključujejo najpogostejše zahteve spletnih aplikacij.",
    "Landing_Page_ChatModule": "Klepetajte",
    "Landing_Page_DocsModule": "dokumenti",
    "Landing_Page_FileManagementModule": "Upravljanje datotek",
    "Landing_Page_CustomerStory_1": "ABP Commercial je podjetju SC Ventures dovolil, da v 9 mesecih dobavi platformo SaaS za več najemnikov silo podatkovne baze bančnega razreda za podporo financiranja dobavne verige terjatev/obveznosti računov z veliko vrednostjo iz več integriranih sidrišč. Modularnost ABP je ekipi omogočila dostavo v rekordnem času, opravila vse VAPT in uvedla kontejnerski sklad mikrostoritev prek celotnega CI/CD in cevovodov v proizvodnjo.",
    "Landing_Page_CustomerStory_2": "Vidimo vrednost uporabe ABP Commercial za zmanjšanje režijskih stroškov razvojnih projektov po meri. Ekipa lahko poenoti vzorec kode v različnih projektnih tokovih. V okviru vidimo več potenciala za hitrejšo gradnjo novih funkcij kot prej. Verjamemo, da bomo nenehno ugotavljali vrednost izkoriščanja ABP Commercial.",
    "Landing_Page_CustomerStory_3": "Ljubimo ABP. Ni nam treba pisati vsega od začetka. Izhajamo iz že pripravljenih funkcij in se osredotočamo na tisto, kar resnično moramo napisati. Poleg tega je ABP dobro zasnovan in koda je visoke kakovosti z manj napakami. Če bi morali sami napisati vse, kar potrebujemo, bi morda morali porabiti leta. Še ena stvar, ki nam je všeč, je, da nova različica ali popravek težave ali izboljšava izide zelo kmalu \n vsak drugi teden. Ne čakamo predolgo.",
    "Landing_Page_CustomerStory_4": "ABP Commercial je fantastičen izdelek, ki ga priporočam. Komercialni izdelki za trženje naših strank v eni konfiguracijski platformi. Skok se začne s tem, da okvir in orodja zagotavljajo, da je vsaka ekipa vredna vsakega centa. ABP Commercial je najbolj ustrezal našim potrebam.",
    "Landing_Page_AdditionalServices": "Licenca po meri ali količinska licenca, vkrcanje, usposabljanje in podpora v živo, razvoj projektov po meri, prenos obstoječih projektov in več ...",
    "Landing_Page_IncludedDeveloperLicenses": "Vključenih <strong>{0}</strong> licenc za razvijalce",
    "Landing_Page_SeeOnDemo": "Glej na Demo",
    "Landing_Page_LeptonThemes": "LeptonThemes",
    "Landing_Page_AccountModuleDescription_1": "Ta modul implementira sistem preverjanja pristnosti za aplikacijo;",
    "Landing_Page_AccountModuleDescription_2": "Zagotavlja stran <strong>za prijavo</strong> z uporabniškim imenom in geslom",
    "Landing_Page_AccountModuleDescription_3": "Zagotavlja stran <strong>za registracijo</strong> za ustvarjanje novega računa.",
    "Landing_Page_AccountModuleDescription_4": "Ponuja stran <strong>s pozabljenim geslom</strong> za pošiljanje povezave <strong>za ponastavitev gesla</strong> kot e-pošto.",
    "Landing_Page_AccountModuleDescription_5": "Omogoča funkcijo <strong>potrditve e-pošte</strong> z uporabniškim vmesnikom.",
    "Landing_Page_AccountModuleDescription_6": "Izvaja <strong>dvostopenjsko</strong> avtentikacijo (SMS in e-pošta).",
    "Landing_Page_AccountModuleDescription_7": "Izvaja <strong>zaklepanje uporabnika</strong> (zaklene račun za nastavljen čas, ko pride do določenega števila neuspešnih prijav zaradi neveljavnih poverilnic v določenem časovnem intervalu).",
    "Landing_Page_AccountModuleDescription_8": "Implementira uporabniški vmesnik in funkcionalnost strežnika za preverjanje <strong>pristnosti Identity Server</strong> .",
    "Landing_Page_AccountModuleDescription_9": "Omogoča <strong>preklapljanje med najemniki</strong> v okolju z več najemniki.",
    "Landing_Page_AccountModuleDescription_10": "Omogoča spreminjanje <strong>jezika uporabniškega vmesnika</strong> aplikacije.",
    "Landing_Page_AuditLoggingModuleDescription_1": "Ta modul nudi uporabniški vmesnik za poročanje revizijskega dnevnika za revizijsko infrastrukturo. Omogoča iskanje, filtriranje in prikaz vnosov v revizijskem dnevniku in dnevnikov sprememb entitet.",
    "Landing_Page_AuditLoggingModuleDescription_2": "Vnos v revizijski dnevnik je sestavljen iz kritičnih podatkov o vsaki zahtevi odjemalca:",
    "Landing_Page_AuditLoggingModuleDescription_3": "URL, brskalnik, naslov IP, ime odjemalca",
    "Landing_Page_AuditLoggingModuleDescription_4": "Uporabnik",
    "Landing_Page_AuditLoggingModuleDescription_5": "Metoda HTTP, povratna statusna koda HTTP",
    "Landing_Page_AuditLoggingModuleDescription_6": "Uspeh/neuspeh, podrobnosti o izjemah, če so na voljo",
    "Landing_Page_AuditLoggingModuleDescription_7": "Trajanje izvedbe zahteve",
    "Landing_Page_AuditLoggingModuleDescription_8": "Entitete so bile ustvarjene, izbrisane ali posodobljene v tej zahtevi (s spremenjenimi lastnostmi).",
    "Landing_Page_BloggingModuleDescription_1": "Ta modul vaši aplikaciji ABP doda preprost blog;",
    "Landing_Page_BloggingModuleDescription_2": "Omogoča ustvarjanje več blogov v eni aplikaciji.",
    "Landing_Page_BloggingModuleDescription_3": "Podpira format Markdown.",
    "Landing_Page_BloggingModuleDescription_4": "Omogoča pisanje komentarja za objavo.",
    "Landing_Page_BloggingModuleDescription_5": "Omogoča dodeljevanje oznak objavam v spletnem dnevniku.",
    "Landing_Page_BloggingModuleDescription_6": "Oglejte si spletno mesto <a href=\"blog.abp.io\">blog.abp.io</a> kot živi primer blogging modula.",
    "Landing_Page_ChatModuleDescription_1": "Ta modul se uporablja za sporočanje v realnem času med uporabniki v aplikaciji.",
    "Landing_Page_ChatModuleDescription_2": "Pošiljanje sporočil v realnem času na strani za klepet.",
    "Landing_Page_ChatModuleDescription_3": "Išči uporabnike v aplikaciji za nove pogovore.",
    "Landing_Page_ChatModuleDescription_4": "Seznam stikov za nedavne pogovore.",
    "Landing_Page_ChatModuleDescription_5": "Obvestila o novih sporočilih, ko uporabnik gleda drugo stran.",
    "Landing_Page_ChatModuleDescription_6": "Značka za skupno število neprebranih sporočil na ikoni menija.",
    "Landing_Page_ChatModuleDescription_7": "Število neprebranih sporočil za vsak pogovor.",
    "Landing_Page_ChatModuleDescription_8": "Leno naloženi pogovori.",
    "Landing_Page_DocsModuleDescription_1": "Ta modul se uporablja za izdelavo spletnih mest s tehnično dokumentacijo;",
    "Landing_Page_DocsModuleDescription_2": "Vgrajena <strong>integracija GitHub</strong> : neposredno pisanje in upravljanje dokumentov na GitHub.",
    "Landing_Page_DocsModuleDescription_3": "Podpora <strong>za urejanje različic</strong> je neposredno integrirana v izdaje GitHub.",
    "Landing_Page_DocsModuleDescription_4": "Podpira <strong>več jezikov</strong> (z nadomestno podporo za privzeti jezik).",
    "Landing_Page_DocsModuleDescription_5": "Podpira formata <strong>Markdown</strong> in HTML.",
    "Landing_Page_DocsModuleDescription_6": "Ponuja razdelek <strong>za krmarjenje</strong> in <strong>oris</strong> .",
    "Landing_Page_DocsModuleDescription_7": "Omogoča gostovanje <strong>več dokumentov projektov</strong> v eni aplikaciji.",
    "Landing_Page_DocsModuleDescription_8": "Povezave do datoteke na GitHubu, tako da lahko vsakdo preprosto prispeva s klikom na <strong>povezavo Uredi</strong> .",
    "Landing_Page_DocsModuleDescription_9": "Poleg vira GitHub omogoča preprosto uporabo mape kot vira dokumentacije.",
    "Landing_Page_FileManagementModuleDescription_1": "Nalagajte, prenašajte in organizirajte datoteke v hierarhični strukturi map.",
    "Landing_Page_FileManagementModuleDescription_2": "Ta modul se uporablja za nalaganje, prenos in organiziranje datotek v hierarhični strukturi map. Združljiv je tudi z več najemništvom in lahko določite skupno omejitev velikosti za svoje najemnike.",
    "Landing_Page_FileManagementModuleDescription_3": "Ta modul temelji na sistemu <a href=\"https://docs.abp.io/en/abp/latest/Blob-Storing\">BLOB Storing</a> , tako da lahko uporablja različne ponudnike pomnilnika za shranjevanje vsebine datoteke.",
    "Landing_Page_IdentityModuleDescription_1": "Ta modul implementira sistem uporabnikov in vlog aplikacije;",
    "Landing_Page_IdentityModuleDescription_2": "Zgrajeno na <a href=\"https://docs.microsoft.com/en-us/aspnet/core/security/authentication/identity\">Microsoftovi knjižnici ASP.NET Core Identity</a> .",
    "Landing_Page_IdentityModuleDescription_3": "Upravljanje <strong>vlog</strong> in <strong>uporabnikov</strong> v sistemu. Uporabnik lahko ima <strong>več vlog</strong> .",
    "Landing_Page_IdentityModuleDescription_4": "Nastavite <strong>dovoljenja</strong> na ravni vlog in uporabnikov.",
    "Landing_Page_IdentityModuleDescription_5": "Omogoči/onemogoči <strong>dvofaktorsko avtentikacijo</strong> in <strong>zaklepanje</strong> uporabnika na uporabnika.",
    "Landing_Page_IdentityModuleDescription_6": "Upravljajte osnovni <strong>uporabniški profil</strong> in <strong>geslo</strong> .",
    "Landing_Page_IdentityModuleDescription_7": "Upravljajte <strong>vrste zahtevkov</strong> v sistemu, nastavite zahtevke za vloge in uporabnike.",
    "Landing_Page_IdentityModuleDescription_8": "Stran z nastavitvami za upravljanje <strong>kompleksnosti gesla</strong> , prijavo uporabnika, račun in zaklepanje.",
    "Landing_Page_IdentityModuleDescription_9": "Podpira avtentikacijo <strong>LDAP</strong> .",
    "Landing_Page_IdentityModuleDescription_10": "Omogoča preverjanje <strong>e-pošte in telefonske številke</strong> .",
    "Landing_Page_IdentityModuleDescription_11": "Podpira integracije socialne prijave (Twitter, Facebook, GitHub itd...).",
    "Landing_Page_IdentityModuleDescription_12": "Upravljanje <strong>organizacijskih enot</strong> v sistemu.",
    "Landing_Page_PaymentModuleDescription_1": "Zagotavlja integracijo za različne plačilne prehode.",
    "Landing_Page_PaymentModuleDescription_2": "Ta modul omogoča integracijo za plačilne prehode, tako da lahko preprosto prejmete plačilo od svojih strank.",
    "Landing_Page_PaymentModuleDescription_3": "Ta modul podpira naslednje plačilne prehode",
    "Welcome_Page_UseSameCredentialForCommercialWebsites": "Uporabite iste poverilnice za <a href=\"https://commercial.abp.io\" class=\"text-primary\">commercial.abp.io</a> in <a href=\"https://support.abp.io\" class=\"text-primary\">support.abp.io</a> .",
    "WatchCrudPagesVideo": "Oglejte si videoposnetek &quot;Ustvarjanje strani CRUD z ABP Suite&quot;!",
    "WatchGeneratingFromDatabaseVideo": "Oglejte si videoposnetek &quot;ABP Suite: ustvarjanje strani CRUD iz obstoječih tabel baze podatkov&quot;!",
    "WatchTakeCloserLookVideo": "Oglejte si video »Pobliže si oglejte ustvarjanje kode: ABP Suite«!",
    "ConfirmedEmailAddressRequiredToStartTrial": "Če želite začeti s preskusno licenco, morate imeti potrjen e-poštni naslov.",
    "EmailVerificationMailNotSent": "E-poštnega sporočila za preverjanje ni bilo mogoče poslati.",
    "GetConfirmationEmail": "<a href=\"javascript:void(0);\" id=\"{0}\" class=\"text-decoration-underline\">Kliknite tukaj, če želite prejeti potrditveno e-poštno sporočilo,</a> če ga še niste prejeli.",
    "WhichLicenseTypeYouAreInterestedIn": "Katera vrsta licence vas zanima?",
    "DontTakeOurWordForIt": "Ne verjemite nam na besedo ...",
    "ReadAbpCommercialUsersWantYouToKnow": "Preberite, kaj uporabniki ABP Commercial želijo, da veste",
    "Testimonial_ShortDescription_1": "Modularnost ABP je ekipi omogočila pravočasno izvedbo.",
    "Testimonial_ShortDescription_2": "Zgradite nove funkcije hitreje kot prej.",
    "Testimonial_ShortDescription_3": "Izhajamo iz že pripravljenih funkcij in se osredotočamo na tisto, kar resnično moramo napisati.",
    "Testimonial_ShortDescription_4": "ABP Commercial je najbolj ustrezal našim potrebam.",
    "OnlineReviewersOnAbpCommercial": "Spletne ocene o ABP Commercial",
    "SeeWhatToldAboutAbpCommercial": "Oglejte si, kaj je bilo povedano o ABP Commercial in napišite svoje misli, če želite.",
    "BlazoriseLicense": "Ali moramo kupiti licenco Blazorise?",
    "BlazoriseLicenseExplanation": "Imamo pogodbo med Volosoftom in Megabitom, s katero je licenca Blazorise priložena komercialnim izdelkom ABP, zato našim strankam ni treba kupiti dodatne licence Blazorise.",
    "ExtendPaymentInfoSection_DeveloperPrice": "{0}x dodatni razvijalec(-i)",
    "ExtendPaymentInfoSection_DiscountRate": "Popust {0}%",
    "TotalNetPrice": "Skupna neto cena",
    "EFCore": "Entity Framework Core",
    "All": "Vse",
    "Mvc": "MVC",
    "DataBaseProvider": "Ponudnik podatkov",
    "UIFramework": "UI Framework",
    "LeptonXThemeForDashboard": "Tema LeptonX za vašo skrbniško nadzorno ploščo avtorja",
    "AbpPlatform": "Platforma ABP",
    "YouDeserveGoodUXUI": "Zaslužiš si dober uporabniški vmesnik in boljši UX. Tema LeptonX proizvajalca ABP je tukaj, da ji služi.",
    "ViewLiveDemo": "Oglejte si predstavitev teme v živo",
    "GetLeptonX": "Pridobite LeptonX zdaj",
    "SeeLeptonXDocumentation": "Oglejte si dokumentacijo LeptonX",
    "SeeLeptonDocumentation": "Oglejte si Leptonovo dokumentacijo",
    "SimplifiedMenu": "Poenostavljen meni",
    "SimplifiedMenuDescription": "Stran, ki jo iščete, zlahka najdete s filtriranjem menija",
    "YourFavoritePages": "Vaše najljubše strani na dosegu roke",
    "YourFavoritePagesDescription": "Stran preprosto dodajte ali odstranite iz priljubljenih s klikom na ikono zvezdice v zgornjem desnem kotu strani.",
    "BreadCrumbs": "Drobtinica za brezhibno preklapljanje",
    "BreadCrumbsDescription": "Z uporabo Breadcrumb lahko z enim klikom preklopite na strani na isti ravni, tudi ko je levi meni zaprt, deluje pa odzivno na tablici in mobilni napravi!",
    "YourMenu": "Vaš jedilnik po vaših željah",
    "YourMenuDescription": "Po želji prilagodite ikone, na katere je mogoče neposredno klikniti, in spustna polja v uporabniškem meniju. Uporabniški meni je popolnoma prilagodljiv vašim potrebam",
    "RtlSupport": "Podpora RTL za vaš jezik",
    "RtlSupportDescription": "Tema LeptonX podpira RTL za vaš jezik. Jezikovne možnosti so v meniju z nastavitvami, kjer lahko spremenite jezik.",
    "YourColors": "Vaše barve na uporabniškem vmesniku skrbniške nadzorne plošče",
    "YourColorsDescription": "Tema LeptonX deluje v skladu z vašimi sistemskimi nastavitvami in ima možnosti svetle teme armaturne plošče, temne teme armaturne plošče in možnosti poltemne teme armaturne plošče.",
    "ArrangeContentWidth": "Preprosto uredite širino vsebine",
    "ArrangeContentWidthDescription": "Preprosto spremenite širino območja vsebine.",
    "LeptonXCompatibleWith": "Tema LeptonX je združljiva z",
    "MobileResponsiveTemplate": "Odzivna predloga za mobilne naprave",
    "MobileResponsiveTemplateDescription1": "Dostopajte do skrbniške nadzorne plošče LeptonX iz katere koli naprave.",
    "MobileResponsiveTemplateDescription2": "Zasnovan je za enostavno uporabo v vsaki vaši napravi. Odziven je na mobilnih napravah in velikostih tablic.",
    "TopMenuLayoutOption": "Možnost postavitve zgornjega menija",
    "TopMenuLayoutOptionDescription1": "Če bi radi svoje spletno mesto postavili z isto skrbniško nadzorno ploščo, je to mogoče storiti s temo LeptonX!",
    "TopMenuLayoutOptionDescription2": "Preizkusite postavitev zgornjega menija LeptonX, da se to zgodi!",
    "EasilyCustomizable": "Preprosto prilagodljiv za barve vaše blagovne znamke",
    "EasilyCustomizableDescription1": "Temo LeptonX lahko prilagodite z le nekaj spremenljivkami SCSS. Brez preglasitve, brez dodatnega nalaganja CSS!",
    "EasilyCustomizableDescription2": "Z LeptonX lahko uredite skrbniško nadzorno ploščo, kakor želite.",
    "IndependentLayout": "Samostojna postavitev in vsebinsko področje",
    "IndependentLayoutDescription1": "Infrastruktura postavitve LeptonX je bila zasnovana popolnoma ločeno od vsebine.",
    "IndependentLayoutDescription2": "To pomeni, da lahko poljubno oblikujete svoj projekt s strukturo vsebine, ki ni Bootstrap, če želite.",
    "MostUsedLibraries": "Najpogosteje uporabljene knjižnice, integrirane z LeptonX",
    "MostUsedLibrariesDescription1": "LeptonX vsebuje vaše najpogosteje uporabljene knjižnice. Omogoča vam brez težav uporabo knjižnic, kot so ApexCharts, DataTables, DropZone, FullCalender, JSTree, Select2 in Toastr.",
    "MostUsedLibrariesDescription2": "LeptonX podpira tudi knjižnici MVC Angular in Blazor.",
    "CreateAndCustomize": "Ustvarite in prilagodite strani, ki jih potrebujete, v nekaj sekundah s stranmi po meri LeptonX",
    "CreateAndCustomizeDescription": "Z uporabo teme LeptonX imate tudi dostop do številnih vnaprej izdelanih strani HTML. Te vključujejo številne strani, kot so stran za prijavo, blog, pogosta vprašanja, seznam naročnin, račun, cene in upravljanje datotek.",
    "LeptonThemeForAdmin": "Tema Lepton za vašo skrbniško nadzorno ploščo avtorja",
    "LeptonThemeForAdminDescription": "Tema Lepton je še vedno na voljo in se bo vzdrževala. Če želite preklopiti na temo LeptonX kot uporabnik teme Lepton, si lahko ogledate dokumentacijo, da izveste, kako.",
    "LeptonCompatibleWith": "Tema Lepton je združljiva z",
    "BlackFridayDiscount": "Popust Black Friday",
    "UpgradePaymentInfoSection_DeveloperPrice": "{0} za {1} dodatnih razvijalcev",
    "Upgrade": "Nadgradnja",
    "Renewal": "Obnova",
    "UpgradePaymentInfoSection_LicensePrice": "{0} licenca",
    "UpgradePaymentInfoSection_LicenseRenewalPrice": "Podaljšanje licence",
    "Total": "Skupaj",
    "SupportPolicyFaqTitle": "Kakšna je vaša politika podpore?",
    "SupportPolicyFaqExplanation": "Podpiramo samo aktivno in prejšnjo glavno različico. Ne jamčimo izdaje popravkov za 3. in starejše glavne različice. Na primer, če je aktivna različica 7.0.0, bomo izdali popravke za različici 6.xx in 7.xx. Poleg tega nudimo podporo samo za vprašanja, povezana z ABP Framework in ABP Commercial. To pomeni, da ni podpore za aplikacije tretjih oseb, storitve v oblaku in druge periferne knjižnice, ki jih uporabljajo izdelki ABP. Uporabili bomo komercialno razumna prizadevanja, da našim strankam zagotovimo tehnično podporo med uradnim delovnim časom &quot;Volosoft Bilisim AS&quot;. Po drugi strani pa se ne zavezujemo k odzivnemu času pogodbe o ravni storitev (SLA), vendar se bomo na tehnične težave poskušali odzvati čim hitreje v okviru uradnega delovnega časa. Če s stranko ni sklenjen poseben dogovor, nudimo podporo samo na https://support.abp.io. Imamo tudi zasebno e-poštno podporo, ki je na voljo samo imetnikom licence Enterprise.",
    "TotalDevelopers": "Skupno {0} razvijalcev",
    "CustomPurchaseExplanation": "Prilagojeno vašim posebnim potrebam",
    "WhereDidYouHearAboutUs": "Kje ste izvedeli za nas?",
    "Twitter": "Twitter",
    "Facebook": "Facebook",
    "Youtube": "YouTube",
    "Google": "Google",
    "Github": "GitHub",
    "Friend": "Od prijatelja",
    "Other": "drugo",
    "WhereDidYouHearAboutUs_explain": "Določite ...",
    "DeletingMemberWarningMessage": "»{0}« bo odstranjen s seznama razvijalcev. Če želite, lahko to prazno mesto pozneje dodelite drugemu razvijalcu.",
    "AdditionalInfo": "Če je število razvijalcev nad vašimi zahtevami, jih lahko zmanjšate. Če želite odstraniti nekatere svoje razvijalske sedeže, lahko pošljete e-pošto na <a href=\"mailto:info@abp.io\">info@abp.io</a> . Čiščenje neuporabljenih razvijalskih mest bo zmanjšalo stroške podaljšanja licence. Če želite, lahko ponovno kupite dodatna mesta za razvijalce v obdobju aktivne licence. Upoštevajte, da tega števila ne morete zmanjšati, ker je v tem licenčnem paketu {0} razvijalcev.",
    "LinkExpiredErrorMessage": "Povezava, do katere poskušate dostopati, je potekla.",
    "ExpirationDate": "Datum veljavnosti",
    "SpringCampaignDiscount": "Pomladni akcijski popust",
    "WhyUseAbpIoPlatform": "Zakaj bi moral uporabiti platformo ABP.IO, namesto da ustvarim novo rešitev iz nič?",
    "WhyUseAbpIoPlatformFaqExplanation": "Oglejte si <a href=\"/why-abp-io \">to stran</a> za podrobno razlago, zakaj ima uporaba platforme ABP.IO pomembno prednost pred tem, da vse naredite sami.",
    "EulaPageTitle": "Licenčna pogodba za končnega uporabnika (EULA)",
    "PrivacyPolicyPageTitle": "Politika zasebnosti – Politika piškotkov",
    "TermsConditionsPageTitle": "Pogoji",
    "TrainingsPageTitle": "Paketi usposabljanja ABP",
    "ModulesPageTitle": "Vnaprej zgrajeni aplikacijski moduli ABP",
    "Volo.AbpIo.Commercial:040001": "Ključ za dostop do API-ja ni pravilen.",
    "GetLepton": "Kupite Lepton zdaj",
    "MyOrganizations_Detail_LicenseStartDate": "Začetni datum licence",
    "MyOrganizations_Detail_LicenseExpiryDate": "Rok uporabnosti",
    "BlazoriseSupport": "Kako dobim licenčni ključ Blazorise in podporo ekipe Blazorise?",
    "BlazoriseSupportExplanation": "Sledite spodnjim korakom, da dobite podporo ekipe Blazorise in licenčni ključ Blazorise:",
    "BlazoriseSupportExplanation1": "Prijavite se za nov račun na <a href=\"https://blazorise.com/support/register\">blazorise.com/support/register</a> z enakim e-poštnim naslovom kot vaš račun abp.io. Vnos &quot;Licenčni ključ&quot; pustite prazen. <strong>E-poštni naslov mora biti enak vašemu e-poštnemu računu na abp.io.</strong>",
    "BlazoriseSupportExplanation2": "Preverite svoj e-poštni naslov tako, da označite svoj e-poštni predal. Če v mapi »Prejeto« ne vidite e-poštnega sporočila, preverite svoj predal z vsiljeno pošto!",
    "BlazoriseSupportExplanation3": "Prijavite se na spletno stran za podporo Blazorise na <a href=\"https://blazorise.com/support/login\">blazorise.com/support/login</a> .",
    "BlazoriseSupportExplanation4": "Če imate aktivno licenco ABP Commercial, boste imeli tudi licenco Blazorise PRO. Licenčni ključ Blazorise lahko dobite na <a href=\"https://blazorise.com/support/user/manage/license\">blazorise.com/support/user/manage/license</a> .",
    "BlazoriseSupportExplanation5": "Svoja vprašanja lahko objavite na spletnem mestu za podporo in ustvarite žeton izdelka za svojo aplikacijo.",
    "AbpLiveTrainingPackages": "ABP paketi usposabljanja v živo",
    "Releases": "Izdaje",
    "ReleasesDescription": "Dnevniki izdaj ABP Commercial.",
    "ReleaseDate": "Datum izdaje",
    "Labels": "Etikete",
    "PreRelease": "Predizdaja",
    "AllTypes": "Vse vrste",
    "Enhancement": "Izboljšanje",
    "Bug": "Napaka",
    "Feature": "Funkcija",
    "AllUIs": "Vsi uporabniški vmesniki",
    "MVC": "MVC",
    "BlazorServer": "Blazor strežnik",
    "MAUI": "MAUI",
    "HowItWorks_Page_Title": "Kako deluje?",
    "HowItWorks_Page_Description": "ABP Framework razširja platformo .NET. Torej je vse, kar lahko storite z navadno rešitvijo .NET, že mogoče z ogrodjem ABP. To olajša začetek z nizko krivuljo učenja.",
    "HowItWorks_Description1": "ABP Framework razširja platformo .NET. Torej je vse, kar lahko storite z navadno rešitvijo .NET, že mogoče z ogrodjem ABP. To olajša začetek z nizko krivuljo učenja.",
    "HowItWorks_Description2": "Ko se začnete učiti in uporabljati funkcije ogrodja ABP, bo razvijanje vaše programske opreme veliko bolj prijetno kot kadar koli prej.",
    "HowItWorks_Description3": "Ta stran v bistvu pojasnjuje, kako uporabljate platformo ABP.IO kot razvijalec .NET.",
    "CreateANewSolution": "Ustvarite novo rešitev .NET",
    "CreateANewSolution_Description1": "Vse se začne z ustvarjanjem nove integrirane rešitve .NET ABP.",
    "StartWithStartupTemplates": "Zaženite eno od vnaprej pripravljenih <a href=\"/startup-templates\">predlog za zagonsko rešitev</a>",
    "SimpleMonolithApplicationTemplate": "Enostavna šablona monolitne aplikacije",
    "LayeredApplicationTemplate": "Večplastna predloga aplikacije",
    "MicroserviceSolutionTemplate": "Predloga rešitve mikrostoritve",
    "CreateEmptySolutionAndUseAbp": "Ali pa ustvarite novo prazno rešitev .NET in sami namestite <a href=\"https://abp.io/packages\" target=\"_blank\">pakete</a> ABP NuGet &amp; NPM.",
    "CreatingSolutionWithMultipleOptions": "Med ustvarjanjem nove rešitve je na voljo več možnosti uporabniškega vmesnika in baze podatkov.",
    "UIFrameworkOptions": "Možnosti ogrodja uporabniškega vmesnika",
    "DotnetSolutionWithoutDependency": "Zdaj imate v lokalnem računalniku običajno rešitev .NET, ki ni odvisna od platforme v oblaku ali zunanje storitve.",
    "CheckTheDocumentForDetails": "Za podrobnosti lahko preverite dokument <a href=\"{0}\" target=\"_blank\">{1}</a> .",
    "UIAndDatabaseIndependent": "ABP lahko deluje s katerim koli uporabniškim vmesnikom in katerim koli ponudnikom baze podatkov, ki ga podpira .NET. \n Vendar pa so ti ponudniki uporabniškega vmesnika in baze podatkov vnaprej integrirani in dobro dokumentirani.",
    "InstallAbpModules": "Namestite module ABP",
    "DevelopYourSolution": "Razvijte svojo rešitev",
    "DeployAnywhere": "Namestite kjer koli",
    "InstallAbpModule_Description1": "ABP je modularno ogrodje za razvoj aplikacij. Predloge rešitev za zagon že prihajajo z nameščenimi osnovnimi moduli. \n Obstaja pa več aplikacijskih modulov, ki jih boste morda želeli uporabiti v svoji rešitvi.",
    "InstallAbpModule_Description2": "Vsak modul je sestavljen iz nekaj paketov NuGet in NPM ter ima namestitveni dokument. <a href=\"/tools/suite\">ABP Suite</a> večino dela opravi samodejno, nato pa modul ročno konfigurirate ali natančno prilagodite na podlagi njegove dokumentacije.",
    "DevelopYourSolution_Description1": "Infrastruktura ABP omogoča, da <b class=\"text-white\">se osredotočite na lastno poslovno kodo</b> z avtomatizacijo ponavljajočega se dela in zagotavljanjem vnaprej zgrajene infrastrukture in aplikacijskih <a href=\"https://abp.io/features\" target=\"_blank\">funkcij</a> .",
    "DevelopYourSolution_Description2": "V naslednjem bloku kode si lahko ogledate, kako se ogrodje ABP neopazno integrira v vašo kodo in namesto vas avtomatizira ponavljajoče se naloge.",
    "DevelopYourSolution_Description3": "Tudi v tem bloku kratke kode ABP naredi veliko stvari namesto vas.",
    "DevelopYourSolution_Description4": "Zagotavlja osnovne razrede za uporabo konvencij, kot je <a href=\"https://docs.abp.io/en/abp/latest/Dependency-Injection\" target=\"_blank\">vstavljanje odvisnosti</a> \n . Storitve generičnih <a href=\"https://docs.abp.io/en/abp/latest/Repositories\" target=\"_blank\">skladišč</a> \n zagotavljajo priročen način \n za interakcijo z bazo podatkov. Deklarativna <a href=\"https://docs.abp.io/en/abp/latest/Authorization\" target=\"_blank\">avtorizacija</a> \n deluje z natančno nastavljenim sistemom dovoljenj.",
    "DevelopYourSolution_Description5": "ABP popolnoma avtomatizira <a href=\"https://docs.abp.io/en/abp/latest/Unit-Of-Work\" target=\"_blank\">enoto dela</a> \n (za povezavo z bazo podatkov in upravljanje transakcij), <a href=\"https://docs.abp.io/en/abp/latest/Exception-Handling\" target=\"_blank\">obravnavanje izjem</a> \n , <a href=\"https://docs.abp.io/en/abp/latest/Validation\" target=\"_blank\">preverjanje</a> \n \n in <a href=\"https://docs.abp.io/en/abp/latest/Audit-Logging\" target=\"_blank\">revizijsko beleženje</a> . Zagotavlja veliko več gradnikov za poenostavitev vaših dnevnih razvojnih nalog in osredotočenost na lastno kodo, medtem ko ustvarjate za proizvodnjo pripravljene aplikacije \n .",
    "DevelopYourSolution_Description6": "Lahko si predstavljate, kako dolg in zapleten je lahko ta blok kode, če bi vse naredili ročno.",
    "SuiteCrudGenerationInFewSeconds": "Poleg ročnega kodiranja vaše rešitve lahko z orodjem ABP Suite ustvarite popolnoma delujoče napredne strani CRUD v nekaj minutah. Generira kodo v vašo rešitev, tako da jo lahko natančno prilagodite glede na vaše zahteve po meri.",
    "DeployAnywhere_Description1": "Na koncu dneva imate čisto rešitev .NET. Svojo rešitev lahko namestite na svoj strežnik, na platformo v oblaku, v Kubernetes ali kamor koli želite. Namestite lahko na poljubno število strežnikov. ABP je agnostično orodje za okolje uvajanja.",
    "ExpertiseAbpFramework": "Preizkusite okvir ABP",
    "ExpertiseAbpFramework_Description1": "Želite preseči osnove in pridobiti strokovno znanje s platformo ABP.IO?",
    "FreeDownload": "Brezplačen prenos",
    "Read": "Preberi",
    "HavingTrouble": "Imeti težave?",
    "HavingTrouble_Description1": "Ali imate težave z razvojem svoje rešitve? Tukaj smo! Uporabite platformo za podporo ABP \n ali pošljite e-pošto, da dobite pomoč neposredno od članov skupine Core ABP Framework.",
    "WeAreHereToHelp_Description1": "Brskate lahko po naših temah pomoči ali iščete med pogostimi vprašanji, \n ali pa nam postavite vprašanje s kontaktnim obrazcem.",
    "OtherModules": "Drugi moduli",
    "OtherModules_Description1": "Račun, beleženje revizije, klepet, komplet CMS, upravljanje datotek, obrazci, GDPR, identiteta, upravljanje jezika, plačilo, Saas in več ...",
    "HowItWorks_DatabaseProviderOptions": "Možnosti ponudnika baze podatkov",
    "SeeFAQ": "Glejte pogosta vprašanja",
    "ReleaseLogs": "Dnevniki izdaje",
    "ReleaseLogs_Tag": "{0} Dnevniki izdaj",
    "ReleaseLogs_Pr": "Zahteva za vlečenje št. {0} - {1}",
    "NoLabels": "Brez nalepk",
    "DoesTheSubscriptionRenewAutomatically": "Ali se naročnina samodejno obnavlja?",
    "DoesTheSubscriptionRenewAutomaticallyExplanation": "ABP Commercial nima modela zaračunavanja samodejnega podaljšanja. Zato <strong>vaša naročnina ne bo samodejno podaljšana</strong> ob koncu vašega licenčnega obdobja. Če želite še naprej imeti ugodnosti ABP Commercial, ga morate ročno obnoviti na <a href=\"/my-organizations\">strani za upravljanje organizacije</a> . Če imate več organizacij, kliknite gumb »Upravljanje« v organizaciji, ki ji poteče veljavnost, in nato kliknite gumb »Podaljšaj zdaj«, da obnovite licenco. Morda si boste želeli ogledati tudi <a href=\"/faq#what-happens-when-license-ends\">Kaj se zgodi, ko mi poteče licenca?</a> razdelek.",
    "ExtraQuestionCreditsFaqTitle": "Ali lahko kupim dodatne kredite za vprašanja podpore?",
    "ExtraQuestionCreditsFaqExplanation": "Ja lahko. Če želite kupiti dodatne kredite za vprašanja, pošljite e-pošto na <a href=\"mailto:info@abp.io\">info@abp.io</a> z imenom vaše organizacije. Tukaj je cenik za dodatne kredite za vprašanja:<ul><li> Paket 50 vprašanj 999 USD</li><li> Paket 25 vprašanj 625 $</li><li> Paket 15 vprašanj 450 $</li></ul>",
    "AlreadyBetaTester": "Ste se že pridružili programu beta tester.",
    "AbpStudio": "ABP Studio",
    "AbpStudio_Description": "ABP Studio je še v razvoju. Lahko izpolnite spodnji obrazec in postanete eden izmed prvih uporabnikov.",
    "AbpStudio_Description1": "ABP Studio je <span class=\"text-highlight-white\">namizna aplikacija za več platform</span> za razvijalce ABP.",
    "AbpStudio_Description2": "<span class=\"text-highlight-white\">Dobro je integriran</span> v ogrodje ABP in želi zagotoviti udobno razvojno okolje za vas z <span class=\"text-highlight-white\">avtomatizacijo stvari, zagotavljanjem vpogledov</span> v vašo rešitev, zaradi česar je <span class=\"text-highlight-white\">razvoj, zagon</span> in <span class=\"text-highlight-white\">uvajanje</span> vaših rešitev veliko lažji.",
    "AbpStudio_ComingSoon": "Kmalu <span class=\"opacity-50 ms-0 ms-md-3 d-block d-md-inline-block \">Načrtovani datum izdaje različice beta: četrto četrtletje leta 2023.</span>",
    "AbpStudio_PlannedPreviewDate": "Načrtovani datum izdaje predogleda: četrto četrtletje leta 2023.",
    "BetaRequest": "Zahteva beta",
    "CreateNewSolutions": "Ustvarite nove rešitve",
    "CreateNewSolutions_Description1": "Z veliko možnostmi lahko preprosto ustvarite od preprostih aplikacij do modularnih monolitnih ali mikrostoritvenih rešitev. Dobite celotno osnovno programsko rešitev, pripravljeno za proizvodnjo, za vaše podjetje.",
    "ArchitectYourSolutions": "Ustvarite svoje rešitve",
    "ArchitectYourSolutions_Description1": "Lažje zgradite monolitno-modularne in mikrostoritvene strukture rešitev z ustvarjanjem modulov ali storitev in vzpostavljanjem odnosov med njimi. Prav tako lahko namestite ali odstranite vnaprej zgrajene aplikacijske module.",
    "ExploreYourSolution": "Raziščite svojo rešitev",
    "ExploreYourSolution_Description1": "ABP Studio prikazuje pogled na visoki ravni komponent v vaši rešitvi in modulov, od katerih je odvisna vaša rešitev. Raziskujete lahko entitete, storitve, HTTP API-je in še veliko več, ne da bi morali odpreti svojo kodno zbirko.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze": "Hitro zaženite rešitve za več aplikacij ali mikrostoritve",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description1": "Zaženite eno, <span class=\"text-highlight-white\">več</span> ali <span class=\"text-highlight-white\">vse storitve</span> z enim klikom. Na ta način je zelo enostavno ustaviti storitev, jo zagnati v Visual Studio za <span class=\"text-highlight-white\">testiranje</span> ali <span class=\"text-highlight-white\">odpravljanje napak</span> .",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description2": "Oglejte si seznam storitev, oglejte si <span class=\"text-highlight-white\">zahteve HTTP v realnem času</span> in <span class=\"text-highlight-white\">število izjem</span> za vsako storitev.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description3": "Oglejte si vse podrobnosti o vseh <span class=\"text-highlight-white\">zahtevah HTTP</span> , ki prihajajo do katere koli storitve.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description4": "Raziščite <span class=\"text-highlight-white\">podrobnosti izjem</span> v realnem času v kateri koli storitvi, preprosto filtrirajte in iščite.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description5": "Prikažite <span class=\"text-highlight-white\">dnevnike aplikacije</span> , filtrirajte po ravni dnevnika ali iščite po besedilu..",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description6": "<span class=\"text-highlight-white\">Brskajte po</span> uporabniškem vmesniku vaše aplikacije, ne da bi zapustili tekalnik rešitev.",
    "IntegrateToYourKubernetesCluster": "Integracija v vašo gručo Kubernetes",
    "IntegrateToYourKubernetesCluster_Description1": "<span class=\"text-highlight-white\">Povežite svoje lokalno razvojno okolje z lokalno ali oddaljeno gručo Kubernetes</span> , kjer ta gruča že izvaja vašo mikrostoritveno rešitev.",
    "IntegrateToYourKubernetesCluster_Description2": "Dostopajte do katere koli storitve v Kubernetesu z imenom storitve DNS, tako kot se izvajajo v vašem lokalnem računalniku.",
    "IntegrateToYourKubernetesCluster_Description3": "<span class=\"text-highlight-white\">Prestrezite katero koli storitev</span> v tej gruči, tako da <span class=\"text-highlight-white\">je ves promet do prestrežene storitve samodejno preusmerjen na vašo storitev</span> , ki se izvaja v vašem lokalnem računalniku. Ko mora vaša storitev uporabiti katero koli storitev v Kubernetesu, se promet preusmeri nazaj v gručo, tako kot se vaša lokalna storitev izvaja znotraj Kubernetesa.",
    "GetInformed": "Bodite obveščeni",
    "Studio_GetInformed_Description1": "Pustite svoje kontaktne podatke, da <span class=\"text-highlight-white\">boste obveščeni</span> , in <span class=\"text-highlight-white\">ga najprej preizkusite,</span> ko bo ABP Studio predstavljen.",
    "Studio_GetInformed_Description2": "Načrtovani datum izdaje predogleda: 3. četrtletje leta 2023.",
    "ThankYou!": "Hvala vam!",
    "SendBetaRequest": "Pošljite zahtevo za različico beta",
    "YouJoinedTheBetaTesterProgram": "Pridružili ste se programu beta preizkuševalcev ABP Studio.",
    "PricingExplanation2": "30-dnevna garancija vračila denarja — <a href=\"/faq#refund-policy\">Več o tem</a>",
    "MoneyBackGuaranteeText": "* 30-dnevna garancija vračila denarja za vse licence! 100 % vračilo za Team, 60 % vračilo za poslovne in poslovne licence v 30 dneh.",
    "MobileApplicationStartupTemplates": "Predloge za zagon mobilnih aplikacij",
    "MobileApplicationStartupTemplates_Description1": "Integrirane predloge za zagon mobilnih aplikacij za vaše komercialne rešitve ABP.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates": "Ustvarite zmogljive poslovne aplikacije z uporabo ABP Mobile Startup Templates",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description1": "ABP Commercial ponuja dve predlogi za zagon mobilnih aplikacij, implementirani z <span class=\"text-highlight\">React Native</span> in <span class=\"text-highlight\">.NET MAUI.</span> Ko ustvarite svojo novo rešitev, ki temelji na ABP, boste imeli tudi osnovne zagonske aplikacije, povezane z vašimi zalednimi API-ji.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description2": "Aplikacija ima vnaprej vgrajen cikel žetonov za preverjanje pristnosti, <span class=\"text-highlight\">podporo za več jezikov, podporo za več najemnikov, prijavo, pozabljeno geslo, upravljanje profilov in stran za upravljanje uporabnikov</span> . Dodate lahko svojo lastno poslovno logiko in jo prilagodite svojim zahtevam.",
    "TwoFrameworkOptions": "Dve možnosti okvirja",
    "TwoFrameworkOptions_Description": "ABP ponuja tako <span class=\"text-highlight\">React Native</span> kot <span class=\"text-highlight\">.NET MAUI</span> mobilne zagonske predloge. Tako lahko izberete tisto, ki najbolj ustreza vašim potrebam. Obe aplikaciji znova uporabljata kodo z najvišjo stopnjo med platformama iOS in Android.",
    "PreIntegratedToYourBackend": "Vnaprej integriran v vašo zaledje",
    "PreIntegratedToYourBackend_Description": "Mobilne aplikacije ABP so vnaprej integrirane v vaše zaledne API-je. Od strežnika pridobi veljaven žeton za preverjanje pristnosti in naredi overjene zahteve.",
    "MultiLanguage": "Več jezikov",
    "MultiLanguage_Description": "Že vnaprej podpira več kot 10 jezikov. Dodate lahko tudi naslednje jezike.",
    "Arabic": "arabsko",
    "Czech": "češki",
    "English": "angleščina",
    "Hungarian": "madžarski",
    "Finnish": "finščina",
    "French": "francosko",
    "Hindi": "Hindi",
    "Portuguese": "portugalščina",
    "Italian": "italijanščina",
    "Russian": "ruski",
    "Slovak": "slovaški",
    "Turkish": "turško",
    "EngageAndRetainYourCustomersWithABPMobileApps": "Pritegnite in obdržite svoje stranke z mobilnimi aplikacijami ABP",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description1": "Vaše stranke želijo upravljati svoje izdelke in naročnine od koder koli in kadarkoli. To od organizacij zahteva, da ustvarijo mobilne aplikacije, ki strankam omogočajo hitro in nemoteno izpolnjevanje njihovih zahtev.",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description2": "Z mobilnimi aplikacijami ABP lahko ustvarite visokokakovostne izvorne mobilne aplikacije za Android in iOS ... Z uporabo ene kodne baze in brez kompromisov glede varnosti, kakovosti ali razširljivosti.",
    "OneCodeBaseMultipleDevices": "Ena kodna osnova Več naprav",
    "OneCodeBaseMultipleDevices_Description": "Aplikacije ABP Mobile so medplatformske. Pripravljeni so za namestitev in zagon na napravah iOS in Android ter se prilagajajo različnim faktorjem oblike z uporabo ene kodne baze. Razvijalci morajo samo enkrat ustvariti uporabniški vmesnik in sprednjo kodo, kode ni treba prilagajati za vsako napravo, ki jo želite podpirati.",
    "ComesWithTheSourceCode": "Prihaja z izvorno kodo",
    "ComesWithTheSourceCode_Description": "Mobilne aplikacije so opremljene z izvorno kodo. Preprosto prilagodite UX/UI svojih aplikacij, da bodo izpolnjevali smernice blagovne znamke.",
    "Purchase_OneYearPrice": "Cena za 1 leto",
    "Purchase_DeveloperSeatCount": "Število sedežev razvijalcev",
    "Purchase_DevelopersAlreadyIncluded": "{0} razvijalcev je že vključenih",
    "1Year": "1 leto",
    "{0}Years": "{0} let",
    "1YearLicense": "1-letna licenca",
    "{0}YearsLicense": "{0}-letna licenca",
    "1AdditionalDeveloper": "1 dodatni razvijalec",
    "{0}AdditionalDevelopers": "{0} Dodatni razvijalci",
    "Discount": "Popust ({0}%)",
    "Summary": "Povzetek",
    "TrainingPack": "Paket za usposabljanje",
    "TrainingPackDiscount": "Popust na paket treningov",
    "Purchase_OnboardingTraining_Description": "Ta paket usposabljanja v živo velja za razred 8 študentov in ta popust velja samo ob nakupu z novo licenco. <a href=\"{0}\" class=\"text-white\">Nauči se več<i class=\"fa fa-external-link ms-1\"></i></a>",
    "Purchase_Save": "{0}% <span class=\"save ms-1\">prihranite {1} {2}</span>",
    "RemoveBasket": "Odstrani iz košarice",
    "WhyABPIOPlatform?": "Zakaj <span class=\"gradient-commercial\">platforma ABP.IO</span> ?",
    "DocumentAim": "Ta dokument želi odgovoriti na veliko vprašanje:",
    "DocumentAim_Description": "&quot;Zakaj bi morali uporabiti platformo ABP.IO namesto ustvarjanja nove rešitve iz nič?&quot;",
    "DocumentAim_Description2": "Dokument predstavlja izzive gradnje sodobne programske rešitve in pojasnjuje, kako ABP obravnava te izzive.",
    "CreatingANewSolution": "Ustvarjanje nove rešitve",
    "CreatingANewSolution_Description": "Ko morate začeti z novo rešitvijo, si morate zastaviti veliko vprašanj in porabiti morate veliko časa, preden začnete pisati svojo prvo poslovno kodo.",
    "CreatingAnEmptySolution": "Ustvarjanje prazne rešitve",
    "THEPROBLEM": "TEŽAVA",
    "CreatingAnEmptySolution_THEPROBLEM_Description": "Tudi ustvarjanje skoraj prazne rešitve je zahtevno;",
    "CreatingAnEmptySolution_THEPROBLEM_Description2": "Kako organizirate svojo kodno zbirko po projektih?",
    "CreatingAnEmptySolution_THEPROBLEM_Description3": "Kaj so plasti in kako medsebojno delujejo?",
    "CreatingAnEmptySolution_THEPROBLEM_Description4": "Kako se integrirate v knjižnico in sisteme tretjih oseb?",
    "CreatingAnEmptySolution_THEPROBLEM_Description5": "Kako nastaviti avtomatizirane teste?",
    "ABPSOLUTION": "REŠITEV ABP",
    "CreatingAnEmptySolution_ABPSOLUTION_Description": "ABP zagotavlja dobro arhitekturo, večplastno in za proizvodnjo pripravljeno <a href=\"https://docs.abp.io/en/abp/latest/Startup-Templates/Application\" target=\"_blank\">zagonsko rešitev</a> , ki temelji na načelih <a href=\"https://docs.abp.io/en/abp/latest/Domain-Driven-Design\" target=\"_blank\">Domain Driven Design</a> . Rešitev vključuje tudi vnaprej konfigurirano enoto in <a href=\"https://docs.abp.io/en/abp/latest/Testing\" target=\"_blank\">testne</a> projekte integracije za vsako plast.",
    "CommonLibraries": "Skupne knjižnice",
    "CommonLibraries_THEPROBLEM_Description": "Katere knjižnice bi morali uporabiti za izvajanje skupnih zahtev? Ekosistem za razvoj programske opreme je zelo dinamičen, zaradi česar je težko slediti najnovejšim orodjem, knjižnicam, trendom in pristopom.",
    "CommonLibraries_ABPSOLUTION_Description": "ABP vnaprej integrira priljubljene, zrele in posodobljene knjižnice v rešitev. Ni vam treba porabiti časa za njihovo integracijo ali za njihovo komunikacijo med seboj. Delujejo pravilno iz škatle.",
    "UITheme&Layout": "Tema in postavitev uporabniškega vmesnika",
    "UITheme&Layout_THEPROBLEM_Description": "Pri obravnavanju vprašanj uporabniškega vmesnika se pojavi vrsta izzivov. Ti vključujejo vzpostavitev temeljev za odziven, sodoben in prilagodljiv komplet uporabniškega vmesnika z doslednim videzom in množico funkcij, kot so navigacijski meniji, glave, orodne vrstice, noge, pripomočki in drugo.",
    "UITheme&Layout_THEPROBLEM_Description2": "Tudi če se odločite za vnaprej oblikovano temo, lahko brezhibna integracija v vaš projekt zahteva več dni razvoja. Dodatna ovira je nadgradnja tovrstnih tem. Pogosto se struktura HTML/CSS teme prepleta z vašo kodo uporabniškega vmesnika, kar povzroči prihodnje spremembe teme ali nadgradnjo zapletenih nalog. To prepletanje kode in oblikovanja otežuje prilagodljivost prilagajanja v nadaljevanju.",
    "UITheme&Layout_ABPSOLUTION_Description": "ABP Framework ponuja značilen sistem tematiziranja, ki vašo kodo uporabniškega vmesnika osvobodi omejitev teme. Teme obstajajo ločeno, zapakirane kot paketi NuGet ali NPM, zaradi česar je namestitev ali nadgradnja teme nekaj minut. Medtem ko obdržite možnost, da razvijete svojo temo po meri ali integrirate obstoječo, ABP Commercial predstavlja zbirko izpopolnjenih in sodobnih tem.",
    "UITheme&Layout_ABPSOLUTION_Description2": "Poleg tega obstajajo ponudniki komponent uporabniškega vmesnika, kot sta Telerik in DevExpress. Vendar pa ti ponudniki zagotavljajo predvsem posamezne komponente, s čimer na vas nalagajo odgovornost, da vzpostavite svoj sistem postavitve. Ko delate v projektih, ki temeljijo na ABP, lahko te knjižnice neopazno vključite, podobno kot bi to storili v katerem koli drugem projektu.",
    "TestInfrastructure": "Testna infrastruktura",
    "TestInfrastructure_THEPROBLEM_Description": "Vzpostavitev robustnega preskusnega okolja je dolgotrajen podvig. Vključuje nastavitev namenskih testnih projektov znotraj vaše rešitve, skrbno izbiro potrebnih orodij, ustvarjanje storitev in ponarejenih baz podatkov, izdelavo bistvenih osnovnih razredov in pomožnih storitev za zmanjšanje odvečne kode v testih ter obravnavanje različnih povezanih nalog.",
    "TestInfrastructure_ABPSOLUTION_Description": "Zagonske predloge ABP prispejo vnaprej opremljene s konfiguriranimi testnimi projekti, kar vam poenostavi postopek. To pomeni, da lahko že od prvega dne brez odlašanja brez odlašanja začnete pisati svojo začetno enoto ali integracijsko testno kodo.",
    "CodingStandards&Training": "Standardi kodiranja in usposabljanje",
    "CodingStandards&Training_THEPROBLEM_Description": "Ko nastavite rešitev za razvoj, morate razvijalce običajno naučiti, kako sistem deluje in kako ga zgraditi z istimi dogovorjenimi metodami. Tudi če jih usposabljate, je posodabljanje dokumentacije lahko težavno. Sčasoma lahko vsak razvijalec piše kodo na svoj način, zaradi česar se pravila za pisanje kode med seboj razlikujejo.",
    "CodingStandards&Training_ABPSOLUTION_Description": "Rešitev ABP je že lepo organizirana in ima jasne razlage. Vadnice in vodniki po korakih vam natančno pokažejo, kako delati na projektu ABP.",
    "KeepingYourSolutionUpToDate": "Posodabljanje vaše rešitve",
    "KeepingYourSolutionUpToDate_THEPROBLEM_Description": "Ko začnete z razvojem, morate spremljati nove različice knjižnic, ki jih uporabljate za nadgradnje in popravke.",
    "KeepingYourSolutionUpToDate_ABPSOLUTION_Description": "Vse pakete redno posodabljamo na najnovejše različice in jih testiramo pred stabilno izdajo. Ko posodobite ogrodje ABP, so vse njegove odvisnosti nadgrajene na robno tehnologijo.",
    "DRY": "Ne ponavljaj se!",
    "DRY_Description": "Ustvarjanje osnovne rešitve zahteva veliko časa in zahteva dobre arhitekturne izkušnje. Vendar je to šele začetek! Ko začnete razvijati, boste verjetno morali napisati veliko ponavljajoče se kode; super bi bilo, če bi se vse to uredilo samodejno.",
    "DRY_Description2": "ABP avtomatizira in poenostavi ponavljajočo se kodo, kolikor je to mogoče, z upoštevanjem načela konvencije nad konfiguracijo. Vendar vas to ne omejuje, ko morate preklopiti na ročno prestavo. Nadzor je vedno v vaših rokah.",
    "Authentication": "Preverjanje pristnosti",
    "Authentication_THEPROBLEM_Description": "Enotna prijava, integracija Active Directory / LDAP, integracija OpenIddict, družabne prijave, dvofaktorska avtentikacija, pozabljeno/ponastavljeno geslo, aktivacija po e-pošti, registracija novega uporabnika, nadzor kompleksnosti gesla, zaklepanje računa ob neuspelih poskusih, prikaz neuspešnih poskusov prijave ... itd. Vemo, da so vam vse te splošne zahteve znane. Niste sami!",
    "Authentication_ABPSOLUTION_Description": "ABP Framework in komercialna različica zagotavljata vse te standardne stvari, ki so vnaprej implementirane za vas kot modul računa, ki ga je mogoče ponovno uporabiti. Samo omogočite in konfigurirate, kar potrebujete.",
    "CrossCuttingConcerns": "Medsektorske skrbi",
    "CrossCuttingConcerns_THEPROBLEM_Description": "Medsektorski pomisleki so temeljna ponavljajoča se logika, ki jo je treba izvajati za vsak primer uporabe. Nekaj primerov;",
    "CrossCuttingConcerns_THEPROBLEM_Description2": "Začetek transakcij, zaveza ob uspehu in povrnitev ob napakah.",
    "CrossCuttingConcerns_THEPROBLEM_Description3": "Obravnava in poročanje o izjemah, vrnitev ustreznega odziva na napako odjemalcem in obravnavanje primerov napak na strani odjemalca.",
    "CrossCuttingConcerns_THEPROBLEM_Description4": "Izvajanje avtorizacije in validacije, vračanje pravilnih odgovorov in obravnavanje le-teh na strani odjemalca.",
    "CrossCuttingConcerns_ABPSOLUTION_Description": "Ogrodje ABP avtomatizira ali poenostavi vse skupne medsektorske pomisleke. Vi pišete samo kodo, ki je pomembna za vaše podjetje, ABP pa poskrbi za ostalo v skladu s konvencijami.",
    "ArchitecturalInfrastructure": "Arhitekturna infrastruktura",
    "ArchitecturalInfrastructure_THEPROBLEM_Description": "Običajno morate zgraditi infrastrukturo, da pravilno implementirate svojo arhitekturo. Na primer, na splošno implementirate vzorec Repository. Definirate nekaj osnovnih razredov za poenostavitev in standardizacijo za ustvarjanje entitet, storitev, krmilnikov in drugih objektov.",
    "ArchitecturalInfrastructure_ABPSOLUTION_Description": "ABP Framework ponuja vse to in še več. Je zrel in dobro dokumentiran.",
    "EnterpriseApplicationRequirements": "Zahteve za poslovne aplikacije",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description": "Obstaja veliko zahtev, ki jih vedno znova izvajate v vsaki poslovni aplikaciji;",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description2": "Podroben sistem dovoljenj in upravljanje dovoljenj v uporabniškem vmesniku na podlagi vlog in uporabnikov.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description3": "Pisanje revizijskih dnevnikov in zgodovin entitet za sledenje, ko uporabnik spremeni zapis baze podatkov.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description4": "Naredite mehko brisanje svojih entitet, tako da so označene kot izbrisane, namesto da bi jih fizično izbrisali iz zbirke podatkov, in samodejno filtrirajte izbrisane entitete v vaših poizvedbah.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description5": "Ustvarjanje abstrakcij in ovojev za uporabo vaših zalednih API-jev iz kode sprednjega dela.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description6": "Postavljanje v čakalno vrsto in izvajanje opravil v ozadju.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description7": "Upravljanje z več časovnimi pasovi v globalnem sistemu.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description8": "Skupna raba validacije, lokalizacije, avtorizacijske logike med strežnikom in odjemalcem.",
    "EnterpriseApplicationRequirements_ABPSOLUTION_Description": "ABP zagotavlja infrastrukturo za preprosto izvajanje takšnih zahtev. Še enkrat, ne porabite svojega dragocenega časa za to, da bi vse to znova in znova izvajali.",
    "GeneratingInitialCode&Tooling": "Ustvarjanje začetne kode in orodja",
    "GeneratingInitialCode&Tooling_THEPROBLEM_Description": "V tipični spletni aplikaciji boste zgradili veliko podobnih strani. Večina jih bo izvajala podobne operacije CRUD. Večkratno ustvarjanje takšnih strani je zelo dolgočasno in tudi nagnjeno k napakam.",
    "GeneratingInitialCode&Tooling_ABPSOLUTION_Description": "<a href=\"/tools/suite\">ABP Suite</a> lahko v nekaj sekundah ustvari stran CRUD s polnim skladom za vaše subjekte. Ustvarjena koda je večplastna in čista. Izvedene so vse standardne zahteve za validacijo in avtorizacijo. Poleg tega se ustvarijo testni razredi enote. Ko dobite popolnoma delujočo stran, jo lahko spremenite glede na vaše poslovne zahteve.",
    "IntegratingTo3rdPartyLibrariesAndSystems": "Integracija v knjižnice in sisteme drugih proizvajalcev",
    "IntegratingTo3rdPartyLibrariesAndSystems_THEPROBLEM_Description": "Večina knjižnic je zasnovanih na nizki ravni in običajno opravite nekaj dela, da jih pravilno integrirate, ne da bi ponavljali isto integracijsko in konfiguracijsko kodo povsod v vaši rešitvi. Na primer, predpostavimo, da morate uporabiti RabbitMQ za implementacijo vašega porazdeljenega vodila dogodkov. Vse kar želite narediti je; poslati sporočilo v čakalno vrsto in obravnavati dohodna sporočila. Vendar morate razumeti vzorce sporočanja, čakalne vrste in podrobnosti izmenjave. Če želite napisati učinkovito kodo, morate ustvariti skupino za upravljanje povezav, odjemalcev in kanalov. Ukvarjati se morate tudi z izjemami, sporočili ACK, ponovnim povezovanjem z RabbitMQ ob napakah in več.",
    "IntegratingTo3rdPartyLibrariesAndSystems_ABPSOLUTION_Description": "Na primer, ABP-jeva integracija RabbitMQ Distributed Event Bus abstrahira vse te podrobnosti. Sporočila pošiljate in prejemate brez vrveža. Ali morate napisati nizkonivojsko kodo? Ni problema, to lahko vedno storite. ABP vas ne omejuje, ko morate uporabiti funkcije nizke ravni knjižnice, ki jo uporabljate.",
    "WhyNotBuildYourOwnFramework?": "Zakaj ne bi zgradili lastnega ogrodja?",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description": "Vsa infrastruktura, tudi na najpreprostejši način, zahteva veliko časa za izgradnjo, vzdrževanje in dokumentiranje. Sčasoma postane večji in težko ga je vzdrževati v svoji rešitvi. Ločevanje teh v projekt, ki ga je mogoče ponovno uporabiti, je izhodišče za izgradnjo lastnega notranjega okvira.",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description2": "Gradnja, dokumentiranje, usposabljanje in vzdrževanje notranjega okvira je res težko. Če nimate izkušene, predane ekipe za ogrodje, vaše notranje ogrodje hitro postane nedokumentirana podedovana koda, ki je nihče več ne more razumeti in vzdrževati. Po drugi strani pa te okvire običajno razvijata en ali dva razvijalca v skupini. In ti štipendisti postajajo silos znanja. To je dobro za njih, a slabo za podjetje, ker so edina točka neuspeha projekta <a href=\"https://en.wikipedia.org/wiki/Single_point_of_failure\">-SPOF-</a> . Ko zapustijo podjetje, projekt dramatično pade.",
    "WhyNotBuildYourOwnFramework_ABPSOLUTION_Description": "ABP Framework je dobro dokumentiran, zrel in generični aplikacijski okvir, ki ga vodi skupnost. Ekipa zelo izkušenih razvijalcev se močno trudi, da bi bil posodobljen, enostaven za razumevanje in udoben za uporabo. Z uporabo takšnega stabilnega ogrodja se lahko osredotočite na lastno poslovno kodo in dobite pomoč pri ogrodju od strokovnjakov, kadar koli jo potrebujete.",
    "ArchitecturalInfrastructure_Description": "Aplikacije SaaS, modularni ali mikrostoritveni sistemi so najbolj uporabljeni modeli programske opreme podjetja. Izgradnja takšnih sistemov ne zahteva le dobrega razumevanja in izkušenj, temveč zahteva tudi močno programsko infrastrukturo. V nasprotnem primeru se boste zelo potrudili, da bi podprli te arhitekturne podrobnosti v svoji kodni bazi.",
    "Modularity": "Modularnost",
    "Modularity_THEPROBLEM_Description": "Izgradnja resnično modularnega sistema ni enostavna! Vse vidike sistema (zbirko podatkov, entitete, API-je, strani/komponente uporabniškega vmesnika) je mogoče razdeliti na module in vsak modul je mogoče ponovno uporabiti brez drugih. Navadni ASP.NET Core ne zagotavlja takšne modularne arhitekture. Če ga potrebujete, bi morali o tem razmišljati od začetka.",
    "Modularity_ABPSOLUTION_Description": "Ogrodje ABP je rojeno kot modularna struktura za razvoj aplikacij. Vsaka funkcija v ogrodju je razvita tako, da je združljiva z modularnostjo. Dokumentacija in vodniki pojasnjujejo, kako na standarden način razviti module, ki jih je mogoče ponovno uporabiti.",
    "SaaSMultiTenancy": "SaaS / Multi-Tenancy",
    "SaaSMultiTenancy_THEPROBLEM_Description": "<a href=\"https://docs.abp.io/en/abp/latest/Multi-Tenancy\">Multi-Tenancy</a> je pogost način implementacije sistemov SaaS. Vendar se lahko uvedba dosledne infrastrukture z več najemniki zaplete.",
    "SaaSMultiTenancy_ABPSOLUTION_Description": "ABP Framework zagotavlja popolno infrastrukturo za več najemnikov in abstraktno kompleksnost iz vaše poslovne kode. Koda vaše aplikacije bo večinoma zaznavala več najemnikov, medtem ko ogrodje ABP samodejno izolira bazo podatkov, predpomnilnik in druge podrobnosti najemnikov drug od drugega. Podpira enotno bazo podatkov, bazo podatkov na najemnika in hibridne pristope. Pravilno konfigurira knjižnice, kot sta Microsoft Identity in OpenIddict, ki običajno niso združljive z več najemniki.",
    "Microservices": "Mikrostoritve",
    "Microservices_THEPROBLEM_Description": "Izgradnja sistema mikrostoritev zahteva veliko infrastrukturnih podrobnosti: avtentikacija in avtorizacija aplikacij in mikrostoritev ter implementacija asinhronih sporočil in sinhronih (Rest/GRPC) komunikacijskih vzorcev med mikrostoritvami so najbolj temeljna vprašanja.",
    "Microservices_ABPSOLUTION_Description": "Ogrodje ABP zagotavlja storitve, <a href=\"https://docs.abp.io/en/abp/latest/Microservice-Architecture\" target=\"_blank\">vodnike</a> in vzorce, ki vam pomagajo implementirati vašo mikrostoritveno rešitev z uporabo standardnih orodij za industrijo.",
    "Microservices_ABPSOLUTION_Description2": "ABP Commercial gre še korak dlje in ponuja popolno <a href=\"https://docs.abp.io/en/commercial/latest/startup-templates/microservice/index\" target=\"_blank\">zagonsko predlogo</a> za zagon vaše mikrostoritvene rešitve.",
    "PreBuiltModules": "Vnaprej izdelani moduli",
    "PreBuiltModules_THEPROBLEM_Description": "Vsi imamo podobne, a nekoliko drugačne poslovne zahteve. Vendar bi morali vsi znova izumiti kolo, saj koda nikogar ne more neposredno delovati v naši rešitvi. Vsi so vgrajeni deli večje rešitve.",
    "PreBuiltModules_ABPSOLUTION_Description": "ABP Commercial <a href=\"/modules\">modules</a> ponuja veliko aplikacijskih modulov, ki jih je mogoče ponovno uporabiti, kot so plačilo, klepet, upravljanje datotek, poročanje revizijskega dnevnika ... itd. Vse te module je enostavno namestiti v vašo rešitev in delujejo neposredno. Nenehno dodajamo nove module.",
    "PreBuiltModules_ABPSOLUTION_Description2": "Vsi moduli so zasnovani tako, da jih je mogoče prilagoditi vašim poslovnim zahtevam. Če potrebujete popoln nadzor, lahko prenesete celotno izvorno kodo katerega koli modula in jo popolnoma prilagodite glede na vaše posebne poslovne zahteve.",
    "ABPCommunity": "Skupnost ABP",
    "ABPCommunity_Description": "Končno, biti v veliki skupnosti, kjer vsi sledijo podobnim stilom kodiranja in načelom ter si delijo skupno infrastrukturo, prinaša moč, ko imate težave ali potrebujete pomoč pri načrtovalskih odločitvah. Ker kodo pišemo podobno, si lahko veliko bolje pomagamo. ABP je projekt, ki ga podpira skupnost z več kot 10.000 zvezdicami na GitHubu.",
    "ABPCommunity_Description2": "Med razvijalci ABP je preprosto deliti kodo ali celo ponovno uporabne knjižnice. Delček kode, ki deluje za vas, bo deloval tudi za druge. Obstaja veliko vzorcev in vaj, ki jih lahko neposredno implementirate za svojo aplikacijo.",
    "ABPCommunity_Description3": "Ko najamete razvijalca, ki je prej delal z arhitekturo ABP, bo takoj razumel vašo rešitev in začel z razvojem v zelo kratkem času.",
    "WhyAbpIo_Page_Title": "Zakaj platforma ABP.IO?",
    "AbpStudio_Page_Title": "ABP Studio",
    "CampaignInfo": "Kupite novo licenco ali obnovite obstoječo licenco in <span class=\"text-white\">si zagotovite dodatna 2 meseca</span> brez dodatnih stroškov! Ta ponudba velja za vse licenčne načrte. Izkoristite to časovno omejeno promocijo za razširitev dostopa do vrhunskih funkcij in nadgradenj.",
    "HurryUpLastDay": "Pohiti! Zadnji dan: {0}",
    "CreatingCRUDPagesWithABPSuite": "Ustvarjanje strani CRUD z ABP Suite",
    "Testimonials": "Pričevanja",
    "MultipleYearDiscount": "Večletni popust",
    "CampaignDiscountText": "Popust na črni petek",
    "CampaignDiscountName": "Črni petek",
    "CampaignName:BlackFriday": "Črni petek"
  }
}