{
  "culture": "sl",
  "texts": {
    "OrganizationManagement": "Upravljanje organizacije",
    "OrganizationList": "Seznam organizacij",
    "Volo.AbpIo.Commercial:010003": "Niste lastnik te organizacije!",
    "OrganizationNotFoundMessage": "Nobene organizacije ni bilo mogoče najti!",
    "DeveloperCount": "Dodeljeni/skupno število razvijalcev",
    "QuestionCount": "Preostala/skupno število vprašanj",
    "Unlimited": "Neomejeno",
    "Owners": "Lastniki",
    "AddMember": "Dodaj člana",
    "AddOwner": "Dodaj lastnika",
    "AddDeveloper": "Dodaj razvijalce",
    "UserName": "Uporabniško ime",
    "Name": "Ime",
    "EmailAddress": "E-poštni naslov",
    "Developers": "Razvijalci",
    "LicenseType": "Tip licence",
    "Manage": "Upravljaj",
    "StartDate": "Datum začetka",
    "EndDate": "Datum konca",
    "Modules": "Moduli",
    "LicenseExtendMessage": "Končni datum veljavnosti licence je podaljšan na {0}",
    "LicenseUpgradeMessage": "Vaša licenca je nadgrajena na {0}",
    "LicenseExtendAdnUpgradeMessage": "Vaša licenca je bila podaljšana do {0}, vaš licenčni načrt pa je nadgrajen na {1}.",
    "LicenseAddDeveloperMessage": "{0} razvijalcev je bilo dodanih k vaši licenci",
    "Volo.AbpIo.Commercial:010004": "Navedenega uporabnika ni mogoče najti! Uporabnik mora biti registriran.",
    "MyOrganizations": "Moje organizacije",
    "ApiKey": "Ključ API",
    "UserNameNotFound": "Ni uporabnika z uporabniškim imenom {0}",
    "SuccessfullyAddedToNewsletter": "Hvala, ker ste se naročili na naše novice!",
    "MyProfile": "Moj profil",
    "EmailNotValid": "Vnesite veljaven e-poštni naslov.",
    "JoinOurMarketingNewsletter": "Pridružite se našemu marketinškemu glasilu",
    "WouldLikeToReceiveMarketingMaterials": "Rad bi prejel marketinško gradivo, kot so ponudbe izdelkov in posebne ponudbe.",
    "StartUsingYourLicenseNow": "Začnite uporabljati svojo licenco zdaj!",
    "WelcomePage": "Dobrodošli stran",
    "UnsubscriptionExpireEmail": "Odjavite se od e-poštnih opomnikov o datumu poteka licence",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Ta e-poštna naročnina vsebuje samo opomnik na datum poteka licence.",
    "UnsubscribeFromLicenseExpireEmails": "Če ne želite prejemati e-poštnih sporočil o datumu poteka veljavnosti licence, se lahko kadar koli odjavite.",
    "Unsubscribe": "Odjavi se",
    "NotOrganizationMember": "Niste član nobene organizacije.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Uspešno odjavljen",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "E-poštnih sporočil z opomnikom o datumu poteka licence ne boste več prejemali.",
    "IndexPageHeroSection": "<span class=\"first-line\">Popolna</span><span class=\"second-line\"> platforma za spletno razvoj</span><span class=\"third-line\">vgrajena <img src= \"{0}\" width=\"110\" class=\"ml-1\" /> okvir</span>",
    "AbpCommercialShortDescription": "ABP Commercial ponuja vnaprej izdelane aplikacijske module, orodja za hiter razvoj aplikacij, profesionalne teme uporabniškega vmesnika, vrhunsko podporo in še več.",
    "LiveDemo": "Demo v živo",
    "GetLicence": "Pridobite licenco",
    "Application": "Aplikacija",
    "StartupTemplates": "Predloge za zagon",
    "Startup": "Začeti",
    "Templates": "Predloge",
    "Developer": "Razvijalec",
    "Tools": "Orodja",
    "Premium": "Premium",
    "PremiumSupport": "Premium podpora",
    "PremiumForumSupport": "Premium forum podpora",
    "UI": "uporabniški vmesnik",
    "Themes": "Teme",
    "JoinOurNewsletter": "Pridružite se našemu glasilu",
    "Send": "Pošlji",
    "Learn": "Naučite se",
    "AdditionalServices": "Dodatne storitve",
    "WhatIsABPFramework": "KAJ JE OKVIR ABP?",
    "OpenSourceBaseFramework": "Odprtokodni osnovni okvir",
    "ABPFrameworkExplanation": "<p class=\"lead\">ABP Commercial temelji na ABP Framework, odprtokodnem in skupnostno usmerjenem ogrodju spletnih aplikacij za ASP.NET Core.</p><p>ABP Framework zagotavlja odlično infrastrukturo za pisanje, ki jo je mogoče vzdrževati in je razširljivo. in kodo, ki jo je mogoče preizkusiti z najboljšimi praksami.</p><p>Vgrajeno in integrirano v priljubljena orodja, ki jih že poznate. Nizka krivulja učenja, enostavna prilagoditev, udoben razvoj.</p>",
    "Modular": "Modularno",
    "MicroserviceCompatible": "Združljivo z mikroservisom",
    "DomainDrivenDesignInfrastructure": "Domain Driven Design Infrastruktura",
    "MultiTenancy": "Več najemno",
    "DistributedMessaging": "Porazdeljeno sporočanje",
    "DynamicProxying": "Dinamično proxy",
    "BackgroundJobs": "Delovna mesta v ozadju",
    "AuditLogging": "Revizijsko beleženje",
    "BLOBStoring": "Shranjevanje BLOB-jev",
    "BundlingMinification": "Združevanje in pomanjševanje",
    "AdvancedLocalization": "Napredna lokalizacija",
    "ManyMore": "Veliko več",
    "ExploreTheABPFramework": "Raziščite okvir ABP",
    "WhyUseTheABPCommercial": "Zakaj uporabljati reklamo ABP?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\">Izdelava spletnih aplikacij za podjetja je lahko zapletena in dolgotrajna.</p><p>ABP Commercial ponuja popolno osnovno infrastrukturo, potrebno za vse sodobne ASP.NET Core poslovnega razreda zasnovane rešitve. Celoten razvojni cikel je pooblaščen z vgrajenimi funkcijami in moduli ABP od zasnove do uvajanja.</p>",
    "StartupTemplatesShortDescription": "Predloge za zagon omogočajo, da v nekaj sekundah preskočite svoj projekt.",
    "UIFrameworksOptions": "možnosti okvirjev uporabniškega vmesnika;",
    "DatabaseProviderOptions": "Možnosti ponudnika baz podatkov;",
    "PreBuiltApplicationModules": "Vnaprej izdelani aplikacijski moduli",
    "PreBuiltApplicationModulesShortDescription": "Najpogostejše zahteve za aplikacije so že razvite za vas kot module za večkratno uporabo.",
    "Account": "račun",
    "Blogging": "Bloganje",
    "Identity": "Identiteta",
    "IdentityServer": "Identity Server",
    "Saas": "Saas",
    "LanguageManagement": "Jezikovno upravljanje",
    "TextTemplateManagement": "Upravljanje besedilnih predlog",
    "See All Modules": "Glej vse module",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "ABP Suite je dopolnilno orodje k ABP Commercial.",
    "AbpSuiteExplanation": "Omogoča vam izdelavo spletnih strani v nekaj minutah. To je globalno orodje .NET Core, ki ga je mogoče namestiti iz ukazne vrstice. Lahko ustvari novo rešitev ABP, generira strani CRUD iz baze podatkov na front-end.",
    "Details": "Podrobnosti",
    "LeptonTheme": "Leptonova tema",
    "ProfessionalModernUIThemes": "Profesionalne, sodobne teme uporabniškega vmesnika",
    "LeptonThemeExplanation": "Lepton ponuja paleto skrbniških tem Bootstrap, ki služijo kot trdna podlaga za vsak projekt, ki zahteva skrbniško nadzorno ploščo.",
    "DefaultTheme": "Privzeta tema",
    "MaterialTheme": "Materialna tema",
    "Default2Theme": "Privzeta 2 tema",
    "DarkTheme": "Temna tema",
    "DarkBlueTheme": "Temno modra tema",
    "LightTheme": "Svetla tema",
    "ProudToWorkWith": "Ponosen na sodelovanje",
    "OurConsumers": "Na tisoče podjetij in razvijalcev v več kot 70 državah po vsem svetu se zanaša na ABP Commercial.",
    "JoinOurConsumers": "Pridružite se jim in hitro sestavite neverjetne izdelke.",
    "AdditionalServicesExplanation": "Potrebujete dodatne storitve ali storitve po meri? <strong>Mi in naši partnerji lahko zagotovimo;</strong>",
    "CustomProjectDevelopment": "Razvoj projekta po meri",
    "CustomProjectDevelopmentExplanation": "Namenski razvijalci za vaše projekte po meri.",
    "PortingExistingProjects": "Prenos obstoječih projektov",
    "PortingExistingProjectsExplanation": "Selitev vaših starih projektov na platformo ABP.",
    "LiveSupport": "Podpora v živo",
    "LiveSupportExplanation": "Možnost podpore na daljavo v živo, ko jo potrebujete.",
    "Training": "Usposabljanje",
    "TrainingExplanation": "Namensko usposabljanje za vaše razvijalce.",
    "OnBoarding": "Na vkrcanje",
    "OnBoardingExplanation": "Pomagajte pri nastavitvi okolja za razvoj, CI in CD.",
    "PrioritizedTechnicalSupport": "Prednostna tehnična podpora",
    "PremiumSupportExplanation": "Poleg velike podpore skupnosti za okvir ABP, naša skupina za podporo odgovarja na tehnična vprašanja in težave komercialnih uporabnikov z visoko prednostjo.",
    "SeeTheSupportOptions": "Glejte Možnosti podpore",
    "Contact": "Kontakt",
    "TellUsWhatYouNeed": "Povejte nam, kaj potrebujete.",
    "YourMessage": "Tvoje sporočilo",
    "YourFullName": "Tvoje polno ime",
    "EmailField": "Email naslov",
    "YourEmailAddress": "Vaš email naslov",
    "HowMayWeHelpYou": "Kako vam lahko pomagamo?",
    "SendMessage": "Pošlji sporočilo",
    "Success": "uspeh",
    "WeWillReplyYou": "Prejeli smo vaše sporočilo in vas bomo v kratkem kontaktirali.",
    "GoHome": "Pojdi domov",
    "CreateLiveDemo": "Ustvari demo v živo",
    "RegisterToTheNewsletter": "Registrirajte se za glasilo, če želite prejemati informacije o ABP.IO, vključno z novimi izdajami itd.",
    "EnterYourEmailOrLogin": "Vnesite svoj e-poštni naslov, če želite ustvariti predstavitev, ali <a href=\"{0}\">Prijavite se</a> z obstoječim računom.",
    "ApplicationTemplate": "Predloga aplikacije",
    "ApplicationTemplateExplanation": "Predloga za zagon aplikacije se uporablja za ustvarjanje nove spletne aplikacije.",
    "EfCoreProvider": "Entity Framework (podpira SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\">in druge</a>)",
    "AlreadyIncludedInTemplateModules": "Naslednji moduli so že vključeni in konfigurirani v tej predlogi:",
    "ApplicationTemplateArchitecture": "Ta predloga aplikacije podpira tudi večstopenjsko arhitekturo, kjer so sloj uporabniškega vmesnika, sloj API in storitev preverjanja pristnosti fizično ločeni.",
    "SeeTheGuideOrGoToTheLiveDemo": "Za tehnične informacije o tej predlogi si oglejte vodnik za razvijalce ali obiščite demo v živo.",
    "DeveloperGuide": "Vodnik za razvijalce",
    "ModuleTemplate": "Predloga modula",
    "ModuleTemplateExplanation1": "Želite ustvariti modul in ga ponovno uporabiti v različnih aplikacijah? Ta zagonska predloga pripravi vse za začetek ustvarjanja <strong>aplikacijskega modula</strong> ali <strong>mikrostoritve</strong> za večkratno uporabo.",
    "ModuleTemplateExplanation2": "<p>Za en sam modul lahko podpirate eno ali več ogrodij uporabniškega vmesnika, enega ali več ponudnikov baz podatkov. Predloga za zagon je konfigurirana za zagon in <strong>preskušanje vašega modula</strong> v minimalni aplikaciji poleg infrastrukture za testiranje enote in integracije. </p> <p>Oglejte si vodnik za razvijalce za tehnične informacije o tej predlogi.</p>",
    "WithAllStyleOptions": "z vsemi stilskimi možnostmi",
    "Demo": "Demo",
    "SeeAllModules": "Glejte Vsi moduli",
    "ABPCLIExplanation": "ABP CLI (vmesnik ukazne vrstice) je orodje ukazne vrstice za izvajanje nekaterih običajnih operacij za rešitve, ki temeljijo na ABP.",
    "ABPSuiteEasilyCURD": "ABP Suite je orodje, ki vam omogoča preprosto ustvarjanje strani CRUD",
    "WeAreHereToHelp": "Tukaj smo za <span class=\"zero-text\">pomoč</span>",
    "BrowseOrAskQuestion": "Brskate lahko po naših temah pomoči ali iščete po pogostih vprašanjih ali pa nam postavite vprašanje z uporabo <a href=\"{0}\" class=\"text-success\">kontaktnega obrazca</a>.",
    "SearchQuestionPlaceholder": "Iščite v pogosto zastavljenih vprašanjih",
    "WhatIsTheABPCommercial": "Kaj je reklama ABP?",
    "WhatAreDifferencesThanAbpFramework": "Kakšne so razlike med odprtokodnim okvirom ABP in ABP Commercial?",
    "ABPCommercialExplanation": "ABP Commercial je nabor vrhunskih modulov, orodij, tem in storitev, zgrajenih na vrhu odprtokodnega <a target=\"_blank\" href=\"{0}\">okvirja ABP</a>. ABP Commercial razvija in podpira ista ekipa, ki stoji za okvirom ABP.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\">Ogrodje ABP</a> je modularno, tematsko ogrodje za razvoj aplikacij za ASP.NET Core, združljivo z mikro storitvami. Zagotavlja popolno arhitekturo in močno infrastrukturo, da se osredotočite na lastno poslovno kodo, namesto da se ponavljate za vsak nov projekt. Temelji na najboljših praksah razvoja programske opreme in priljubljenih orodjih, ki jih že poznate. </p> <p> Okvir ABP je popolnoma brezplačen, odprtokoden in usmerjen v skupnost. Ponuja tudi brezplačno temo in nekaj vnaprej izdelanih modulov (npr. upravljanje identitete in upravljanje najemnikov).</p>",
    "VisitTheFrameworkVSCommercialDocument": "Za več informacij obiščite naslednjo povezavo <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial poleg okvira ABP dodaja naslednje prednosti;",
    "Professional": "Profesionalni",
    "UIThemes": "Teme uporabniškega vmesnika",
    "EnterpriseModules": "Za podjetja pripravljeni, bogati s funkcijami, vnaprej izdelani <a href=\"{0}\">aplikacijski moduli</a> (npr. upravljanje strežnika Identity Server, upravljanje SaaS, upravljanje jezikov)",
    "ToolingToSupport": "Orodja za podporo vaši razvojni produktivnosti (npr. <a href=\"{0}\">ABP Suite</a>)",
    "PremiumSupportLink": "Premium <a href=\"{0}\" target=\"_blank\">podpora</a>",
    "WhatDoIDownloadABPCommercial": "Kaj prenesem, ko kupim ABP Commercial?",
    "CreateUnlimitedSolutions": "Ko kupite licenco ABP Commercial, boste lahko ustvarili neomejene rešitve, kot je opisano v dokumentu <a href=\"{0}\">Kako začeti</a>.",
    "ABPCommercialSolutionExplanation": "Ko ustvarite novo aplikacijo, dobite rešitev Visual Studio (zagonsko predlogo), ki temelji na vaših željah. Prenesena rešitev ima komercialne module in teme že nameščene in konfigurirane za vas. Če želite, lahko odstranite vnaprej nameščen modul ali dodate drug modul. Vsi moduli in teme se privzeto uporabljajo kot paketi NuGet/NPM.",
    "StartDevelopWithTutorials": "Prenesena rešitev je dobro zasnovana in dokumentirana. Na podlagi <a href=\"{0}\">vadnic</a> lahko začnete razvijati svojo poslovno kodo",
    "TryTheCommercialDemo": "Poskusite lahko <a href=\"{0}\">demo</a> in si ogledate vzorčno aplikacijo, ustvarjeno s pomočjo zagonske predloge ABP Commercial.",
    "HowManyProducts": "Koliko različnih izdelkov/rešitev lahko izdelam z uporabo ABP Commerciala?",
    "HowManyProductsExplanation": "Za ustvarjanje projekta ABP ni omejitev. Ustvarite lahko toliko projektov, kot želite, jih razvijete in naložite na različne strežnike.",
    "HowManyDevelopers": "Koliko razvijalcev lahko dela na reklami ABP?",
    "HowManyDevelopersExplanation": "Licence ABP Commercial so na razvijalca. Različne vrste licenc imajo različne omejitve za razvijalce. Vendar pa lahko vsaki vrsti licence dodate več razvijalcev, kadar koli potrebujete. Za vrste licenc, omejitve razvijalcev in dodatne stroške razvijalcev si oglejte <a href=\"{0}\">stran s cenami</a>.",
    "ChangingLicenseType": "Ali lahko pozneje nadgradim svojo vrsto licence?",
    "ChangingLicenseTypeExplanation": "Lahko nadgradite na višjo licenco tako, da doplačate razliko v obdobju aktivne licence. Ko nadgradite na višji licenčni načrt, prejmete prednosti novega načrta, vendar nadgradnja licence ne spremeni datuma poteka licence. Poleg tega lahko svoji obstoječi licenci dodate tudi nova mesta za razvijalce, glejte »Koliko razvijalcev lahko dela na ABP Commercial?«",
    "LicenseExtendUpgradeDiff": "Kakšna je razlika med podaljšanjem licence in nadgradnjo?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Razširitev:</strong> S podaljšanjem/obnovitvijo licence boste še naprej prejemali vrhunsko podporo in večje posodobitve za module in teme. Poleg tega boste lahko nadaljevali z ustvarjanjem novih projektov. Še vedno boste lahko uporabljali zbirko ABP Suite, ki pospeši vaš razvoj.<hr/><strong>Nadgradnja:</strong> Z nadgradnjo vaše licence boste napredovali v višji licenčni načrt, ki vam bo omogočil dodatne ugodnosti . Če želite preveriti razlike med licenčnimi načrti, glejte <a href=\"/pricing\">tabelo za primerjavo licenc</a>.<strong>Po drugi strani pa se datum poteka licence ne bo spremenil, ko nadgradite!</strong> >Če želite podaljšati končni datum licence, morate podaljšati licenco.",
    "LicenseRenewalCost": "Kakšni so stroški podaljšanja licence po 1 letu?",
    "LicenseRenewalCostExplanation": "Cena podaljšanja (podaljšanja) standardne licence ekipe je {0} $, standardne poslovne licence {1} $ in standardne licence za podjetje je {2} $. Če ste že stranka, se <a href='{3}' target='_blank'>prijavite v svoj račun</a> in si oglejte razpoložljive cene za podaljšanje.",
    "HowDoIRenewMyLicense": "Kako podaljšam licenco?",
    "HowDoIRenewMyLicenseExplanation": "Licenco lahko podaljšate tako, da se pomaknete na <a href='{0}' target='_blank'>stran za upravljanje organizacije</a>. Če želite izkoristiti naše znižane cene zgodnjega podaljšanja, se prepričajte, da ste jo podaljšali, preden vam poteče licenca. Ne skrbite, da ne boste vedeli, kdaj se izteče vaša priložnost za zgodnjo obnovo. Pred potekom naročnine boste prejeli 3 e-poštna sporočila z opomnikom. Poslali jih bomo 30 dni, 7 dni in 1 dan pred iztekom.",
    "IsSourceCodeIncluded": "Ali moja licenca vključuje izvorno kodo komercialnih modulov in tem?",
    "IsSourceCodeIncludedExplanation1": "Odvisno od vrste licence, ki ste jo kupili:",
    "IsSourceCodeIncludedExplanation2": "<strong>Ekipa</strong>: Vaša rešitev uporablja module in teme kot paketa NuGet in NPM. Ne vključuje njihove izvorne kode. Na ta način lahko te module in teme enostavno nadgradite, kadar koli je na voljo nova različica. Vendar pa ne morete dobiti izvorne kode modulov in tem.",
    "IsSourceCodeIncludedExplanation3": "<strong>Podjetje/podjetje</strong>: Poleg licence ekipe lahko prenesete izvorno kodo katerega koli modula ali teme, ki jo potrebujete. Lahko celo odstranite reference paketa NuGet/NPM za določen modul in dodate njegovo izvorno kodo neposredno svoji rešitvi, da jo popolnoma spremenite.",
    "IsSourceCodeIncludedExplanation4": "<p>Vključitev izvorne kode modula v vašo rešitev vam daje največjo svobodo pri prilagajanju tega modula. Vendar takrat modula ne bo mogoče samodejno nadgraditi, ko bo izdana nova različica.</p><p>Nobena od licenc ne vključuje izvorne kode zbirke ABP Suite, ki je zunanje orodje, ki za vas ustvari kodo in vam pomaga. za vaš razvoj.</p><p>Glejte <a href=\"{0}\">stran s cenami</a> za druge razlike med vrstami licenc.</p>",
    "ChangingDevelopers": "Ali lahko v prihodnosti spremenim registrirane razvijalce svoje organizacije?",
    "ChangingDevelopersExplanation": "Poleg dodajanja novih razvijalcev vaši licenci lahko spremenite tudi obstoječe razvijalce (lahko odstranite razvijalca in dodate novega na isto mesto) brez dodatnih stroškov.",
    "WhatHappensWhenLicenseEnds": "Kaj se zgodi, ko se moje licenčno obdobje konča?",
    "WhatHappensWhenLicenseEndsExplanation1": "Vrsta licence ABP Commercial je <a href=\"{0}\" target=\"_blank\">trajna licenca</a>. Po poteku licence lahko nadaljujete z razvojem svojega projekta. In licence vam ni treba podaljšati. Vaša licenca je priložena enoletnemu načrtu za posodobitev in podporo. Če želite še naprej prejemati nove funkcije, izboljšave zmogljivosti, popravke napak, podporo in še naprej uporabljati ABP Suite, morate obnoviti licenco. Ko vaša licenca poteče, ne boste prejeli naslednjih ugodnosti;",
    "WhatHappensWhenLicenseEndsExplanation2": "Z uporabo ABP Commercial ne morete ustvarjati novih rešitev, lahko pa za vedno razvijate svoje obstoječe aplikacije.",
    "WhatHappensWhenLicenseEndsExplanation3": "Prejeli boste lahko posodobitve za module in teme v vaši MAJOR različici (razen različic RC ali Preview). Na primer; če uporabljate v3.2.0 modula, lahko še vedno dobite posodobitve za v3.x.x (v3.3.0, v3.5.2 ... itd.) tega modula. Vendar ne morete dobiti posodobitev za naslednjo večjo različico (na primer v4.x, v5.x). Na primer, ko je vaša licenca potekla, je bila najnovejša izdaja v4.4.3 in najnovejša različica za predogled v5.0.0-rc.2, lahko dostopate do v4.X.X, vendar ne morete dostopati do v5.X.X.",
    "WhatHappensWhenLicenseEndsExplanation4": "Po prenehanju licence ne morete namestiti novih modulov in tem, ki so bili dodani platformi ABP Commercial.",
    "WhatHappensWhenLicenseEndsExplanation5": "Ne morete uporabljati ABP Suite.",
    "WhatHappensWhenLicenseEndsExplanation6": "Ne morete več dobiti <a href=\"{0}\">premium podpore</a>.",
    "WhatHappensWhenLicenseEndsExplanation7": "Licenco lahko podaljšate (obnovite), če želite še naprej uživati te ugodnosti. Če podaljšate licenco v <strong>1 mesecu</strong> po poteku licence, bodo uveljavljeni naslednji popusti: licenca ekipe {0} % popusta, poslovna licenca {1} % popusta, licenca podjetja {2} % popusta .",
    "WhenShouldIRenewMyLicense": "Kdaj naj podaljšam licenco?",
    "WhenShouldIRenewMyLicenseExplanation": "Če licenco podaljšate v <strong>1 mesecu</strong> po poteku licence, bodo uporabljeni naslednji popusti: licenca za ekipo {0} % popusta, poslovna licenca {1} % popusta, licenca za podjetje {2} % popusta . Če podaljšate licenco <strong>1 mesec</strong> po datumu poteka veljavnosti licence, bo cena podaljšanja enaka nakupni ceni licence in pri podaljšanju ne bo popusta.",
    "TrialPlan": "Ali imate poskusni načrt?",
    "TrialPlanExplanation": "Za zdaj ABP Commercial nima načrta za preskus. Za licence ekipe nudimo 30-dnevno garancijo vračila denarja. Zahtevate lahko samo vračilo kupnine v prvih 30 dneh. Za licence Business in Enterprise nudimo 60 % vračilo v 30 dneh. To je zato, ker licence Business in Enterprise vključujejo celotno izvorno kodo vseh modulov in tem.",
    "DoYouAcceptBankWireTransfer": "Ali sprejemate bančno nakazilo?",
    "DoYouAcceptBankWireTransferExplanation": "Da, sprejemamo bančno nakazilo.<br />Ko pošljete licenčnino prek bančnega nakazila, nam pošljite e-pošto na accounting@abp.io vaše potrdilo o prejemu in vrsto zahtevane licence. Naši podatki o mednarodnem bančnem računu:",
    "HowToUpgrade": "Kako nadgraditi obstoječe aplikacije, ko je na voljo nova različica?",
    "HowToUpgradeExplanation1": "Ko ustvarite novo aplikacijo z uporabo ABP Commercial, se vsi moduli in tema uporabljajo kot paketa NuGet in NPM. Tako lahko preprosto nadgradite pakete, ko je na voljo nova različica.",
    "HowToUpgradeExplanation2": "Poleg standardnih nadgradenj NuGet/NPM ponuja <a href=\"{0}\">ABP CLI</a> ukaz za posodobitev, ki samodejno poišče in nadgradi vse pakete, povezane z ABP, v vaši rešitvi.",
    "DatabaseSupport": "Kateri sistemi baz podatkov so podprti?",
    "DatabaseSupportExplanation": "Sam ABP Framework je agnostičen za bazo podatkov in lahko po svoji naravi deluje s katerim koli ponudnikom baz podatkov. Za seznam trenutno implementiranih ponudnikov glejte <a href=\"{0}\" target=\"_blank\">dokument za dostop do podatkov</a>.",
    "UISupport": "Kateri okvirji uporabniškega vmesnika so podprti?",
    "Supported": "Podprto",
    "UISupportExplanation": "Sam ABP Framework je agnostičen za okvir uporabniškega vmesnika in lahko deluje s katerim koli ogrodjem uporabniškega vmesnika. Vendar zagonske predloge, uporabniški vmesniki modulov in teme niso bili implementirani za vse okvire uporabniškega vmesnika. Za posodobljen seznam možnosti uporabniškega vmesnika si oglejte <a href=\"{0}\">dokument za začetek</a>.",
    "MicroserviceSupport": "Ali podpira arhitekturo mikro storitev?",
    "MicroserviceSupportExplanation1": "Eden od glavnih ciljev okvira ABP je zagotoviti priročno infrastrukturo za ustvarjanje rešitev za mikro storitve. Oglejte si dokument <a href=\"{0}\">arhitekture mikro storitev</a>, če želite razumeti, kako pomaga pri ustvarjanju sistemov mikrostoritev.",
    "MicroserviceSupportExplanation2": "Vsi moduli ABP Commercial so zasnovani tako, da podpirajo scenarije uvajanja mikro storitev (z lastnim API-jem in bazo podatkov) z upoštevanjem dokumenta <a href=\"{0}\">najboljše prakse za razvoj modulov</a>.",
    "MicroserviceSupportExplanation3": "Ponujamo vzorčno <a href=\"{0}\">demo rešitev mikro storitev</a>, ki prikazuje izvedbo arhitekture mikro storitev, ki vam pomaga ustvariti lastno rešitev.",
    "MicroserviceSupportExplanation4": "Kratek odgovor je torej \"<strong>da, podpira arhitekturo mikro storitev</strong>\".",
    "MicroserviceSupportExplanation5": "Vendar pa je sistem mikro storitev rešitev in vsaka rešitev bo imela različne zahteve, topologijo omrežja, komunikacijske scenarije, možnosti preverjanja pristnosti, odločitve o ločevanju/souporabi baz podatkov, konfiguracije izvajanja, sistemske integracije tretjih oseb in še veliko več.",
    "MicroserviceSupportExplanation6": "ABP Framework in ABP Commercial zagotavljata infrastrukturo za scenarije mikro storitev, module, združljive z mikro storitvami, vzorce in dokumentacijo, ki vam pomaga zgraditi lastno rešitev. Vendar ne pričakujte, da boste neposredno prenesli svojo sanjsko rešitev, ki je bila vnaprej izdelana za vas. Morali ga boste razumeti in združiti nekatere dele glede na vaše zahteve.",
    "WhereCanIDownloadSourceCode": "Kje lahko prenesem izvorno kodo?",
    "WhereCanIDownloadSourceCodeExplanation": "Izvorno kodo vseh modulov ABP, paketov Angular in tem lahko prenesete prek ABP Suite ali ABP CLI. Glejte <a href=\"{0}\">Kako prenesti izvorno kodo?</a>",
    "ComputerLimitation": "Koliko računalnikov se lahko razvijalec prijavi pri razvoju ABP?",
    "ComputerLimitationExplanation": "Izrecno dovoljujemo <strong>{0} računalnikov</strong> na posameznega/licenciranega razvijalca. Kadar koli potrebuje razvijalec, da razvije izdelke ABP Commercial na tretjem računalniku, je treba na naslov licence@abp.io poslati e-pošto z razlago situacije in nato bomo v našem sistemu izvedli ustrezno dodelitev.",
    "RefundPolicy": "Ali imate politiko vračila?",
    "RefundPolicyExplanation": "Vračilo kupnine lahko zahtevate v <strong>30 dneh</strong> po nakupu licence. Vrste licenc Business in Enterprise imajo možnost prenosa izvorne kode, zato vračila niso na voljo za podjetja in podjetja (in vse licence, ki vključujejo pravico do prejema izvorne kode). Poleg tega se za podaljšanje in nakup druge licence ne vračajo.",
    "HowCanIRefundVat": "Kako lahko vrnem DDV?",
    "HowCanIRefundVatExplanation1": "Če ste plačilo izvedli z uporabo 2Checkout, lahko DDV povrnete preko svojega računa 2Checkout:",
    "HowCanIRefundVatExplanation2": "Prijavite se v svoj račun <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\">2Checkout</a>",
    "HowCanIRefundVatExplanation3": "Poiščite ustrezno naročilo in pritisnite \"Vračilo zamudnega DDV-ja\" (vnesite vaš ID za DDV)",
    "HowCanIGetMyInvoice": "Kako lahko dobim svoj račun?",
    "HowCanIGetMyInvoiceExplanation": "Obstajata 2 plačilna prehoda za nakup licence: Iyzico in 2Checkout. Če licenco kupite prek prehoda 2Checkout, ta pošlje račun PDF na vaš e-poštni naslov, glejte <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How- do-invoices-work\">2Izstavljanje računov na blagajni.</a> Če kupujete prek prehoda Iyzico, s povezavo za nakup po meri ali z bančnim nakazilom, bomo pripravili in poslali vaš račun. Račun lahko zahtevate ali prenesete na <a href=\"{0}\">strani za upravljanje organizacije</a>. Preden nas kontaktirate za račun, preverite stran za upravljanje vaše organizacije!",
    "Forum": "Forum",
    "SupportExplanation": "Licence ABP Commercial zagotavljajo vrhunsko forumsko podporo skupine, ki jo sestavljajo strokovnjaki za ABP Framework.",
    "PrivateTicket": "Zasebna vstopnica",
    "PrivateTicketExplanation": "Enterprise License vključuje tudi zasebno podporo z e-pošto in sistemom vstopnic.",
    "AbpSuiteExplanation1": "ABP Suite vam omogoča izdelavo spletnih strani v nekaj minutah. To je globalno orodje .NET Core, ki ga je mogoče namestiti iz ukazne vrstice.",
    "AbpSuiteExplanation2": "Lahko ustvari novo rešitev ABP, generira strani CRUD iz baze podatkov na front-end. Za tehnični pregled glejte <a href=\"{0}\">dokument</a>",
    "FastEasy": "Hitro & enostavno",
    "AbpSuiteExplanation3": "ABP Suite vam omogoča preprosto ustvarjanje strani CRUD. Samo definirati morate svojo entiteto in njene lastnosti, ostalo prepustite ABP Suite namesto vas! ABP Suite ustvari vso potrebno kodo za vašo stran CRUD v nekaj sekundah. Podpira uporabniške vmesnike Angular, MVC in Blazor.",
    "RichOptions": "Bogate možnosti",
    "AbpSuiteExplanation4": "ABP Suite supports multiple UI options like <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\">Razor Pages</a> and <a href=\"https://angular.io\">Angular</a>.It also supports multiple databases like <a href=\"https://www.mongodb.com\">MongoDB</a> and all databases supported by <strong>EntityFramework Core</strong> (MS SQL Server, Oracle, MySql, PostgreSQL and <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\">more</a>).",
    "AbpSuiteExplanation5": "Dobra stvar je, da vam za te možnosti ni treba skrbeti. ABP Suite razume vaš tip projekta in ustvari kodo za vaš projekt ter ustvarjeno kodo postavi na pravo mesto v vašem projektu.",
    "SourceCode": "Izvorna koda",
    "AbpSuiteExplanation6": "ABP Suite ustvari izvorno kodo za vas! Ne ustvarja čarobnih datotek za ustvarjanje spletne strani. ABP Suite ustvari izvorno kodo za <strong>Entity, Repository, Application Service, Code First Migration, JavaScript/TypeScript in CSHTML/HTML</strong> ter potrebne vmesnike. ABP Suite tudi generira kodo v skladu z <strong>najboljšimi praksami</strong> razvoja programske opreme, tako da vam ni treba skrbeti za kakovost ustvarjene kode.",
    "AbpSuiteExplanation7": "Ker imate izvorno kodo gradnikov ustvarjene strani CRUD v pravilnih slojih aplikacije, lahko preprosto spremenite izvorno kodo in v ustvarjeno kodo vnesete svojo logiko po meri/poslovno.",
    "CrossPlatform": "Navzkrižna platforma",
    "AbpSuiteExplanation8": "ABP Suite je zgrajen z .NET Core in je med platformo. Deluje kot spletna aplikacija na vašem lokalnem računalniku. Zaženete ga lahko v <strong>Windows</strong>, <strong>Mac</strong> in <strong>Linux</strong>",
    "OtherFeatures": "Druge funkcije",
    "OtherFeatures1": "Preprosto posodobi pakete <strong>NuGet</strong> in <strong>NPM</strong> na vaši rešitvi.",
    "OtherFeatures2": "Regenerira že ustvarjene strani iz nič.",
    "OtherFeatures3": "Ustvarja nove rešitve",
    "ThanksForCreatingProject": "Hvala, ker ste ustvarili svoj projekt!",
    "HotToRunSolution": "Kako zagnati svojo rešitev?",
    "HotToRunSolutionExplanation": "Če želite izvedeti, kako konfigurirati in zagnati svojo rešitev, glejte dokument o začetnih korakih.",
    "GettingStarted": "Kako začeti",
    "WebAppDevTutorial": "Vadnica za razvijalce spletnih aplikacij",
    "WebAppDevTutorialExplanation": "Glejte vadnico za razvoj spletnih aplikacij za vzorec razvoja po korakih.",
    "Document": "dokument",
    "UsingABPSuiteToCURD": "Uporaba zbirke ABP za generiranje strani in orodja CRUD",
    "SeeABPSuiteDocument": "Glejte dokument ABP Suite, če želite izvedeti, kako uporabljati ABP Suite.",
    "AskQuestionsOnSupport": "Vprašanja lahko postavite na ABP Commercial Support.",
    "Documentation": "Dokumentacija",
    "SeeModulesDocument": "Glejte dokument modulov za seznam vseh komercialnih(pro) modulov in njihovih dokumentov.",
    "Pricing": "Cenitev",
    "PricingExplanation": "Izberite funkcije in funkcionalnosti, ki jih vaše podjetje potrebuje danes. Enostavno nadgradite, ko vaše podjetje raste.",
    "Team": "Ekipa",
    "Business": "Posel",
    "Enterprise": "Enterprise",
    "Custom": "Po meri",
    "IncludedDeveloperLicenses": "Vključene licence za razvijalce",
    "CustomLicenceOrAdditionalServices": "Potrebujete licenco po meri ali dodatne storitve?",
    "CustomOrVolumeLicense": "Licenca po meri ali količinska licenca",
    "LiveTrainingSupport": "Usposabljanje in podpora v živo",
    "AndMore": "in več",
    "AdditionalDeveloperLicense": "Dodatna licenca za razvijalce",
    "ProjectCount": "Število projektov",
    "AllProModules": "Vsi profesionalni moduli",
    "AllProThemes": "Vse profesionalne teme",
    "AllProStartupTemplates": "Vse profesionalne predloge za zagon",
    "SourceCodeOfAllModules": "Izvorna koda vseh modulov",
    "SourceCodeOfAllThemes": "Izvorna koda vseh tem",
    "PerpetualLicense": "Trajna licenca",
    "UnlimitedServerDeployment": "Neomejena namestitev strežnika",
    "YearUpgrade": "1-letna nadgradnja",
    "YearPremiumForumSupport": "1 leto premium forumske podpore",
    "ForumSupportIncidentCountYear": "Število incidentov za podporo forumu/leto",
    "PrivateTicketEmailSupport": "Podpora za zasebne vstopnice in e-pošto",
    "BuyNow": "Kupi zdaj",
    "PayViaAmexCard": "Kako lahko plačam s kartico AMEX?",
    "PayViaAmexCardDescription": "Privzeti plačilni prehod 'Iyzico' lahko zaradi varnostnih ukrepov zavrne nekatere kreditne kartice AMEX. V tem primeru lahko plačate prek alternativnega plačilnega prehoda '2Checkout'.",
    "ThankYou": "Hvala vam",
    "InvalidReCaptchaErrorMessage": "Pri preverjanju reCAPTCHA je prišlo do napake. Prosim poskusite ponovno.",
    "CompanyName": "Ime podjetja",
    "YourCompanyName": "Ime vašega podjetja",
    "FirstName": "Ime",
    "LastName": "Priimek",
    "Optional": "Neobvezno",
    "YourFirstName": "Vaše ime",
    "YourLastName": "Tvoj priimek",
    "SpecialOffer": "Posebna ponudba",
    "SpecialOfferMessage": "Pohiti! Cene veljajo omejen čas.",
    "DiscountRequest": "Zahteva za popust",
    "DiscountRequestDescribeCustomerQuestion": "Kaj od naslednjega vas opisuje?",
    "DiscountRequestStudentEmailMessage": "E-poštni naslov mora vsebovati »edu«.",
    "DiscountRequestDeveloperCount": "Koliko razvijalcev ste?",
    "DiscountRequestDeveloperCountExceedMessage": "Ne ponujamo znižane licence za podjetja, ki imajo več kot {0} razvijalcev.",
    "DiscountRequestOrganizationName": "Ime podjetja/organizacije/šole",
    "Website": "Spletna stran",
    "GithubUsername": "Uporabniško ime GitHub",
    "PhoneNumber": "Telefonska številka",
    "Country": "Država",
    "DescribeABPCommercialUsage": "Opišite projekt, ki ga nameravate razviti na podlagi APB Commercial",
    "DiscountRequestCertifyInformationMessage": "Potrjujem, da so vsi podatki resnični in točni.",
    "DiscountRequestReceived": "Prejeli smo vašo zahtevo za popust.",
    "DiscountRequestStatusMessage": "Odgovorili vam bomo po preverjanju podatkov, ki ste jih posredovali.",
    "MVCOrRazorPages": "MVC (razor Pages)",
    "Angular": "Kotna",
    "Blazor": "Blazor",
    "New": "Novo",
    "MongoDB": "MongoDB",
    "EBookDDD": "Oblikovanje na podlagi domene e-knjig",
    "PracticalGuideForImplementingDDD": "Ta knjiga je praktičen vodnik za implementacijo domensko vodenega oblikovanja z ogrodjem ABP.",
    "IntroducingDDD": "Predstavljamo domensko vodeno oblikovanje",
    "DDDLayersAndCleanArchitecture": "DDD plasti in čista arhitektura",
    "LayeringOfADotnetSolution": "Plasti rešitve .NET",
    "ImplementingDDDBuildingBlocks": "Izvajanje gradnikov DDD",
    "DomainVsApplicationLogic": "Logika domene proti logiki aplikacij",
    "SamplesAndDiscussions": "Vzorci in razprave",
    "Free": "prost",
    "Download": "Prenesi",
    "DDDEBook": "E-knjiga DDD",
    "ImplementingDDD": "Izvajanje domensko vodenega dizajna",
    "DDDBookExplanation": "Praktični vodnik za implementacijo domensko vodenega oblikovanja z ogrodjem ABP.",
    "Overview": "Pregled",
    "DDDBookPracticalGuide": "To je praktičen vodnik za implementacijo Domain Driven Design (DDD). Medtem ko se podrobnosti o implementaciji zanašajo na infrastrukturo ABP Framework, so temeljni koncepti, načela in vzorci uporabni v kakršni koli rešitvi, tudi če ni rešitev .NET.",
    "TableOfContents": "Kazalo",
    "IntroductionToImplementingDDD": "Uvod v izvajanje domensko vodenega oblikovanja",
    "WhatIsDDD": "Kaj je domensko vodeno oblikovanje?",
    "Implementation": "Izvajanje",
    "TheBigPicture": "Velika slika",
    "TheBuildingBlock": "Gradnik",
    "ExampleUseCase": "Primer uporabe",
    "DomainAndApplicationLogic": "Logika domene in logika aplikacij",
    "Author": "Avtor",
    "PublishedOn": "Objavljeno na",
    "Page": "stran",
    "FreeEBook": "Brezplačna e-knjiga",
    "EBookSignInForDownload": "Če želite prenesti e-knjigo, se prijavite",
    "SignIn": "Prijaviti se",
    "Or": "ali",
    "TellUsAboutYourself": "Povejte nam malo o sebi",
    "Surname": "Priimek",
    "DoYouAgreePrivacyPolicy": "Strinjam se s <a href=\"/TermsConditions\">pogoji in določili<a/> in <a href=\"/Privacy\">pravilnikom o zasebnosti</a>.",
    "VolosoftMarketingInformationMessage": "Želim informacije, nasvete in ponudbe o rešitvah za podjetja in organizacije ter drugih Volosoftovih izdelkih in storitvah.",
    "VolosoftSharingInformationMessage": "Želim, da Volosoft deli moje podatke z izbranimi partnerji, da bom lahko prejemal ustrezne informacije o njihovih izdelkih in storitvah.",
    "WeWillSendYouADownloadLink": "Povezava za prenos e-knjige je bila poslana na {0}.<br/> Preverite svojo mapo »Prejeto«/neželeno/neželeno pošto!",
    "InvalidFormInputs": "Prosimo, vnesite veljavne podatke, navedene v obrazcu.",
    "DDDBookEmailBody": "Hvala vam. <br /> Če želite prenesti svojo knjigo, <a href=\"{0}\">kliknite tukaj</a>.",
    "FreeDDDEBook": "Brezplačna e-knjiga DDD",
    "StartFree": "Začnite brezplačno",
    "FreeTrial": "Brezplačen preizkus",
    "AcceptsMarketingCommunications": " Da, rad bi prejemal marketinška sporočila ABP Commercial.",
    "PurposeOfUsage": "Namen uporabe",
    "Industry": "Industrija",
    "Choose": "-Izberi -",
    "CompanyOrganizationName": "Ime podjetja/organizacije",
    "CompanySize": "Velikost podjetja",
    "Next": "Naslednji",
    "StartTrial": "Začnite moj brezplačni preizkus",
    "ContactUsIssues": "Pišite nam, če imate kakršne koli težave",
    "TrialActivatedWarning": "Spoštovani {0}, uporabnik ima pravico do 1 brezplačnega preskusnega obdobja. Poskusno obdobje ste že izkoristili.",
    "ActivationRequirement": "Še en korak vas loči od začetka brezplačnega preizkusa.<br>Na <b>{0}</b> smo poslali e-poštno sporočilo, da aktiviramo vaš račun. Preverite svojo mapo »Prejeto/neželeno/neželeno pošto!",
    "SaveAndDownload": "Shrani in prenesi",
    "CompanyNameValidationMessage": "Ime podjetja je predolgo!",
    "AddressValidationMessage": "Naslov je predolg!",
    "TaxNoValidationMessage": "Št. DDV/DDV je predolga!",
    "NotesValidationMessage": "Polje za opombe je predolgo!",
    "CheckYourBillingInfo": "Račun lahko ustvarite samo enkrat! Preden ustvarite račun, preverite svoje podatke za obračun.",
    "Volo.AbpIo.Commercial:030000": "Poskusno obdobje ste že izkoristili.",
    "Volo.AbpIo.Commercial:030001": "To ime organizacije že obstaja.",
    "StartYourFreeTrial": "Začnite brezplačno preskusno obdobje",
    "TrialLicenseModelInvalidErrorMessage": "Eno od naslednjih polj je neveljavno: ime države, velikost podjetja, panoga ali namen uporabe.",
    "Trial": "Sojenje",
    "Purchased": "Kupljeno",
    "PurchaseLicense": "Nakup licence",
    "PurchaseTrialLicenseMessage": "Datum poteka vaše licence je {0}. <br> Če želite še naprej uporabljati projekte, ki ste jih ustvarili med brezplačnim preizkusnim obdobjem, morate spremeniti licenčne ključe v datotekah <code>appsettings.secrets.json</code>. Tukaj je vaš licenčni ključ:",
    "TrialLicenseExpireMessage": "Uporabljate preizkusno licenco in vaša preizkusna licenca bo potekla {0}.",
    "TryForFree": "Poskusite brezplačno",
    "TrialLicenseExpiredInfo": "Vaša preizkusna licenca je potekla!",
    "CommercialNewsletterConfirmationMessage": "Strinjam se s <a href=\"https://commercial.abp.io/TermsConditions\">pogoji in določili</a> in <a href=\"https://commercial.abp.io/Privacy\">pravilnikom o zasebnosti </a>."
  }
}