{
  "culture": "sv",
  "texts": {
    "OrganizationManagement": "Organisation och ledning",
    "OrganizationList": "Organisationslista",
    "Volo.AbpIo.Commercial:010003": "Du är inte ägare till den här organisationen!",
    "OrganizationNotFoundMessage": "Ingen organisation hittades!",
    "DeveloperCount": "Tilldelade / totala utvecklare",
    "QuestionCount": "Kvarvarande / totala frågor",
    "Unlimited": "Obegränsad",
    "Owners": "Ägare",
    "Owner": "Ägare",
    "AddMember": "Lägg till medlem",
    "AddNewOwner": "Lägg till ny ägare",
    "AddNewDeveloper": "Lägg till ny utvecklare",
    "UserName": "Användarnamn",
    "Name": "Namn",
    "EmailAddress": "E-postadress",
    "Developers": "Utvecklare",
    "LicenseType": "Typ av licens",
    "Manage": "Hantera",
    "SetDefault": "Ställ in som standard",
    "DefaultOrganization": "Standard",
    "StartDate": "Startdatum",
    "EndDate": "Slutdatum",
    "Modules": "Moduler",
    "LicenseExtendMessage": "Slutdatum för din licens förlängs till {0}.",
    "LicenseUpgradeMessage": "Din licens har uppgraderats till {0}.",
    "LicenseExtendAdnUpgradeMessage": "Din licens har förlängts till {0} och din licensplan har uppgraderats till {1}.",
    "LicenseAddDeveloperMessage": "{0} utvecklare läggs till i din licens",
    "Volo.AbpIo.Commercial:010004": "Kan inte hitta den angivna användaren! Användaren måste redan ha registrerats.",
    "MyOrganizations": "Mina organisationer",
    "ApiKey": "API-nyckel",
    "UserNameNotFound": "Det finns ingen användare med användarnamnet {0}",
    "SuccessfullyAddedToNewsletter": "Tack för att du prenumererar på vårt nyhetsbrev!",
    "MyProfile": "Min profil",
    "EmailNotValid": "Vänligen ange en giltig e-postadress.",
    "JoinOurMarketingNewsletter": "Anmäl dig till vårt marknadsföringsnyhetsbrev",
    "WouldLikeToReceiveMarketingMaterials": "Jag skulle vilja få marknadsföringsnyheter som produkterbjudanden och specialerbjudanden.",
    "StartUsingYourLicenseNow": "Börja använda din licens nu!",
    "WelcomePage": "Välkomstsida",
    "UnsubscriptionExpireEmail": "Avregistrera dig från e-postmeddelanden med påminnelser om licensens utgångsdatum",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Denna e-postprenumeration innehåller endast påminnelser om utgångsdatum för din licens.",
    "UnsubscribeFromLicenseExpireEmails": "Om du inte vill få e-postmeddelanden om utgångsdatum för din licens kan du avsluta prenumerationen när som helst.",
    "Unsubscribe": "Avsluta prenumeration",
    "NotOrganizationMember": "Du är inte medlem i någon organisation.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Framgångsrikt avregistrerad",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Du kommer inte längre att få e-postmeddelanden med påminnelser om licensens utgångsdatum.",
    "IndexPageHeroSection": "<span class=\"first-line\">En komplett</span><span class=\"second-line\">webbutvecklingsplattform</span><span class=\"third-line\">byggd på <img src=\"{0}\" width=\"110\" class=\"ml-1\" /> ramverk</span>",
    "AbpCommercialShortDescription": "ABP tillhandahåller förbyggda applikationsmoduler, verktyg för snabb applikationsutveckling, professionella UI-teman, premiumsupport och mycket mer.",
    "LiveDemo": "Live Demo",
    "LiveDemoLead": "<a href=\"{0}\">{1}</a> med ditt ABP-konto, <a href=\"{2}\">{3}</a> till abp.io eller fyll i formuläret nedan för att skapa en live demo nu",
    "ThereIsAlreadyAnAccountWithTheGivenEmailAddress": "Det finns redan ett konto med den angivna e-postadressen: <b>{0}</b><br/> Du bör logga in med ditt konto för att fortsätta.",
    "GetLicence": "Skaffa licens",
    "Application": "Tillämpning",
    "StartupTemplates": "Mallar för nystartade företag",
    "Startup": "Nystartad verksamhet",
    "Templates": "Mallar",
    "Developer": "Utvecklare",
    "Tools": "Verktyg",
    "Premium": "Premium",
    "PremiumSupport": "Premium-support",
    "PremiumForumSupport": "Premium Forum Support",
    "UI": "UI",
    "Themes": "Teman",
    "JoinOurNewsletter": "Anmäl dig till vårt nyhetsbrev",
    "Send": "Skicka",
    "WhatIsABPFramework": "VAD ÄR ABP-RAMVERKET?",
    "OpenSourceBaseFramework": "Basramverk med öppen källkod",
    "ABPFrameworkExplanation": "<p class=\"lead\">ABP kommersiell version är baserad på ABP Framework, en öppen källkod och community-driven webbapplikationsram för ASP.NET Core.</p> <p>ABP Framework ger en utmärkt infrastruktur för att skriva underhållbar, utdragbar och testbar kod med bästa praxis.</p> <p>Byggd på och integrerad med populära verktyg som du redan känner till. Låg inlärningskurva, enkel anpassning, bekväm utveckling.</p> <p>",
    "Modular": "Modulär",
    "MicroserviceCompatible": "Kompatibel med mikrotjänster",
    "DomainDrivenDesignInfrastructure": "Domänstyrd design Infrastruktur",
    "MultiTenancy": "Multi-Tenancy",
    "DistributedMessaging": "Distribuerad meddelandehantering",
    "DynamicProxying": "Dynamisk proxyservering",
    "BackgroundJobs": "Bakgrundsjobb",
    "AuditLogging": "Loggning av revision",
    "BLOBStoring": "BLOB Storing",
    "BundlingMinification": "Paketering och minimering",
    "AdvancedLocalization": "Avancerad lokalisering",
    "ManyMore": "Många fler",
    "ExploreTheABPFramework": "Utforska ABP-ramverket",
    "WhyUseTheABPCommercial": "Varför använda ABP-plattformen?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\">Att bygga webbapplikationer i företagsklass kan vara komplext och tidskrävande.</p><p>ABP erbjuder den perfekta basinfrastrukturen som krävs för alla moderna ASP.NET Core-baserade lösningar i företagsklass. Från design till driftsättning, hela utvecklingscykeln förstärks av ABP: s inbyggda funktioner och moduler.</p> <p>",
    "StartupTemplatesShortDescription": "Startup-mallar gör att du kan starta ditt projekt på några sekunder.",
    "UIFrameworksOptions": "Alternativ för ramverk för användargränssnitt;",
    "DatabaseProviderOptions": "Alternativ för databasleverantör;",
    "PreBuiltApplicationModules": "Förbyggda applikationsmoduler",
    "PreBuiltApplicationModulesShortDescription": "De vanligaste applikationskraven är redan utvecklade åt dig som återanvändbara moduler.",
    "Account": "Konto",
    "Blogging": "Bloggande",
    "Identity": "Identitet",
    "IdentityServer": "Identitetsserver",
    "Saas": "Saas",
    "LanguageManagement": "Språkhantering",
    "TextTemplateManagement": "Hantering av textmallar",
    "See All Modules": "SeAllaModuler",
    "ABPSuite": "ABP-svit",
    "AbpSuiteShortDescription": "ABP Suite är ett kompletterande verktyg till ABP-projekt.",
    "AbpSuiteExplanation": "Det gör att du kan bygga webbsidor på bara några minuter. Det är ett .NET Core Global-verktyg som kan installeras från kommandoraden. Det kan skapa en ny ABP-lösning och generera CRUD-sidor från databasen till frontend.",
    "Details": "Detaljer",
    "LeptonTheme": "Lepton tema",
    "ProfessionalModernUIThemes": "Professionella, moderna UI-teman",
    "LeptonThemeExplanation": "Lepton tillhandahåller en rad Bootstrap-adminteman som fungerar som en solid grund för alla projekt som kräver en adminpanel.",
    "DefaultTheme": "Standardtema",
    "MaterialTheme": "Materialtema",
    "Default2Theme": "Standard 2 Tema",
    "DarkTheme": "Mörkt tema",
    "DarkBlueTheme": "Mörkblått tema",
    "LightTheme": "Ljus tema",
    "ProudToWorkWith": "Stolt över att arbeta med",
    "OurConsumers": "Tusentals företag och utvecklare i över 70 länder världen över förlitar sig på ABP.",
    "JoinOurConsumers": "Anslut dig till dem och bygg fantastiska produkter snabbt.",
    "AdditionalServicesExplanation": "Behöver du ytterligare eller anpassade tjänster?  <strong>Vi och våra partners kan tillhandahålla;</strong>",
    "CustomProjectDevelopment": "Anpassad projektutveckling",
    "CustomProjectDevelopmentExplanation": "Dedikerade utvecklare för dina anpassade projekt.",
    "PortingExistingProjects": "Portning av befintliga projekt",
    "PortingExistingProjectsExplanation": "Migrera dina äldre projekt till ABP-plattformen.",
    "LiveSupport": "Support i realtid",
    "LiveSupportExplanation": "Fjärrsupport i realtid när du behöver det.",
    "Training": "Utbildning",
    "TrainingExplanation": "Dedikerad utbildning för dina utvecklare.",
    "OnBoarding": "Onboarding",
    "OnBoardingExplanation": "Hjälp med att konfigurera dina utvecklings-, CI- och CD-miljöer.",
    "PrioritizedTechnicalSupport": "Prioriterad teknisk support",
    "PremiumSupportExplanation": "Förutom det stora samhällsstödet i ABP-ramverket svarar vårt supportteam på tekniska frågor och problem från de kommersiella användarna med hög prioritet.",
    "SeeTheSupportOptions": "Kolla in supportalternativen",
    "Contact": "Kontakt",
    "TellUsWhatYouNeed": "Berätta för oss vad du behöver.",
    "YourMessage": "Ditt meddelande",
    "YourFullName": "Ditt fullständiga namn",
    "FirstNameField": "Förnamn",
    "LastNameField": "Efternamn",
    "EmailField": "E-postadress",
    "YourEmailAddress": "Din e-postadress",
    "ValidEmailAddressIsRequired": "En giltig e-postadress krävs.",
    "HowMayWeHelpYou": "Hur kan vi hjälpa dig?",
    "SendMessage": "Skicka meddelande",
    "Success": "Framgång",
    "WeWillReplyYou": "Vi har mottagit ditt meddelande och kommer att kontakta dig inom kort.",
    "GoHome": "Gå hem",
    "CreateLiveDemo": "Skapa live-demo",
    "CreateLiveDemoDescription": "När du har skickat in formuläret kommer du att få ett e-postmeddelande med din demolänk.",
    "RegisterToTheNewsletter": "Anmäl dig till nyhetsbrevet för att få information om ABP.IO, inklusive nya releaser etc.",
    "EnterYourEmailOrLogin": "Ange din e-postadress för att skapa din demo eller <a href=\"{0}\">Logga in</a> med ditt befintliga konto.",
    "ApplicationTemplate": "Mall för ansökan",
    "ApplicationTemplateExplanation": "Application startup template används för att skapa en ny webbapplikation.",
    "EfCoreProvider": "Entity Framework (Stödjer SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\">och andra</a>)",
    "AlreadyIncludedInTemplateModules": "Följande moduler är redan inkluderade och konfigurerade i den här mallen:",
    "ApplicationTemplateArchitecture": "Den här applikationsmallen stöder också nivåindelad arkitektur där användargränssnittslagret, API-lagret och autentiseringstjänsten är fysiskt åtskilda.",
    "SeeTheGuideOrGoToTheLiveDemo": "Kolla in utvecklarguiden för teknisk information om den här mallen eller gå till live-demonstrationen.",
    "DeveloperGuide": "Guide för utvecklare",
    "ModuleTemplate": "Mall för modul",
    "ModuleTemplateExplanation1": "Vill du skapa en modul och återanvända den i olika applikationer? Den här startmallen förbereder allt för att börja skapa en återanvändbar <strong>applikationsmodul</strong> eller en <strong>mikrotjänst</strong>.",
    "ModuleTemplateExplanation2": "<p>Du kan stödja enstaka eller flera användargränssnittsramverk, enstaka eller flera databasleverantörer för en enda modul. Startmallen är konfigurerad för att köra och <strong>testa din modul</strong> i en minimal applikation utöver infrastrukturen för enhets- och integrationstest. </p> <p>Se utvecklarguiden för teknisk information om den här mallen.</p> <p>",
    "WithAllStyleOptions": "med alla stilalternativ",
    "Demo": "Demo",
    "SeeAllModules": "Se alla moduler",
    "ABPCLIExplanation": "ABP CLI (Command Line Interface) är ett kommandoradsverktyg för att utföra vissa vanliga åtgärder för ABP-baserade lösningar.",
    "ABPSuiteEasilyCURD": "ABP Suite är ett verktyg som gör att du enkelt kan skapa CRUD-sidor",
    "WeAreHereToHelp": "Vi är här för att <span class=\"zero-text\">hjälpa</span>",
    "BrowseOrAskQuestion": "Du kan bläddra i våra hjälpämnen eller söka i vanliga frågor, eller så kan du ställa en fråga till oss genom att använda <a href=\"{0}\">kontaktformuläret</a>.",
    "SearchQuestionPlaceholder": "Sök i vanliga frågor och svar",
    "WhatIsTheABPCommercial": "Vad är ABP?",
    "WhatAreDifferencesThanAbpFramework": "Vilka är skillnaderna mellan ABP med öppen källkod och den kommersiella versionen av ABP?",
    "AbpCommercialMetaTitle": " {0} | ABP",
    "AbpCommercialMetaDescription": "En omfattande webbutvecklingsplattform på ABP Framework med förbyggda moduler, startmallar, verktyg för snabb utveckling, proffsiga UI-teman och premiumsupport.",
    "ABPCommercialExplanation": "ABP Platform är en uppsättning premiummoduler, verktyg, teman och tjänster som är byggda på toppen av open source <a target=\"_blank\" href=\"{0}\">ABP-ramverket</a>. ABP utvecklas och stöds av samma team som ligger bakom ABP-ramverket.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\">ABP-ramverket</a> är ett modulärt, tematiserbart, mikrotjänstkompatibelt ramverk för applikationsutveckling för ASP.NET Core. Det ger en komplett arkitektur och en stark infrastruktur så att du kan fokusera på din egen affärskod istället för att upprepa dig själv för varje nytt projekt. Det är baserat på bästa praxis för mjukvaruutveckling och populära verktyg som du redan känner till.  </p> <p> ABP-ramverket är helt gratis, öppen källkod och community-driven. Det ger också ett gratis tema och några förbyggda moduler (t.ex. identitetshantering och hyresgästhantering).</p> <",
    "VisitTheFrameworkVSCommercialDocument": "Besök följande länk för mer information <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP kommersiell version lägger till följande fördelar ovanpå ABP-ramverket:",
    "Professional": "Professionell",
    "UIThemes": "Teman för användargränssnitt",
    "EnterpriseModules": "Enterprise ready, funktionsrika, förbyggda <a href=\"{0}\">applikationsmoduler</a> (t.ex. hantering av identitetsserver, SaaS-hantering, språkhantering)",
    "ToolingToSupport": "Verktyg för att stödja din utvecklingsproduktivitet (t.ex. <a href=\"{0}\">ABP Suite</a>)",
    "PremiumSupportLink": "Premium <a href=\"{0}\" target=\"_blank\">Support</a>",
    "WhatDoIDownloadABPCommercial": "Vad laddar jag ner när jag köper den kommersiella versionen av ABP?",
    "CreateUnlimitedSolutions": "När du har köpt en ABP Commercial-licens kan du skapa obegränsade lösningar som beskrivs i dokumentet <a href=\"{0}\">Gå igång</a>.",
    "ABPCommercialSolutionExplanation": "När du skapar en ny applikation får du en Visual Studio-lösning (en startmall) som baseras på dina önskemål. Den nedladdade lösningen har kommersiella moduler och teman som redan är installerade och konfigurerade åt dig. Du kan ta bort en förinstallerad modul eller lägga till en annan modul om du vill. Alla moduler och teman använder NuGet/NPM-paket som standard.",
    "StartDevelopWithTutorials": "Den nedladdade lösningen är väl arkitekterad och dokumenterad. Du kan börja utveckla din egen företagskod baserad på den genom att följa <a href=\"{0}\">handledningarna</a>.",
    "TryTheCommercialDemo": "Du kan prova <a href=\"{0}\">Live Demo</a> för att se ett exempel på en applikation som skapats med hjälp av ABP-startmallen.",
    "HowManyProducts": "Hur många olika produkter/lösningar kan jag bygga med hjälp av ABP?",
    "HowManyProductsExplanation": "Du kan skapa så många projekt du vill under din aktiva licensperiod; det finns ingen gräns! Efter att din licens har löpt ut kan du inte skapa nya projekt, men du kan fortsätta att utveckla de projekt du har laddat ner och distribuera dem till ett obegränsat antal servrar.",
    "HowManyDevelopers": "Hur många utvecklare kan arbeta med ABP?",
    "HowManyDevelopersExplanation": "ABP-licenser är per utvecklare. Olika licenstyper har olika gränser för utvecklare. Du kan dock lägga till fler utvecklare till vilken licenstyp som helst när du behöver. Kolla in sidan <a href=\"{0}\">Planer och priser</a> för licenstyper, utvecklargränser och ytterligare utvecklingskostnader.",
    "ChangingLicenseType": "Kan jag uppgradera min licenstyp senare?",
    "ChangingLicenseTypeExplanation": "Du kan uppgradera till en högre licens genom att betala mellanskillnaden inom din aktiva licensperiod. När du uppgraderar till en högre licensplan får du fördelarna med den nya planen, men licensuppgraderingen ändrar inte licensens utgångsdatum. Dessutom kan du också lägga till nya utvecklarplatser till din befintliga licens, kolla in \"Hur många utvecklare kan arbeta med ABP?\" VANLIGA FRÅGOR.",
    "LicenseExtendUpgradeDiff": "Vad är skillnaden mellan licensförlängning och uppgradering?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Förlängning:</strong> Genom att förlänga/förnya din licens kommer du att fortsätta att få premiumsupport och få större eller mindre uppdateringar för modulerna och teman. Dessutom kommer du att kunna fortsätta skapa nya projekt. Och du kommer fortfarande att kunna använda ABP Suite, vilket påskyndar din utveckling. När du förlänger din licens läggs 1 år till licensens utgångsdatum. <hr/><strong>Uppgradering:</strong> Genom att uppgradera din licens kommer du att befordras till en högre licensplan, vilket gör att du kan få ytterligare fördelar. Kolla in <a href=\"/prissättning\">jämförelsetabellen för licenser</a> för att se skillnaderna mellan licensplanerna. <strong>När du uppgraderar ändras däremot inte licensens utgångsdatum!</strong> För att förlänga licensens slutdatum måste du förlänga din licens.",
    "LicenseRenewalCost": "Vad är kostnaden för licensförnyelse efter 1 år?",
    "LicenseRenewalCostExplanation": "Priset för förnyelse (förlängning) av standard Team License är ${0}, standard Business License är ${1} och standard Enterprise License är ${2}. Om du redan är kund, <a href='{3}' target='_blank'>logga in på ditt konto</a> för att granska den aktuella förnyelseprissättningen.",
    "HowDoIRenewMyLicense": "Hur förnyar jag min licens?",
    "HowDoIRenewMyLicenseExplanation": "Du kan förnya din licens genom att navigera till <a href='{0}' target='_blank'>organisationshanteringssidan</a>. För att dra nytta av våra rabatterade priser för tidig förnyelse, se till att du förnyar innan din licens löper ut. Oroa dig inte för att du inte vet när din möjlighet till tidig förnyelse stängs; du kommer att få 3 påminnelse-e-postmeddelanden innan din prenumeration löper ut. Vi skickar dem 30 dagar, 7 dagar och 1 dag före utgången.",
    "IsSourceCodeIncluded": "Omfattar min licens källkoden för pro-modulerna och teman?",
    "IsSourceCodeIncludedExplanation1": "Beror på vilken licenstyp du har köpt:",
    "IsSourceCodeIncludedExplanation2": "<strong>Team</strong>: Din lösning använder moduler och teman som NuGet- och NPM-paket. Den inkluderar inte deras källkod. På så sätt kan du enkelt uppgradera dessa moduler och teman när en ny version är tillgänglig. Du kan dock inte få källkoden för dessa moduler och teman.",
    "IsSourceCodeIncludedExplanation3": "<strong>Business/Enterprise</strong>: Utöver Team-licensen kan du ladda ner källkoden för alla moduler eller teman du behöver. Du kan till och med ta bort NuGet/NPM-paketreferenserna för en viss modul och lägga till dess källkod direkt i din lösning för att ändra den helt.",
    "IsSourceCodeIncludedExplanation4": "<p>Att inkludera källkoden för en modul i din lösning ger dig maximal frihet att anpassa den modulen. Det kommer dock inte att vara möjligt att automatiskt uppgradera modulen när en ny version släpps.</p> <p>Ingen av licenserna inkluderar källkoden för ABP Suite och ABP Studio, vilket är externa verktyg som genererar kod åt dig och hjälper din utveckling.</p> <p>Kolla in sidan <a href=\"{0}\">Planer och priser</a> för andra skillnader mellan licenstyperna.</p> <",
    "ChangingDevelopers": "Kan jag ändra de registrerade utvecklarna för min organisation i framtiden?",
    "ChangingDevelopersExplanation": "Förutom att lägga till nya utvecklare till din licens kan du också ändra befintliga utvecklare (du kan ta bort en utvecklare och lägga till en ny på samma plats) utan någon extra kostnad.",
    "WhatHappensWhenLicenseEnds": "Vad händer när min licensperiod upphör?",
    "WhatHappensWhenLicenseEndsExplanation1": "ABP-licensen är en <a href=\"{0}\" target=\"_blank\">perpetuell licens</a>. När din licens löper ut kan du fortsätta att utveckla ditt projekt. Och du är inte skyldig att förnya din licens. Din licens levereras med en ettårig uppdaterings- och supportplan direkt ur lådan. För att fortsätta få nya funktioner, prestandaförbättringar, buggfixar, support och fortsätta använda ABP Suite måste du förnya din licens. När din licens löper ut;",
    "WhatHappensWhenLicenseEndsExplanation2": "Du kan inte skapa nya lösningar med hjälp av den kommersiella versionen av ABP, men du kan fortsätta att utveckla dina befintliga applikationer för alltid.",
    "WhatHappensWhenLicenseEndsExplanation3": "Du kommer att kunna få uppdateringar för modulerna och teman inom din MINOR-version (utom RC- eller Preview-versioner). Om du t.ex. använder v3.2.0 av en modul kan du fortfarande få uppdateringar för v3.2.x (v3.2.1, v3.2.5... etc.) av den modulen. Men du kan inte få uppdateringar för nästa större eller mindre version (som v3.3.0, v3.3.3, 4.x.x.. etc.). Till exempel, när din licens löpte ut, den senaste versionen var v4.4.3, och senare publicerade den både 4.4.4-versionen och 4.5.0-versionen, skulle du kunna komma åt v4.4.X men du skulle inte komma åt v4.5.X.",
    "WhatHappensWhenLicenseEndsExplanation4": "Du kan inte installera nya moduler och teman som läggs till i ABP:s kommersiella plattform efter att din licens har upphört.",
    "WhatHappensWhenLicenseEndsExplanation5": "Du kan inte använda ABP Suite.",
    "WhatHappensWhenLicenseEndsExplanation6": "Du kan inte få <a href=\"{0}\">premium support</a> längre.",
    "WhatHappensWhenLicenseEndsExplanation7": "Du kan förlänga (förnya) din licens om du vill fortsätta att få dessa förmåner. Om du förlänger din licens inom <strong>{3} dagar</strong> efter att din licens har löpt ut, kommer följande rabatter att tillämpas: Teamlicens {0}; Företagslicens {1}; Enterprise-licens {2}.",
    "discountForYears": "{0}% rabatt för {1} år",
    "WhatHappensWhenLicenseEndsExplanation8": "De ABP-projekt som du genererar lagras inte på våra servrar. Därför är det ditt ansvar att behålla källkoden som du laddar ner. När din licens löper ut finns det inget sätt att få tag på källkoden för dina genererade ABP-projekt.",
    "WhenShouldIRenewMyLicense": "När ska jag förnya min licens?",
    "WhenShouldIRenewMyLicenseExplanation": "Om du förnyar din licens inom <strong>{3} dagar</strong> efter att din licens har löpt ut, kommer följande rabatter att tillämpas: Teamlicens {0}; Företagslicens {1}; Enterprise-licens {2}. Men om du förnyar din licens efter <strong>{3} dagar</strong> efter licensens utgångsdatum, kommer förnyelsepriset att vara detsamma som licensens inköpspris och det kommer inte att finnas någon rabatt på din förnyelse.",
    "TrialPlan": "Har du en testplan?",
    "TrialPlanExplanation": "Ja, för att starta din kostnadsfria testversion, kontakta <a href=\"mailto:marketing@volosoft.com?subject=ABP - Trial License Request\">marketing@volosoft.com</a>. Vi erbjuder också en 30-dagars pengarna-tillbaka-garanti för Team-licensen, inga frågor ställs! Du kan begära full återbetalning inom de första 30 dagarna efter licensköpet. Vi ger 60% återbetalning inom 30 dagar för Business- och Enterprise-licenser. Detta beror på att Business- och Enterprise-licenserna innehåller den fullständiga källkoden för alla moduler och teman.",
    "DoYouAcceptBankWireTransfer": "Accepterar ni banköverföringar?",
    "DoYouAcceptBankWireTransferExplanation": "Ja, vi accepterar banköverföringar.<br/>När du har skickat licensavgiften via banköverföring, skicka ditt kvitto och önskad licenstyp till accounting@volosoft.com.<br/>Vår internationella bankkontoinformation:",
    "HowToUpgrade": "Hur uppgraderar man befintliga applikationer när en ny version finns tillgänglig?",
    "HowToUpgradeExplanation1": "När du skapar en ny applikation med hjälp av ABP används alla moduler och teman som NuGet- och NPM-paket. På så sätt kan du enkelt uppgradera paketen när en ny version finns tillgänglig.",
    "HowToUpgradeExplanation2": "Förutom de vanliga NuGet/NPM-uppgraderingarna tillhandahåller <a href=\"{0}\">ABP CLI</a> ett uppdateringskommando som automatiskt hittar och uppgraderar alla ABP-relaterade paket i din lösning.",
    "DatabaseSupport": "Vilka databassystem stöds?",
    "DatabaseSupportExplanation": "ABP Framework i sig är databasagnostiskt och kan fungera med alla databasleverantörer genom sin natur. Kolla in <a href=\"{0}\" target=\"_blank\">Data Access-dokumentet</a> för en lista över för närvarande implementerade leverantörer.",
    "UISupport": "Vilka UI-ramverk stöds?",
    "Supported": "Stödd",
    "UISupportExplanation": "ABP Framework är i sig självt agnostiskt och kan fungera med alla användargränssnitt. Startmallar, modul-användargränssnitt och teman implementerades dock inte för alla användargränssnittsramverk. Kolla in <a href=\"{0}\">Gå igång-dokumentet</a> för den uppdaterade listan över användargränssnittsalternativ.",
    "MicroserviceSupport": "Stödjer den microservice-arkitekturen?",
    "MicroserviceSupportExplanation1": "Ett av de viktigaste målen med ABP-ramverket är att tillhandahålla en bekväm infrastruktur för att skapa mikroservicelösningar. Kolla in <a href=\"{0}\">Microservice Architecture-dokumentet</a> för att förstå hur det hjälper till att skapa mikroservicesystem.",
    "MicroserviceSupportExplanation2": "Alla ABP-moduler är utformade för att stödja distributionsscenarier för mikrotjänster (med eget API och egen databas) genom att följa dokumentet <a href=\"{0}\">Module Development Best Practices</a>.",
    "MicroserviceSupportExplanation3": "Vi tillhandahåller ett exempel på <a href=\"{0}\">Microservice Demo Solution</a> som visar en implementering av en mikrotjänstarkitektur för att hjälpa dig att skapa din egen lösning.",
    "MicroserviceSupportExplanation4": "Så det korta svaret är: \"<strong>Ja, det stöder mikroservicearkitektur</strong>\".",
    "MicroserviceSupportExplanation5": "Ett mikrotjänstsystem är dock en lösning och varje lösning kommer att ha olika krav, nätverkstopologi, kommunikationsscenarier, autentiseringsmöjligheter, databasdelning/partitioneringsbeslut, runtime-konfigurationer, integrationer med tredjepartssystem och mycket mer.",
    "MicroserviceSupportExplanation6": "ABP tillhandahåller infrastruktur för microservice-scenarier, microservice-kompatibla moduler, exempel och dokumentation som hjälper dig att bygga din egen lösning. Men förvänta dig inte att direkt ladda ner din drömlösning som är förbyggd åt dig. Du måste förstå den och sammanföra specifika delar baserat på dina krav.",
    "WhereCanIDownloadSourceCode": "Var kan jag ladda ner källkoden?",
    "WhereCanIDownloadSourceCodeExplanation": "Du kan ladda ner källkoden för alla ABP-moduler, Angular-paket och teman via ABP Suite eller ABP CLI. Kolla in <a href=\"{0}\">Hur man laddar ner källkoden?</a>",
    "ComputerLimitation": "Hur många datorer kan en utvecklare logga in på när han utvecklar ABP?",
    "ComputerLimitationExplanation": "Vi tillåter specifikt <strong>{0} datorer</strong> per individ/licensierad utvecklare. När det finns ett behov för en utvecklare att utveckla ABP-baserade produkter på en tredje maskin, ska ett e-postmeddelande skickas till license@abp.io där situationen förklaras, och vi kommer sedan att göra lämplig tilldelning i vårt system.",
    "RefundPolicy": "Har ni någon återbetalningspolicy?",
    "RefundPolicyExplanation": "Du kan begära återbetalning inom <strong>30 dagar</strong> efter ditt licensköp. Licenstyperna Business och Enterprise har alternativ för nedladdning av källkod; därför ger vi en återbetalning på 60 % inom 30 dagar för Business- och Enterprise-licenser. Dessutom görs inga återbetalningar för förnyelser och andra licensköp.",
    "HowCanIRefundVat": "Hur kan jag återbetala moms?",
    "HowCanIRefundVatExplanation1": "Om du gjorde betalningen med 2Checkout kan du återbetala momsen via ditt 2Checkout-konto:",
    "HowCanIRefundVatExplanation2": "Logga in på ditt <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\">2Checkout</a>-konto",
    "HowCanIRefundVatExplanation3": "Leta upp rätt order och tryck på \"Återbetala försenad moms\" (ange ditt momsregistreringsnummer)",
    "HowCanIGetMyInvoice": "Hur kan jag få min faktura?",
    "HowCanIGetMyInvoiceExplanation": "Det finns 2 betalningsgateways för att köpa en licens: Iyzico och 2Checkout. Om du köper din licens via 2Checkout-gatewayen skickar den PDF-fakturan till din e-postadress; kolla in <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How-do-invoices-work\">2Checkout-fakturering.</a> Om du köper via Iyzico-gatewayen, med en anpassad inköpslänk eller via en banköverföring, kommer vi att förbereda och skicka din faktura. Du kan begära eller ladda ner din faktura från <a href=\"{0}\">sidan för organisationshantering</a>. Innan du kontaktar oss för fakturan, kontrollera din organisationshanteringssida!",
    "Forum": "Forum",
    "SupportExplanation": "ABP-licensen ger ett premiumforumstöd av ett team som består av ABP Framework-experter.",
    "PrivateTicket": "Privat biljett",
    "PrivateTicketExplanation": "Enterprise License inkluderar även en privat support med e-post och ärendehanteringssystem.",
    "AbpSuiteExplanation1": "Med ABP Suite kan du skapa webbsidor på bara några minuter. Det är ett globalt .NET Core-verktyg som kan installeras från kommandoraden.",
    "AbpSuiteExplanation2": "Den kan skapa en ny ABP-lösning och generera CRUD-sidor från databasen till frontend. För teknisk översikt se <a href=\"{0}\">dokumentet</a>",
    "FastEasy": "Snabbt och enkelt",
    "AbpSuiteExplanation3": "Med ABP Suite kan du enkelt skapa CRUD-sidor. Du behöver bara definiera din entitet och dess egenskaper och låta resten gå till ABP Suite åt dig! ABP Suite genererar all nödvändig kod för din CRUD-sida på några sekunder. Den stöder Angular, MVC och Blazor användargränssnitt.",
    "RichOptions": "Rika alternativ",
    "AbpSuiteExplanation4": "ABP Suite stöder flera användargränssnittsalternativ som <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\">Razor Pages</a> och <a href=\"https://angular.io\">Angular</a>. Den stöder också flera databaser som <a href=\"https://www.mongodb.com\">MongoDB</a> och alla databaser som stöds av <strong>EntityFramework Core</strong> (MS SQL Server, Oracle, MySql, PostgreSQL och <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\">andra leverantörer...</a>).",
    "AbpSuiteExplanation5": "Det som är bra är att du inte behöver oroa dig för dessa alternativ. ABP Suite förstår din projekttyp och genererar koden för ditt projekt och placerar den genererade koden på rätt plats i ditt projekt.",
    "SourceCode": "Källkod",
    "AbpSuiteExplanation6": "ABP Suite genererar källkoden åt dig! Den genererar inte magiska filer för att generera webbsidan. ABP Suite genererar källkoden för <strong>Entity, Repository, Application Service, Code First Migration, JavaScript/TypeScript och CSHTML/HTML</strong> och även nödvändiga gränssnitt. ABP Suite genererar också koden enligt <strong>Best Practices</strong> för programvaruutveckling, så du behöver inte oroa dig för den genererade kodens kvalitet.",
    "AbpSuiteExplanation7": "Eftersom du har källkoden för byggstenarna i den genererade CRUD-sidan i rätt applikationslager kan du enkelt ändra källkoden och lägga till din egen anpassade affärslogik i den genererade koden.",
    "CrossPlatform": "Plattformsoberoende",
    "AbpSuiteExplanation8": "ABP Suite är byggt med .NET Core och är plattformsoberoende. Den körs som en webbapplikation på din lokala dator. Du kan köra den på <strong>Windows</strong>, <strong>Mac</strong> och <strong>Linux</strong>",
    "OtherFeatures": "Andra funktioner",
    "OtherFeatures1": "Uppdaterar enkelt <strong>NuGet</strong>- och <strong>NPM</strong>-paket på din lösning.",
    "OtherFeatures2": "Återskapar redan genererade sidor från början.",
    "OtherFeatures3": "Skapar nya lösningar",
    "ThanksForCreatingProject": "Ditt projekt har skapats framgångsrikt!",
    "HotToRunSolution": "Hur kör du din lösning?",
    "HotToRunSolutionExplanation": "I dokumentet Kom igång kan du läsa om hur du konfigurerar och kör din lösning.",
    "GettingStarted": "Komma igång",
    "WebAppDevTutorial": "Handledning för utveckling av webbapplikationer",
    "WebAppDevTutorialExplanation": "I handledningsdokumentet för utveckling av webbapplikationer finns ett exempel på utveckling steg för steg.",
    "Document": "Dokument",
    "UsingABPSuiteToCURD": "Använda ABP Suite för generering av CRUD-sidor och verktyg",
    "SeeABPSuiteDocument": "Kolla in ABP Suite-dokumentet för att lära dig användningen av ABP Suite.",
    "AskQuestionsOnSupport": "Du kan ställa frågor på ABP Support.",
    "Documentation": "Dokumentation",
    "SeeModulesDocument": "Se sidan med moduler för en lista över alla PRO-moduler.",
    "Pricing": "Prissättning",
    "PricingExplanation": "Välj de egenskaper och funktioner som ditt företag behöver idag. Uppgradera enkelt när ditt företag växer.",
    "Team": "Team",
    "Business": "Företag",
    "Enterprise": "Företag",
    "Custom": "Anpassad",
    "IncludedDeveloperLicenses": "Inkluderade utvecklarlicenser",
    "CustomLicenceOrAdditionalServices": "Behöver du en anpassad licens eller ytterligare tjänster?",
    "CustomOrVolumeLicense": "Anpassad licens eller volymlicens",
    "LiveTrainingSupport": "Utbildning och support i realtid",
    "AndMore": "och mer",
    "AdditionalDeveloperLicense": "Ytterligare licens för utvecklare",
    "ProjectCount": "Projekträkning",
    "AllProModules": "Alla proffsmoduler",
    "AllProThemes": "Alla proffsteman",
    "AllProStartupTemplates": "Alla proffsmallar för nystartade företag",
    "SourceCodeOfAllModules": "Källkod för alla moduler",
    "SourceCodeOfAllThemes": "Källkod för alla teman",
    "PerpetualLicense": "Evig licens",
    "UnlimitedServerDeployment": "Obegränsad serverdistribution",
    "YearUpgrade": "1 års uppgradering",
    "YearPremiumForumSupport": "1 års premiumsupport för forum",
    "ForumSupportIncidentCountYear": "Antal incidenter för forumstöd/år",
    "PrivateTicketEmailSupport": "Privat support via biljett och e-post",
    "BuyNow": "Köp nu",
    "PayViaAmexCard": "Hur kan jag betala med mitt AMEX-kort?",
    "PayViaAmexCardDescription": "Standardbetalningsgatewayen \"Iyzico\" kan neka vissa AMEX-kreditkort på grund av säkerhetsåtgärder. I detta fall kan du betala via den alternativa betalningsgatewayen \"2Checkout\".",
    "ThankYou": "Tack så mycket",
    "InvalidReCaptchaErrorMessage": "Det uppstod ett fel vid verifiering av reCAPTCHA. Vänligen försök igen.",
    "CompanyName": "Företagets namn",
    "YourCompanyName": "Ditt företagsnamn",
    "FirstName": "Förnamn",
    "LastName": "Efternamn",
    "Optional": "Valfritt",
    "YourFirstName": "Ditt förnamn",
    "YourLastName": "Ditt efternamn",
    "SpecialOffer": "Specialerbjudande",
    "SpecialOfferMessage": "Skynda dig! Priserna gäller under en begränsad tid.",
    "DiscountRequest": "Begäran om rabatt",
    "DiscountRequestDescribeCustomerQuestion": "Vilken av följande beskrivningar stämmer in på dig?",
    "DiscountRequestStudentEmailMessage": "E-postadressen måste innehålla \"edu\".",
    "DiscountRequestDeveloperCount": "Hur många utvecklare är ni?",
    "DiscountRequestDeveloperCountExceedMessage": "Vi erbjuder inte rabatterade licenser för företag som har fler än {0} utvecklare.",
    "DiscountRequestOrganizationName": "Företagets/organisationens/skolans namn",
    "Website": "Webbplats",
    "GithubUsername": "Användarnamn för GitHub",
    "PhoneNumber": "Telefonnummer",
    "Country": "Land",
    "DescribeABPCommercialUsage": "Beskriv det projekt som du planerar att utveckla baserat på APB",
    "DiscountRequestCertifyInformationMessage": "Jag intygar att alla uppgifter är sanningsenliga och korrekta.",
    "DiscountRequestReceived": "Vi har mottagit din begäran om rabatt.",
    "DiscountRequestStatusMessage": "Vi kommer att svara dig efter att ha kontrollerat den information du har lämnat.",
    "MVCOrRazorPages": "MVC (Razor Pages)",
    "Angular": "Angular",
    "Blazor": "Blazor",
    "New": "Nya",
    "MongoDB": "MongoDB",
    "EBookDDD": "E-bok Domänstyrd design",
    "PracticalGuideForImplementingDDD": "Den här boken är en praktisk guide för att implementera domändriven design med ABP-ramverket.",
    "IntroducingDDD": "Introduktion till domändriven design",
    "DDDLayersAndCleanArchitecture": "DDD-skikt och ren arkitektur",
    "LayeringOfADotnetSolution": "Skiktning av en .NET-lösning",
    "ImplementingDDDBuildingBlocks": "Implementering av DDD-byggstenar",
    "DomainVsApplicationLogic": "Domänlogik vs applikationslogik",
    "SamplesAndDiscussions": "Provtagningar och diskussioner",
    "Free": "Gratis",
    "Download": "Nedladdningar",
    "DDDEBook": "DDD E-bok",
    "ImplementingDDD": "Implementering av domändriven design",
    "DDDBookExplanation": "En praktisk guide för implementering av domändriven design med ABP-ramverket.",
    "Overview": "Översikt",
    "DDDBookPracticalGuide": "Detta är en praktisk guide för implementering av domändriven design (DDD). Implementeringsdetaljerna bygger på ABP Framework-infrastrukturen, men kärnkoncepten, principerna och mönstren är tillämpliga på alla typer av lösningar, även om det inte är en .NET-lösning.",
    "TableOfContents": "Innehållsförteckning",
    "IntroductionToImplementingDDD": "Introduktion till implementering av domändriven design",
    "WhatIsDDD": "Vad är domändriven design?",
    "Implementation": "Implementering",
    "TheBigPicture": "Den stora bilden",
    "TheBuildingBlock": "Byggstenen",
    "ExampleUseCase": "Exempel Användningsfall",
    "DomainAndApplicationLogic": "Domänlogik och applikationslogik",
    "Author": "Författaren",
    "PublishedOn": "Publicerad på",
    "Page": "Sidan",
    "FreeEBook": "Gratis e-bok",
    "EBookSignInForDownload": "För att ladda ner e-boken logga in",
    "SignIn": "Logga in",
    "Or": "Eller",
    "TellUsAboutYourself": "Berätta lite om dig själv",
    "Surname": "Efternamn",
    "DoYouAgreePrivacyPolicy": "Jag samtycker till <a href=\"/TermsConditions\">Terms & Conditions<a/> och <a href=\"/Privacy\">Privacy Policy</a>.",
    "VolosoftMarketingInformationMessage": "Jag vill ha information, tips och erbjudanden om Solutions for Businesses and Organizations och andra produkter och tjänster från Volosoft.",
    "VolosoftSharingInformationMessage": "Jag vill att Volosoft ska dela min information med utvalda partners så att jag kan få relevant information om deras produkter och tjänster.",
    "WeWillSendYouADownloadLink": "Länken för nedladdning av e-boken har skickats till {0}. Kontrollera din inkorg, skräppost och spamboxar!",
    "InvalidFormInputs": "Vänligen skriv in den giltiga information som anges på formuläret.",
    "DDDBookEmailBody": "Tack så mycket. <br /> För att ladda ner din bok, <a href=\"{0}\">klicka här</a>.",
    "StartFree": "Starta gratis",
    "FreeTrial": "Gratis provperiod",
    "AcceptsMarketingCommunications": " Ja, jag vill gärna få ABP-relaterade marknadsföringsnyheter.",
    "PurposeOfUsage": "Syfte med användningen",
    "Choose": "- Välj -",
    "CompanyOrganizationName": "Företagets/organisationens namn",
    "CompanySize": "Företagets storlek",
    "Next": "Nästa",
    "StartTrial": "Starta min kostnadsfria testperiod",
    "ContactUsQuestions": "Kontakta oss om du har några frågor",
    "TrialActivatedWarning": "En användare har endast rätt till 1 gratis provperiod. Du har redan använt din provperiod.",
    "ActivationRequirement": "Du är bara ett steg från att starta din provperiod.<br>Efter att ha kontrollerat din information aktiverar vi din licens. När din licens är aktiverad skickar vi ett e-postmeddelande till <b>{0}</b>. Oroa dig inte, den här processen kommer inte att ta lång tid!",
    "SaveAndDownload": "Spara och ladda ner",
    "CompanyNameValidationMessage": "Företagsnamnet är för långt!",
    "AddressValidationMessage": "Adressen är för lång!",
    "TaxNoValidationMessage": "TAX/VAT Nej är för långt!",
    "NotesValidationMessage": "Anteckningsfältet är för långt!",
    "CheckYourBillingInfo": "Du kan bara skapa din faktura en gång! Kontrollera din faktureringsinformation innan du skapar din faktura.",
    "StartYourFreeTrial": "Starta din kostnadsfria testperiod",
    "TrialLicenseModelInvalidErrorMessage": "Ett av följande fält är ogiltigt: Landsnamn, Företagsstorlek, Bransch eller Syfte med användning.",
    "Trial": "Rättegång",
    "Purchased": "Köpte",
    "PurchaseNow": "Köp nu",
    "PurchaseTrialLicenseMessage": "Din licens utgångsdatum är {0}. <br> Om du vill fortsätta använda de projekt som du skapade under din kostnadsfria testperiod måste du ändra licensnycklarna i dina <code>appsettings.secrets.json</code>-filer. Här är din licensnyckel:",
    "TrialLicenseExpireMessage": "Du använder en testlicens och din testlicens upphör att gälla den {0}.",
    "TryForFree": "Prova gratis",
    "TrialLicenseExpiredInfo": "Din testlicensperiod har löpt ut!",
    "DowngradeLicensePlan": "Kan jag nedgradera till en lägre licensplan i framtiden?",
    "DowngradeLicensePlanExplanation": "Du kan inte nedgradera din befintliga licensplan. Men du kan köpa en ny lägre licensplan och fortsätta din utveckling på den nya licensen. När du har köpt en lägre licens behöver du bara logga in på din nya licensplan via ABP CLI-kommandot: ` abp login <användarnamn> -o <organisation> `.",
    "LicenseTransfer": "Kan en licens överföras från en utvecklare till en annan?",
    "LicenseTransferExplanation": "Ja, det gör jag! När du köper en licens blir du licensinnehavare och får därmed tillgång till sidan för organisationshantering. En organisation har rollerna ägare och utvecklare. Ägare kan hantera utvecklarplatserna och tilldela utvecklare. Varje tilldelad utvecklare loggar in via ABP CLI-kommandot i systemet och har utvecklings- och supportbehörighet.",
    "UserOwnerDescription": "Organisationens \"ägare\" är administratör för detta konto. Han/hon hanterar organisationen genom att köpa licenser och tilldela utvecklare. En \"ägare\" kan inte skriva kod i ABP-projekten, kan inte ladda ner ABP-exempelprojekten och kan inte ställa frågor på supportwebbplatsen. Om du vill göra allt detta måste du också lägga till dig själv som utvecklare.",
    "UserDeveloperDescription": "\"Utvecklarna\" kan skriva kod i ABP-projekten, ladda ner ABP:s exempelprojekt och ställa frågor på supportwebbplatsen. Å andra sidan kan \"utvecklarna\" inte hantera den här organisationen.",
    "RemoveCurrentUserFromOrganizationWarningMessage": "Du tar bort dig själv från din egen organisation. Du kommer inte längre att kunna hantera den här organisationen, bekräftar du det?",
    "RenewExistingOrganizationOrCreateNewOneMessage": "Du kan förnya licensen för din organisation (er) genom att klicka på nedanstående \"Förläng nu\"-knapp (ar) och därmed kan du förlänga licensens utgångsdatum med 1 år. Om du fortsätter till kassan kommer du att ha en ny organisation. Vill du fortsätta med en ny organisation?",
    "PurchaseTrialOrganizationOrCreateNewOneMessage": "Du har en testlicens. För att köpa din testlicens klickar du på knappen Köp nu. Om du fortsätter till kassan kommer du att ha en ny organisation. Vill du fortsätta med en ny organisation?",
    "ExtendNow": "Förlänga / Förnya",
    "CreateNewOrganization": "Skapa en ny organisation",
    "RenewLicenseEarly": "Om jag förnyar min licens tidigt, kommer jag att få hela året?",
    "RenewLicenseEarylExplanation": "När du förnyar din licens före licensens utgångsdatum kommer 1 år att läggas till licensens utgångsdatum. Om din licens t.ex. löper ut den {0}-06-06 och du förnyar den den {0}-01-01, kommer din nya licens att löpa ut den {1}-06-06.",
    "OpenSourceWebApplication": "Webbapplikation med öppen källkod",
    "CompleteWebDevelopment": "En komplett webbutveckling",
    "ABPFrameworkDescription": "ABP Framework är en komplett infrastruktur för att skapa moderna webbapplikationer genom att följa de bästa metoderna för mjukvaruutveckling och konventioner.",
    "CommunityDescription": "Dela dina erfarenheter av ABP-ramverket!",
    "GetStarted": "Kom igång",
    "Views": "utsikt",
    "LatestPosts": "Senaste inlägg",
    "PreBuiltApplication": "Förbyggd applikation",
    "DatabaseProviders": "Databasleverantörer",
    "UIFrameworks": "Ramverk för användargränssnitt",
    "UsefulLinks": "Användbara länkar",
    "Platform": "Plattform",
    "CoolestCompaniesUseABPCommercial": "De coolaste företagen använder redan <span class=\"fw-bold\">ABP.</span>",
    "UserInterface": "Användargränssnitt",
    "APIGateway": "API-gateway",
    "Microservice": "Mikroservice",
    "Database": "Databas",
    "Architecture": "Arkitektur",
    "MicroserviceArchitectureExplanation": "Det här är en komplett lösningsarkitektur som består av flera applikationer, API-gateways, mikrotjänster och databaser för att bygga en skalbar mikrotjänstlösning med den senaste tekniken.",
    "BusinessLogic": "Affärslogik",
    "DataAccessLayer": "Dataåtkomstskikt",
    "Monolith": "Monolit",
    "ModularArchitectureExplanation": "Denna startup-mall ger en skiktad, modulär och DDD-baserad lösningsarkitektur för att bygga en ren och underhållbar kodbas.",
    "SeeDetails": "Se detaljer",
    "SeeDocumentation": "Kolla in dokumentationen",
    "Bs5Compatible": "Professionellt tema som är kompatibelt med Bootstrap 5, perfekt för din administratörswebbplats.",
    "LeptonXTheme": "LeptonX tema",
    "LeptonXDark": "LeptonX Mörk",
    "LeptonXLight": "LeptonX Ljus",
    "LeptonXSemiDark": "LeptonX Halvmörk",
    "BuiltOnBs5Library": "Byggd på Bootstrap 5-biblioteket",
    "FullyCompatibleWithBs5": "100% kompatibel med Bootstrap 5 HTML-struktur och CSS-klasser",
    "ResponsiveAndMobileCompatible": "Responsiv, mobilkompatibel, RTL-stöd",
    "ProvidesStylesForDatatables": "Tillhandahåller stilar för datatabeller",
    "MultipleLayoutOptions": "Flera layoutalternativ",
    "EasilyInstallAndUpgrade": "Enkel installation och uppgradering",
    "SupportForum": "Forum för support",
    "TrustedBy": "Betrodda av",
    "OurPricing": "Vår <span class=\"gradient-commercial\">prissättning</span>",
    "Plans": "Planer",
    "NameSurname": "Namn Efternamn",
    "Unspecified": "Ospecificerad",
    "LicenceType": "Typ av licens",
    "LicenseDiscountWarning": "DENNA RABATTSIDA ANVÄNDER STANDARD RABATTKOD OCH FÖR VOLOSOFT UTVECKLARE. INKÖPSLÄNKAR NEDAN FUNGERAR INTE.",
    "DiscountedLicenseExplanation": "Dessa licenspriser är avsedda för små nystartade företag, enskilda utvecklare, studenter, ideella organisationer och projekt!",
    "General": "Allmänt",
    "License": "Licens",
    "Development": "Utveckling",
    "Payment": "Betalning",
    "WatchExplainerVideo": "Låt oss träffas! Titta på förklarande video",
    "LightDarkAndSemiDarkThemes": "Ljus, mörk och halvmörk",
    "LeptonXThemeExplanation": "Lepton Theme kan ändra ditt tema enligt dina systeminställningar.",
    "PRO": "PRO",
    "WelcomeToABPCommercial": "Välkommen till <span class=\"gradient-commercial\">ABP Platform!</span>",
    "YourAccountDetails": "Dina kontouppgifter",
    "OrganizationName": "Organisationens namn",
    "AddDevelopers": "Lägg till utvecklare",
    "StartDevelopment": "Starta utveckling",
    "CreateAndRunApplicationUsingStartupTemplate": "Lär dig hur du skapar och kör en ny webbapplikation med hjälp av ABP:s startmallar.",
    "CommunityDescription2": "<span class=\"fw-6\">community.abp.io</span> är en plats där människor kan dela ABP-relaterade artiklar. Sök efter artiklar, handledningar, kodprover, fallstudier och träffa människor som är i samma spår som du.",
    "UseABPSuiteExplanation": "Använd ABP Suite för att ladda ner källkoden för modulerna och temana.",
    "ManageModulesWithSuite": "Du kan också hantera dina ABP-moduler med Suite.",
    "LearnHowToInstallSuite": "Lär dig hur du installerar och använder ABP Suite.",
    "SeeMore": "Se mer",
    "SeeLess": "Se mindre",
    "LayeredSolutionStructure": "Struktur med flera lager av lösningar",
    "LayeredSolutionStructureExplanation": "Lösningen är uppbyggd i lager baserat på principer och mönster för domändriven design för att isolera affärslogiken från infrastruktur och integrationer och för att maximera underhåll och återanvändning av koden. ABP Framework tillhandahåller redan abstraktioner, basklasser och guider för att verkligen implementera DDD för din applikation.",
    "MultipleUIOptions": "Flera alternativ för användargränssnitt",
    "MultipleUIOptionsExplanation": "Vi älskar olika sätt att skapa användargränssnitt. Den här startup-lösningen ger tre olika alternativ för användargränssnitt för din affärsapplikation.",
    "MultipleDatabaseOptions": "Flera databasalternativ",
    "MultipleDatabaseOptionsExplanation": "Du har två alternativ för databasleverantörer (förutom att du kan använda båda i en och samma applikation). Använd Entity Framework Core för att arbeta med alla relationsdatabaser och använd eventuellt Dapper när du behöver skriva lågnivåfrågor för bättre prestanda. MongoDB är ett annat alternativ om du behöver använda en dokumentbaserad NoSQL-databas. Även om dessa leverantörer är välintegrerade, abstraherade och förkonfigurerade kan du faktiskt interagera med alla databassystem som du kan använda med .NET.",
    "ModularArchitectureExplanation2": "Modularitet är en första klassens medborgare i ABP.IO-plattformen. Alla applikationsfunktionaliteter är uppdelade i välisolerade valfria moduler. Startlösningen levereras redan med de grundläggande <a href=\"/modules\" class=\"text-primary\">ABP-modulerna</a> förinstallerade. Du kan också skapa dina egna moduler för att bygga ett modulärt system för din egen applikation.",
    "MultiTenancyForSaasBusiness": "Multi-Tenancy för ditt SaaS-företag",
    "MultiTenancyForSaasBusinessExplanation": "ABP tillhandahåller ett komplett, end-to-end multi-tenancy-system för att skapa dina SaaS-system (Software-as-a-Service). Det gör det möjligt för hyresgästerna att dela eller ha sina egna databaser med on-the-fly databasskapande och migrationssystem.",
    "MicroserviceStartupSolution": "Microservice Startup-lösning",
    "MicroserviceArchitectureExplanation2": "Du kan skaffa det till ditt nästa microservice-system för att dra nytta av den förbyggda baslösningen och destillerade erfarenheten.",
    "PreIntegratedTools": "Förintegrerad i populära verktyg",
    "PreIntegratedToolsExplanation": "Lösningen är redan integrerad i branschens standardverktyg och -tekniker, men du kan alltid ändra dem och integrera dem med dina favoritverktyg.",
    "SingleSignOnAuthenticationServer": "Server för autentisering med enkel inloggning",
    "SingleSignOnAuthenticationServerExplanation": "Lösningen har en autentiseringsserverapplikation som används av de andra applikationerna som en server för enkel inloggning med API-åtkomsthanteringsfunktioner. Den är baserad på IdentityServer.",
    "WebAppsWithGateways": "2 Webbapp med 2 API-gateways",
    "WebAppsWithGatewaysExplanation": "Lösningen innehåller två webbapplikationer som var och en har en dedikerad API-gateway (BFF - Backend For Frontend-mönster).",
    "BackOfficeApplication": "Back Office-applikation",
    "BackOfficeApplicationExplanation": "Den faktiska webbapplikationen för ditt system, med flera alternativ för användargränssnitt. Du kan skapa alla typer av affärsapplikationer.",
    "LandingWebsite": "Landningswebbplats",
    "LandingWebsiteExplanation": "En generisk landningsplats/publik webbplats som kan användas för flera ändamål, t.ex. för att presentera ditt företag, sälja dina produkter osv.",
    "ABPFrameworkEBook": "Mastering ABP Framework e-bok",
    "MasteringAbpFrameworkEBookDescription": "Ingår i din ABP-licens",
    "FullName": "Full Name",
    "LicenseTypeNotCorrect": "Licenstypen är inte korrekt!",
    "Trainings": "Utbildningar",
    "ChooseTrainingPlaceholder": "Välj utbildning...",
    "DoYouNeedTrainings": "Behöver du någon av dessa utbildningar?",
    "DoYouNeedTraining": "Behöver du {0} utbildning?",
    "GetInTouchUs": "Ta kontakt med oss",
    "ForMoreInformationClickHere": "För mer information, klicka <a href='{0}'>här.</a>",
    "ForMoreInformationClickHereByClass": "<span class=\"{1}\">För mer information, klicka</span> <a href='{0}'>här.</a>",
    "IsGetOnboardingTraining": "Vill du få utbildning i onboarding och utveckling av webbapplikationer?",
    "OnboardingWebApplicationDevelopmentTrainingMessage": "För att schemalägga din utbildningskalender, vänligen kontakta {0} efter att du har skapat organisationen",
    "CustomPurchaseMessage": "För nästa steg, klicka på {0} för att kontakta oss.",
    "Note": "Notera",
    "AdditionalNote": "Ytterligare anmärkning",
    "OnboardingTrainingFaqTitle": "Har du en ABP onboarding-utbildning?",
    "OnboardingTrainingFaqExplanation": "Ja, vi har ABP Training Services som hjälper dig att snabbt komma igång med ditt ABP-projekt. Du kommer att lära dig om ABP från en medlem i ABP:s kärnteam och du kommer att få de färdigheter som krävs för att starta ditt ABP-projekt. I onboarding-utbildningen förklarar vi hur du ställer in din utvecklingsmiljö, installerar de nödvändiga verktygen och skapar en fullt fungerande CRUD-sida. Utbildningen kommer att vara live och Zoom-applikationen kommer att användas, men vi är öppna för att använda andra online-mötesplattformar. Språket för utbildningen kommer att vara engelska. Du kan också ställa dina frågor om ABP under sessionerna. En lämplig tid och ett lämpligt datum kommer att planeras för båda parter. För att få mer information, kontakta oss på <a href=\"mailto:info@abp.io\">info@abp.io</a>.",
    "AddBasket": "Lägg till i korgen",
    "SendTrainingRequest": "Skicka förfrågan om utbildning",
    "OnlyEnglishVersionOfThisDocumentIsTheRecentAndValid": "* Den engelska versionen av detta dokument är den mest aktuella och den engelska versionen ska ha företräde i alla tvister.",
    "Pricing_Page_Title": "Priser och planer",
    "Pricing_Page_Description": "Välj de funktioner och den funktionalitet som ditt företag behöver idag. Köp en ABP-licens och skapa obegränsat med projekt.",
    "Pricing_Page_HurryUp": "Skynda dig!",
    "Pricing_Page_BuyLicense": "Köp en licens till <strong>2021 års priser</strong> fram till den 16 januari!",
    "Pricing_Page_ValidForExistingCustomers": "Gäller även för befintliga kunder och licensförnyelser.",
    "Pricing_Page_Hint1": "I licenspriset ingår ett visst antal platser för utvecklare. Om du har fler utvecklare kan du alltid köpa ytterligare platser.",
    "Pricing_Page_Hint2": "Du kan köpa fler utvecklarlicenser nu eller i framtiden. Licenserna är platsbaserade, vilket innebär att du kan överföra en plats från en utvecklare till en annan.",
    "Pricing_Page_Hint3": "Du kan utveckla ett obegränsat antal olika produkter med din licens.",
    "Pricing_Page_Hint4": "ABP Suite är ett verktyg som hjälper dig att utveckla och förbättra din produktivitet. Det stöder generering av CRUD-sidor och skapande av nya projekt.",
    "Pricing_Page_Hint5": "Du kan använda alla de förbyggda modulerna i dina applikationer.",
    "Pricing_Page_Hint6": "Du kan använda alla de förbyggda temana i dina applikationer.",
    "Pricing_Page_Hint7": "En startmall är en Visual Studio-lösning som hjälper dig att komma igång med ditt projekt. Alla grundläggande moduler läggs till och förkonfigureras åt dig.",
    "Pricing_Page_Hint8": "Mastering ABP Framework e-bok förklarar hur man implementerar .NET-lösningar med bästa praxis. Den säljs på Amazon.com, och du kan ladda ner boken gratis med din licens.",
    "Pricing_Page_Hint9": "Du kan ladda ner källkoden för alla moduler. Du kanske vill lägga till källkoden i din lösning för att göra radikala ändringar eller bara behålla den för dig själv av säkerhetsskäl.",
    "Pricing_Page_Hint10": "Licenserna är livstidsbaserade. Det innebär att du kan fortsätta att utveckla din applikation för alltid. Tillgång till den senaste versionen och support beviljas inom licensperioden (1 år om du inte förnyar den).",
    "Pricing_Page_Hint11": "Inga begränsningar för driftsättning! Du kan distribuera till så många servrar som du vill, inklusive molntjänster eller lokalt.",
    "Pricing_Page_Hint12": "Du kan uppdatera moduler, teman och verktyg till den senaste versionen inom din aktiva licensperiod. När din licens löper ut måste du förnya den för att fortsätta att få uppdateringar för buggfixar, nya funktioner och förbättringar.",
    "Pricing_Page_Hint13": "Du kan få premiumsupport i ett år (du kan förnya din licens för att förlänga den).",
    "Pricing_Page_Hint14": "Team- och Business-licenser har en gräns för antal incidenter/frågor. Om du köper ytterligare utvecklarlicenser ökar incidentgränsen med {0} (för Team-licensen) eller {1} (för Business-licensen) per utvecklare.",
    "Pricing_Page_Hint15": "Endast Enterprise License inkluderar privat support. Du kan skicka ett e-postmeddelande direkt till ABP-teamet eller ställa frågor på support.abp.io med ett privat biljettalternativ. De privata ärendena är inte synliga för allmänheten.",
    "Pricing_Page_Hint16": "Du kan ladda ner källkoden för alla ABP-teman. Du kanske vill lägga till källkoden i din lösning för att göra radikala ändringar eller bara behålla den för dig själv av säkerhetsskäl.",
    "Pricing_Page_Testimonial_1": "ABP gjorde det möjligt för SC Ventures att leverera en bankklassad SaaS-plattform med silodatabas med flera hyresgäster på 9 månader för att stödja leverantörskedjans kundfordringar / leverantörsskulder för finansiering av fakturor med betydande värde från flera integrerade ankare. ABP:s modularitet gjorde det möjligt för teamet att leverera på rekordtid, klara alla VAPT och distribuera den containeriserade mikrotjänststacken via fullständig CI/CD och pipelines till produktion.",
    "Pricing_Page_Testimonial_2": "Vi ser värdet av att använda ABP för att minska omkostnaderna för kundanpassade utvecklingsprojekt. Teamet kan förena kodmönstret i olika projektströmmar. Vi ser mer potential i ramverket för att vi ska kunna bygga nya funktioner snabbare än tidigare. Vi litar på att vi ständigt kommer att se värdet av att utnyttja ABP.",
    "Pricing_Page_Testimonial_3": "Vi älskar ABP. Vi behöver inte skriva allt från grunden. Vi utgår från out-of-the-box-funktioner och fokuserar bara på det vi verkligen behöver skriva. Dessutom är ABP välarkitekterat och koden är av hög kvalitet med färre buggar. Om vi hade varit tvungna att skriva allt vi behövde på egen hand hade vi kanske fått lägga ner flera år. Ytterligare en sak vi gillar är att den nya versionen, problemfixningen eller förbättringen kommer ut väldigt snart, varannan vecka. Vi väntar inte för länge.",
    "Pricing_Page_Testimonial_4": "ABP är en fantastisk produkt som jag skulle rekommendera. Kommersiella produkter till marknaden för våra kunder i en enda konfigurerbar plattform. Den starthjälp som ramverket och verktygen ger alla team är värd varenda cent. ABP var det som passade bäst för våra behov.",
    "Pricing_Page_Testimonial_5": "ABP Framework är inte bara ett ramverk, utan det är också en guide för projektutveckling/hantering, eftersom det ger utbildning i DDD, GenericRepository, DI, Microservice och Modularity. Även om du inte kommer att använda själva ramverket kan du utveckla dig själv med docs.abp.io som är väl och professionellt förberedd (OpenIddict, Redis, Quartz etc.). Eftersom många saker är förbyggda förkortar det projektutvecklingstiden avsevärt (t.ex. inloggningssida, undantagshantering, datafiltrering, sådd, revisionsloggning, lokalisering, automatisk API-kontroller etc.) Som ett exempel från vår applikation har jag använt Local Event Bus för lagerstyrning. Så jag kan hantera orderrörelser genom att skriva lagerhanterare. Det är underbart att inte förlora tid för CreationTime, CreatorId. De fylls i automatiskt.",
    "Pricing_Page_Testimonial_6": "ABP Framework är ett bra ramverk men det tar tid att förstå de olika lager, klasser och bibliotek som det använder (särskilt ABP). Jag spenderade mycket tid på att läsa kodbasen, men ABP sparade oss tid när vi skapade projektspecialitetsenheterna (AR) och förvaret kopplat till var och en av dem. Jag gillade också att den metod som används i ABP är mycket mogen; vi vet att den är baserad på DDD och monolit.",
    "Pricing_Page_Testimonial_7": "Som ett nystartat företag måste vi iterera snabbt och spendera minimal tid på standardfunktioner och icke-kärnfunktioner.\nVåra ingenjörer sträcker sig från mycket erfarna till juniora ingenjörer, och vi behövde en gemensam förståelse och ett sätt att dela teknisk och domänkunskap, ABP gjorde det möjligt för oss att göra detta tack vare deras fantastiska guider och dokumentation.\nDet finns saker som vi inte har behövt oroa oss för eftersom de fungerar direkt med ABP.\nABP hjälpte oss att effektivisera snabb prototyping och utveckling, mindre än 4 veckor från funktionsstart till produktion. Med alla premiumfunktioner som ingår i licensen har ABP gett oss \"Startup in a Box\" på Software Engineering-sidan.",
    "Pricing_Page_Testimonial_8": "Jag skulle rekommendera ABP till alla som vill utöka utbudet av produkter som är tillgängliga för sina kunder. Det är fantastiskt när man behöver använda en distribuerad företagsmiljö (Angular, WPF, Win&Linux). Förutom deras produkter älskar vi deras support, som gör vårt jobb snabbare och enklare. Vi vet redan att vi har hittat en bra partner för framtiden som kommer att stödja oss i att expandera vår verksamhet.",
    "Pricing_Page_Testimonial_9": "Vi är ett företag med 2 anställda som har varit i branschen i över 20 år.\nNär det gäller vår erfarenhet av ABP kontaktades vi av en kund som ville att vi skulle utveckla en ny personalapplikation i en modern miljö för att ersätta deras 25 år gamla Access-applikation. Vi bestämde oss för att gå över från en desktoplösning till en webbaserad lösning.\n\nVid den tidpunkten hade vi mycket liten kunskap om webbapplikationer och .NET, men vi snubblade över ABP, och med hjälp av ABP Framework, teknisk dokumentation och ABP Suite kunde vi inte bara utveckla applikationen enligt kundens specifikationer utan också framgångsrikt arbeta i en .NET-miljö inom ett år.",
    "AbpBookDownloadArea_ClaimYourEBook": "Gör anspråk på din e-bok om ABP Framework",
    "AddMemberModal_Warning_1": "Om det <strong>användarnamn</strong> som du försöker lägga till inte finns i systemet, be din teammedlem att registrera sig på <a href='{0}/Account/Register'>{0}</a> och dela användarnamnet på hans/hennes konto med dig.",
    "MyOrganizations_Detail_WelcomeMessage": "Välkommen till din organisation, {0}",
    "MyOrganizations_Detail_OrganizationManagement": "Organisation <span class=\"gradient-commercial\">Förvaltning</span>",
    "OrganizationDisplayName": "Organisationens visningsnamn",
    "MyOrganizations_Detail_EditDisplayName": "Redigera visningsnamn",
    "MyOrganizations_Detail_UpgradeYourLicense": "Uppgradera din licens",
    "MyOrganizations_Detail_LicenseStartAndExpiryDate": "Licensens startdatum - utgångsdatum",
    "MyOrganizations_Detail_OwnerRightInfo": "Du använder {0} av din {1} ägares rättigheter.",
    "MyOrganizations_Detail_CopyApiKey": "Kopiera nyckeln",
    "MyOrganizations_Detail_ApiKeyDescription": "API-nyckeln är token för PRO-paket som finns på <a href=\"{0}\" target=\"_blank\" rel=\"noopener\">{1}.</a>",
    "MyOrganizations_Detail_YourPrivateNugetSource": "Din privata NuGet-källa är <a href=\"{0}\" target=\"_blank\" rel=\"noopener\">{0}</a>",
    "MyOrganizations_Detail_PrivateNugetSourceWarning": "Detta läggs automatiskt till som en feed till din NuGet.Config i din ABP-lösning. Dela inte din privata nyckel med obehöriga användare!",
    "MyOrganizations_Detail_DeveloperSeatInfo": "Du använder {0} av dina {1} platser för utvecklare.",
    "NeedMoreSeatsForYourTeam": "Behöver du fler platser för ditt team?",
    "MyOrganizations_Detail_PricePerYear": "{0} / per år",
    "MyOrganizations_Detail_PurchaseDeveloperSeats": "Köpa platser för utvecklare",
    "Invoices": "Fakturor",
    "RequestInvoice": "Begär faktura",
    "OrderNumber": "Beställningsnummer",
    "Date": "Datum",
    "Products": "Produkter",
    "TotalPrice": "Totalt pris",
    "ThereIsNoInvoice": "Det finns ingen faktura",
    "MyOrganizations_Detail_PaymentProviderInfo": "Om du har köpt din licens via <i>{0}</i> gateway skickas PDF-fakturan till din e-postadress, se <a href=\"{1}\" target=\"_blank\">{0} fakturering.</a>",
    "MyOrganizations_Detail_PayUInfo": "Om du har köpt via <i>Iyzico</i>-gatewayen klickar du på knappen \"Begär faktura\" och fyller i faktureringsinformationen.",
    "MyOrganizations_Detail_ConclusionInfo": "Din fakturabegäran kommer att behandlas inom {0} arbetsdagar.",
    "ExtendYourLicense": "Förläng din <span class=\"text-primary\">{0}</span> licens",
    "Continue": "Fortsätt",
    "PurchaseLicense": "Köp {0} licens",
    "DownloadInvoiceModal_DownloadInvoice": "Ladda ner faktura",
    "DownloadInvoiceModal_SaveInformationOnlyOnce": "Du kan bara spara din faktureringsinformation en gång.",
    "InvoiceModal_EnterCompanyName": "Ange ditt juridiska företagsnamn...",
    "InvoiceModal_EnterCompanyAddress": "Ange din juridiska företagsadress...",
    "InvoiceModal_EnterTaxNumber": "Ange ditt TAX/VAT-nummer om det finns tillgängligt...",
    "RequestInvoiceModal_EnterNotes": "Ytterligare information för din faktura... Denna anteckning kommer att skrivas i anteckningsavsnittet på fakturan.",
    "PrePayment_PayWithIyzico": "Du kommer att betala med Iyzico",
    "ContinueToCheckout": "Fortsätt till kassan",
    "PrePayment_IyzicoRedirectionInfo": "Du kommer att omdirigeras till Iyzico Payment Gateway för att slutföra ditt köp på ett säkert sätt.",
    "PrePayment_IyzicoAcceptVisaAndMasterCard": "Iyzico tar emot Visa och MasterCard.",
    "Purchase": "Köp",
    "AcceptTermsAndConditions": "Jag har läst, förstått och accepterar <a href=\"{0}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">integritetspolicy</a>, <a href=\"{1}\" target=\"_blank\" class=\"text-primary\" rel=\"noopener\">villkor</a> och <a href=\"{2}\" target=\"_blank\" class=\"text-primary\">EULA.</a>",
    "AcceptTermsAndConditionsWarningMessage": "Vänligen acceptera integritetspolicyn och villkoren",
    "SelectGatewayToContinue": "Vänligen välj en Gateway för att fortsätta!",
    "GatewaySelection_SelectGateway": "Välj en betalningsportal",
    "GatewaySelection_RedirectionMessage": "Därefter kommer du att omdirigeras till den valda betalningsgatewayens webbplats för transaktionen.",
    "PaymentSucceed_PaymentSuccessMessage": "Betalning framgångsrik",
    "PaymentSucceed_ThanksForPurchase": "Tack för ditt köp!",
    "PaymentSucceed_CreateYourOrganization": "Skapa din organisation",
    "PaymentSucceed_AddMeAsDeveloper": "Jag är också utvecklare, lägg till mig som utvecklare i min organisation.",
    "PaymentSucceed_CreateOrganization": "Skapa organisation",
    "PaymentSucceed_OrganizationDescription": "En organisation består av utvecklare och ägare. Utvecklarna är användare som skriver kod på ABP-projektet och som kommer att dra nytta av webbplatsen <a href=\"{0}\" target=\"_blank\">{1}</a>. Ägarna är användare som tilldelar utvecklarplatser och hanterar licensiering.",
    "PaymentSucceed_ViewOrganization": "Klicka här för att se organisationen",
    "Purchase_TotalAnnualPrice": "TOTALT <small class=\"opacity-50\">(årsavgift)</small>",
    "Purchase_TrainingPrice": "Pris för utbildning",
    "Purchase_OnboardingTraining": "Live-utbildning i onboarding och utveckling av webbapplikationer",
    "TotalDeveloperPrice": "Totalt pris för utvecklare",
    "Purchase_PricePerDeveloper": "<span>{0}</span> per utvecklare",
    "Purchase_IncludedDeveloperInfo": "{0} {1} ingår.",
    "Purchase_LicenseExtraDeveloperPurchaseMessage": "I <span class=\"fw-bold\">{0} licens</span> ingår {1} utvecklare. Du kan lägga till ytterligare utvecklare.",
    "StartupTemplates_Page_Title": "ABP Startup Mallar",
    "StartupTemplates_Page_Description": "Med ABP kan du bygga lösningar med valfri komplexitetsnivå. Det ger två huvudsakliga förbyggda startlösningar. Du kan välja den som ligger närmast dina krav och bygga din egen anpassade lösning ovanpå den.",
    "MicroserviceStartupSolutionForDotnet": "Microservice Startup-lösning för .NET",
    "MonolithSolutionForDotnet": "Monolitisk (modulär) lösning för .NET",
    "TrainingDetailsHeaderInfo_TrainingHour": "{0} timmar",
    "Trainings_Content": "Utbildningens innehåll",
    "Trial_Page_StartYourFreeTrial": "Starta din <span class=\"gradient-commercial\">gratis provperiod</span>.",
    "TrialLicenseFeatures": "Du kommer att kunna dra nytta av alla ABP:s kommersiella funktioner",
    "TrialPeriodDays": "Du kommer att ha en {0} dagars teamlicens",
    "TrialForumSupportIncident": "Du kommer att ha {0} forum support incidenter",
    "Contact_Page_Title": "Kontakt med ABP:s utvecklingsteam",
    "Contact_Page_Description": "Kontakta ABP:s utvecklingsteam om du behöver hjälp eller dela med dig av dina tankar och åsikter! ABP Support Team är redo att hjälpa till.",
    "Demo_Page_Title": "Skapa en demo",
    "Demo_Page_Description": "Skapa en gratis demo för att se ett exempel på en ansökan som skapats med hjälp av ABP:s startmallar. Upprepa inte dig själv för vanliga applikationskrav.",
    "Discounted_Page_Title": "Rabatterad prissättning",
    "Discounted_Page_Description": "Välj de funktioner och den funktionalitet som ditt företag behöver redan idag. Köp en ABP-licens och skapa obegränsat med projekt",
    "Faq_Page_Title": "Vanliga frågor och svar (FAQ)",
    "Faq_Page_Description": "Har du några frågor eller funderingar? Sök bland vanliga frågor eller ställ en fråga till oss via kontaktformuläret.",
    "Faq_Page_SwiftCode": "SWIFT-kod",
    "Faq_Page_BankName": "Bankens namn",
    "Faq_Page_AccountName": "Kontots namn",
    "Faq_Page_AccountNumber": "Kontonummer",
    "Faq_Page_Currency": "Valuta",
    "Faq_Page_VatNumber": "Momsregistreringsnummer",
    "Faq_Page_OtherCurrenciesInfo": "För andra valutor, se <a href='{0}'>alla konton</a>",
    "ProjectCreatedSuccess_Page_Title": "Ditt projekt skapat",
    "ProjectCreatedSuccess_Page_Description": "Ditt ABP-projekt har skapats framgångsrikt!",
    "Suite_Page_Title": "ABP-svit",
    "Suite_Page_Description": "ABP tillhandahåller verktyg för snabb applikationsutveckling för att öka utvecklarens produktivitet. Med ABP Suite kan du enkelt skapa CRUD-sidor.",
    "Themes_Page_Title": "ABP Teman",
    "Themes_Page_Description": "ABP tillhandahåller flera professionella, moderna UI-teman. Skapa en gratis demo för att få en snabb bild av hur användargränssnittet ser ut.",
    "Tools_Page_Title": "Verktyg för snabb applikationsutveckling",
    "Tools_Page_Description": "ABP tillhandahåller verktyg för snabb applikationsutveckling för att öka utvecklarens produktivitet. Med ABP Suite kan du enkelt skapa CRUD-sidor.",
    "DeveloperPrice": "Pris för utvecklare",
    "AdditionalDeveloperPaymentInfoSection_AdditionalDevelopers": "{0} <small>utvecklare</small>",
    "LicenseRemainingDays": "för <span class=\"text-white\"> {0} </span> dagar",
    "ExtendPaymentInfoSection_Description": "Genom att förlänga/förnya din licens kommer du att fortsätta att få <a href=\"{0}\" target=\"_blank\">premium support</a>. Du kommer också att kunna få större eller mindre uppdateringar för moduler och teman. Du kommer att kunna fortsätta skapa nya projekt. Och du kommer fortfarande att kunna använda <a href=\"{1}\" target=\"_blank\">ABP Suite</a> som påskyndar din utveckling.",
    "LicenseRenewalPrice": "Pris för förnyelse av licens",
    "LicensePrice": "Licenspris",
    "TrialLicensePaymentInfoSection_Description": "<strong>Köp licens:</strong> Genom att köpa en licens kommer du att fortsätta att få <a href=\"{0}\" target=\"_blank\" rel=\"noopener\">premium support</a>. Du kommer också att kunna få större eller mindre uppdateringar för moduler och teman. Du kommer att kunna fortsätta skapa nya projekt. Och du kommer fortfarande att kunna använda <a href=\"{1}\" target=\"_blank\" rel=\"noopener\">ABP Suite</a> som påskyndar din utveckling.<br>Se <a href=\"{2}\" target=\"_blank\" rel=\"noopener\">jämförelsetabellen för licenser</a> för att kontrollera skillnaderna mellan licenstyperna.",
    "SelectTargetLicense": "Välj mållicens",
    "UpgradePaymentInfoSection_ExtendMyLicenseForOneYear": "Ja, förlänga min licens utgångsdatum med 1 år.",
    "UpgradePaymentInfoSection_WantToExtendLicense": "Vill du förlänga din licens med ytterligare 1 år?",
    "UpgradePaymentInfoSection_UpgradingWillNotExtendLicense": "Uppgradering kommer inte att förlänga licensens utgångsdatum!",
    "UpgradePaymentInfoSection_LicenseUpgradeDescription": "Genom att uppgradera din licens kommer du att bli befordrad till en högre licenstyp, vilket gör att du kan få ytterligare fördelar. Se <a href=\"/Priser\" target=\"_blank\">jämförelsetabellen för licenser</a> för att kontrollera skillnaderna mellan licenstyperna.",
    "Landing_Page_CustomerStories": "Customer Stories",
    "Landing_Page_OurGreatCustomers": "Våra fantastiska kunder",
    "Landing_Page_WebApplicationFramework": "Ramverk för webbapplikationer",
    "Landing_Page_WebDevelopmentPlatform": "Plattform för webbutveckling",
    "Landing_Page_CompleteWebDevelopmentPlatform": "Komplett plattform för webbutveckling",
    "Landing_Page_TryFreeDemo": "Prova gratis demo",
    "Landing_Page_StartingPointForWebApplications": "Utgångspunkten för ASP.NET Core-baserade webbapplikationer! Den är baserad på ABP-ramverket för bästa webbutveckling.",
    "Landing_Page_AbpProvidesSoftwareInfrastructure": "ABP Framework tillhandahåller en mjukvaruinfrastruktur för att utveckla utmärkta webbapplikationer med bästa praxis.",
    "Landing_Page_MicroserviceCompatibleArchitecture": "Kompatibel arkitektur för mikrotjänster",
    "Landing_Page_PreBuiltApplicationModulesAndThemes": "Förbyggda applikationsmoduler och teman",
    "Landing_Page_MultiTenantArchitecture": "Arkitektur för flera hyresgäster",
    "Landing_Page_MultiTenancyDescription": "SaaS-applikationer på ett enkelt sätt! Integrerad multi-tenancy från databas till användargränssnitt.",
    "Landing_Page_DDDIntroduction": "Designad och utvecklad utifrån DDD-mönster och principer. Ger en skiktad modell för din applikation.",
    "Landing_Page_CrossCuttingConcernsInfo": "Komplett infrastruktur för auktorisering, validering, undantagshantering, cachelagring, revisionsloggning, transaktionshantering med mera.",
    "Landing_Page_PreBuiltApplicationModules": "Förbyggda applikationsmoduler som omfattar de vanligaste kraven på webbapplikationer.",
    "Landing_Page_ChatModule": "Chatt",
    "Landing_Page_DocsModule": "Dokument",
    "Landing_Page_FileManagementModule": "Filhantering",
    "Landing_Page_CustomerStory_1": "ABP gjorde det möjligt för SC Ventures att leverera en bankklassad SaaS-plattform med silodatabas med flera hyresgäster på 9 månader för att stödja leverantörskedjans kundfordringar / leverantörsskulder för finansiering av fakturor med betydande värde från flera integrerade ankare. ABP:s modularitet gjorde det möjligt för teamet att leverera på rekordtid, klara alla VAPT och distribuera den containeriserade mikrotjänststacken via fullständig CI/CD och pipelines till produktion.",
    "Landing_Page_CustomerStory_2": "Vi ser värdet av att använda ABP för att minska omkostnaderna för anpassade utvecklingsprojekt. Teamet kan förenhetliga kodmönstret i olika projektflöden. Vi ser mer potential i ramverket för att vi ska kunna bygga nya funktioner snabbare än tidigare. Vi litar på att vi ständigt kommer att se värdet av att utnyttja ABP.",
    "Landing_Page_CustomerStory_3": "Vi älskar ABP. Vi behöver inte skriva allt från grunden. Vi utgår från out-of-the-box-funktioner och fokuserar bara på det vi verkligen behöver skriva. Dessutom är ABP välarkitekterat och koden är av hög kvalitet med färre buggar. Om vi hade varit tvungna att skriva allt vi behövde på egen hand hade vi kanske fått lägga ner flera år. Ytterligare en sak som vi gillar är att den nya versionen, problemfixningen eller förbättringen kommer ut mycket snart\n                                varannan vecka. Vi väntar inte för länge.",
    "Landing_Page_CustomerStory_4": "ABP är en fantastisk produkt som jag skulle rekommendera. Kommersiella produkter till marknaden för våra kunder i en enda konfigurerbar plattform. Den starthjälp som ramverket och verktygen ger alla team är värd varenda cent. ABP var det som passade bäst för våra behov.",
    "Landing_Page_AdditionalServices": "Anpassad eller volymlicens, onboarding, liveutbildning och support, anpassad projektutveckling, portning av befintliga projekt och mycket mer...",
    "Landing_Page_IncludedDeveloperLicenses": "Inkluderar <strong>{0}</strong> utvecklarlicenser",
    "Landing_Page_SeeOnDemo": "Se på Demo",
    "Landing_Page_LeptonThemes": "LeptonTema",
    "Landing_Page_AccountModuleDescription_1": "Denna modul implementerar autentiseringssystemet för en applikation;",
    "Landing_Page_AccountModuleDescription_2": "Tillhandahåller en <strong>inloggningssida</strong> med användarnamn och lösenord",
    "Landing_Page_AccountModuleDescription_3": "Tillhandahåller en <strong>register</strong>-sida för att skapa ett nytt konto.",
    "Landing_Page_AccountModuleDescription_4": "Tillhandahåller en <strong>glömt lösenord</strong>-sida för att skicka en <strong>återställningslänk för lösenord</strong> som ett e-postmeddelande.",
    "Landing_Page_AccountModuleDescription_5": "Ger <strong>email confirmation</strong>-funktionalitet med UI.",
    "Landing_Page_AccountModuleDescription_6": "Implementerar <strong>tvåfaktor</strong>-autentisering (SMS och e-post).",
    "Landing_Page_AccountModuleDescription_7": "Implementerar <strong>användarspärr</strong> (låser kontot under en viss tid när ett visst antal misslyckade inloggningar inträffar på grund av ogiltiga inloggningsuppgifter inom en viss tidsperiod).",
    "Landing_Page_AccountModuleDescription_8": "Implementerar användargränssnitt och funktionalitet för autentiseringsservern <strong>Identity Server</strong>.",
    "Landing_Page_AccountModuleDescription_9": "Gör det möjligt att <strong>växla mellan hyresgäster</strong> i en miljö med flera hyresgäster.",
    "Landing_Page_AccountModuleDescription_10": "Gör det möjligt att ändra <strong>UI-språk</strong> i programmet.",
    "Landing_Page_AuditLoggingModuleDescription_1": "Den här modulen tillhandahåller gränssnittet för rapportering av granskningsloggar för granskningsinfrastrukturen. Gör det möjligt att söka, filtrera och visa poster i granskningsloggen och loggar över enhetsändringar.",
    "Landing_Page_AuditLoggingModuleDescription_2": "En post i granskningsloggen består av kritisk information om varje klientförfrågan:",
    "Landing_Page_AuditLoggingModuleDescription_3": "URL, webbläsare, IP-adress, klientnamn",
    "Landing_Page_AuditLoggingModuleDescription_4": "Användaren",
    "Landing_Page_AuditLoggingModuleDescription_5": "HTTP-metod, HTTP-returstatuskod",
    "Landing_Page_AuditLoggingModuleDescription_6": "Framgång/misslyckande, detaljer om undantag om sådana finns",
    "Landing_Page_AuditLoggingModuleDescription_7": "Tid för genomförande av begäran",
    "Landing_Page_AuditLoggingModuleDescription_8": "Enheterna har skapats, tagits bort eller uppdaterats i denna begäran (med ändrade egenskaper).",
    "Landing_Page_BloggingModuleDescription_1": "Denna modul lägger till en enkel blogg i din ABP-applikation;",
    "Landing_Page_BloggingModuleDescription_2": "Gör det möjligt att skapa flera bloggar i en och samma applikation.",
    "Landing_Page_BloggingModuleDescription_3": "Stöder Markdown-formatet.",
    "Landing_Page_BloggingModuleDescription_4": "Gör det möjligt att skriva en kommentar till ett inlägg.",
    "Landing_Page_BloggingModuleDescription_5": "Gör det möjligt att tilldela taggar till blogginläggen.",
    "Landing_Page_BloggingModuleDescription_6": "Se webbplatsen <a href=\"blog.abp.io\">blog.abp.io</a> som ett levande exempel på bloggmodulen.",
    "Landing_Page_ChatModuleDescription_1": "Denna modul används för realtidsmeddelanden mellan användare i applikationen.",
    "Landing_Page_ChatModuleDescription_2": "Meddelanden i realtid på chatt-sidan.",
    "Landing_Page_ChatModuleDescription_3": "Sök efter användare i applikationen för nya konversationer.",
    "Landing_Page_ChatModuleDescription_4": "Kontaktlista för senaste konversationer.",
    "Landing_Page_ChatModuleDescription_5": "Meddelanden om nya meddelanden när användaren tittar på en annan sida.",
    "Landing_Page_ChatModuleDescription_6": "Symbol för totalt antal olästa meddelanden på menyikonen.",
    "Landing_Page_ChatModuleDescription_7": "Antal olästa meddelanden för varje konversation.",
    "Landing_Page_ChatModuleDescription_8": "Lata laddade konversationer.",
    "Landing_Page_DocsModuleDescription_1": "Denna modul används för att skapa webbplatser för teknisk dokumentation;",
    "Landing_Page_DocsModuleDescription_2": "Inbyggd <strong>GitHub-integration</strong>: Skriv och hantera dokument direkt på GitHub.",
    "Landing_Page_DocsModuleDescription_3": "Stöd för <strong>Versioning</strong> direkt integrerat i GitHub-utgåvor.",
    "Landing_Page_DocsModuleDescription_4": "Stöd för <strong>flerspråkighet</strong> (med fallback-stöd till standardspråket).",
    "Landing_Page_DocsModuleDescription_5": "Stöder formaten <strong>Markdown</strong> och HTML.",
    "Landing_Page_DocsModuleDescription_6": "Innehåller en <strong>navigation</strong> och en <strong>outline</strong>.",
    "Landing_Page_DocsModuleDescription_7": "Gör det möjligt att hosta <strong>flera projekt</strong> dokumentation i en enda applikation.",
    "Landing_Page_DocsModuleDescription_8": "Länkar till filen på GitHub, så att vem som helst enkelt kan bidra genom att klicka på <strong>Edit-länken</strong>.",
    "Landing_Page_DocsModuleDescription_9": "Förutom GitHub-källan kan du helt enkelt använda en mapp som dokumentationskälla.",
    "Landing_Page_FileManagementModuleDescription_1": "Ladda upp, ladda ner och organisera filer i en hierarkisk mappstruktur.",
    "Landing_Page_FileManagementModuleDescription_2": "Den här modulen används för att ladda upp, ladda ner och organisera filer i en hierarkisk mappstruktur. Den är också kompatibel med multi-tenancy och du kan bestämma den totala storleksgränsen för dina hyresgäster.",
    "Landing_Page_FileManagementModuleDescription_3": "Den här modulen är baserad på <a href=\"https://docs.abp.io/en/abp/latest/Blob-Storing\">BLOB-lagring</a>-systemet, så den kan använda olika lagringsleverantörer för att lagra filinnehållet.",
    "Landing_Page_IdentityModuleDescription_1": "Denna modul implementerar användar- och rollsystemet i en applikation;",
    "Landing_Page_IdentityModuleDescription_2": "Bygger på <a href=\"https://docs.microsoft.com/en-us/aspnet/core/security/authentication/identity\">Microsofts ASP.NET Core Identity</a>-bibliotek.",
    "Landing_Page_IdentityModuleDescription_3": "Hantera <strong>roller</strong> och <strong>användare</strong> i systemet. En användare kan ha <strong>flera roller</strong>.",
    "Landing_Page_IdentityModuleDescription_4": "Ange <strong>behörigheter</strong> i roll- och användarnivåer.",
    "Landing_Page_IdentityModuleDescription_5": "Aktivera/avaktivera <strong>tvåfaktorautentisering</strong> och <strong>låsning</strong> av användare per användare.",
    "Landing_Page_IdentityModuleDescription_6": "Hantera grundläggande <strong>användarprofil</strong> och <strong>lösenord</strong>.",
    "Landing_Page_IdentityModuleDescription_7": "Hantera <strong>anspråkstyper</strong> i systemet, koppla anspråk till roller och användare.",
    "Landing_Page_IdentityModuleDescription_8": "Inställningssida för att hantera <strong>lösenordskomplexitet</strong>, användarinloggning, konto och spärr.",
    "Landing_Page_IdentityModuleDescription_9": "Stöd för <strong>LDAP</strong>-autentisering.",
    "Landing_Page_IdentityModuleDescription_10": "Ger verifiering av <strong>e-postadress och telefonnummer</strong>.",
    "Landing_Page_IdentityModuleDescription_11": "Stödjer integrering av sociala inloggningar (Twitter, Facebook, GitHub etc.).",
    "Landing_Page_IdentityModuleDescription_12": "Hantera <strong>organisationsenheter</strong> i systemet.",
    "Landing_Page_PaymentModuleDescription_1": "Ger integration för olika betalningsgateways.",
    "Landing_Page_PaymentModuleDescription_2": "Denna modul ger integration för betalningsgateways, så att du enkelt kan få betalning från dina kunder.",
    "Landing_Page_PaymentModuleDescription_3": "Denna modul stöder följande betalningsportaler",
    "Welcome_Page_UseSameCredentialForCommercialWebsites": "Använd samma autentiseringsuppgifter för både <a href=\"https://abp.io\" class=\"text-primary\">abp.io</a> och <a href=\"https://abp.io/support\" class=\"text-primary\">abp.io/support</a>.",
    "WatchCrudPagesVideo": "Titta på videon \"Skapa CRUD-sidor med ABP Suite\"!",
    "WatchGeneratingFromDatabaseVideo": "Titta på videon \"ABP Suite: Generera CRUD-sidor från befintliga databastabeller\" Video!",
    "WatchTakeCloserLookVideo": "Titta på videon \"Ta en närmare titt på kodgenerering: ABP Suite\" Video!",
    "ConfirmedEmailAddressRequiredToStartTrial": "Du måste ha en bekräftad e-postadress för att kunna starta en testlicens.",
    "EmailVerificationMailNotSent": "E-postverifiering mail kunde inte skickas.",
    "GetConfirmationEmail": "<a href=\"javascript:void(0);\" id=\"{0}\" class=\"text-decoration-underline\">Klicka här för att få ett verifieringsmejl</a> om du inte har fått det tidigare.",
    "WhichLicenseTypeYouAreInterestedIn": "Vilken licenstyp är du intresserad av?",
    "DontTakeOurWordForIt": "Ta inte vårt ord för det...",
    "ReadAbpCommercialUsersWantYouToKnow": "Läs vad ABP:s användare vill att du ska veta",
    "Testimonial_ShortDescription_1": "ABP:s modularitet gjorde det möjligt för teamet att leverera i tid.",
    "Testimonial_ShortDescription_2": "Bygg nya funktioner snabbare än tidigare.",
    "Testimonial_ShortDescription_3": "Vi utgår från out-of-the-box-funktioner och fokuserar bara på det som vi verkligen behöver skriva.",
    "Testimonial_ShortDescription_4": "ABP passade bäst för våra behov.",
    "OnlineReviewersOnAbpCommercial": "Online recensioner om ABP",
    "SeeWhatToldAboutAbpCommercial": "Se vad som har sagts om ABP och skriv dina tankar om du vill.",
    "BlazoriseLicense": "Måste vi köpa en Blazorise-licens?",
    "BlazoriseLicenseExplanation": "Vi har ett avtal mellan Volosoft och Megabit, med detta avtal är Blazorise-licensen buntad med ABP-produkter, därför behöver våra kunder inte köpa en extra Blazorise-licens.",
    "ExtendPaymentInfoSection_DeveloperPrice": "{0}x Ytterligare utvecklare",
    "ExtendPaymentInfoSection_DiscountRate": "Rabatt {0}%.",
    "TotalNetPrice": "Totalt nettopris",
    "EFCore": "Entity Framework Core",
    "All": "Alla",
    "Mvc": "MVC",
    "DataBaseProvider": "Dataleverantör",
    "UIFramework": "Ramverk för användargränssnitt",
    "LeptonXThemeForDashboard": "LeptonX Theme för din Admin Dashboard av",
    "AbpPlatform": "ABP-plattform",
    "YouDeserveGoodUXUI": "Du förtjänar ett bra UI och ett bättre UX. LeptonX Theme by ABP är här för att tjäna det.",
    "ViewLiveDemo": "Visa demo för live-tema",
    "GetLeptonX": "Skaffa LeptonX nu",
    "SeeLeptonXDocumentation": "Se LeptonX dokumentation",
    "SeeLeptonDocumentation": "Se Lepton Dokumentation",
    "SimplifiedMenu": "Förenklad meny",
    "SimplifiedMenuDescription": "Du kan enkelt hitta den sida du letar efter genom att filtrera i menyn",
    "YourFavoritePages": "Dina favoritsidor inom räckhåll",
    "YourFavoritePagesDescription": "Lägg enkelt till eller ta bort sidan från favoriter genom att klicka på stjärnikonen i det övre högra hörnet av sidan.",
    "BreadCrumbs": "Breadcrumb för sömlös växling",
    "BreadCrumbsDescription": "Med Breadcrumb kan du växla till sidorna på samma nivå med ett klick, även när vänstermenyn är stängd, och det fungerar på surfplattor och mobiler!",
    "YourMenu": "Din meny som du vill ha den",
    "YourMenuDescription": "Anpassa de direktklickbara ikonerna och rullgardinsmenyerna i användarmenyn som du vill. Användarmenyn är helt anpassningsbar efter dina behov",
    "RtlSupport": "RTL-stöd för ditt språk",
    "RtlSupportDescription": "LeptonX Theme stöder RTL för ditt språk. Språkalternativen finns i inställningsmenyn så att du kan ändra språk.",
    "YourColors": "Dina färger i gränssnittet för din adminpanel",
    "YourColorsDescription": "LeptonX Theme fungerar enligt dina systeminställningar och har alternativ för dashboard light theme, dashboard dark theme och dashboard semi-dark theme.",
    "ArrangeContentWidth": "Ordna enkelt bredden på ditt innehåll",
    "ArrangeContentWidthDescription": "Ändra enkelt bredden på din innehållsyta.",
    "LeptonXCompatibleWith": "LeptonX Theme är kompatibelt med",
    "MobileResponsiveTemplate": "Mobil responsiv mall",
    "MobileResponsiveTemplateDescription1": "Få tillgång till LeptonX adminpanel från vilken enhet du vill.",
    "MobileResponsiveTemplateDescription2": "Den är utformad för att du enkelt ska kunna använda den i alla dina enheter. Den är responsiv på mobila enheter och surfplattor.",
    "TopMenuLayoutOption": "Alternativ för layout av toppmeny",
    "TopMenuLayoutOptionDescription1": "Om du vill konfigurera din webbplats med samma adminpanel är det möjligt att göra det med LeptonX Theme!",
    "TopMenuLayoutOptionDescription2": "Prova bara LeptonX toppmenylayout för att få det att hända!",
    "EasilyCustomizable": "Lätt att anpassa till ditt varumärkes färger",
    "EasilyCustomizableDescription1": "Du kan anpassa LeptonX-temat med bara några få SCSS-variabler. Ingen åsidosättning, ingen extra CSS-belastning!",
    "EasilyCustomizableDescription2": "Med LeptonX kan du ordna din adminpanel precis som du vill.",
    "IndependentLayout": "Oberoende layout och innehållsyta",
    "IndependentLayoutDescription1": "LeptonX:s layoutinfrastruktur utformades helt separat från innehållet.",
    "IndependentLayoutDescription2": "Detta innebär att du fritt kan utforma ditt projekt med en annan innehållsstruktur än Bootstrap om du vill.",
    "MostUsedLibraries": "De mest använda biblioteken integrerade med LeptonX",
    "MostUsedLibrariesDescription1": "LeptonX innehåller dina mest använda bibliotek. Det gör att du enkelt kan använda bibliotek som ApexCharts, DataTables, DropZone, FullCalender, JSTree, Select2 och Toastr.",
    "MostUsedLibrariesDescription2": "LeptonX stöder också MVC Angular och Blazor-specifika bibliotek.",
    "CreateAndCustomize": "Skapa och anpassa de sidor du behöver på några sekunder med LeptonX anpassade sidor",
    "CreateAndCustomizeDescription": "Genom att använda LeptonX Theme får du också tillgång till många färdiga HTML-sidor. Dessa inkluderar många sidor som inloggningssida, blogg, FAQ, prenumerationslista, faktura, prissättning och filhantering.",
    "LeptonThemeForAdmin": "Lepton Theme för din adminpanel genom att",
    "LeptonThemeForAdminDescription": "Lepton Theme är fortfarande tillgängligt och kommer att underhållas. Om du vill byta till LeptonX Theme som Lepton Theme-användare kan du se dokumentationen för att lära dig hur du gör.",
    "LeptonCompatibleWith": "Lepton Theme är kompatibelt med",
    "BlackFridayDiscount": "Black Friday-rabatt",
    "UpgradePaymentInfoSection_DeveloperPrice": "{0} för {1} ytterligare utvecklare",
    "Upgrade": "Uppgradering",
    "Renewal": "Förnyelse",
    "UpgradePaymentInfoSection_LicensePrice": "{0} licens",
    "UpgradePaymentInfoSection_LicenseRenewalPrice": "Förnyelse av licens",
    "Total": "Totalt",
    "SupportPolicyFaqTitle": "Vilken är er supportpolicy?",
    "SupportPolicyFaqExplanation": "Vi stöder endast den aktiva och den tidigare huvudversionen. Vi garanterar inte en patchrelease för den tredje och äldre huvudversionen. Till exempel, om den aktiva versionen är 7.0.0, kommer vi att släppa patchversioner för både 6.x.x och 7.x.x. Dessutom ger vi support endast för ABP Framework och ABP-relaterade problem. Det betyder att inget stöd ges för tredjepartsapplikationer, molntjänster och andra perifera bibliotek som används av ABP-produkter. Vi kommer att använda kommersiellt rimliga ansträngningar för att ge våra kunder teknisk support under \"Volosoft Bilisim A.S\" officiella öppettider. Å andra sidan förbinder vi oss inte till en svarstid enligt servicenivåavtal (SLA), men vi kommer att försöka svara på de tekniska frågorna så snabbt som möjligt inom våra officiella arbetstider. Om inte en särskild överenskommelse görs med kunden tillhandahåller vi endast support på https://support.abp.io. Vi har också en privat e-postsupport som endast är tillgänglig för innehavare av Enterprise-licenser.",
    "TotalDevelopers": "Totalt {0} utvecklare",
    "CustomPurchaseExplanation": "Skräddarsydd för dina specifika behov",
    "WhereDidYouHearAboutUs": "Var har du hört talas om oss?",
    "Twitter": "Twitter",
    "Facebook": "Facebook",
    "Youtube": "YouTube",
    "Google": "Google",
    "Github": "GitHub",
    "Friend": " Från en vän",
    "Other": "Övriga",
    "WhereDidYouHearAboutUs_explain": "Ange ...",
    "DeletingMemberWarningMessage": "\"{0}\" kommer att tas bort från listan över utvecklare. Om du vill kan du tilldela denna tomma plats till en annan utvecklare senare.",
    "AdditionalInfo": "Om antalet platser för utvecklare överstiger dina krav kan du minska dem. Du kan skicka e-post till <a href=\"mailto:info@abp.io\">info@abp.io</a> för att ta bort några av dina utvecklarplatser. Om du rensar bort oanvända utvecklarplatser minskar kostnaden för licensförnyelse. Om du vill kan du återköpa ytterligare utvecklarplatser inom din aktiva licensperiod. Observera att eftersom det finns {0} utvecklare i det här licenspaketet kan du inte minska detta antal.",
    "LinkExpiredErrorMessage": "Länken du försöker komma åt har gått ut.",
    "ExpirationDate": "Utgångsdatum",
    "SpringCampaignDiscount": "Rabatt på vårkampanjen",
    "WhyUseAbpIoPlatform": "Varför ska jag använda ABP.IO-plattformen i stället för att skapa en ny lösning från grunden?",
    "WhyUseAbpIoPlatformFaqExplanation": "Se <a href=\"/why-abp-io\"> den sidan </a> för en detaljerad förklaring av varför användning av ABP.IO Platform har en betydande fördel jämfört med att göra allt själv.",
    "EulaPageTitle": "Licensavtal för slutanvändare (EULA)",
    "PrivacyPolicyPageTitle": "Integritetspolicy - Cookiepolicy",
    "TermsConditionsPageTitle": "Villkor och anvisningar",
    "TrainingsPageTitle": "ABP:s utbildningspaket",
    "ModulesPageTitle": "ABP Förbyggda applikationsmoduler",
    "Volo.AbpIo.Commercial:040001": "API-åtkomstnyckeln är felaktig.",
    "GetLepton": "Skaffa Lepton nu",
    "MyOrganizations_Detail_LicenseStartDate": "Startdatum",
    "MyOrganizations_Detail_LicenseExpiryDate": "Utgångsdatum",
    "BlazoriseSupport": "Hur får jag Blazorise-licensnyckeln och support från Blazorise-teamet?",
    "BlazoriseSupportExplanation": "Följ stegen nedan för att få support från Blazorise-teamet och få din Blazorise-licensnyckel:",
    "BlazoriseSupportExplanation1": "Registrera dig för ett nytt konto på <a href=\"https://blazorise.com/support/register\">blazorise.com/support/register</a> med samma e-postadress som ditt abp.io-konto. Lämna posten \"Licensnyckel\" tom. <strong>Det måste vara samma e-postadress som ditt e-postkonto på abp.io</strong>.",
    "BlazoriseSupportExplanation2": "Verifiera din e-postadress genom att kolla din e-postlåda. Kontrollera din skräppostlåda om du inte ser ett e-postmeddelande i din inkorg!",
    "BlazoriseSupportExplanation3": "Logga in på Blazorise supportwebbplats på <a href=\"https://blazorise.com/support/login\">blazorise.com/support/login</a>.",
    "BlazoriseSupportExplanation4": "Om du har en aktiv ABP betald licens kommer du också att ha en Blazorise PRO-licens. Du kan få din Blazorise-licensnyckel på <a href=\"https://blazorise.com/support/user/manage/license\">blazorise.com/support/user/manage/license</a>.",
    "BlazoriseSupportExplanation5": "Du kan ställa dina frågor på supportwebbplatsen och generera en produkttoken för din applikation.",
    "AbpLiveTrainingPackages": "ABP Live utbildningspaket",
    "Releases": "Utgåvor",
    "ReleasesDescription": "Den här sidan innehåller detaljerad information om varje release. Du kan se alla stängda pull requests för en specifik release. För övergripande milstolpsutvecklingar kan du kolla in <a href=\"https://abp.io/docs/latest/release-notes\">sidan med kortfattade releaseanteckningar</a>.",
    "ReleaseDate": "Utgivningsdatum",
    "Labels": "Etiketter",
    "PreRelease": "Förhandsrelease",
    "AllTypes": "Alla typer",
    "Enhancement": "Förbättring",
    "Bug": "Insekt",
    "Feature": "Funktion",
    "AllUIs": "Alla användargränssnitt",
    "MVC": "MVC",
    "BlazorServer": "Blazor Server",
    "MAUI": "MAUI",
    "HowItWorks_Page_Title": "Hur fungerar det?",
    "HowItWorks_Page_Description": "ABP Framework utökar .NET-plattformen. Så allt du kan göra med en vanlig .NET-lösning är redan möjligt med ABP Framework. Det gör det enkelt att komma igång med en låg inlärningskurva.",
    "HowItWorks_Description1": "ABP Framework utökar .NET-plattformen. Så allt du kan göra med en vanlig .NET-lösning är redan möjligt med ABP Framework. Det gör det enkelt att komma igång med en låg inlärningskurva.",
    "HowItWorks_Description2": "När du väl har börjat lära dig och använda ABP Framework-funktionerna kommer det att bli mycket roligare än någonsin att utveckla din programvara.",
    "HowItWorks_Description3": "Den här sidan förklarar i princip hur du använder ABP.IO Platform som .NET-utvecklare.",
    "CreateANewSolution": "Skapa en ny .NET-lösning",
    "CreateANewSolution_Description1": "Allt börjar med att skapa en ny ABP-integrerad .NET-lösning.",
    "StartWithStartupTemplates": "Starta en av de förbyggda <a href=\"/startup-templates\">mallarna för startup-lösningar</a>",
    "SimpleMonolithApplicationTemplate": "Enkel mall för monolitisk applikation",
    "LayeredApplicationTemplate": "Skiktad applikationsmall",
    "MicroserviceSolutionTemplate": "Mall för mikroservicelösning",
    "CreateEmptySolutionAndUseAbp": "Eller skapa en ny tom .NET-lösning och installera ABP NuGet & NPM <a href=\"https://abp.io/packages\" target=\"_blank\">paket</a> själv.",
    "CreatingSolutionWithMultipleOptions": "Det finns flera alternativ för användargränssnitt och databas när du skapar en ny lösning.",
    "UIFrameworkOptions": "Alternativ för användargränssnitt",
    "DotnetSolutionWithoutDependency": "Nu har du en vanlig .NET-lösning i din lokala dator som inte är beroende av någon molnplattform eller extern tjänst.",
    "CheckTheDocumentForDetails": "Du kan kontrollera <a href=\"{0}\" target=\"_blank\">{1}</a> dokumentet för detaljer.",
    "UIAndDatabaseIndependent": "ABP kan fungera med alla användargränssnitt och alla databasleverantörer som stöds av .NET.\n Dessa användargränssnitt och databasleverantörer är dock förintegrerade och väldokumenterade.",
    "InstallAbpModules": "Installera ABP-moduler",
    "DevelopYourSolution": "Utveckla din lösning",
    "DeployAnywhere": "Distribuera var som helst",
    "InstallAbpModule_Description1": "ABP är ett modulärt ramverk för applikationsutveckling. Mallarna för startup-lösningar levereras redan med de viktigaste modulerna installerade.\n Men det finns fler applikationsmoduler som du kanske vill använda i din lösning.",
    "InstallAbpModule_Description2": "Varje modul består av ett fåtal NuGet- och NPM-paket och har ett installationsdokument. <a href=\"/tools/suite\">ABP Suite</a> gör det mesta av arbetet automatiskt, sedan konfigurerar eller finjusterar du modulen manuellt baserat på dess dokumentation.",
    "DevelopYourSolution_Description1": "ABP:s infrastruktur gör att du kan <b class=\"text-white\">fokusera på din egen affärskod</b> genom att automatisera det repetitiva arbetet och tillhandahålla förbyggd infrastruktur och applikationsfunktioner</a>.",
    "DevelopYourSolution_Description2": "I följande kodblock kan du se hur ABP Framework sömlöst integreras i din kod och automatiserar de repetitiva uppgifterna åt dig.",
    "DevelopYourSolution_Description3": "Även i detta kortkodsblock gör ABP en hel del saker åt dig.",
    "DevelopYourSolution_Description4": "Den tillhandahåller basklasser för att tillämpa konventioner, som\n <a href=\"https://docs.abp.io/en/abp/latest/Dependency-Injection\" target=\"_blank\">dependency injection</a>. Generiska\n <a href=\"https://docs.abp.io/en/abp/latest/Repositories\" target=\"_blank\">repository</a> tjänster ger ett bekvämt sätt att\n sätt att interagera med databasen. Deklarativ\n <a href=\"https://docs.abp.io/en/abp/latest/Authorization\" target=\"_blank\">auktorisering</a> arbetar med ett finjusterat behörighetssystem.",
    "DevelopYourSolution_Description5": "ABP automatiserar helt och hållet\n <a href=\"https://docs.abp.io/en/abp/latest/Unit-Of-Work\" target=\"_blank\">arbetsenhet</a> (för databasanslutning och transaktionshantering),\n <a href=\"https://docs.abp.io/en/abp/latest/Exception-Handling\" target=\"_blank\">undantagshantering</a>,\n <a href=\"https://docs.abp.io/en/abp/latest/Validation\" target=\"_blank\">validering</a>\n och <a href=\"https://docs.abp.io/en/abp/latest/Audit-Logging\" target=\"_blank\">auditloggning</a>. Det ger många fler byggstenar för att förenkla dina dagliga utvecklingsuppgifter och fokusera på din egen kod medan du skapar produktionsklara\n applikationer.",
    "DevelopYourSolution_Description6": "Du kan föreställa dig hur långt och komplicerat det kodblocket kan bli om du skulle göra allt manuellt.",
    "SuiteCrudGenerationInFewSeconds": "Förutom att handkoda din lösning kan du skapa fullt fungerande avancerade CRUD-sidor på några minuter med hjälp av ABP Suite-verktyget. Det genererar koden till din lösning, så att du kan finjustera den utifrån dina anpassade krav.",
    "DeployAnywhere_Description1": "I slutändan har du en ren .NET-lösning. Du kan distribuera din lösning till din egen server, till en molnplattform, till Kubernetes eller var du vill. Du kan distribuera till så många servrar som du vill. ABP är ett agnostiskt verktyg för driftsättningsmiljöer.",
    "ExpertiseAbpFramework": "Expertis ABP-ramverket",
    "ExpertiseAbpFramework_Description1": "Vill du gå längre än till grunderna och få expertis inom ABP.IO-plattformen?",
    "FreeDownload": "Fri nedladdning",
    "Read": "Läs",
    "HavingTrouble": "Har du problem?",
    "HavingTrouble_Description1": "Har du problem med att utveckla din lösning? Vi finns här för dig! Använd ABP:s supportplattform\n eller skicka ett e-postmeddelande för att få hjälp direkt från Core ABP Framework-teamets medlemmar.",
    "WeAreHereToHelp_Description1": "Du kan bläddra bland våra hjälpämnen eller söka i vanliga frågor,\n eller så kan du ställa en fråga till oss genom att använda kontaktformuläret.",
    "OtherModules": "Övriga moduler",
    "OtherModules_Description1": "Konto, Audit Logging, Chatt, CMS Kit, Filhantering, Formulär, GDPR, Identitet, Språkhantering, Betalning, Saas och mer ...",
    "HowItWorks_DatabaseProviderOptions": "Alternativ för databasleverantör",
    "SeeFAQ": "Se vanliga frågor",
    "ReleaseLogs": "Release Loggar",
    "ReleaseLogs_Tag": "{0} Loggar för frisläppande",
    "ReleaseLogs_Pr": "Pull Request #{0} - {1}",
    "NoLabels": "Inga etiketter",
    "DoesTheSubscriptionRenewAutomatically": "Förnyas abonnemanget automatiskt?",
    "DoesTheSubscriptionRenewAutomaticallyExplanation": "ABP.IO-plattformen har inte en faktureringsmodell för automatisk förnyelse. Därför kommer <strong>din prenumeration inte att förnyas automatiskt</strong> i slutet av din licensperiod. Om du vill fortsätta att ha fördelarna med ABP.IO-plattformen måste du förnya den manuellt på <a href=\"{0}\">sidan för organisationshantering</a>. Om du har flera organisationer klickar du på knappen \"Hantera\" på din organisation som löper ut och klickar sedan på knappen \"Förläng nu\" för att förnya din licens. Du kanske också vill ta en titt på avsnittet <a href=\"/faq#vad-händer-när-licensen-gårut\">Vad händer när min licens går ut?</a>.",
    "DoesTheSubscriptionRenewAutomaticallyExplanationAutoRenewal": "ABP tillåter dig att automatiskt förnya din licens. Detta är en valfri tjänst. Du kan växla den här funktionen när du köper en ny licens eller senare aktivera den från din <a href=\"https://abp.io/my-organizations\">organisationshanteringssida.</a> Växling för automatisk förnyelse finns i avsnittet \"Betalningsmetod\" på <a href=\"https://abp.io/my-organizations\">organisationshanteringssidan.</a> Om du vill stänga av automatisk förnyelse, besök <a href=\"https://abp.io/my-organizations\">organisationshanteringssidan, </a>gå till avsnittet \"Betalningsmetod\" och avmarkera kryssrutan \"Automatisk förnyelse\". När du stänger av funktionen för automatisk förnyelse måste du förnya din licens själv.",
    "ExtraQuestionCreditsFaqTitle": "Kan jag köpa extra poäng för supportfrågor?",
    "ExtraQuestionCreditsFaqExplanation": "Ja, det kan du göra. För att köpa extra frågepoäng, skicka ett e-postmeddelande till <a href=\"mailto:info@abp.io\">info@abp.io</a> med din organisations namn. Här är prislistan för de extra frågekrediterna: <ul><li>50 frågor paket $999</li><li>25 frågor paket $625</li><li>15 frågor paket $450</li></ul>",
    "AlreadyBetaTester": "Du har redan gått med i betatestarprogrammet.",
    "AbpStudio": "ABP Studio",
    "AbpStudio_Description": "ABP Studio är fortfarande under utveckling. Du kan fylla i formuläret nedan för att bli en av de första användarna.",
    "AbpStudio_Description1": "ABP Studio är en <span class=\"text-highlight-white\">plattformsoberoende skrivbordsapplikation</span> för ABP-utvecklare.",
    "AbpStudio_Description2": "Det är <span class=\"text-highlight-white\">väl integrerat</span> i ABP-ramverket och syftar till att tillhandahålla en bekväm utvecklingsmiljö för dig genom att <span class=\"text-highlight-white\">automatisera saker, ge insikter</span> om din lösning, vilket gör det mycket enklare att <span class=\"text-highlight-white\">utveckla, köra</span> och <span class=\"text-highlight-white\">distribuera</span> dina lösningar.",
    "AbpStudio_ComingSoon": "Om du vill testa ABP Studio före alla andra kan du bli BETA-testare",
    "AbpStudio_PlannedPreviewDate": "Planerat utgivningsdatum för förhandsvisning: Q4 år 2023.",
    "BetaRequest": "Beta förfrågan",
    "CreateNewSolutions": "Skapa nya lösningar",
    "CreateNewSolutions_Description1": "Du kan enkelt skapa allt från enkla applikationer till modulära monolit- eller mikroservicelösningar med många alternativ. Du får en fullständig produktionsfärdig basprogramvarulösning för ditt företag.",
    "ArchitectYourSolutions": "Arkitekt för dina lösningar",
    "ArchitectYourSolutions_Description1": "Bygg enklare monolitiskt modulära och mikrotjänstbaserade lösningsstrukturer genom att skapa moduler eller tjänster och upprätta relationer mellan dem. Du kan också installera eller avinstallera förbyggda applikationsmoduler.",
    "ExploreYourSolution": "Utforska din lösning",
    "ExploreYourSolution_Description1": "ABP Studio visar en vy på hög nivå av komponenterna i din lösning och de moduler som din lösning är beroende av. Du kan utforska entiteter, tjänster, HTTP API:er och mycket mer utan att behöva öppna din kodbas.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze": "Kör multiapplikations- eller microservice-lösningar på ett kick",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description1": "Kör en, <span class=\"text-highlight-white\">flera</span> eller <span class=\"text-highlight-white\">alla tjänster</span> med ett enda klick. På så sätt är det mycket enkelt att stoppa en tjänst, köra den i Visual Studio för att <span class=\"text-highlight-white\">testa</span> eller <span class=\"text-highlight-white\">debugga</span>.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description2": "Se en lista över tjänster, visa <span class=\"text-highlight-white\"> HTTP Request</span> i realtid och <span class=\"text-highlight-white\"> antal undantag</span> för varje tjänst.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description3": "Se alla detaljer om alla <span class=\"text-highlight-white\">HTTP-begäranden</span> som kommer till en tjänst.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description4": "Utforska <span class=\"text-highlight-white\">undantagsdetaljer</span> i realtid i alla tjänster, filtrera och sök enkelt.",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description5": "Visa <span class=\"text-highlight-white\">applikationsloggarna</span>, filtrera efter loggnivå eller sök efter text...",
    "RunMultiApplicationOrMicroserviceSolutionsInABreeze_Description6": "<span class=\"text-highlight-white\">Bläddra</span> genom användargränssnittet i din applikation utan att lämna solution runner.",
    "IntegrateToYourKubernetesCluster": "Integrera till ditt Kubernetes-kluster",
    "IntegrateToYourKubernetesCluster_Description1": "<span class=\"text-highlight-white\">Koppla din lokala utvecklingsmiljö till ett lokalt eller avlägset Kubernetes-kluster</span>, där klustret redan kör din mikrotjänstlösning.",
    "IntegrateToYourKubernetesCluster_Description2": "Få åtkomst till alla tjänster i Kubernetes med deras tjänstenamn som DNS, precis som om de körs på din lokala dator.",
    "IntegrateToYourKubernetesCluster_Description3": "<span class=\"text-highlight-white\">Interceptera vilken tjänst som helst</span> i det klustret, så att all <span class=\"text-highlight-white\">trafik till den intercepterade tjänsten automatiskt omdirigeras till din tjänst </span>som körs i din lokala maskin. När din tjänst behöver använda någon tjänst i Kubernetes omdirigeras trafiken tillbaka till klustret, precis som om din lokala tjänst körs inuti Kubernetes.",
    "GetInformed": "Bli informerad",
    "Studio_GetInformed_Description1": "Lämna din kontaktinformation för att <span class=\"text-highlight-white\">få information</span> och <span class=\"text-highlight-white\">pröva först</span> när ABP Studio har lanserats.",
    "Studio_GetInformed_Description2": "Planerat utgivningsdatum för förhandsvisning: Q3 år 2023.",
    "ThankYou!": "Tack så mycket!",
    "SendBetaRequest": "Skicka Beta förfrågan",
    "YouJoinedTheBetaTesterProgram": "Du har gått med i betatestarprogrammet för ABP Studio.",
    "PricingExplanation2": "30 dagars pengarna tillbaka-garanti - <a href=\"/faq#refund-policy\">Läs mer</a>",
    "MoneyBackGuaranteeText": "* 30-dagars pengarna-tillbaka-garanti på alla licenser! 100% återbetalning på Team-, 60% återbetalning på Business- och Enterprise-licenser inom 30 dagar.",
    "MobileApplicationStartupTemplates": "Mallar för uppstart av mobilapplikationer",
    "MobileApplicationStartupTemplates_Description1": "Integrerade startmallar för mobilapplikationer för dina ABP-lösningar.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates": "Skapa kraftfulla affärsapplikationer med hjälp av ABP Mobile Startup Templates",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description1": "ABP tillhandahåller två startmallar för mobilapplikationer som implementerats med <span class=\"text-highlight\">React Native</span> och <span class=\"text-highlight\">.NET MAUI.</span> När du skapar din nya ABP-baserade lösning kommer du också att ha grundläggande startapplikationer som är anslutna till dina backend-API:er.",
    "CreatePowerfulLineOfBusinessApplicationsUsingABPMobileStartupTemplates_Description2": "Applikationen har en förbyggd autentiseringstokencykel, <span class=\"text-highlight\">stöd för flera språk, stöd för flera behörigheter, inloggning, glömt lösenord, profilhantering och en användarhanteringssida</span>. Du kan lägga till din egen affärslogik och anpassa den utifrån dina krav.",
    "TwoFrameworkOptions": "Två alternativ för ramverk",
    "TwoFrameworkOptions_Description": "ABP tillhandahåller både <span class=\"text-highlight\">React Native</span> och <span class=\"text-highlight\">.NET MAUI</span> mobila startup-mallar. På så sätt kan du välja den som bäst passar dina behov. Båda apparna återanvänder kod i den högsta graden mellan iOS- och Android-plattformarna.",
    "PreIntegratedToYourBackend": "Förintegrerad till din backend",
    "PreIntegratedToYourBackend_Description": "ABP Mobile-applikationer är förintegrerade med dina backend-API:er. Den får en giltig autentiseringstoken från servern och gör autentiserade förfrågningar.",
    "MultiLanguage": "Flerspråkig",
    "MultiLanguage_Description": "Det stöder redan mer än 10 språk ur lådan. Du kan också lägga till ytterligare språk.",
    "Arabic": "Arabiska",
    "Czech": "Tjeckien",
    "English": "Engelska",
    "Hungarian": "Ungerska",
    "Finnish": "Finska",
    "French": "Franska",
    "Hindi": "Hindi",
    "Portuguese": "Portugisiska",
    "Italian": "Italienska",
    "Russian": "Ryska",
    "Slovak": "Slovakien",
    "Turkish": "Turkiska",
    "EngageAndRetainYourCustomersWithABPMobileApps": "Engagera och behåll dina kunder med ABP:s mobilappar",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description1": "Dina kunder vill kunna hantera sina produkter och prenumerationer var som helst och när som helst. Det kräver att organisationer skapar mobilappar som gör det möjligt för kunderna att uppfylla sina önskemål snabbt och smidigt.",
    "EngageAndRetainYourCustomersWithABPMobileApps_Description2": "Med ABP Mobile apps kan du skapa högkvalitativa native mobilappar för Android och iOS... med en enda kodbas och utan att kompromissa med säkerhet, kvalitet eller skalbarhet.",
    "OneCodeBaseMultipleDevices": "En kodbas Flera enheter",
    "OneCodeBaseMultipleDevices_Description": "ABP:s mobilapplikationer är plattformsoberoende. De är redo att installeras och köras på iOS- och Android-enheter, och de anpassar sig till olika formfaktorer med hjälp av en enda kodbas. Utvecklare behöver bara skapa användargränssnittet och front-end-koden en gång, det finns inget behov av att anpassa koden för varje enhet du vill stödja.",
    "ComesWithTheSourceCode": "Levereras med källkoden",
    "ComesWithTheSourceCode_Description": "Mobilapparna är försedda med källkod. Anpassa enkelt UX/UI för dina appar för att uppfylla riktlinjerna för varumärkesprofilering.",
    "Purchase_OneYearPrice": "1 år Pris",
    "Purchase_DeveloperSeatCount": "Antal platser för utvecklare",
    "Purchase_DevelopersAlreadyIncluded": "{0} utvecklare redan inkluderade",
    "1Year": "1 år",
    "{0}Years": "{0} år",
    "1YearLicense": "1 års licens",
    "{0}YearsLicense": "{0} År Licens",
    "1AdditionalDeveloper": "1 ytterligare utvecklare",
    "{0}AdditionalDevelopers": "{0} Ytterligare utvecklare",
    "Discount": "Rabatt ({0}%)",
    "Summary": "Sammanfattning",
    "TrainingPack": "Utbildningspaket",
    "TrainingPackDiscount": "Rabatt på utbildningspaket",
    "Purchase_OnboardingTraining_Description": "Denna liveutbildning är giltig för en klass med 8 elever och denna rabatt är endast giltig när den köps med den nya licensen. <a href=\"{0}\" class=\"text-white\">Läs mer <i class=\"fa fa-extern-länk ms-1\"></i></a>",
    "Purchase_Save": "{0}% <span class=\"spara ms-1\">Spara {1}</span>",
    "RemoveBasket": "Ta bort från korgen",
    "WhyABPIOPlatform?": "Varför <span class=\"gradient-commercial\">ABP.IO Platform</span>?",
    "DocumentAim": "Detta dokument syftar till att besvara den stora frågan:",
    "DocumentAim_Description": "\"Varför ska man använda ABP.IO-plattformen i stället för att skapa en ny lösning från grunden?\"",
    "DocumentAim_Description2": "Dokumentet presenterar utmaningarna med att bygga en modern mjukvarulösning och förklarar hur ABP hanterar dessa utmaningar.",
    "CreatingANewSolution": "Skapa en ny lösning",
    "CreatingANewSolution_Description": "När du ska starta en ny lösning finns det många frågor du måste ställa dig själv, och du bör lägga ner mycket tid innan du börjar skriva din allra första affärskod.",
    "CreatingAnEmptySolution": "Skapa en tom lösning",
    "THEPROBLEM": "PROBLEMET",
    "CreatingAnEmptySolution_THEPROBLEM_Description": "Även att skapa en nästan tom lösning är en utmaning;",
    "CreatingAnEmptySolution_THEPROBLEM_Description2": "Hur organiserar du din kodbas mellan olika projekt?",
    "CreatingAnEmptySolution_THEPROBLEM_Description3": "Vilka är lagren och hur samverkar de?",
    "CreatingAnEmptySolution_THEPROBLEM_Description4": "Hur integrerar du med tredjepartsbibliotek?",
    "CreatingAnEmptySolution_THEPROBLEM_Description5": "Hur ställer man in automatiserade tester?",
    "ABPSOLUTION": "ABP-LÖSNING",
    "CreatingAnEmptySolution_ABPSOLUTION_Description": "ABP tillhandahåller en välarkitekterad, skiktad och produktionsklar <a href=\"https://docs.abp.io/en/abp/latest/Startup-Templates/Application\" target=\"_blank\">startup-lösning</a> baserad på <a href=\"https://docs.abp.io/en/abp/latest/Domain-Driven-Design\" target=\"_blank\">Domain Driven Design</a>-principerna. Lösningen innehåller också en förkonfigurerad enhet och integration <a href=\"https://docs.abp.io/en/abp/latest/Testing\" target=\"_blank\">test</a> -projekt för varje lager.",
    "CommonLibraries": "Gemensamma bibliotek",
    "CommonLibraries_THEPROBLEM_Description": "Vilka bibliotek bör du använda för att implementera gemensamma krav? Ekosystemet för programvaruutveckling är mycket dynamiskt, vilket gör det svårt att hålla jämna steg med de senaste verktygen, biblioteken, trenderna och metoderna.",
    "CommonLibraries_ABPSOLUTION_Description": "ABP förintegrerar populära, mogna och uppdaterade bibliotek i lösningen. Du behöver inte lägga tid på att integrera dem eller få dem att kommunicera med varandra. De fungerar som de ska direkt från start.",
    "UITheme&Layout": "UI Tema & Layout",
    "UITheme&Layout_THEPROBLEM_Description": "När man tar itu med användargränssnittet uppstår en rad olika utmaningar. Det handlar bland annat om att lägga grunden för ett responsivt, modernt och anpassningsbart UI-kit med ett konsekvent utseende och en mängd funktioner som navigeringsmenyer, rubriker, verktygsfält, sidfötter, widgetar med mera.",
    "UITheme&Layout_THEPROBLEM_Description2": "Även om du väljer ett fördesignat tema kan det ta flera dagars utveckling att integrera det sömlöst i ditt projekt. Ett ytterligare hinder ligger i att uppgradera sådana teman. Ofta blir temats HTML/CSS-struktur sammanflätad med din UI-kod, vilket gör framtida temaförändringar eller uppgraderingar till komplicerade uppgifter. Denna sammanvävning av kod och design komplicerar flexibiliteten att göra justeringar längs linjen.",
    "UITheme&Layout_ABPSOLUTION_Description": "ABP Framework erbjuder ett distinkt temasystem som frigör din UI-kod från temabegränsningar. Teman finns isolerade, paketerade som NuGet- eller NPM-paket, vilket gör installation eller uppgradering av teman till en fråga om minuter. Även om du behåller möjligheten att utveckla ditt eget tema eller integrera ett befintligt, presenterar ABP en samling polerade och moderna teman.",
    "UITheme&Layout_ABPSOLUTION_Description2": "Dessutom finns det leverantörer av UI-komponenter som Telerik och DevExpress. Dessa leverantörer tillhandahåller dock främst enskilda komponenter, vilket innebär att det är upp till dig att skapa ditt layoutsystem. När du arbetar inom ABP-baserade projekt kan du sömlöst införliva dessa bibliotek, på samma sätt som du skulle göra i alla andra projekt.",
    "TestInfrastructure": "Testinfrastruktur",
    "TestInfrastructure_THEPROBLEM_Description": "Att etablera en robust testmiljö är en tidskrävande uppgift. Det handlar om att skapa dedikerade testprojekt inom din lösning, noggrant välja ut de verktyg som behövs, skapa mocks för tjänster och databaser, skapa viktiga basklasser och verktygstjänster för att minimera redundant kod i testerna och ta itu med olika relaterade uppgifter.",
    "TestInfrastructure_ABPSOLUTION_Description": "ABP Startup Templates levereras färdigutrustade med konfigurerade testprojekt, vilket effektiviserar processen för dig. Det innebär att du redan från dag ett kan börja skriva din första enhets- eller integrationstestkod utan dröjsmål.",
    "CodingStandards&Training": "Kodningsstandarder och utbildning",
    "CodingStandards&Training_THEPROBLEM_Description": "När du har konfigurerat lösningen för utveckling måste du vanligtvis lära utvecklarna hur systemet fungerar och hur man bygger det med hjälp av samma överenskomna metoder. Även om du ger dem utbildning kan det vara svårt att hålla dokumentationen uppdaterad. Med tiden kanske varje utvecklare skriver kod på sitt eget sätt, vilket leder till att reglerna för att skriva kod skiljer sig från varandra.",
    "CodingStandards&Training_ABPSOLUTION_Description": "ABP-lösningen är redan snyggt organiserad och har tydliga förklaringar. Steg-för-steg-handledningar och guider visar exakt hur du ska arbeta med ett ABP-projekt.",
    "KeepingYourSolutionUpToDate": "Håll din lösning uppdaterad",
    "KeepingYourSolutionUpToDate_THEPROBLEM_Description": "När du har påbörjat din utveckling måste du hålla reda på de nya versionerna av de bibliotek du använder för uppgraderingar och korrigeringar.",
    "KeepingYourSolutionUpToDate_ABPSOLUTION_Description": "Vi uppdaterar regelbundet alla paket till de senaste versionerna och testar dem före den stabila utgåvan. När du uppdaterar ABP Framework uppgraderas alla dess beroenden till den senaste tekniken.",
    "KeepingYourSolutionUpToDate_ABPSOLUTION_Description2": "<a class=\"text-primary\">Abp update</span> <a href=\"https://docs.abp.io/en/abp/latest/CLI\" target=\"_blank\">CLI-kommando </a> hittar och uppgraderar automatiskt alla ABP-beroende NuGet- och NPM-paket i en lösning. Med ABP är det enklare att hålla sig till de senaste versionerna.",
    "DRY": "Upprepa inte dig själv!",
    "DRY_Description": "Att skapa en baslösning tar lång tid och kräver god erfarenhet av arkitektur. Men detta är bara början! När du börjar utveckla kommer du sannolikt att behöva skriva massor av repetitiv kod; det skulle vara fantastiskt om allt detta kunde hanteras automatiskt.",
    "DRY_Description2": "ABP automatiserar och förenklar upprepningskoden så mycket som möjligt genom att följa principen om konvention framför konfiguration. Det begränsar dig dock inte när du behöver växla till manuell växel. Kontrollen ligger alltid i dina händer.",
    "Authentication": "Autentisering",
    "Authentication_THEPROBLEM_Description": "Single Sign On, Active Directory / LDAP-integration, OpenIddict-integration, sociala inloggningar, tvåfaktorsautentisering, glömt / återställt lösenord, e-postaktivering, ny användarregistrering, kontroll av lösenordskomplexitet, låsning av konto vid misslyckade försök, visning av misslyckade inloggningsförsök ... etc. Vi vet att alla dessa generiska krav är bekanta för dig. Du är inte ensam!",
    "Authentication_ABPSOLUTION_Description": "ABP Framework och den kommersiella versionen tillhandahåller alla dessa standardgrejer förimplementerade åt dig som en återanvändbar kontomodul. Du aktiverar och konfigurerar bara det du behöver.",
    "CrossCuttingConcerns": "Övergripande frågor",
    "CrossCuttingConcerns_THEPROBLEM_Description": "Cross-Cutting Concerns är den grundläggande upprepningslogik som bör implementeras för varje användningsfall. Några exempel;",
    "CrossCuttingConcerns_THEPROBLEM_Description2": "Starta transaktioner, genomföra vid framgång och rulla tillbaka vid fel.",
    "CrossCuttingConcerns_THEPROBLEM_Description3": "Hantera och rapportera undantag, returnera ett korrekt felsvar till klienterna och hantera felfall på klientsidan.",
    "CrossCuttingConcerns_THEPROBLEM_Description4": "Implementera auktorisering och validering, returnera korrekta svar och hantera dessa på klientsidan.",
    "CrossCuttingConcerns_ABPSOLUTION_Description": "ABP Framework automatiserar eller förenklar alla vanliga övergripande problem. Du skriver bara kod som är viktig för ditt företag, och ABP hanterar resten genom konventioner.",
    "ArchitecturalInfrastructure": "Arkitektonisk infrastruktur",
    "ArchitecturalInfrastructure_THEPROBLEM_Description": "Du behöver vanligtvis bygga infrastruktur för att implementera din arkitektur på rätt sätt. Till exempel implementerar du i allmänhet Repository-mönstret. Du definierar några basklasser för att förenkla och standardisera skapandet av entiteter, tjänster, controllers och andra objekt.",
    "ArchitecturalInfrastructure_ABPSOLUTION_Description": "ABP Framework tillhandahåller allt detta och mer därtill direkt från start. Det är moget och väldokumenterat.",
    "EnterpriseApplicationRequirements": "Krav på företagsapplikationer",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description": "Det finns många krav som du upprepade gånger måste implementera i varje affärsapplikation;",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description2": "Detaljerat behörighetssystem och hantering av behörigheter i användargränssnittet baserat på roller och användare.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description3": "Skriva granskningsloggar och entitetshistorik för att spåra när en användare ändrar en databaspost.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description4": "Gör dina enheter mjukt raderade, så att de markeras som raderade istället för att fysiskt raderas från databasen och automatiskt filtrera bort raderade enheter i dina frågor.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description5": "Skapa abstraktioner och omslag för att konsumera dina backend-API:er från frontend-koden.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description6": "Uppställning i kö och utförande av bakgrundsjobb.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description7": "Hantering av flera tidszoner i ett globalt system.",
    "EnterpriseApplicationRequirements_THEPROBLEM_Description8": "Delning av validering, lokalisering och auktoriseringslogik mellan server och klient.",
    "EnterpriseApplicationRequirements_ABPSOLUTION_Description": "ABP tillhandahåller en infrastruktur för att enkelt implementera sådana krav. Återigen behöver du inte spendera din värdefulla tid på att implementera alla dessa om och om igen.",
    "GeneratingInitialCode&Tooling": "Generering av initialkod och verktyg",
    "GeneratingInitialCode&Tooling_THEPROBLEM_Description": "Du kommer att bygga många liknande sidor i en typisk webbapplikation. De flesta av dem kommer att utföra liknande CRUD-operationer. Det är mycket tråkigt och även felbenäget att upprepade gånger skapa sådana sidor.",
    "GeneratingInitialCode&Tooling_ABPSOLUTION_Description": "<a href=\"/tools/suite\">ABP Suite</a> kan generera en full-stack CRUD-sida för dina enheter på några sekunder. Den genererade koden är skiktad och ren. Alla standardkrav för validering och auktorisering är implementerade. Dessutom genereras enhetstestklasser. När du väl har fått en helt fungerande sida kan du ändra den enligt dina affärsbehov.",
    "IntegratingTo3rdPartyLibrariesAndSystems": "Integrering med bibliotek och system från tredje part",
    "IntegratingTo3rdPartyLibrariesAndSystems_THEPROBLEM_Description": "De flesta bibliotek är utformade på låg nivå och du måste vanligtvis göra en del arbete för att integrera dem på rätt sätt utan att upprepa samma integrations- och konfigurationskod överallt i din lösning. Anta till exempel att du måste använda RabbitMQ för att implementera din distribuerade händelsebuss. Allt du vill göra är att skicka ett meddelande till en kö och hantera de inkommande meddelandena. Men du måste förstå meddelandemönster, köer och utbytesdetaljer. För att skriva effektiv kod måste du skapa en pool för att hantera anslutningar, klienter och kanaler. Du måste också hantera undantag, ACK-meddelanden, återanslutning till RabbitMQ vid misslyckanden och mer.",
    "IntegratingTo3rdPartyLibrariesAndSystems_ABPSOLUTION_Description": "Till exempel abstraherar ABP:s RabbitMQ Distributed Event Bus-integration alla dessa detaljer. Du skickar och tar emot meddelanden utan krångel. Behöver du skriva kod på låg nivå? Inga problem, det kan du alltid göra. ABP begränsar dig inte när du behöver använda lågnivåfunktioner i det bibliotek du använder.",
    "WhyNotBuildYourOwnFramework?": "Varför inte bygga ditt eget ramverk?",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description": "All infrastruktur, även på det enklaste sättet, tar mycket tid att bygga, underhålla och dokumentera. Den blir större med tiden och det blir svårt att underhålla den i din lösning. Att separera dessa i ett återanvändbart projekt är utgångspunkten för att bygga ditt eget interna ramverk.",
    "WhyNotBuildYourOwnFramework_THEPROBLEM_Description2": "Att bygga, dokumentera, utbilda och underhålla ett internt ramverk är verkligen svårt. Om du inte har ett erfaret, dedikerat ramverksteam blir ditt interna ramverk snabbt en odokumenterad äldre kod som ingen längre kan förstå och underhålla. Å andra sidan utvecklas dessa ramverk i allmänhet av en eller två utvecklare i teamet. Och dessa medarbetare håller på att bli en kunskapssilo. Det är bra för dem men dåligt för företaget eftersom de är projektets enda punkt för misslyckande <a href=\"https://en.wikipedia.org/wiki/Single_point_of_failure\">-SPOF-</a>. När de lämnar företaget går projektet dramatiskt ner.",
    "WhyNotBuildYourOwnFramework_ABPSOLUTION_Description": "ABP Framework är ett community-drivet, väldokumenterat, moget och generiskt applikationsramverk. Ett team av mycket erfarna utvecklare arbetar hårt för att hålla det uppdaterat, lätt att förstå och bekvämt att använda. Att använda ett så stabilt ramverk gör att du kan fokusera på din egen affärskod och få hjälp med ramverket från experter när du behöver det.",
    "ArchitecturalInfrastructure_Description": "SaaS-applikationer, modulära system eller mikroservicesystem är de mest använda modellerna för företagsprogramvara. Att bygga sådana system kräver inte bara en god förståelse och erfarenhet utan också en stark mjukvaruinfrastruktur. Annars kommer du att få lägga ner mycket arbete på att stödja dessa arkitektoniska detaljer i din kodbas.",
    "Modularity": "Modularitet",
    "Modularity_THEPROBLEM_Description": "Att bygga ett verkligt modulärt system är inte lätt! Alla aspekter av systemet (databas, entiteter, API:er, UI-sidor/komponenter) kan delas upp i moduler, och varje modul kan återanvändas utan andra. Den vanliga ASP.NET Core ger inte en sådan modulär arkitektur. Om du behöver det bör du tänka på det från grunden.",
    "Modularity_ABPSOLUTION_Description": "ABP Framework är skapat för att vara en modulär struktur för applikationsutveckling. Varje funktion i ramverket är utvecklad för att vara kompatibel med modularitet. Dokumentation och guider förklarar hur man utvecklar återanvändbara moduler på ett standardiserat sätt.",
    "SaaSMultiTenancy": "SaaS / Multi-Tenancy",
    "SaaSMultiTenancy_THEPROBLEM_Description": "<a href=\"https://docs.abp.io/en/abp/latest/Multi-Tenancy\">Multi-Tenancy</a> är ett vanligt sätt att implementera SaaS-system. Att implementera en konsekvent multi-tenant infrastruktur kan dock bli komplicerat.",
    "SaaSMultiTenancy_ABPSOLUTION_Description": "ABP Framework tillhandahåller en komplett infrastruktur för flera hyresgäster och abstraherar komplexiteten från din företagskod. Din applikationskod kommer att vara mestadels multi-tenancy medveten, medan ABP Framework automatiskt isolerar databasen, cache och andra detaljer om hyresgästerna från varandra. Det stöder en enda databas, per hyresgästdatabas och hybridmetoder. Det konfigurerar biblioteken som Microsoft Identity och OpenIddict, som normalt inte är multi-tenancy-kompatibla, på rätt sätt.",
    "Microservices": "Mikrotjänster",
    "Microservices_THEPROBLEM_Description": "Att bygga ett mikrotjänstsystem kräver många infrastrukturdetaljer: Autentisering och auktorisering av applikationer och mikrotjänster samt implementering av asynkrona meddelanden och synkrona (Rest/GRPC) kommunikationsmönster mellan mikrotjänster är de mest grundläggande frågorna.",
    "Microservices_ABPSOLUTION_Description": "ABP-ramverket tillhandahåller tjänster, <a href=\"https://docs.abp.io/en/abp/latest/Microservice-Architecture\" target=\"_blank\">guider</a> och exempel som hjälper dig att implementera din mikrotjänstlösning med hjälp av branschens standardverktyg.",
    "Microservices_ABPSOLUTION_Description2": "ABP:s kommersiella version går till och med ett steg längre och tillhandahåller en komplett <a href=\"https://docs.abp.io/en/commercial/latest/startup-templates/microservice/index\" target=\"_blank\">startup-mall</a> för att kickstarta din microservice-lösning.",
    "PreBuiltModules": "Förbyggda moduler",
    "PreBuiltModules_THEPROBLEM_Description": "Alla har vi liknande men lite olika affärskrav. Men vi måste alla uppfinna hjulet på nytt eftersom ingen annans kod kan fungera direkt i vår lösning. De är alla inbäddade delar av en större lösning.",
    "PreBuiltModules_ABPSOLUTION_Description": "ABP <a href=\"/modules\">modules</a> tillhandahåller många återanvändbara applikationsmoduler som betalning, chatt, filhantering, revisionsloggrapportering ... etc. Alla dessa moduler installeras enkelt i din lösning och fungerar direkt. Vi lägger ständigt till fler moduler.",
    "PreBuiltModules_ABPSOLUTION_Description2": "Alla moduler är utformade så att de kan anpassas efter dina affärsbehov. Om du behöver fullständig kontroll kan du ladda ner den fullständiga källkoden för alla moduler och anpassa dem helt utifrån dina specifika affärskrav.",
    "ABPCommunity": "ABP Gemenskap",
    "ABPCommunity_Description": "Slutligen, att vara en del av en stor gemenskap där alla följer liknande kodningsstilar och principer och delar en gemensam infrastruktur ger kraft när du har problem eller behöver hjälp med designbeslut. Eftersom vi skriver kod på liknande sätt kan vi hjälpa varandra mycket bättre. ABP är ett community-stöttat projekt med mer än 10K stjärnor på GitHub.",
    "ABPCommunity_Description2": "Det är lätt att dela kod eller till och med återanvändbara bibliotek mellan ABP-utvecklare. En kodsnutt som fungerar för dig kommer också att fungera för andra. Det finns många exempel och handledningar som du direkt kan implementera i din applikation.",
    "ABPCommunity_Description3": "När du anlitar en utvecklare som tidigare arbetat med ABP-arkitekturen kommer denne omedelbart att förstå din lösning och påbörja utvecklingen på mycket kort tid.",
    "WhyAbpIo_Page_Title": "Varför ABP.IO Platform?",
    "AbpStudio_Page_Title": "ABP Studio",
    "CampaignInfo": "Köp en ny licens eller förnya din befintliga licens och <span class=\"text-white\">få ytterligare 2 månader</span> utan extra kostnad! Detta erbjudande gäller för alla licensplaner. Se till att du utnyttjar denna tidsbegränsade kampanj för att utöka din tillgång till premiumfunktioner och uppgraderingar.",
    "HurryUpLastDay": "Skynda på! Sista dagen: {0}",
    "CreatingCRUDPagesWithABPSuite": "Skapa CRUD-sidor med ABP Suite",
    "Testimonials": "Vittnesmål",
    "MultipleYearDiscount": "Rabatt för flera år",
    "CampaignDiscountText": "Black Friday-rabatt",
    "CampaignDiscountName": "Svart fredag",
    "CampaignName:BlackFriday": "Svart fredag",
    "MultipleOrganizationInfo": "Se alla dina organisationer",
    "AbpStudioBetaAccessInfoTitle": "ABP Studio Beta Access",
    "AbpStudioBetaAccessInfoText": "Vi är glada över att kunna dela med oss av <span class=\"text-highlight-white\">beta</span>-versionen av <span class=\"text-highlight-white\">ABP Studio</span>! Den här versionen markerar en viktig milstolpe i vår utvecklingsresa, och vi är angelägna om att samla in din feedback för att göra applikationen ännu bättre.",
    "YouAreNotAuthorizedToDownloadStudio": "Du är inte behörig att ladda ner ABP Studio.",
    "OrganizationHasNoDefaultCreditCard": "Din organisation har inget standardkreditkort. Lägg till ett kreditkort för din organisation.",
    "YouAreNotAuthorizedToPayThisPaymentRequest": "Du är inte behörig att betala denna betalningsbegäran.",
    "YouAreNotAuthorizedToCreateBillingInfoForThisPaymentRequest": "Du är inte behörig att skapa faktureringsinformation för denna betalningsbegäran.",
    "OrganizationNotFound": "Organisationen hittades inte.",
    "CannotDeleteDefaultCardBecauseAutoRenewalEnabled": "Du kan inte ta bort kortet just nu eftersom funktionen Auto-Renewal är aktiverad. För att ta bort kortet måste du först avaktivera Auto-Renewal.",
    "AreYouSureWantToDeleteThisCard": "Är du säker på att du vill ta bort det här kortet?",
    "AreYouSureWantToSetThisCardAsDefault": "Är du säker på att du vill använda det här kortet som standard?",
    "OrganizationBillingInfoIsNotSuitableForIyzicoPayment": "Din organisations faktureringsinformation är inte lämplig för iyzico-betalning.",
    "AutomaticRenewal": "Automatisk förnyelse",
    "AutomaticRenewal_Description": "Om du förnyar en licens innan den går ut får du en rabatt på upp till 40 %. Med den automatiska förnyelseprocessen kan du förnya din licens utan att förlora denna rabatt, och din utveckling kommer aldrig att avbrytas. Automatisk förnyelse är endast tillgänglig för kreditkortsbetalning. Du kan inaktivera automatisk förnyelse när som helst genom att gå till din organisationshanteringssida. ABP sparar inte din kreditkortsinformation, men våra globala betalningsgateways säkrar besparingar.",
    "CardNotFoundMessage": "Vill du lägga till ett nytt kort?",
    "CardNotFoundTitle": "Kortet hittades inte",
    "AutoRenewalEnabled": "Automatisk förnyelse aktiverad",
    "AutoRenewalDisabled": "Automatisk förnyelse Avaktiverad",
    "PaymentRequestIdIsNotProvided": "Betalningsförfrågans ID anges inte.",
    "PaymentFailedInfo": "Tyvärr, betalningen misslyckades! Detta kan bero på otillräckliga medel, ogiltigt kreditkortsnummer eller ogiltig pinkod",
    "UsedPayment": "Denna betalning har redan använts",
    "ManageLicense": "Hantera licens",
    "AbpPlatformLeptonXTheme": "LeptonX Theme för din administrativa instrumentpanel av <span class=\"gradient-commercial\">ABP Platform</span>",
    "NoActiveLicence": "Du är inte berättigad till denna åtgärd! Du har ingen aktiv licens.",
    "ABPStudioBetaTester": "För att kunna skicka in din begäran måste du logga in",
    "ABPStudioBetaAccess": "ABP Studio Beta Access",
    "VisitABPStudio": "Besök ABP Studio",
    "EditBillingInformation": "Redigera faktureringsinformation",
    "Organization": "Organisation",
    "E-Book": "E-bok",
    "CreditCards": "Kreditkort",
    "BillingInformation": "Faktureringsinformation",
    "AddNewCreditCard": "Lägg till nytt kreditkort",
    "MyOrganizations_LearnMorePlan": "Läs mer om planer på prissättningssidan",
    "AutoLicenseRenewalIsNotEnabled": "Automatisk licensförnyelse är inte aktiverad.",
    "SetAsDefaultPaymentMethod": "Ange som standardbetalningsmetod",
    "{0}PerAdditionalDeveloper": "{0} per ytterligare utvecklare",
    "CardAlias": "Alias för kort (valfritt)",
    "AbpDoesNotSaveYourPaymentDetails_Description": "Betalningsuppgifterna kommer att sparas i <a href=\"{0}\" target=\"_blank\" class=\"{1}\">{2}</a> säkerhetsvalv och du kan ta bort lagrade uppgifter när som helst. Aktivering av automatisk förnyelse säkerställer att din ABP-prenumeration automatiskt förnyas innan den löper ut, förutsatt att du har ett giltigt kreditkort. Om du avaktiverar automatisk förnyelse måste du förnya din prenumeration manuellt. Om du vill fortsätta din projektutveckling utan avbrott föreslår vi att du aktiverar alternativet Automatisk förnyelse.",
    "AddBillingInformation": "Lägg till faktureringsinformation",
    "YouHaveNoCardsSaved": "Kortet är inte sparat ännu.",
    "CreateCreditCardModal_BillingDetails_Description": "Du måste spara dina faktureringsuppgifter för att kunna lägga till ditt kreditkort.",
    "TaxNo": "Skatt Nej",
    "CardNumber": "Kortnummer",
    "NameOnCard": "Namn på kortet",
    "BillingDetails": "Faktureringsinformation",
    "ThereIsNoDeveloper": "Ingen utvecklare tillagd.",
    "CardDetails": "Debit-/Kreditkortsuppgifter",
    "YearCantBeNull": "Årsfältet får inte vara tomt.",
    "CardHolderName": "Namn på kortet",
    "ExpireDate": "Utgångsdatum",
    "DisplayName:ExpireDate": "Utgångsdatum",
    "DisplayName:CardHolderName": "Namn på kortet",
    "CreditCardNumberLengthWarning": "Ogiltigt kortnummer",
    "ExpirationWarning": "Ogiltigt utgångsdatum",
    "CreateCreditCardModal_Description": "När du sparar ditt betalkort/kreditkort kommer en tillfällig avgift på 1 USD att godkännas för verifiering och återbetalas omedelbart.",
    "ReturnOfInvestmentTitle": "Avkastning på <span class=\"gradient-commercial\">investering</span>",
    "ReduceYourDevelopmentCostsDescription": "Minska dina utvecklingskostnader med mer än 50 % med ABP-ramverket. Men hur? Fortsätt läsa...",
    "SettingUpTheArchitectureTitle": "Uppsättning av arkitekturen",
    "DoingEverythingFromScratch": "Att göra allt från början",
    "SettingUpTheArchitecture_Description1": "Organisera kodbas och lösningsstruktur",
    "SettingUpTheArchitecture_Description2": "Identifiera, installera och konfigurera viktiga tredjepartsbibliotek",
    "SettingUpTheArchitecture_Description3": "Upprätta infrastruktur för automatiserad integration och enhetstest",
    "SettingUpTheArchitecture_Description4": "Fastställa och dokumentera kodstandarder, utbilda utvecklingsteamet",
    "UsingTheABPFramework": "Använda ABP-ramverket",
    "UseABPSettingUpTheArchitecture_Description": "Använd ABP:s mallar för startup-lösningar",
    "ReduceCostsWithABP": "Minska kostnaderna med ABP genom att",
    "ReduceCostsBy": "80 % till 100 %.",
    "DesigningTheUserInterfaceTitle": "Utformning av användargränssnittet",
    "DesigningTheUserInterface_Description1": "Skapa eller köp ett UI-tema",
    "DesigningTheUserInterface_Description2": "Anpassa användargränssnittets tema till lösningen",
    "DesigningTheUserInterface_Description3": "Bygga de viktigaste delarna av användargränssnittet (layout, meny, sidhuvud, sidfot med responsiv design)",
    "DesigningTheUserInterface_Description4": "Se till att designen är konsekvent på alla applikationssidor",
    "UseABPDesigningTheUserInterface_Description": "Använd ABP:s LeptonX UI Theme",
    "DevelopingApplicationFeaturesTitle": "Utveckling av applikationsfunktioner",
    "DevelopingApplicationFeatures_Description1": "Utveckla din egen affärslogik",
    "DevelopingApplicationFeatures_Description2": "Utveckla varje sida en efter en",
    "DevelopingApplicationFeatures_Description3": "Utveckla gemensamma affärsmoduler själv",
    "DevelopingApplicationFeatures_Description4": "Utveckla autentiseringssystemet (enkel inloggning, 2-faktor autentisering, sociala inloggningar, återställning av lösenord, e-postaktivering etc...)",
    "DevelopingApplicationFeatures_Description5": "Tillämpa övergripande frågor i varje användningsfall (DB-transaktioner, auktorisering, validering, undantagshantering etc.)",
    "DevelopingApplicationFeatures_Description6": "Utveckla gemensamma basklasser och nyttotjänster",
    "DevelopingApplicationFeatures_Description7": "Utveckla gemensamma icke-affärsmässiga krav (revisionsloggning, soft-delete, bakgrundsjobb, behörighetssystem etc.)",
    "UseABPDevelopingApplicationFeatures_Description1": "Utveckla din egen affärslogik",
    "UseABPDevelopingApplicationFeatures_Description2": "Använd ABP Suite för att automatiskt generera CRUD-liknande sidor",
    "UseABPDevelopingApplicationFeatures_Description3": "Använd direkt ABP:s förbyggda gemensamma applikationsmoduler och anpassa dem utifrån dina unika krav",
    "ReduceCostsBy_2": "40-60 procent",
    "WhyABPIoPlatform": "Varför ABP.IO Platform?",
    "WhyShouldYouUsetheABPIOPlatform": "Varför ska du använda ABP.IO-plattformen istället för att skapa en ny lösning från grunden?",
    "ExploreMore": "Utforska mer",
    "DocumentIntroducesDescription": "Om du vill veta mer om varför du ska använda ABP.IO Platform istället för att skapa en ny lösning från grunden, läs följande dokument:",
    "ReturnOfInvestmentPageAbout": "På den här sidan beskrivs de grundläggande stegen i utvecklingen av en programvarulösning och hur ABP.IO Platform minskar dina utvecklingskostnader i varje steg.",
    "LearnMore": "Lär dig mer",
    "ReturnOfInvestment": "Avkastning på investeringar",
    "ReturnOfInvestment_Description": "Lär dig hur du kan minska dina utvecklingskostnader med mer än 50 %.",
    "Previous": "Föregående",
    "PricingDiscount": "Spara",
    "PricingTeamTitle": "Team",
    "PricingBusinessTitle": "Företag",
    "PricingEnterpriseTitle": "Företag",
    "SpecialDiscount": "Särskild rabatt",
    "YourOrganizationOverview": "Översikt över din organisation",
    "TrainingDetailsHeaderInfo_TrainingHourSingular": "{0} timme",
    "ContactPageError": "Vänligen skicka ditt meddelande via e-post till <a href=\"{0}\"> info@abp.io </a><br /> Här är vad du skrev :",
    "GoBack": "Gå tillbaka",
    "HereWhatYouWrote": "Här är vad du skrev:",
    "Sales": "Försäljning",
    "LicensingPricing": "Licensiering/prissättning",
    "TrialDemo": "Testversion / Demo",
    "TrainingOnboarding": "Utbildning / Onboarding",
    "Resellers": "Återförsäljare",
    "Others": "Övriga",
    "Characters": "Karaktärer",
    "Topic": "Ämne",
    "SendUsEmail": "Skicka e-post till oss",
    "ErrorExceptionMessage": "Ett fel inträffade under behandlingen av din begäran",
    "WatchTakeCodeGeneration": "Titta på videon \"Utforska potentialen med kodgenerering: ABP Suite\" Video!",
    "StartupTemplatesUser": "Användare",
    "StartupSingleSignOn": "Enkel inloggning",
    "Application{0}": "Tillämpning {0}",
    "PreBuiltApplicationModulesTitle": "Färdigbyggda applikationer <span class=\"gradient-commercial\">Moduler</span>.",
    "RegisterDemo": "Registrera",
    "TrainingDescription": "Vi erbjuder följande utbildningspaket för dig som vill skaffa dig kunskap om ABP.",
    "PurchaseDevelopers": "Utvecklare",
    "LinkExpiredMessage": "Betalningslänken har löpt ut! Kontakta oss på <a href='mailto:sales@volosoft.com'>sales@volosoft.com</a> för att uppdatera länken eller <a href='https://abp.io/contact'>klicka här</a> för att navigera till kontaktsidan."
  }
}