{
  "culture": "tr",
  "texts": {
    "OrganizationManagement": "Organizasyon yönetimi",
    "OrganizationList": "Organizasyon listesi",
    "Volo.AbpIo.Commercial:010003": "Bu organizasyonda yetkili değilsiniz!",
    "OrganizationNotFoundMessage": "Organizasyon bulunamadı!",
    "DeveloperCount": "Yazılımcı sayısı",
    "QuestionCount": "Kalan/toplam sorular",
    "Unlimited": "Sınırsız",
    "Owners": "Yetkili sayısı",
    "AddMember": "Üye ekle",
    "AddOwner": "Yetkili ekle",
    "AddDeveloper": "Yazılımcı ekle",
    "UserName": "Kullanıcı adı",
    "Name": "İsim",
    "EmailAddress": "Email adresi",
    "Developers": "Yazılımcılar",
    "LicenseType": "lisans türü",
    "Manage": "Yönet",
    "StartDate": "Başlangıç tarihi",
    "EndDate": "bitiş tarihi",
    "Modules": "Modüller",
    "LicenseExtendMessage": "Lisans bitiş tarihiniz {0} tarihine kadar uzatıldı",
    "LicenseUpgradeMessage": "Lisansınız {0} lisansa yükseltildi",
    "LicenseExtendAdnUpgradeMessage": "Lisansınız {0} tarihine kadar uzatıldı ve lisans planınız {1}'e yükseltildi.",
    "LicenseAddDeveloperMessage": "Lisansınıza {0} geliştirici eklendi",
    "Volo.AbpIo.Commercial:010004": "Kullanıcı bulunamadı! İlgili kullanıcının daha önceden sisteme kayıt olmuş olması gerekiyor.",
    "MyOrganizations": "Organizasyonlarım",
    "ApiKey": "API anahtarı",
    "UserNameNotFound": "{0} kullanıcı adı ile bir kullanıcı yok",
    "SuccessfullyAddedToNewsletter": "Bültenimize abone olduğunuz için teşekkürler!",
    "MyProfile": "Profilim",
    "EmailNotValid": "Lütfen uygun bir e-posta adresi giriniz",
    "JoinOurMarketingNewsletter": "Pazarlama bültenimize katılın",
    "WouldLikeToReceiveMarketingMaterials": "Ürün fırsatları ve özel teklifler gibi pazarlama materyalleri almak istiyorum.",
    "StartUsingYourLicenseNow": "Lisansınızı şimdi kullanmaya başlayın!",
    "WelcomePage": "Sayfaya hoşgeldiniz",
    "UnsubscriptionExpireEmail": "Lisansın sona erme tarihi hatırlatıcı e-postalarının aboneliğinden çık",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Bu e-posta aboneliği yalnızca lisansınızın sona erme tarihini hatırlatmayı içerir.",
    "UnsubscribeFromLicenseExpireEmails": "Lisansınızın sona erme tarihi ile ilgili e-postaları almak istemiyorsanız, istediğiniz zaman abonelikten çıkabilirsiniz.",
    "Unsubscribe": "Aboneliği iptal et",
    "NotOrganizationMember": "Herhangi bir kuruluşa üye değilsiniz.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Abonelikten başarıyla çıkıldı",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Artık lisans sona erme tarihi hatırlatma e-postaları almayacaksınız.",
    "IndexPageHeroSection": "<span class=\"first-line\">A complete</span><span class=\"second-line\"> web development platform</span><span class=\"third-line\">built-on <img src=\"{0}\" width=\"110\" class=\"ml-1\" /> framework</span>",
    "AbpCommercialShortDescription": "ABP Commercial, önceden oluşturulmuş uygulama modülleri, hızlı uygulama geliştirme araçları, profesyonel UI temaları, premium destek ve daha fazlasını sağlar.",
    "LiveDemo": "Canlı Demo",
    "GetLicence": "Lisans Alın",
    "Application": "Başvuru",
    "StartupTemplates": "Başlangıç Şablonları",
    "Startup": "Başlamak",
    "Templates": "şablonlar",
    "Developer": "geliştirici",
    "Tools": "Aletler",
    "Premium": "Ödül",
    "PremiumSupport": "Premium Destek",
    "PremiumForumSupport": "Premium Forum Desteği",
    "UI": "kullanıcı arayüzü",
    "Themes": "Temalar",
    "JoinOurNewsletter": "Bültenimize Katılın",
    "Send": "Göndermek",
    "Learn": "Öğrenmek",
    "AdditionalServices": "Ek hizmetler",
    "WhatIsABPFramework": "ABP ÇERÇEVESİ NEDİR?",
    "OpenSourceBaseFramework": "Açık Kaynak Temel Çerçevesi",
    "ABPFrameworkExplanation": "<p class=\"lead\">ABP Commercial, ASP.NET Core için açık kaynak ve topluluk tarafından yönlendirilen bir web uygulaması çerçevesi olan ABP Framework'ü temel alır.</p><p>ABP Framework, sürdürülebilir, genişletilebilir yazmak için mükemmel bir altyapı sağlar. ve en iyi uygulamalarla test edilebilir kod.</p><p>Zaten bildiğiniz popüler araçlar üzerine kurulu ve entegre. Düşük öğrenme eğrisi, kolay adaptasyon, rahat gelişim.</p>",
    "Modular": "modüler",
    "MicroserviceCompatible": "Mikro hizmet uyumlu",
    "DomainDrivenDesignInfrastructure": "Etki Alanına Dayalı Tasarım Altyapısı",
    "MultiTenancy": "Çok kiracılık",
    "DistributedMessaging": "Dağıtılmış Mesajlaşma",
    "DynamicProxying": "Dinamik Proxy",
    "BackgroundJobs": "Arka Plan İşleri",
    "AuditLogging": "Denetim Günlüğü",
    "BLOBStoring": "BLOB Depolama",
    "BundlingMinification": "Paketleme ve Küçültme",
    "AdvancedLocalization": "Gelişmiş Yerelleştirme",
    "ManyMore": "daha birçok",
    "ExploreTheABPFramework": "ABP Çerçevesini Keşfedin",
    "WhyUseTheABPCommercial": "Neden ABP Reklamını Kullanmalısınız?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\">Kurumsal düzeyde web uygulamaları oluşturmak karmaşık ve zaman alıcı olabilir.</p><p>ABP Commercial, tüm modern kurumsal düzeyde ASP.NET Core için gereken mükemmel temel altyapıyı sunar. tabanlı çözümler. Tasarımdan dağıtıma kadar tüm geliştirme döngüsü, ABP'nin yerleşik özellikleri ve modülleri tarafından desteklenir.</p>",
    "StartupTemplatesShortDescription": "Başlangıç şablonları, projenize birkaç saniye içinde hızlı bir başlangıç yapmanızı sağlar.",
    "UIFrameworksOptions": "UI çerçeve seçenekleri;",
    "DatabaseProviderOptions": "Veritabanı sağlayıcı seçenekleri;",
    "PreBuiltApplicationModules": "Önceden Hazırlanmış Uygulama Modülleri",
    "PreBuiltApplicationModulesShortDescription": "En yaygın uygulama gereksinimleri, yeniden kullanılabilir modüller olarak sizin için zaten geliştirilmiştir.",
    "Account": "Hesap",
    "Blogging": "Bloglama",
    "Identity": "Kimlik",
    "IdentityServer": "Kimlik Sunucusu",
    "Saas": "hizmet",
    "LanguageManagement": "Dil Yönetimi",
    "TextTemplateManagement": "Metin Şablonu Yönetimi",
    "See All Modules": "SeeAllModüller",
    "ABPSuite": "ABP Süiti",
    "AbpSuiteShortDescription": "ABP Suite, ABP Commercial için tamamlayıcı bir araçtır.",
    "AbpSuiteExplanation": "Birkaç dakika içinde web sayfaları oluşturmanıza olanak tanır. Komut satırından yüklenebilen bir .NET Core Global aracıdır. Yeni bir ABP çözümü oluşturabilir, veritabanından ön uca kadar CRUD sayfaları oluşturabilir.",
    "Details": "Detaylar",
    "LeptonTheme": "Lepton Teması",
    "ProfessionalModernUIThemes": "Profesyonel, modern UI temaları",
    "LeptonThemeExplanation": "Lepton, yönetici panosu gerektiren herhangi bir proje için sağlam bir temel görevi gören bir dizi Bootstrap yönetici teması sağlar.",
    "DefaultTheme": "Varsayılan tema",
    "MaterialTheme": "Malzeme Tema",
    "Default2Theme": "Varsayılan 2 Tema",
    "DarkTheme": "Karanlık Tema",
    "DarkBlueTheme": "Koyu Mavi Tema",
    "LightTheme": "Açık Tema",
    "ProudToWorkWith": "Birlikte Çalışmaktan Gurur Duyarız",
    "OurConsumers": "Dünya çapında 70'ten fazla ülkede binlerce işletme ve geliştirici ABP Commercial'a güveniyor.",
    "JoinOurConsumers": "Onlara katılın ve hızlı bir şekilde harika ürünler oluşturun.",
    "AdditionalServicesExplanation": "Ek veya özel hizmetlere mi ihtiyacınız var? <strong>Biz ve ortaklarımız şunları sağlayabilir;</strong>",
    "CustomProjectDevelopment": "Özel Proje Geliştirme",
    "CustomProjectDevelopmentExplanation": "Özel projeleriniz için özel geliştiriciler.",
    "PortingExistingProjects": "Mevcut Projeleri Taşıma",
    "PortingExistingProjectsExplanation": "Eski projelerinizi ABP platformuna geçirme.",
    "LiveSupport": "Canlı destek",
    "LiveSupportExplanation": "İhtiyacınız olduğunda canlı uzaktan destek seçeneği.",
    "Training": "Eğitim",
    "TrainingExplanation": "Geliştiricileriniz için özel eğitim.",
    "OnBoarding": "İlk Katılım",
    "OnBoardingExplanation": "Geliştirme, CI ve CD ortamlarınızı kurmanıza yardımcı olun.",
    "PrioritizedTechnicalSupport": "Öncelikli Teknik Destek",
    "PremiumSupportExplanation": "ABP çerçevesinin büyük topluluk desteğinin yanı sıra, destek ekibimiz ticari kullanıcıların teknik sorularını ve sorunlarını yüksek öncelikli olarak yanıtlar.",
    "SeeTheSupportOptions": "Destek Seçeneklerine Bakın",
    "Contact": "Temas",
    "TellUsWhatYouNeed": "Bize neye ihtiyacın olduğunu söyle.",
    "YourMessage": "Mesajın",
    "YourFullName": "Tam adınız",
    "EmailField": "E",
    "YourEmailAddress": "E",
    "HowMayWeHelpYou": "Size nasıl yardımcı olabiliriz?",
    "SendMessage": "Mesaj gönder",
    "Success": "Başarı",
    "WeWillReplyYou": "Mesajınızı aldık ve kısa süre içinde sizinle iletişime geçeceğiz.",
    "GoHome": "Eve git",
    "CreateLiveDemo": "Canlı Demo Oluştur",
    "RegisterToTheNewsletter": "ABP.IO hakkında yeni yayınlar vb. dahil olmak üzere bilgi almak için haber bültenine kaydolun.",
    "EnterYourEmailOrLogin": "Demonuzu oluşturmak için e-posta adresinizi girin veya mevcut hesabınızı kullanarak <a href=\"{0}\">Giriş yapın</a>.",
    "ApplicationTemplate": "Uygulama Şablonu",
    "ApplicationTemplateExplanation": "Uygulama başlangıç şablonu, yeni bir web uygulaması oluşturmak için kullanılır.",
    "EfCoreProvider": "Entity Framework (SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\">ve diğerlerini</a> destekler)",
    "AlreadyIncludedInTemplateModules": "Aşağıdaki modüller bu şablona zaten dahil edilmiş ve yapılandırılmıştır:",
    "ApplicationTemplateArchitecture": "Bu uygulama şablonu ayrıca UI katmanı, API katmanı ve kimlik doğrulama hizmetinin fiziksel olarak ayrıldığı katmanlı mimariyi de destekler.",
    "SeeTheGuideOrGoToTheLiveDemo": "Bu şablon hakkında teknik bilgi için geliştirici kılavuzuna bakın veya canlı demoya gidin.",
    "DeveloperGuide": "Geliştirici Kılavuzu",
    "ModuleTemplate": "Modül Şablonu",
    "ModuleTemplateExplanation1": "Bir modül oluşturmak ve farklı uygulamalarda yeniden kullanmak mı istiyorsunuz? Bu başlangıç şablonu, yeniden kullanılabilir bir <strong>uygulama modülü</strong> veya bir <strong>mikro hizmet</strong> oluşturmaya başlamak için her şeyi hazırlar.",
    "ModuleTemplateExplanation2": "<p>Tek bir modül için tek veya birden çok UI çerçevesini, tek veya birden çok veritabanı sağlayıcısını destekleyebilirsiniz. Başlangıç şablonu, birim ve entegrasyon test altyapısına ek olarak minimal bir uygulamada <strong>modülünüzü çalıştıracak ve test edecek</strong> yapılandırılmıştır. </p> <p>Bu şablonla ilgili teknik bilgiler için geliştirici kılavuzuna bakın.</p>",
    "WithAllStyleOptions": "tüm stil seçenekleriyle",
    "Demo": "Demo",
    "SeeAllModules": "Tüm Modülleri Gör",
    "ABPCLIExplanation": "ABP CLI (Komut Satırı Arayüzü), ABP tabanlı çözümler için bazı ortak işlemleri gerçekleştirmek için bir komut satırı aracıdır.",
    "ABPSuiteEasilyCURD": "ABP Suite, kolayca CRUD sayfaları oluşturmanıza olanak sağlayan bir araçtır",
    "WeAreHereToHelp": "<span class=\"zero-text\">Yardım</span> için buradayız",
    "BrowseOrAskQuestion": "Yardım konularımıza göz atabilir veya sık sorulan sorularda arama yapabilir ya da <a href=\"{0}\" class=\"text-success\">iletişim formunu</a> kullanarak bize soru sorabilirsiniz.",
    "SearchQuestionPlaceholder": "Sık sorulan sorularda ara",
    "WhatIsTheABPCommercial": "ABP Ticari nedir?",
    "WhatAreDifferencesThanAbpFramework": "Açık kaynaklı ABP Çerçevesi ile ABP Ticari arasındaki farklar nelerdir?",
    "ABPCommercialExplanation": "ABP Commercial, açık kaynak <a target=\"_blank\" href=\"{0}\">ABP çerçevesi</a> üzerine inşa edilmiş bir dizi premium modül, araç, tema ve hizmettir. ABP Commercial, ABP çerçevesinin arkasındaki aynı ekip tarafından geliştirilmekte ve desteklenmektedir.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\">ABP çerçevesi</a>, ASP.NET Core için modüler, temaya uygun, mikro hizmet uyumlu bir uygulama geliştirme çerçevesidir. Her yeni projede kendinizi tekrarlamak yerine kendi iş kodunuza odaklanmanızı sağlayacak eksiksiz bir mimari ve güçlü bir altyapı sunar. Yazılım geliştirmenin en iyi uygulamalarına ve zaten bildiğiniz popüler araçlara dayanmaktadır. </p> <p> ABP çerçevesi tamamen ücretsiz, açık kaynak kodlu ve topluluk odaklıdır. Ayrıca ücretsiz bir tema ve önceden oluşturulmuş bazı modüller (ör. kimlik yönetimi ve kiracı yönetimi) sağlar.</p>",
    "VisitTheFrameworkVSCommercialDocument": "Daha fazla bilgi için aşağıdaki bağlantıyı ziyaret edin <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial, ABP çerçevesinin üzerine aşağıdaki faydaları ekler;",
    "Professional": "Profesyonel",
    "UIThemes": "kullanıcı arayüzü temaları",
    "EnterpriseModules": "Kurumsal kullanıma hazır, zengin özelliklere sahip, önceden oluşturulmuş <a href=\"{0}\">uygulama modülleri</a> (ör. Kimlik Sunucusu yönetimi, SaaS yönetimi, dil yönetimi)",
    "ToolingToSupport": "Geliştirme üretkenliğinizi destekleyecek araçlar (ör. <a href=\"{0}\">ABP Suite</a>)",
    "PremiumSupportLink": "Premium <a href=\"{0}\" target=\"_blank\">destek</a>",
    "WhatDoIDownloadABPCommercial": "ABP Commercial'ı satın aldığımda ne indiririm?",
    "CreateUnlimitedSolutions": "Bir ABP Ticari lisansı satın aldığınızda, <a href=\"{0}\">Başlarken</a> belgesinde açıklandığı gibi sınırsız çözümler oluşturabileceksiniz.",
    "ABPCommercialSolutionExplanation": "Yeni bir uygulama oluşturduğunuzda, tercihlerinize göre bir Visual Studio çözümü (bir başlangıç şablonu) elde edersiniz. İndirilen çözüm, sizin için önceden yüklenmiş ve yapılandırılmış ticari modüllere ve temalara sahiptir. Önceden kurulmuş bir modülü kaldırabilir veya isterseniz başka bir modül ekleyebilirsiniz. Tüm modüller ve temalar, varsayılan olarak bir NuGet/NPM paketleri kullanılır.",
    "StartDevelopWithTutorials": "İndirilen çözüm iyi tasarlanmış ve belgelenmiştir. <a href=\"{0}\">Öğreticileri</a> izleyerek kendi iş kodunuzu buna dayalı olarak geliştirmeye başlayabilirsiniz.",
    "TryTheCommercialDemo": "ABP Ticari başlangıç şablonu kullanılarak oluşturulmuş örnek bir uygulamayı görmek için <a href=\"{0}\">demoyu</a> deneyebilirsiniz.",
    "HowManyProducts": "ABP Commercial'ı kullanarak kaç farklı ürün/çözüm oluşturabilirim?",
    "HowManyProductsExplanation": "ABP projesi oluşturmanın bir sınırı yoktur. Dilediğiniz kadar proje oluşturabilir, geliştirebilir ve farklı sunuculara yükleyebilirsiniz.",
    "HowManyDevelopers": "ABP Commercial'da kaç geliştirici çalışabilir?",
    "HowManyDevelopersExplanation": "ABP Ticari lisansları geliştirici başınadır. Farklı lisans türlerinin farklı geliştirici sınırları vardır. Ancak, ihtiyacınız olduğunda herhangi bir lisans türüne daha fazla geliştirici ekleyebilirsiniz. Lisans türleri, geliştirici sınırları ve ek geliştirici maliyetleri için <a href=\"{0}\">fiyatlar</a> sayfasına bakın.",
    "ChangingLicenseType": "Lisans türümü daha sonra yükseltebilir miyim?",
    "ChangingLicenseTypeExplanation": "Aktif lisans süreniz içerisinde aradaki farkı ödeyerek bir üst lisansa geçebilirsiniz. Daha yüksek bir lisans planına yükselttiğinizde, yeni planın avantajlarından yararlanırsınız, ancak lisans yükseltmesi, lisansın sona erme tarihini değiştirmez. Ayrıca, mevcut lisansınıza yeni geliştirici lisansları da ekleyebilirsiniz, bkz. \"ABP Ticari üzerinde kaç geliştirici çalışabilir?\"",
    "LicenseExtendUpgradeDiff": "Lisans uzatma ve yükseltme arasındaki fark nedir?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Uzatma:</strong> Lisansınızı uzatarak/yenileyerek, premium destek almaya ve modüller ve temalar için önemli güncellemeler almaya devam edeceksiniz. Ayrıca, yeni projeler oluşturmaya devam edebileceksiniz. Ve geliştirmenizi hızlandıran ABP Suite'i kullanmaya devam edebileceksiniz.<hr/><strong>Yükseltme:</strong> Lisansınızı yükselterek, ek avantajlar elde etmenizi sağlayacak daha yüksek bir lisans planına terfi edeceksiniz. . Lisans planları arasındaki farkları kontrol etmek için <a href=\"/pricing\">lisans karşılaştırma tablosuna</a> bakın.<strong>Öte yandan, yükseltme yaptığınızda lisans geçerlilik bitiş tarihiniz değişmez!</strong >Lisans bitiş tarihinizi uzatmak için lisansınızı uzatmanız gerekir.",
    "LicenseRenewalCost": "1 yıl sonra ehliyet yenileme ücreti ne kadardır?",
    "LicenseRenewalCostExplanation": "Tüm ABP Ticari kalıcı lisanslarının yenileme (uzatma) oranı, lisans liste fiyatının {0} kadarıdır. Standart Takım Lisansının yenileme fiyatı {1}$, standart İşletme Lisansı {2}$ ve standart Enterprise Lisansı {3}$'dır. Zaten bir müşteriyseniz, mevcut yenileme fiyatlarını incelemek için <a href='{4}' target='_blank'>hesabınıza giriş yapın</a>.",
    "HowDoIRenewMyLicense": "Lisansımı nasıl yenilerim?",
    "HowDoIRenewMyLicenseExplanation": "<a href='{0}' target='_blank'>Kuruluş yönetimi sayfasına</a> giderek lisansınızı yenileyebilirsiniz. İndirimli Erken Yenileme fiyatlarımızdan yararlanmak için lisansınızın süresi dolmadan yenilemeyi unutmayınız. Bununla birlikte, Erken Yenileme fırsatınızın ne zaman kapanacağını bilmemek konusunda endişelenmeyin. Aboneliğiniz sona ermeden önce 3 hatırlatma e-postası alacaksınız. Son kullanma tarihinden 30 gün, 7 gün ve 1 gün önce göndereceğiz.",
    "IsSourceCodeIncluded": "Lisansım ticari modüllerin ve temaların kaynak kodunu içeriyor mu?",
    "IsSourceCodeIncludedExplanation1": "Satın aldığınız lisans türüne bağlıdır:",
    "IsSourceCodeIncludedExplanation2": "<strong>Ekip</strong>: Çözümünüz modülleri ve temaları NuGet ve NPM paketleri olarak kullanır. Kaynak kodlarını içermez. Bu şekilde, yeni bir sürüm çıktığında bu modülleri ve temaları kolayca yükseltebilirsiniz. Ancak modüllerin ve temaların kaynak kodunu alamıyorsunuz.",
    "IsSourceCodeIncludedExplanation3": "<strong>İş/Kurumsal</strong>: Ekip lisansına ek olarak, ihtiyacınız olan herhangi bir modül veya temanın kaynak kodunu indirebilirsiniz. Hatta belirli bir modül için NuGet/NPM paket referanslarını kaldırabilir ve tamamen değiştirmek için kaynak kodunu doğrudan çözümünüze ekleyebilirsiniz.",
    "IsSourceCodeIncludedExplanation4": "<p>Bir modülün kaynak kodunu çözümünüze dahil etmek, o modülü özelleştirmek için size maksimum özgürlük sağlar. Ancak, bu durumda yeni bir sürüm yayınlandığında modülü otomatik olarak yükseltmek mümkün olmayacaktır.</p><p>Lisansların hiçbiri, sizin için kod oluşturan ve size yardımcı olan harici bir araç olan ABP Suite kaynak kodunu içermez. geliştirmenize yardımcı olur.</p><p>Lisans türleri arasındaki diğer farklar için <a href=\"{0}\">fiyatlandırma</a> sayfasına bakın.</p>",
    "ChangingDevelopers": "Gelecekte kuruluşumun kayıtlı geliştiricilerini değiştirebilir miyim?",
    "ChangingDevelopersExplanation": "Lisansınıza yeni geliştiriciler eklemenin yanı sıra mevcut geliştiricileri de herhangi bir ek ücret ödemeden değiştirebilirsiniz (bir geliştiriciyi kaldırıp aynı koltuğa yeni bir tane ekleyebilirsiniz).",
    "WhatHappensWhenLicenseEnds": "Lisans sürem sona erdiğinde ne olur?",
    "WhatHappensWhenLicenseEndsExplanation1": "ABP Ticari lisans türü <a href=\"{0}\" target=\"_blank\">kalıcı lisanstır</a>. Lisansınızın süresi dolduktan sonra projenizi geliştirmeye devam edebilirsiniz. Ve ehliyetinizi yenilemek zorunda değilsiniz. Lisansınız, kutudan çıktığı gibi bir yıllık Güncellemeler ve Destek planıyla birlikte gelir. Yeni özellikler, performans geliştirmeleri, hata düzeltmeleri, destek almaya devam etmek ve ABP Suite'i kullanmaya devam etmek için planınızı her yıl yenilemeyi unutmayın. Lisansınızın süresi dolduğunda, aşağıdaki avantajlardan daha fazlasını elde edemezsiniz;",
    "WhatHappensWhenLicenseEndsExplanation2": "ABP Ticari kullanarak yeni çözümler üretemezsiniz, ancak mevcut uygulamalarınızı sonsuza kadar geliştirmeye devam edebilirsiniz.",
    "WhatHappensWhenLicenseEndsExplanation3": "MAJOR sürümünüzdeki modüller ve temalar için güncellemeler alabileceksiniz. Örneğin; Bir modülün v3.2.0'ını kullanıyorsanız, yine de o modülün v3.x.x (v3.3.0, v3.5.2... vb.) güncellemelerini alabilirsiniz. Ancak bir sonraki ana sürüm için güncellemeler alamazsınız (v4.x, v5.x gibi)",
    "WhatHappensWhenLicenseEndsExplanation4": "ABP Ticari platformuna eklenen yeni modülleri ve temaları lisansınız sona erdikten sonra kuramazsınız.",
    "WhatHappensWhenLicenseEndsExplanation5": "ABP Suite'i kullanamazsınız.",
    "WhatHappensWhenLicenseEndsExplanation6": "Artık <a href=\"{0}\">premium desteği</a> alamazsınız.",
    "WhatHappensWhenLicenseEndsExplanation7": "Bu avantajlardan yararlanmaya devam etmek istiyorsanız aboneliğinizi yenileyebilirsiniz. Lisansınızın süresi dolduktan sonra 1 ay içerisinde aboneliğinizi yenilerseniz %20 indirim uygulanır.",
    "WhenShouldIRenewMyLicense": "Ehliyetimi ne zaman yenilemeliyim?",
    "WhenShouldIRenewMyLicenseExplanation1": "Lisansınızın süresi dolduktan sonra <strong>1 ay</strong> içinde lisansınızı yenilerseniz %20 indirim uygulanır.",
    "WhenShouldIRenewMyLicenseExplanation2": "Lisansınızın bitiş tarihinden 1 ay sonra lisansınızı yenilerseniz, yenileme fiyatı lisans satın alma fiyatı ile aynı olacak ve yenilemenizde indirim yapılmayacaktır.",
    "TrialPlan": "Deneme planınız var mı?",
    "TrialPlanExplanation": "ABP Commercial'ın şimdilik bir deneme planı yok. Ekip lisansları için 30 gün para iade garantisi veriyoruz. Sadece ilk 30 gün içinde geri ödeme talebinde bulunabilirsiniz. Business ve Enterprise lisansları için 30 gün içinde %60 geri ödeme sağlıyoruz. Bunun nedeni, Business ve Enterprise lisanslarının tüm modüllerin ve temaların tam kaynak kodunu içermesidir.",
    "DoYouAcceptBankWireTransfer": "Banka havalesini kabul ediyor musunuz?",
    "DoYouAcceptBankWireTransferExplanation": "Evet, banka havalesini kabul ediyoruz.<br />Lisans ücretini banka havalesi yoluyla gönderdikten sonra, makbuzunuzu ve istenen lisans türünü info@abp.io adresine e-posta ile gönderin. Uluslararası banka hesap bilgilerimiz:",
    "HowToUpgrade": "Yeni bir sürüm mevcut olduğunda mevcut uygulamalar nasıl yükseltilir?",
    "HowToUpgradeExplanation1": "ABP Commercial kullanarak yeni bir uygulama oluşturduğunuzda, tüm modüller ve tema NuGet ve NPM paketleri olarak kullanılır. Böylece yeni bir sürüm çıktığında paketleri kolayca yükseltebilirsiniz.",
    "HowToUpgradeExplanation2": "Standart NuGet/NPM yükseltmelerine ek olarak, <a href=\"{0}\">ABP CLI</a>, çözümünüzdeki ABP ile ilgili tüm paketleri otomatik olarak bulan ve yükselten bir güncelleme komutu sağlar.",
    "DatabaseSupport": "Hangi veritabanı sistemleri desteklenir?",
    "DatabaseSupportExplanation": "ABP Framework'ün kendisi veritabanından bağımsızdır ve doğası gereği herhangi bir veritabanı sağlayıcısıyla çalışabilir. Şu anda uygulanmakta olan sağlayıcıların listesi için <a href=\"{0}\" target=\"_blank\">veri erişim belgesine</a> bakın.",
    "UISupport": "Hangi UI çerçeveleri desteklenir?",
    "Supported": "Desteklenen",
    "UISupportExplanation": "ABP Framework'ün kendisi, UI çerçevesinden bağımsızdır ve herhangi bir UI çerçevesiyle çalışabilir. Ancak başlangıç şablonları, modül kullanıcı arabirimleri ve temalar tüm kullanıcı arabirimi çerçeveleri için uygulanmadı. Kullanıcı arayüzü seçeneklerinin güncel listesi için <a href=\"{0}\">başlangıç belgesine</a> bakın.",
    "MicroserviceSupport": "Mikro hizmet mimarisini destekliyor mu?",
    "MicroserviceSupportExplanation1": "ABP çerçevesinin ana hedeflerinden biri, mikro hizmet çözümleri oluşturmak için uygun bir altyapı sağlamaktır. Mikro hizmet sistemleri oluşturmaya nasıl yardımcı olduğunu anlamak için <a href=\"{0}\">mikro hizmet mimarisi</a> belgesine bakın.",
    "MicroserviceSupportExplanation2": "Tüm ABP Ticari modülleri, <a href=\"{0}\">modül geliştirme en iyi uygulamaları</a> belgesini izleyerek mikro hizmet dağıtım senaryolarını (kendi API'si ve veritabanıyla) desteklemek üzere tasarlanmıştır.",
    "MicroserviceSupportExplanation3": "Kendi çözümünüzü oluşturmanıza yardımcı olacak bir mikro hizmet mimarisi uygulamasını gösteren örnek bir <a href=\"{0}\">mikro hizmet demo çözümü</a> sunuyoruz.",
    "MicroserviceSupportExplanation4": "Bu nedenle kısa yanıt \"<strong>evet, mikro hizmet mimarisini destekler</strong>\"dir.",
    "MicroserviceSupportExplanation5": "Ancak, bir mikro hizmet sistemi bir çözümdür ve her çözümün farklı gereksinimleri, ağ topolojisi, iletişim senaryoları, kimlik doğrulama olanakları, veritabanı ayırma/paylaşım kararları, çalışma zamanı yapılandırmaları, 3. taraf sistem entegrasyonları ve daha birçok özelliği olacaktır.",
    "MicroserviceSupportExplanation6": "ABP Çerçevesi ve ABP Ticari, kendi çözümünüzü oluşturmanıza yardımcı olacak mikro hizmet senaryoları, mikro hizmet uyumlu modüller, örnekler ve belgeler için altyapı sağlar. Ancak, sizin için önceden oluşturulmuş hayalinizdeki çözümü doğrudan indirmeyi beklemeyin. Bunu anlamanız ve gereksinimlerinize göre bazı parçaları bir araya getirmeniz gerekecek.",
    "WhereCanIDownloadSourceCode": "Kaynak kodunu nereden indirebilirim?",
    "WhereCanIDownloadSourceCodeExplanation": "ABP Suite veya ABP CLI aracılığıyla tüm ABP modüllerinin, Angular paketlerinin ve temalarının kaynak kodunu indirebilirsiniz. <a href=\"{0}\">Kaynak kodu nasıl indirilir?</a> konusuna bakın.",
    "ComputerLimitation": "Bir geliştirici ABP geliştirirken kaç bilgisayarda oturum açabilir?",
    "ComputerLimitationExplanation": "Kişi/lisanslı geliştirici başına özellikle <strong>{0} bilgisayara</strong> izin veriyoruz. Üçüncü bir makinede ABP Commercial ürünlerini geliştirmek için bir geliştiriciye ihtiyaç duyulduğunda, durumu açıklayan lisans@abp.io adresine bir e-posta gönderilmelidir ve ardından sistemimizde uygun tahsisi yapacağız.",
    "RefundPolicy": "Geri ödeme politikanız var mı?",
    "RefundPolicyExplanation": "Lisans satın alımınızın <strong>30 gün</strong> içinde geri ödeme talebinde bulunabilirsiniz. Business ve Enterprise lisans türlerinin kaynak kodu indirme seçeneği vardır, bu nedenle Business ve Enterprise (ve kaynak kodu alma hakkı içeren lisanslar) için geri ödeme yapılmaz. Ayrıca yenileme ve ikinci lisans alımlarında ücret iadesi yapılmaz.",
    "HowCanIRefundVat": "KDV'yi nasıl iade edebilirim?",
    "HowCanIRefundVatExplanation1": "Ödemeyi 2Checkout kullanarak yaptıysanız, KDV'yi 2Checkout hesabınız aracılığıyla iade edebilirsiniz:",
    "HowCanIRefundVatExplanation2": "<a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\">2Checkout</a> hesabınıza giriş yapın",
    "HowCanIRefundVatExplanation3": "Uygun siparişi bulun ve \"Gecikmiş KDV'yi İade Et\"e basın (KDV numaranızı girin)",
    "HowCanIGetMyInvoice": "Faturamı nasıl alabilirim?",
    "HowCanIGetMyInvoiceExplanation": "There are 2 payment gateways for purchasing a license: Iyzico and 2Checkout. If you purchase your license through the 2Checkout gateway, it sends the PDF invoice to your email address, see <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How-do-invoices-work\">2Checkout invoicing.</a> If you purchase through the Iyzico gateway, with custom purchase link or via bank wire transfer, we will prepare and send your invoice. You can request or download your invoice from the <a href=\"{0}\">organization management page</a>. Before contacting us for the invoice, check your organization management page!",
    "Forum": "Forum",
    "SupportExplanation": "ABP Ticari lisansları, ABP Çerçeve uzmanlarından oluşan bir ekip tarafından premium bir forum desteği sağlar.",
    "PrivateTicket": "Özel Bilet",
    "PrivateTicketExplanation": "Kurumsal Lisans ayrıca e-posta ve bilet sistemi ile özel bir destek içerir.",
    "AbpSuiteExplanation1": "ABP Suite, birkaç dakika içinde web sayfaları oluşturmanıza olanak tanır. Komut satırından yüklenebilen bir .NET Core Global aracıdır.",
    "AbpSuiteExplanation2": "Yeni bir ABP çözümü oluşturabilir, veritabanından ön uca kadar CRUD sayfaları oluşturabilir. Teknik genel bakış için <a href=\"{0}\">belgeye</a> bakın",
    "FastEasy": "Hızlı kolay",
    "AbpSuiteExplanation3": "ABP Suite, kolayca CRUD sayfaları oluşturmanıza olanak tanır. Sadece varlığınızı ve özelliklerini tanımlamanız yeterli, gerisi sizin için ABP Suite'e kalsın! ABP Suite, CRUD sayfanız için gerekli tüm kodu birkaç saniye içinde oluşturur. Angular, MVC ve Blazor kullanıcı arayüzlerini destekler.",
    "RichOptions": "Zengin Seçenekler",
    "AbpSuiteExplanation4": "ABP Suite supports multiple UI options like <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\">Razor Pages</a> and <a href=\"https://angular.io\">Angular</a>.It also supports multiple databases like <a href=\"https://www.mongodb.com\">MongoDB</a> and all databases supported by <strong>EntityFramework Core</strong> (MS SQL Server, Oracle, MySql, PostgreSQL and <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\">more</a>).",
    "AbpSuiteExplanation5": "İyi olan şu ki, bu seçenekler için endişelenmenize gerek yok. ABP Suite proje türünüzü anlar ve projeniz için kod üretir ve oluşturulan kodu projenizde doğru yere yerleştirir.",
    "SourceCode": "Kaynak kodu",
    "AbpSuiteExplanation6": "ABP Suite sizin için kaynak kodunu oluşturur! Web sayfasını oluşturmak için sihirli dosyalar oluşturmaz. ABP Suite, <strong>Entity, Repository, Application Service, Code First Migration, JavaScript/TypeScript ve CSHTML/HTML</strong> ve gerekli Arayüzler için kaynak kodunu oluşturur. ABP Suite ayrıca kodu yazılım geliştirmenin <strong>En İyi Uygulamalarına</strong> göre oluşturur, böylece oluşturulan kodun kalitesi hakkında endişelenmenize gerek kalmaz.",
    "AbpSuiteExplanation7": "Oluşturulan CRUD sayfasının yapı taşlarının kaynak koduna doğru uygulama katmanlarında sahip olduğunuz için, kaynak kodu kolayca değiştirebilir ve oluşturulan koda özel/iş mantığınızı enjekte edebilirsiniz.",
    "CrossPlatform": "Çapraz Platform",
    "AbpSuiteExplanation8": "ABP Suite, .NET Core ile oluşturulmuştur ve çapraz platformdur. Yerel bilgisayarınızda bir web uygulaması olarak çalışır. <strong>Windows</strong>, <strong>Mac</strong> ve <strong>Linux</strong> üzerinde çalıştırabilirsiniz.",
    "OtherFeatures": "Diğer özellikler",
    "OtherFeatures1": "Çözümünüzdeki <strong>NuGet</strong> ve <strong>NPM</strong> paketlerini kolayca günceller.",
    "OtherFeatures2": "Halihazırda oluşturulmuş sayfaları sıfırdan yeniden oluşturur.",
    "OtherFeatures3": "Yeni çözümler yaratır",
    "ThanksForCreatingProject": "Projenizi Oluşturduğunuz İçin Teşekkürler!",
    "HotToRunSolution": "Çözümünüzü nasıl çalıştırırsınız?",
    "HotToRunSolutionExplanation": "Çözümünüzü nasıl yapılandıracağınızı ve çalıştıracağınızı öğrenmek için başlangıç belgesine bakın.",
    "GettingStarted": "Başlarken",
    "WebAppDevTutorial": "Web Uygulaması Geliştirme Eğitimi",
    "WebAppDevTutorialExplanation": "Adım adım geliştirme örneği için web uygulaması geliştirme öğretici belgesine bakın.",
    "Document": "belge",
    "UsingABPSuiteToCURD": "CRUD Sayfa Oluşturma ve Kalıplama için ABP Suite'i Kullanma",
    "SeeABPSuiteDocument": "ABP Suite kullanımını öğrenmek için ABP Suite belgesine bakın.",
    "AskQuestionsOnSupport": "ABP Ticari Destek ile ilgili sorularınızı sorabilirsiniz.",
    "Documentation": "belgeler",
    "SeeModulesDocument": "Tüm ticari(pro) modüllerin ve bunların belgelerinin listesi için modüller belgesine bakın.",
    "Pricing": "fiyatlandırma",
    "PricingExplanation": "İşletmenizin bugün ihtiyaç duyduğu özellikleri ve işlevleri seçin. İşletmeniz büyüdükçe kolayca yükseltin.",
    "Team": "Takım",
    "Business": "İşletme",
    "Enterprise": "Girişim",
    "Custom": "Gelenek",
    "IncludedDeveloperLicenses": "Dahil edilen geliştirici lisansları",
    "CustomLicenceOrAdditionalServices": "Özel lisansa veya ek hizmetlere mi ihtiyacınız var?",
    "CustomOrVolumeLicense": "Özel veya toplu lisans",
    "LiveTrainingSupport": "Canlı eğitim ve destek",
    "AndMore": "ve dahası",
    "AdditionalDeveloperLicense": "Ek geliştirici lisansı",
    "ProjectCount": "proje sayısı",
    "AllProModules": "Tüm profesyonel modüller",
    "AllProThemes": "Tüm profesyonel temalar",
    "AllProStartupTemplates": "Tüm profesyonel başlangıç şablonları",
    "SourceCodeOfAllModules": "Tüm modüllerin kaynak kodu",
    "SourceCodeOfAllThemes": "Tüm temaların kaynak kodu",
    "PerpetualLicense": "Daimi lisans",
    "UnlimitedServerDeployment": "Sınırsız sunucu dağıtımı",
    "YearUpgrade": "1 yıllık yükseltme",
    "YearPremiumForumSupport": "1 yıllık premium forum desteği",
    "ForumSupportIncidentCountYear": "Forum desteği olay sayısı/yıl",
    "PrivateTicketEmailSupport": "Özel bilet ve e-posta desteği",
    "BuyNow": "Şimdi al",
    "PayViaAmexCard": "AMEX kartımla nasıl ödeme yapabilirim?",
    "PayViaAmexCardDescription": "Varsayılan ödeme ağ geçidi 'Iyzico', güvenlik önlemleri nedeniyle bazı AMEX kredi kartlarını reddedebilir. Bu durumda, '2Checkout' alternatif ödeme ağ geçidi üzerinden ödeme yapabilirsiniz.",
    "ThankYou": "Teşekkürler",
    "InvalidReCaptchaErrorMessage": "ReCAPTCHA doğrulanırken hata oluştu, lütfen tekrar deneyin.",
    "CompanyName": "Şirket",
    "YourCompanyName": "Şirketiniz",
    "FirstName": "Ad",
    "LastName": "Soyad",
    "Optional": "Opsiyonel",
    "YourFirstName": "Adınız",
    "YourLastName": "Soyadınız",
    "SpecialOffer": "Özel Teklif",
    "SpecialOfferMessage": "Acele et! Fiyatlar sınırlı bir süre için geçerlidir.",
    "DiscountRequest": "İndirim İsteği",
    "DiscountRequestDescribeCustomerQuestion": "Aşağıdakilerden hangisi sizi tanımlar?",
    "DiscountRequestStudentEmailMessage": "E-posta Adresi \".edu\" içermelidir.",
    "DiscountRequestDeveloperCount": "Kaç geliştiriciye sahipsiniz?",
    "DiscountRequestDeveloperCountExceedMessage": "{0}'ten fazla geliştiricisi olan şirketler için indirimli lisans sağlamıyoruz.",
    "DiscountRequestOrganizationName": "Şirket/organizasyon/okul adı",
    "Website": "İnternet sitesi",
    "GithubUsername": "GitHub kullanıcı adı",
    "PhoneNumber": "Telefon numarası",
    "Country": "Ülke",
    "DescribeABPCommercialUsage": "ABP Commercial kullanarak geliştirmeyi planladığınız projeyi tanımlayın",
    "DiscountRequestCertifyInformationMessage": "Tüm bilgilerin gerçek ve doğru olduğunu onaylıyorum.",
    "DiscountRequestReceived": "İndirim talebinizi aldık.",
    "DiscountRequestStatusMessage": "Verdiğiniz bilgileri kontrol ettikten sonra size cevap vereceğiz.",
    "MVCOrRazorPages": "MVC (Razor Pages)",
    "Angular": "Angular",
    "Blazor": "Blazor",
    "New": "Yeni",
    "MongoDB": "MongoDB",
    "EBookDDD": "Domain Driven Design E-Kitap",
    "PracticalGuideForImplementingDDD": "Bu kitap ABP Framework ile birlikte Domain Driven Design'ın uygulanması için pratik bir kılavuz görevi görür.",
    "IntroducingDDD": "Domain Driven Design Ile Tanışın",
    "DDDLayersAndCleanArchitecture": "DDD Katmanları & Clean Architecture",
    "LayeringOfADotnetSolution": "Bir .NET Uygulamasının Katmanlı Yapısı",
    "ImplementingDDDBuildingBlocks": "DDD Yapı Taşlarının Uygulanması",
    "DomainVsApplicationLogic": "Domain Mantığı vs Uygulama Mantığı",
    "SamplesAndDiscussions": "Örnekler & Tartışmalar",
    "Free": "Ücretsiz",
    "Download": "İndir",
    "DDDEBook": "DDD E-kitap",
    "ImplementingDDD": "Domain Driven Design'ı Uygulayın",
    "DDDBookExplanation": "ABP Framework ile Domain Driven Design'ın uygulanması için pratik bir kılavuz.",
    "Overview": "Genel Bakış",
    "DDDBookPracticalGuide": "Bu kitap Domain Driven Design'ın uygulanması için pratik bir kılavuz görevi görür. Uygulama ayrıntıları ABP Framework altyapısına dayanırken, temel kavramlar, prensipler ve modeller bir .NET çözümü olmasa bile her türlü çözümde uygulanabilir.",
    "TableOfContents": "İçindekiler",
    "IntroductionToImplementingDDD": "Domain Driven Design Uygulamasına Giriş",
    "WhatIsDDD": "Domain Driven Design nedir?",
    "Implementation": "Uygulama",
    "TheBigPicture": "Büyük Resim",
    "TheBuildingBlock": "Yapıtaşı",
    "ExampleUseCase": "Örnek Kullanım Senaryosu",
    "DomainAndApplicationLogic": "Domain ve Uygulama Mantığı",
    "Author": "Yazar",
    "PublishedOn": "Yayımlanma tarihi",
    "Page": "Sayfa",
    "FreeEBook": "Ücretsiz E-Kitap",
    "EBookSignInForDownload": "E-Kitabı indirmek için giriş yapın",
    "SignIn": "Giriş Yap",
    "Or": "Veya",
    "TellUsAboutYourself": "Bize biraz kendinizden bahsedin",
    "Surname": "Soyad",
    "DoYouAgreePrivacyPolicy": "Şartlar & Koşulları ve <a href=\"https://commercial.abp.io/Privacy\">Gizlilik Politikasını</a> kabul ediyorum.",
    "VolosoftMarketingInformationMessage": "İşletmeler ve Organizasyonlar için çözümler ve diğer Volosoft ürün ve hizmetleri hakkında bilgi, ipucu ve teklifler almak istiyorum.",
    "VolosoftSharingInformationMessage": "Volosoft'un ürünlerimi seçkin ortaklarla paylaşmasını kabul ediyorum, böylece ilgili ortakların ürünleri ve hizmetleri hakkında ilgili bilgileri alabilirim.",
    "WeWillSendYouADownloadLink": "{0} adresine email gönderilmiştir.",
    "InvalidFormInputs": "Lütfen formda belirtilen geçerli bilgileri yazınız.",
    "DDDBookEmailBody": "Teşekkürler. <br /> Kitabı indirmek için, <a href=\"{0}\">buraya tıklayınız</a>.",
    "FreeDDDEBook": "Ücretsiz DDD E-Kitap",
    "StartFree": "Ücretsiz başla",
    "FreeTrial": "Ücretsiz deneme",
    "AcceptsMarketingCommunications": " Evet, ABP Ticari pazarlama iletişimlerini almak istiyorum.",
    "PurposeOfUsage": "Kullanım amacı",
    "Industry": "sanayi",
    "Choose": "- Seçmek -",
    "CompanyOrganizationName": "şirket/organizasyon adı",
    "CompanySize": "Şirket büyüklüğü",
    "Next": "Sonraki",
    "StartTrial": "Ücretsiz Denememi Başlat",
    "ContactUsIssues": "Herhangi bir sorununuz varsa bizimle iletişime geçin",
    "TrialActivatedWarning": "Sayın {0}, bir kullanıcının yalnızca 1 ücretsiz deneme süresi hakkı vardır. Deneme sürenizi zaten kullandınız.",
    "ActivationRequirement": "Ücretsiz denemenizi başlatmanıza bir adım kaldı.<br>Hesabınızı etkinleştirmek için <b>{0}</b> adresine bir e-posta gönderdik. Gelen kutunuzu/önemsiz/spam kutularınızı kontrol edin!",
    "SaveAndDownload": "Kaydet ve İndir",
    "CompanyNameValidationMessage": "Şirket adı çok uzun!",
    "AddressValidationMessage": "Adres çok uzun!",
    "TaxNoValidationMessage": "VERGİ/KDV No çok uzun!",
    "NotesValidationMessage": "Notlar alanı çok uzun!",
    "CheckYourBillingInfo": "Faturanızı yalnızca bir kez oluşturabilirsiniz! Faturanızı oluşturmadan önce fatura bilgilerinizi kontrol edin.",
    "Volo.AbpIo.Commercial:030000": "Deneme sürenizi zaten kullandınız.",
    "Volo.AbpIo.Commercial:030001": "Bu kuruluş adı zaten var.",
    "StartYourFreeTrial": "ÜCRETSİZ deneme sürümünü başlat",
    "TrialLicenseModelInvalidErrorMessage": "Aşağıdaki alanlardan biri geçersiz: Ülke Adı, Şirket Büyüklüğü, Sektör veya Kullanım Amacı.",
    "Trial": "Duruşma",
    "Purchased": "satın alındı",
    "PurchaseLicense": "Satın alma lisansı",
    "PurchaseTrialLicenseMessage": "Lisans sona erme tarihiniz {0}. <br> Ücretsiz deneme süreniz boyunca oluşturduğunuz projeleri kullanmaya devam etmek istiyorsanız, <code>appsettings.secrets.json</code> dosyalarınızdaki lisans anahtarlarını değiştirmeniz gerekir. İşte lisans anahtarınız:",
    "TrialLicenseExpireMessage": "Deneme lisansını kullanıyorsunuz ve deneme lisansınızın süresi {0} tarihinde sona erecek.",
    "TryForFree": "Ücretsiz deneyin",
    "TrialLicenseExpiredInfo": "Deneme lisansınızın süresi doldu!",
    "CommercialNewsletterConfirmationMessage": "<a href=\"https://commercial.abp.io/TermsConditions\">Şartlar, Koşullar</a> ve <a href=\"https://commercial.abp.io/Privacy\">Gizlilik politikasını</a> kabul ediyorum."
  }
}