{
  "culture": "vi",
  "texts": {
    "OrganizationManagement": "Quản lý tổ chức",
    "OrganizationList": "Danh sách tổ chức",
    "Volo.AbpIo.Commercial:010003": "Bạn không phải là chủ sở hữu của tổ chức này!",
    "OrganizationNotFoundMessage": "Không tìm thấy tổ chức nào!",
    "DeveloperCount": "Nhà phát triển được phân bổ/tổng số",
    "QuestionCount": "Còn lại/tổng số câu hỏi",
    "Unlimited": "Vô hạn",
    "Owners": "Những chủ sở hữu",
    "AddMember": "Thêm thành viên",
    "AddOwner": "Thêm chủ sở hữu",
    "AddDeveloper": "Thêm nhà phát triển",
    "UserName": "tên tài khoản",
    "Name": "Tên",
    "EmailAddress": "Địa chỉ email",
    "Developers": "Nhà phát triển",
    "LicenseType": "Loại giấy phép",
    "Manage": "Quản lý",
    "StartDate": "Ngày bắt đầu",
    "EndDate": "Ngày cuối",
    "Modules": "Mô-đun",
    "LicenseExtendMessage": "Ngày kết thúc giấy phép của bạn được gia hạn thành {0}",
    "LicenseUpgradeMessage": "Giấy phép của bạn được nâng cấp lên {0}",
    "LicenseExtendAdnUpgradeMessage": "Giấy phép của bạn đã được gia hạn cho đến {0} và gói giấy phép của bạn được nâng cấp lên {1}.",
    "LicenseAddDeveloperMessage": "{0} nhà phát triển đã được thêm vào giấy phép của bạn",
    "Volo.AbpIo.Commercial:010004": "Không thể tìm thấy người dùng được chỉ định! Người dùng phải đã đăng ký.",
    "MyOrganizations": "Tổ chức của tôi",
    "ApiKey": "Mã API",
    "UserNameNotFound": "Không có người dùng nào có tên người dùng {0}",
    "SuccessfullyAddedToNewsletter": "Cảm ơn bạn đã đăng ký nhận bản tin của chúng tôi!",
    "MyProfile": "Thông tin của tôi",
    "EmailNotValid": "Vui lòng nhập một địa chỉ email hợp lệ.",
    "JoinOurMarketingNewsletter": "Tham gia bản tin tiếp thị của chúng tôi",
    "WouldLikeToReceiveMarketingMaterials": "Tôi muốn nhận các tài liệu tiếp thị như giao dịch sản phẩm và ưu đãi đặc biệt.",
    "StartUsingYourLicenseNow": "Bắt đầu sử dụng giấy phép của bạn ngay bây giờ!",
    "WelcomePage": "Trang chào mừng",
    "UnsubscriptionExpireEmail": "Hủy đăng ký nhận email nhắc nhở ngày hết hạn giấy phép",
    "UnsubscribeLicenseExpireEmailReminderMessage": "Đăng ký email này chỉ có nhắc nhở ngày hết hạn giấy phép của bạn.",
    "UnsubscribeFromLicenseExpireEmails": "Nếu bạn không muốn nhận email về ngày hết hạn giấy phép của mình, bạn có thể hủy đăng ký bất kỳ lúc nào bạn muốn.",
    "Unsubscribe": "Hủy đăng ký",
    "NotOrganizationMember": "Bạn không phải là thành viên của bất kỳ tổ chức nào.",
    "UnsubscribeLicenseExpirationEmailSuccessTitle": "Đã hủy đăng ký thành công",
    "UnsubscribeLicenseExpirationEmailSuccessMessage": "Bạn sẽ không nhận được email nhắc nhở ngày hết hạn giấy phép nữa.",
    "IndexPageHeroSection": "<span class=\"first-line\"> Nền tảng phát triển web hoàn chỉnh </span> <span class=\"second-line\"> </span> <span class=\"third-line\"> được tích hợp sẵn <img src=\"{0}\" width = \"110\" class=\"ml-1\" /> khung </span>",
    "AbpCommercialShortDescription": "ABP Commercial cung cấp các mô-đun ứng dụng được tạo sẵn, công cụ phát triển ứng dụng nhanh chóng, các chủ đề giao diện người dùng chuyên nghiệp, hỗ trợ cao cấp và hơn thế nữa.",
    "LiveDemo": "Bản thử trực tiếp",
    "GetLicence": "Nhận giấy phép",
    "Application": "Ứng dụng",
    "StartupTemplates": "Mẫu khởi động",
    "Startup": "Khởi động",
    "Templates": "Mẫu",
    "Developer": "Nhà phát triển",
    "Tools": "Công cụ",
    "Premium": "Phần thưởng",
    "PremiumSupport": "Hỗ trợ cao cấp",
    "PremiumForumSupport": "Hỗ trợ diễn đàn trả phí",
    "UI": "Giao diện người dùng",
    "Themes": "Chủ đề",
    "JoinOurNewsletter": "Tham gia bản tin của chúng tôi",
    "Send": "Gửi",
    "Learn": "Học",
    "AdditionalServices": "Dịch vụ bổ sung",
    "WhatIsABPFramework": "KHUNG ABP LÀ GÌ?",
    "OpenSourceBaseFramework": "Khung cơ sở nguồn mở",
    "ABPFrameworkExplanation": "<p class=\"lead\"> ABP Commercial dựa trên ABP Framework, một khuôn khổ ứng dụng web nguồn mở và do cộng đồng điều khiển cho ASP.NET Core. </p> <p> ABP Framework cung cấp một cơ sở hạ tầng tuyệt vời để viết và mã có thể kiểm tra với các phương pháp hay nhất. </p> <p> Được xây dựng và tích hợp với các công cụ phổ biến mà bạn đã biết. Đường cong học tập thấp, dễ dàng thích nghi, phát triển thoải mái. </p>",
    "Modular": "Mô-đun",
    "MicroserviceCompatible": "Tương thích với microservice",
    "DomainDrivenDesignInfrastructure": "Cơ sở hạ tầng thiết kế theo hướng miền",
    "MultiTenancy": "Thuê nhiều kiểu",
    "DistributedMessaging": "Nhắn tin phân tán",
    "DynamicProxying": "Proxying động",
    "BackgroundJobs": "Công việc cơ bản",
    "AuditLogging": "Ghi nhật ký kiểm tra",
    "BLOBStoring": "Lưu trữ BLOB",
    "BundlingMinification": "Bó & nhỏ",
    "AdvancedLocalization": "Bản địa hóa nâng cao",
    "ManyMore": "Nhiều nữa",
    "ExploreTheABPFramework": "Khám phá Khung ABP",
    "WhyUseTheABPCommercial": "Tại sao sử dụng ABP Commercial?",
    "WhyUseTheABPCommercialExplanation": "<p class=\"lead mt-5\"> Việc xây dựng các ứng dụng web cấp doanh nghiệp có thể phức tạp và tốn nhiều thời gian. </p> <p> ABP Commercial cung cấp cơ sở hạ tầng cơ sở hoàn hảo cần thiết cho tất cả ASP.NET Core cấp doanh nghiệp hiện đại các giải pháp dựa trên. Ngay từ khi thiết kế đến triển khai, toàn bộ chu trình phát triển được hỗ trợ bởi các tính năng và mô-đun tích hợp của ABP. </p>",
    "StartupTemplatesShortDescription": "Các mẫu khởi động giúp bạn bắt đầu ngay với dự án của mình trong vài giây.",
    "UIFrameworksOptions": "Tùy chọn khung giao diện người dùng;",
    "DatabaseProviderOptions": "Tùy chọn nhà cung cấp cơ sở dữ liệu;",
    "PreBuiltApplicationModules": "Mô-đun ứng dụng được xây dựng sẵn",
    "PreBuiltApplicationModulesShortDescription": "Hầu hết các yêu cầu ứng dụng phổ biến đã được phát triển cho bạn dưới dạng các mô-đun có thể sử dụng lại.",
    "Account": "Tài khoản",
    "Blogging": "Viết blog",
    "Identity": "Xác thực",
    "IdentityServer": "Máy chủ định danh",
    "Saas": "Saas",
    "LanguageManagement": "Quản lý ngôn ngữ",
    "TextTemplateManagement": "Quản lý mẫu văn bản",
    "See All Modules": "SeeAllModules",
    "ABPSuite": "ABP Suite",
    "AbpSuiteShortDescription": "ABP Suite là một công cụ bổ sung cho ABP Commercial.",
    "AbpSuiteExplanation": "Nó cho phép bạn xây dựng các trang web chỉ trong vài phút. Đó là một công cụ .NET Core Global có thể được cài đặt từ dòng lệnh. Nó có thể tạo ra một giải pháp ABP mới, tạo các trang CRUD từ cơ sở dữ liệu đến giao diện người dùng.",
    "Details": "Thông tin chi tiết",
    "LeptonTheme": "Chủ đề Lepton",
    "ProfessionalModernUIThemes": "Chủ đề giao diện người dùng chuyên nghiệp, hiện đại",
    "LeptonThemeExplanation": "Lepton cung cấp một loạt các chủ đề quản trị Bootstrap đóng vai trò là nền tảng vững chắc cho bất kỳ dự án nào yêu cầu bảng điều khiển quản trị.",
    "DefaultTheme": "Hình nền mặc định",
    "MaterialTheme": "Chủ đề vật liệu",
    "Default2Theme": "Chủ đề 2 mặc định",
    "DarkTheme": "Chủ đề tối",
    "DarkBlueTheme": "Chủ đề xanh đậm",
    "LightTheme": "Chủ đề ánh sáng",
    "ProudToWorkWith": "Tự hào được làm việc cùng",
    "OurConsumers": "Hàng nghìn doanh nghiệp và nhà phát triển trên 70 quốc gia trên toàn thế giới dựa vào ABP Commercial.",
    "JoinOurConsumers": "Tham gia cùng họ và xây dựng các sản phẩm tuyệt vời một cách nhanh chóng.",
    "AdditionalServicesExplanation": "Bạn có cần các dịch vụ bổ sung hoặc tùy chỉnh không? <strong> Chúng tôi và các đối tác của chúng tôi có thể cung cấp; </strong>",
    "CustomProjectDevelopment": "Phát triển dự án tùy chỉnh",
    "CustomProjectDevelopmentExplanation": "Các nhà phát triển chuyên dụng cho các dự án tùy chỉnh của bạn.",
    "PortingExistingProjects": "Chuyển các dự án hiện có",
    "PortingExistingProjectsExplanation": "Di chuyển các dự án kế thừa của bạn sang nền tảng ABP.",
    "LiveSupport": "Hỗ trợ trực tuyến",
    "LiveSupportExplanation": "Tùy chọn hỗ trợ trực tiếp từ xa khi bạn cần.",
    "Training": "Đào tạo",
    "TrainingExplanation": "Đào tạo chuyên dụng cho các nhà phát triển của bạn.",
    "OnBoarding": "Nhập môn",
    "OnBoardingExplanation": "Giúp thiết lập môi trường phát triển, CI & CD của bạn.",
    "PrioritizedTechnicalSupport": "Hỗ trợ kỹ thuật được ưu tiên",
    "PremiumSupportExplanation": "Bên cạnh sự hỗ trợ cộng đồng tuyệt vời của khuôn khổ ABP, nhóm hỗ trợ của chúng tôi sẽ giải đáp các thắc mắc và vấn đề kỹ thuật của người dùng thương mại với mức độ ưu tiên cao.",
    "SeeTheSupportOptions": "Xem các Tùy chọn Hỗ trợ",
    "Contact": "Tiếp xúc",
    "TellUsWhatYouNeed": "Hãy cho chúng tôi những gì bạn cần.",
    "YourMessage": "Tin nhắn của bạn",
    "YourFullName": "Tên đầy đủ của bạn",
    "EmailField": "Địa chỉ email",
    "YourEmailAddress": "Địa chỉ email của bạn",
    "HowMayWeHelpYou": "Chúng tôi có thể giúp gì cho bạn?",
    "SendMessage": "Gửi tin nhắn",
    "Success": "Sự thành công",
    "WeWillReplyYou": "Chúng tôi đã nhận được tin nhắn của bạn và sẽ sớm liên hệ với bạn.",
    "GoHome": "Về nhà",
    "CreateLiveDemo": "Tạo bản trình diễn trực tiếp",
    "RegisterToTheNewsletter": "Đăng ký nhận bản tin để nhận thông tin về ABP.IO, bao gồm các bản phát hành mới, v.v.",
    "EnterYourEmailOrLogin": "Nhập địa chỉ e-mail của bạn để tạo bản demo hoặc <a href=\"{0}\"> Đăng nhập </a> bằng tài khoản hiện có của bạn.",
    "ApplicationTemplate": "Mẫu ứng dụng",
    "ApplicationTemplateExplanation": "Mẫu khởi động ứng dụng được sử dụng để tạo một ứng dụng web mới.",
    "EfCoreProvider": "Khung thực thể (Hỗ trợ SQL Server, MySQL, PostgreSQL, Oracle <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/\"> và những người khác </a>)",
    "AlreadyIncludedInTemplateModules": "Các mô-đun sau đã được bao gồm và định cấu hình trong mẫu này:",
    "ApplicationTemplateArchitecture": "Mẫu ứng dụng này cũng hỗ trợ kiến trúc phân cấp trong đó lớp giao diện người dùng, lớp API và dịch vụ xác thực được tách biệt về mặt vật lý.",
    "SeeTheGuideOrGoToTheLiveDemo": "Xem hướng dẫn dành cho nhà phát triển để biết thông tin kỹ thuật về mẫu này hoặc đi tới bản demo trực tiếp.",
    "DeveloperGuide": "Hướng dẫn dành cho nhà phát triển",
    "ModuleTemplate": "Mẫu mô-đun",
    "ModuleTemplateExplanation1": "Bạn muốn tạo một mô-đun và sử dụng lại trên các ứng dụng khác nhau? Mẫu khởi động này chuẩn bị mọi thứ để bắt đầu tạo <strong> mô-đun ứng dụng </strong> hoặc <strong> dịch vụ vi mô </strong> có thể sử dụng lại.",
    "ModuleTemplateExplanation2": "<p> Bạn có thể hỗ trợ một hoặc nhiều khung giao diện người dùng, một hoặc nhiều nhà cung cấp cơ sở dữ liệu cho một mô-đun. Mẫu khởi động được định cấu hình để chạy và <strong> kiểm tra mô-đun của bạn </strong> trong một ứng dụng tối thiểu ngoài cơ sở hạ tầng kiểm tra đơn vị và tích hợp. </p> <p> Xem hướng dẫn dành cho nhà phát triển để biết thông tin kỹ thuật về mẫu này. </p>",
    "WithAllStyleOptions": "với tất cả các tùy chọn phong cách",
    "Demo": "Bản giới thiệu",
    "SeeAllModules": "Xem tất cả các mô-đun",
    "ABPCLIExplanation": "ABP CLI (Giao diện dòng lệnh) là một công cụ dòng lệnh để thực hiện một số hoạt động phổ biến cho các giải pháp dựa trên ABP.",
    "ABPSuiteEasilyCURD": "ABP Suite là một công cụ cho phép bạn dễ dàng tạo các trang CRUD",
    "WeAreHereToHelp": "Chúng tôi ở đây để <span class=\"zero-text\"> Trợ giúp </span>",
    "BrowseOrAskQuestion": "Bạn có thể duyệt qua các chủ đề trợ giúp của chúng tôi hoặc tìm kiếm trong các câu hỏi thường gặp hoặc bạn có thể đặt câu hỏi cho chúng tôi bằng cách sử dụng <a href=\"{0}\" class=\"text-success\"> biểu mẫu liên hệ </a>.",
    "SearchQuestionPlaceholder": "Tìm kiếm trong các câu hỏi thường gặp",
    "WhatIsTheABPCommercial": "ABP thương mại là gì?",
    "WhatAreDifferencesThanAbpFramework": "Sự khác biệt giữa Khung ABP nguồn mở và ABP Thương mại là gì?",
    "ABPCommercialExplanation": "ABP Commercial là một tập hợp các mô-đun, công cụ, chủ đề và dịch vụ cao cấp được xây dựng dựa trên <a target=\"_blank\" href=\"{0}\"> khung ABP </a> mã nguồn mở. ABP Commercial đang được phát triển và hỗ trợ bởi cùng một nhóm đứng sau khuôn khổ ABP.",
    "WhatAreDifferencesThanABPFrameworkExplanation": "<p> <a target=\"_blank\" href=\"{0}\"> Khung ABP </a> là một khung phát triển ứng dụng mô-đun, có thể chủ đề, tương thích với dịch vụ vi mô cho ASP.NET Core. Nó cung cấp một kiến trúc hoàn chỉnh và một cơ sở hạ tầng mạnh mẽ để khiến bạn tập trung vào mã kinh doanh của riêng mình hơn là lặp lại chính mình cho mọi dự án mới. Nó dựa trên các phương pháp hay nhất về phát triển phần mềm và các công cụ phổ biến mà bạn đã biết. </p> <p> Khung ABP hoàn toàn miễn phí, mã nguồn mở và hướng tới cộng đồng. Nó cũng cung cấp một chủ đề miễn phí và một số mô-đun được tạo sẵn (ví dụ: quản lý danh tính và quản lý người thuê). </p>",
    "VisitTheFrameworkVSCommercialDocument": "Truy cập liên kết sau để biết thêm thông tin <a href=\"{0}\" target=\"_blank\"> {1} </a>",
    "ABPCommercialFollowingBenefits": "ABP Commercial bổ sung các lợi ích sau vào đầu khuôn khổ ABP;",
    "Professional": "Cao thủ",
    "UIThemes": "Chủ đề giao diện người dùng",
    "EnterpriseModules": "Sẵn sàng cho doanh nghiệp, nhiều tính năng, <a href=\"{0}\"> mô-đun ứng dụng </a> được tạo sẵn (ví dụ: quản lý Máy chủ định danh, quản lý SaaS, quản lý ngôn ngữ)",
    "ToolingToSupport": "Công cụ để hỗ trợ năng suất phát triển của bạn (ví dụ: <a href=\"{0}\"> ABP Suite </a>)",
    "PremiumSupportLink": "<a href=\"{0}\" target=\"_blank\"> hỗ trợ </a> cao cấp",
    "WhatDoIDownloadABPCommercial": "Tôi tải xuống những gì khi mua ABP Commercial?",
    "CreateUnlimitedSolutions": "Khi bạn mua giấy phép ABP Thương mại, bạn sẽ có thể tạo các giải pháp không giới hạn như được mô tả trong tài liệu <a href=\"{0}\"> Bắt đầu </a>.",
    "ABPCommercialSolutionExplanation": "Khi bạn tạo một ứng dụng mới, bạn sẽ nhận được giải pháp Visual Studio (mẫu khởi động) dựa trên sở thích của bạn. Giải pháp đã tải xuống có các mô-đun và chủ đề thương mại đã được cài đặt và định cấu hình cho bạn. Bạn có thể gỡ bỏ một mô-đun đã được cài đặt sẵn hoặc thêm một mô-đun khác nếu bạn muốn. Tất cả các mô-đun và chủ đề được sử dụng một gói NuGet/NPM theo mặc định.",
    "StartDevelopWithTutorials": "Giải pháp đã tải xuống được cấu trúc và tài liệu hóa tốt. Bạn có thể bắt đầu phát triển mã doanh nghiệp của riêng mình dựa trên mã đó bằng cách thực hiện theo <a href=\"{0}\"> các hướng dẫn </a>",
    "TryTheCommercialDemo": "Bạn có thể thử <a href=\"{0}\"> bản trình diễn </a> để xem một ứng dụng mẫu được tạo bằng cách sử dụng mẫu khởi động ABP Commercial.",
    "HowManyProducts": "Tôi có thể xây dựng bao nhiêu sản phẩm/giải pháp khác nhau bằng ABP Commercial?",
    "HowManyProductsExplanation": "Không có giới hạn để tạo một dự án ABP. Bạn có thể tạo bao nhiêu dự án tùy thích, phát triển và tải chúng lên các máy chủ khác nhau.",
    "HowManyDevelopers": "Có bao nhiêu nhà phát triển có thể làm việc trên ABP Commercial?",
    "HowManyDevelopersExplanation": "Giấy phép thương mại ABP là cho mỗi nhà phát triển. Các loại giấy phép khác nhau có các giới hạn dành cho nhà phát triển khác nhau. Tuy nhiên, bạn có thể thêm nhiều nhà phát triển hơn vào bất kỳ loại giấy phép nào bất cứ khi nào bạn cần. Xem trang <a href=\"{0}\"> giá </a> để biết các loại giấy phép, giới hạn dành cho nhà phát triển và chi phí bổ sung cho nhà phát triển.",
    "ChangingLicenseType": "Tôi có thể nâng cấp loại giấy phép của mình sau này không?",
    "ChangingLicenseTypeExplanation": "Bạn có thể nâng cấp lên giấy phép cao hơn bằng cách trả khoản chênh lệch trong thời hạn giấy phép đang hoạt động của mình. Khi bạn nâng cấp lên gói giấy phép cao hơn, bạn sẽ nhận được những lợi ích của gói mới, nhưng việc nâng cấp giấy phép không thay đổi ngày hết hạn của giấy phép. Bên cạnh đó, bạn cũng có thể thêm chỗ ngồi cho nhà phát triển mới vào giấy phép hiện có của mình, hãy xem \"Có bao nhiêu nhà phát triển có thể làm việc trên ABP Commercial?\"",
    "LicenseExtendUpgradeDiff": "Sự khác biệt giữa gia hạn giấy phép và nâng cấp là gì?",
    "LicenseExtendUpgradeDiffExplanation": "<strong>Extending:</strong> By extending/renewing your license, you will continue to get premium support and get major updates for the modules and themes. Besides, you will be able to continue creating new projects. And you will still be able to use ABP Suite which speeds up your development.<hr/><strong>Upgrading:</strong> By upgrading your license, you will promote to a higher license plan which will allow you to get additional benefits. See the <a href=\"/pricing\">license comparison table</a> to check the differences between the license plans.<strong>On the other hand, when you upgrade, your license expiry date will not change!</strong>To extend your license end date, you need to extend your license.",
    "LicenseRenewalCost": "Chi phí gia hạn giấy phép sau 1 năm là bao nhiêu?",
    "LicenseRenewalCostExplanation": "Giá gia hạn (gia hạn) của Giấy phép nhóm tiêu chuẩn là $ {0}, Giấy phép kinh doanh tiêu chuẩn là $ {1} và Giấy phép doanh nghiệp tiêu chuẩn là $ {2}. Nếu bạn đã là khách hàng, hãy <a href='{3}' target='_blank'> đăng nhập vào tài khoản của bạn </a> để xem lại giá gia hạn hiện có.",
    "HowDoIRenewMyLicense": "Làm cách nào để gia hạn giấy phép của tôi?",
    "HowDoIRenewMyLicenseExplanation": "Bạn có thể gia hạn giấy phép của mình bằng cách điều hướng đến <a href='{0}' target='_blank'> trang quản lý tổ chức </a>. Để tận dụng mức giá Gia hạn sớm được chiết khấu của chúng tôi, hãy đảm bảo bạn gia hạn trước khi giấy phép hết hạn. Tuy nhiên, đừng lo lắng về việc không biết khi nào cơ hội Gia hạn sớm của bạn đóng lại. Bạn sẽ nhận được 3 e-mail nhắc nhở trước khi đăng ký của bạn hết hạn. Chúng tôi sẽ gửi chúng vào 30 ngày, 7 ngày và 1 ngày trước khi hết hạn.",
    "IsSourceCodeIncluded": "Giấy phép của tôi có bao gồm mã nguồn của các mô-đun và chủ đề thương mại không?",
    "IsSourceCodeIncludedExplanation1": "Phụ thuộc vào loại giấy phép bạn đã mua:",
    "IsSourceCodeIncludedExplanation2": "<strong> Nhóm </strong>: Giải pháp của bạn sử dụng các mô-đun và chủ đề dưới dạng gói NuGet và NPM. Nó không bao gồm mã nguồn của họ. Bằng cách này, bạn có thể dễ dàng nâng cấp các mô-đun và chủ đề này bất cứ khi nào có phiên bản mới. Tuy nhiên, bạn không thể lấy mã nguồn của các mô-đun và chủ đề.",
    "IsSourceCodeIncludedExplanation3": "<strong> Doanh nghiệp/Doanh nghiệp </strong>: Ngoài giấy phép Nhóm, bạn có thể tải xuống mã nguồn của bất kỳ mô-đun hoặc chủ đề nào bạn cần. Bạn thậm chí có thể xóa các tham chiếu gói NuGet/NPM cho một mô-đun cụ thể và thêm mã nguồn của nó trực tiếp vào giải pháp của bạn để thay đổi hoàn toàn nó.",
    "IsSourceCodeIncludedExplanation4": "<p> Bao gồm mã nguồn của mô-đun vào giải pháp của bạn mang lại cho bạn quyền tự do tối đa để tùy chỉnh mô-đun đó. Tuy nhiên, sau đó sẽ không thể tự động nâng cấp mô-đun khi phiên bản mới được phát hành. </p> <p> Không có giấy phép nào bao gồm mã nguồn ABP Suite, là một công cụ bên ngoài tạo mã cho bạn và hỗ trợ cho sự phát triển của bạn. </p> <p> Xem trang <a href=\"{0}\"> giá cả </a> để biết những khác biệt khác giữa các loại giấy phép. </p>",
    "ChangingDevelopers": "Tôi có thể thay đổi các nhà phát triển đã đăng ký của tổ chức của mình trong tương lai không?",
    "ChangingDevelopersExplanation": "Ngoài việc thêm các nhà phát triển mới vào giấy phép của mình, bạn cũng có thể thay đổi các nhà phát triển hiện có (bạn có thể xóa một nhà phát triển và thêm một nhà phát triển mới vào cùng một chỗ ngồi) mà không phải trả thêm bất kỳ chi phí nào.",
    "WhatHappensWhenLicenseEnds": "Điều gì xảy ra khi thời hạn cấp phép của tôi kết thúc?",
    "WhatHappensWhenLicenseEndsExplanation1": "ABP Loại giấy phép thương mại là <a href=\"{0}\" target=\"_blank\"> giấy phép vĩnh viễn </a>. Sau khi giấy phép của bạn hết hạn, bạn có thể tiếp tục phát triển dự án của mình. Và bạn không có nghĩa vụ phải gia hạn giấy phép của mình. Giấy phép của bạn đi kèm với một bản cập nhật và kế hoạch hỗ trợ trong một năm. Để tiếp tục nhận các tính năng mới, cải tiến hiệu suất, sửa lỗi, hỗ trợ và tiếp tục sử dụng ABP Suite, bạn cần gia hạn giấy phép của mình. Khi giấy phép của bạn hết hạn, bạn sẽ không nhận được những lợi ích sau đây;",
    "WhatHappensWhenLicenseEndsExplanation2": "Bạn không thể tạo các giải pháp mới bằng ABP Commercial, nhưng bạn có thể tiếp tục phát triển các ứng dụng hiện có của mình mãi mãi.",
    "WhatHappensWhenLicenseEndsExplanation3": "Bạn sẽ có thể nhận được bản cập nhật cho các mô-đun và chủ đề trong phiên bản CHÍNH của mình (ngoại trừ phiên bản RC hoặc Preview). Ví dụ; nếu bạn đang sử dụng v3.2.0 của một mô-đun, bạn vẫn có thể nhận được các bản cập nhật cho v3.x.x (v3.3.0, v3.5.2 ... v.v.) của mô-đun đó. Nhưng bạn không thể nhận các bản cập nhật cho phiên bản chính tiếp theo (như v4.x, v5.x). Ví dụ: khi giấy phép của bạn hết hạn, bản phát hành mới nhất là v4.4.3 và phiên bản xem trước mới nhất là v5.0.0-rc.2, bạn có thể truy cập v4.X.X nhưng không thể truy cập v5.X.X.",
    "WhatHappensWhenLicenseEndsExplanation4": "Bạn không thể cài đặt các mô-đun và chủ đề mới được thêm vào nền tảng ABP Commercial sau khi giấy phép của bạn hết hạn.",
    "WhatHappensWhenLicenseEndsExplanation5": "Bạn không thể sử dụng ABP Suite.",
    "WhatHappensWhenLicenseEndsExplanation6": "Bạn không thể nhận được <a href=\"{0}\"> hỗ trợ cao cấp </a> nữa.",
    "WhatHappensWhenLicenseEndsExplanation7": "Bạn có thể gia hạn (gia hạn) giấy phép của mình nếu bạn muốn tiếp tục nhận được những lợi ích này. Nếu bạn gia hạn giấy phép của mình trong vòng <strong> 1 tháng </strong> sau khi giấy phép của bạn hết hạn, các chiết khấu sau sẽ được áp dụng: Giảm giá {0}% cho Giấy phép Nhóm, Giảm giá {1}% Giấy phép Kinh doanh, Giảm giá {2}% Giấy phép Doanh nghiệp .",
    "WhenShouldIRenewMyLicense": "Khi nào tôi nên gia hạn giấy phép của mình?",
    "WhenShouldIRenewMyLicenseExplanation": "Nếu bạn gia hạn giấy phép của mình trong vòng <strong> 1 tháng </strong> sau khi giấy phép của bạn hết hạn, các chiết khấu sau sẽ được áp dụng: Giảm giá {0}% cho Giấy phép Nhóm, Giảm giá {1}% Giấy phép Kinh doanh, Giảm giá {2}% Giấy phép Doanh nghiệp . Nếu bạn gia hạn giấy phép <strong> 1 tháng </strong> sau ngày giấy phép hết hạn, giá gia hạn sẽ giống như giá mua giấy phép và sẽ không có chiết khấu khi gia hạn của bạn.",
    "TrialPlan": "Bạn có kế hoạch dùng thử không?",
    "TrialPlanExplanation": "Hiện tại, ABP Commercial không có kế hoạch dùng thử. Đối với giấy phép Nhóm, chúng tôi cung cấp bảo đảm hoàn tiền trong 30 ngày. Bạn chỉ có thể yêu cầu hoàn lại tiền trong 30 ngày đầu tiên. Đối với giấy phép Doanh nghiệp và Doanh nghiệp, chúng tôi hoàn lại 60% trong 30 ngày. Điều này là do giấy phép Doanh nghiệp và Doanh nghiệp bao gồm mã nguồn đầy đủ của tất cả các mô-đun và chủ đề.",
    "DoYouAcceptBankWireTransfer": "Bạn có chấp nhận chuyển khoản ngân hàng không?",
    "DoYouAcceptBankWireTransferExplanation": "Có, chúng tôi chấp nhận chuyển khoản ngân hàng. <br /> Sau khi gửi phí cấp phép qua chuyển khoản ngân hàng, hãy gửi email cho chúng tôi theo địa chỉ accounting@abp.io biên lai của bạn và loại giấy phép được yêu cầu. Thông tin tài khoản ngân hàng quốc tế của chúng tôi:",
    "HowToUpgrade": "Làm thế nào để nâng cấp các ứng dụng hiện có khi có phiên bản mới?",
    "HowToUpgradeExplanation1": "Khi bạn tạo một ứng dụng mới bằng ABP Commercial, tất cả các mô-đun và chủ đề được sử dụng dưới dạng gói NuGet và NPM. Vì vậy, bạn có thể dễ dàng nâng cấp các gói khi có phiên bản mới.",
    "HowToUpgradeExplanation2": "Ngoài các nâng cấp NuGet/NPM tiêu chuẩn, <a href=\"{0}\"> ABP CLI </a> cung cấp lệnh cập nhật tự động tìm và nâng cấp tất cả các gói liên quan đến ABP trong giải pháp của bạn.",
    "DatabaseSupport": "Hệ thống cơ sở dữ liệu nào được hỗ trợ?",
    "DatabaseSupportExplanation": "Bản thân ABP Framework là cơ sở dữ liệu bất khả tri và có thể hoạt động với bất kỳ nhà cung cấp cơ sở dữ liệu nào về bản chất. Xem <a href=\"{0}\" target=\"_blank\"> tài liệu truy cập dữ liệu </a> để biết danh sách các nhà cung cấp hiện được triển khai.",
    "UISupport": "Những khung giao diện người dùng nào được hỗ trợ?",
    "Supported": "Được hỗ trợ",
    "UISupportExplanation": "Bản thân ABP Framework là khuôn khổ giao diện người dùng bất khả tri và có thể hoạt động với bất kỳ khuôn khổ giao diện người dùng nào. Tuy nhiên, các mẫu khởi động, giao diện người dùng mô-đun và chủ đề không được triển khai cho tất cả các khung giao diện người dùng. Xem <a href=\"{0}\"> tài liệu bắt đầu </a> để biết danh sách cập nhật các tùy chọn giao diện người dùng.",
    "MicroserviceSupport": "Nó có hỗ trợ kiến trúc dịch vụ vi mô không?",
    "MicroserviceSupportExplanation1": "Một trong những mục tiêu chính của khuôn khổ ABP là cung cấp cơ sở hạ tầng thuận tiện để tạo ra các giải pháp dịch vụ vi mô. Xem tài liệu <a href=\"{0}\"> kiến trúc dịch vụ vi mô </a> để hiểu tài liệu này giúp tạo ra các hệ thống dịch vụ vi mô như thế nào.",
    "MicroserviceSupportExplanation2": "Tất cả các mô-đun ABP Commercial được thiết kế để hỗ trợ các tình huống triển khai dịch vụ vi mô (với API và cơ sở dữ liệu riêng) bằng cách tuân theo tài liệu <a href=\"{0}\"> các phương pháp hay nhất về phát triển mô-đun </a>.",
    "MicroserviceSupportExplanation3": "Chúng tôi cung cấp <a href=\"{0}\"> giải pháp demo dịch vụ vi mô </a> mẫu thể hiện việc triển khai kiến trúc dịch vụ vi mô để giúp bạn tạo giải pháp của riêng mình.",
    "MicroserviceSupportExplanation4": "Vì vậy, câu trả lời ngắn gọn là \"<strong> có, nó hỗ trợ kiến trúc dịch vụ vi mô </strong>\".",
    "MicroserviceSupportExplanation5": "Tuy nhiên, hệ thống dịch vụ vi mô là một giải pháp và mọi giải pháp sẽ có các yêu cầu khác nhau, cấu trúc liên kết mạng, kịch bản giao tiếp, khả năng xác thực, quyết định tách/chia sẻ cơ sở dữ liệu, cấu hình thời gian chạy, tích hợp hệ thống của bên thứ 3 và nhiều hơn nữa.",
    "MicroserviceSupportExplanation6": "ABP Framework và ABP Commercial cung cấp cơ sở hạ tầng cho các kịch bản dịch vụ vi mô, mô-đun tương thích với dịch vụ vi mô, mẫu và tài liệu để giúp bạn xây dựng giải pháp của riêng mình. Nhưng đừng mong đợi tải trực tiếp giải pháp mơ ước được xây dựng sẵn cho bạn. Bạn sẽ cần phải hiểu nó và kết hợp một số phần lại với nhau dựa trên yêu cầu của bạn.",
    "WhereCanIDownloadSourceCode": "Tôi có thể tải xuống mã nguồn ở đâu?",
    "WhereCanIDownloadSourceCodeExplanation": "Bạn có thể tải xuống mã nguồn của tất cả các mô-đun ABP, gói Angular và chủ đề thông qua ABP Suite hoặc ABP CLI. Xem <a href=\"{0}\"> Cách tải xuống mã nguồn? </a>",
    "ComputerLimitation": "Nhà phát triển có thể đăng nhập bao nhiêu máy tính khi phát triển ABP?",
    "ComputerLimitationExplanation": "Chúng tôi đặc biệt cho phép <strong> {0} máy tính </strong> cho mỗi cá nhân/nhà phát triển được cấp phép. Bất cứ khi nào nhà phát triển cần phát triển các sản phẩm ABP Commercial trên máy thứ ba, một e-mail sẽ được gửi đến license@abp.io giải thích tình hình và sau đó chúng tôi sẽ thực hiện phân bổ thích hợp trong hệ thống của mình.",
    "RefundPolicy": "Bạn có chính sách hoàn lại tiền không?",
    "RefundPolicyExplanation": "Bạn có thể yêu cầu hoàn lại tiền trong vòng <strong> 30 ngày </strong> kể từ khi mua giấy phép của mình. Loại giấy phép Doanh nghiệp và Doanh nghiệp có tùy chọn tải xuống mã nguồn, do đó, Doanh nghiệp và Doanh nghiệp không được hoàn lại tiền (và bất kỳ giấy phép nào bao gồm quyền nhận mã nguồn). Ngoài ra, không hoàn lại tiền cho việc gia hạn và mua giấy phép thứ hai.",
    "HowCanIRefundVat": "Tôi có thể hoàn thuế GTGT bằng cách nào?",
    "HowCanIRefundVatExplanation1": "Nếu bạn thực hiện thanh toán bằng 2Checkout, bạn có thể hoàn thuế VAT qua tài khoản 2Checkout của mình:",
    "HowCanIRefundVatExplanation2": "Đăng nhập vào tài khoản <a href=\"https://secure.2checkout.com/cpanel/login.php\" target=\"_blank\"> 2Checkout </a> của bạn",
    "HowCanIRefundVatExplanation3": "Tìm đơn đặt hàng thích hợp và nhấn \"Hoàn lại VAT sau thời hạn\" (nhập ID VAT của bạn)",
    "HowCanIGetMyInvoice": "Làm cách nào tôi có thể nhận được hóa đơn của mình?",
    "HowCanIGetMyInvoiceExplanation": "There are 2 payment gateways for purchasing a license: Iyzico and 2Checkout. If you purchase your license through the 2Checkout gateway, it sends the PDF invoice to your email address, see <a href=\"https://knowledgecenter.2checkout.com/Documentation/03Billing-and-payments/Payment-operations/How-do-invoices-work\">2Checkout invoicing.</a> If you purchase through the Iyzico gateway, with custom purchase link or via bank wire transfer, we will prepare and send your invoice. You can request or download your invoice from the <a href=\"{0}\">organization management page</a>. Before contacting us for the invoice, check your organization management page!",
    "Forum": "Diễn đàn",
    "SupportExplanation": "Giấy phép ABP Thương mại cung cấp hỗ trợ diễn đàn cao cấp bởi một nhóm bao gồm các chuyên gia Khung ABP.",
    "PrivateTicket": "Vé riêng",
    "PrivateTicketExplanation": "Giấy phép Doanh nghiệp cũng bao gồm một hỗ trợ riêng với e-mail và hệ thống vé.",
    "AbpSuiteExplanation1": "ABP Suite cho phép bạn tạo các trang web chỉ trong vài phút. Đó là một công cụ .NET Core Global có thể được cài đặt từ dòng lệnh.",
    "AbpSuiteExplanation2": "Nó có thể tạo ra một giải pháp ABP mới, tạo các trang CRUD từ cơ sở dữ liệu đến giao diện người dùng. Để biết tổng quan về kỹ thuật, hãy xem <a href=\"{0}\"> tài liệu </a>",
    "FastEasy": "Nhanh chóng và dễ dàng",
    "AbpSuiteExplanation3": "ABP Suite cho phép bạn dễ dàng tạo các trang CRUD. Bạn chỉ cần xác định thực thể của mình và các thuộc tính của nó, phần còn lại hãy để ABP Suite giúp bạn! ABP Suite tạo tất cả mã cần thiết cho trang CRUD của bạn trong vài giây. Nó hỗ trợ giao diện người dùng Angular, MVC và Blazor.",
    "RichOptions": "Tùy chọn phong phú",
    "AbpSuiteExplanation4": "ABP Suite hỗ trợ nhiều tùy chọn giao diện người dùng như <a href=\"https://docs.microsoft.com/en-us/aspnet/core/razor-pages\"> Razor Pages </a> và <a href=\"https://angular.io\">Angular </a>. Nó cũng hỗ trợ nhiều cơ sở dữ liệu như <a href=\"https://www.mongodb.com\"> MongoDB </a> và tất cả các cơ sở dữ liệu được hỗ trợ bởi <strong> EntityFramework Core </strong> (MS SQL Server, Oracle, MySql, PostgreSQL và <a href=\"https://docs.microsoft.com/en-us/ef/core/providers/?tabs=dotnet-core-cli\"> khác </a>).",
    "AbpSuiteExplanation5": "Điều tốt là bạn không phải lo lắng về những lựa chọn đó. ABP Suite hiểu loại dự án của bạn và tạo mã cho dự án của bạn và đặt mã đã tạo vào đúng vị trí trong dự án của bạn.",
    "SourceCode": "Mã nguồn",
    "AbpSuiteExplanation6": "ABP Suite tạo mã nguồn cho bạn! Nó không tạo ra các tệp ma thuật để tạo trang web. ABP Suite tạo mã nguồn cho <strong> Thực thể, Kho lưu trữ, Dịch vụ Ứng dụng, Di chuyển Đầu tiên của Mã, JavaScript/TypeScript và CSHTML/HTML </strong> cũng như các Giao diện cần thiết. ABP Suite cũng tạo mã theo <strong> Các phương pháp hay nhất </strong> về phát triển phần mềm, vì vậy bạn không phải lo lắng về chất lượng của mã được tạo.",
    "AbpSuiteExplanation7": "Vì bạn có mã nguồn của các khối xây dựng của trang CRUD được tạo trong các lớp ứng dụng chính xác, bạn có thể dễ dàng sửa đổi mã nguồn và đưa logic tùy chỉnh/kinh doanh của mình vào mã được tạo.",
    "CrossPlatform": "Nền tảng chéo",
    "AbpSuiteExplanation8": "ABP Suite được xây dựng với .NET Core và nó là nền tảng chéo. Nó chạy như một ứng dụng web trên máy tính cục bộ của bạn. Bạn có thể chạy nó trên <strong> Windows </strong>, <strong> Mac </strong> và <strong> Linux </strong>",
    "OtherFeatures": "Các tính năng khác",
    "OtherFeatures1": "Cập nhật các gói <strong>NuGet</strong> và <strong>NPM</strong> trên giải pháp của bạn một cách dễ dàng.",
    "OtherFeatures2": "Tạo lại các trang đã được tạo từ đầu.",
    "OtherFeatures3": "Tạo ra các giải pháp mới",
    "ThanksForCreatingProject": "Cảm ơn bạn đã tạo dự án!",
    "HotToRunSolution": "Làm thế nào để chạy giải pháp của bạn?",
    "HotToRunSolutionExplanation": "Xem tài liệu bắt đầu để tìm hiểu cách định cấu hình và chạy giải pháp của bạn.",
    "GettingStarted": "Bắt đầu",
    "WebAppDevTutorial": "Hướng dẫn dành cho nhà phát triển ứng dụng web",
    "WebAppDevTutorialExplanation": "Xem tài liệu hướng dẫn phát triển ứng dụng web để biết mẫu phát triển từng bước.",
    "Document": "Tài liệu",
    "UsingABPSuiteToCURD": "Sử dụng ABP Suite để tạo & tạo trang CRUD",
    "SeeABPSuiteDocument": "Xem tài liệu ABP Suite để tìm hiểu cách sử dụng ABP Suite.",
    "AskQuestionsOnSupport": "Bạn có thể đặt câu hỏi trên Bộ phận Hỗ trợ Thương mại của ABP.",
    "Documentation": "Tài liệu",
    "SeeModulesDocument": "Xem tài liệu mô-đun để biết danh sách tất cả các mô-đun thương mại (chuyên nghiệp) và tài liệu của chúng.",
    "Pricing": "Định giá",
    "PricingExplanation": "Chọn các tính năng và chức năng mà doanh nghiệp của bạn cần ngay hôm nay. Dễ dàng nâng cấp khi doanh nghiệp của bạn phát triển.",
    "Team": "Đội",
    "Business": "Kinh doanh",
    "Enterprise": "Doanh nghiệp",
    "Custom": "Tập quán",
    "IncludedDeveloperLicenses": "Giấy phép nhà phát triển được bao gồm",
    "CustomLicenceOrAdditionalServices": "Cần giấy phép tùy chỉnh hoặc các dịch vụ bổ sung?",
    "CustomOrVolumeLicense": "Giấy phép tùy chỉnh hoặc số lượng lớn",
    "LiveTrainingSupport": "Đào tạo và hỗ trợ trực tiếp",
    "AndMore": "và hơn thế nữa",
    "AdditionalDeveloperLicense": "Giấy phép nhà phát triển bổ sung",
    "ProjectCount": "Số lượng dự án",
    "AllProModules": "Tất cả các mô-đun chuyên nghiệp",
    "AllProThemes": "Tất cả các chủ đề chuyên nghiệp",
    "AllProStartupTemplates": "Tất cả các mẫu khởi động chuyên nghiệp",
    "SourceCodeOfAllModules": "Mã nguồn của tất cả các mô-đun",
    "SourceCodeOfAllThemes": "Mã nguồn của tất cả các chủ đề",
    "PerpetualLicense": "Giấy phép vĩnh viễn",
    "UnlimitedServerDeployment": "Triển khai máy chủ không giới hạn",
    "YearUpgrade": "Nâng cấp 1 năm",
    "YearPremiumForumSupport": "1 năm hỗ trợ diễn đàn cao cấp",
    "ForumSupportIncidentCountYear": "Số sự cố hỗ trợ diễn đàn/năm",
    "PrivateTicketEmailSupport": "Hỗ trợ qua email và vé riêng",
    "BuyNow": "Mua ngay",
    "PayViaAmexCard": "Làm cách nào để thanh toán qua thẻ AMEX?",
    "PayViaAmexCardDescription": "Cổng thanh toán mặc định 'Iyzico' có thể từ chối một số thẻ tín dụng AMEX do các biện pháp bảo mật. Trong trường hợp này, bạn có thể thanh toán qua cổng thanh toán thay thế '2Checkout'.",
    "ThankYou": "Cảm ơn bạn",
    "InvalidReCaptchaErrorMessage": "Đã xảy ra lỗi khi xác minh reCAPTCHA. Vui lòng thử lại.",
    "CompanyName": "Tên công ty",
    "YourCompanyName": "Tên công ty của bạn",
    "FirstName": "Tên đầu tiên",
    "LastName": "Họ",
    "Optional": "Không bắt buộc",
    "YourFirstName": "Tên của bạn",
    "YourLastName": "Tên của bạn",
    "SpecialOffer": "Đề nghị đặc biệt",
    "SpecialOfferMessage": "Nhanh lên! Giá có hiệu lực trong một thời gian giới hạn.",
    "DiscountRequest": "Yêu cầu giảm giá",
    "DiscountRequestDescribeCustomerQuestion": "Điều nào sau đây mô tả bạn?",
    "DiscountRequestStudentEmailMessage": "Địa chỉ Email phải chứa 'edu'.",
    "DiscountRequestDeveloperCount": "Bạn có bao nhiêu nhà phát triển?",
    "DiscountRequestDeveloperCountExceedMessage": "Chúng tôi không cung cấp giấy phép chiết khấu cho các công ty có hơn {0} nhà phát triển.",
    "DiscountRequestOrganizationName": "Tên công ty/tổ chức/trường học",
    "Website": "Trang mạng",
    "GithubUsername": "Tên người dùng GitHub",
    "PhoneNumber": "Số điện thoại",
    "Country": "Quốc gia",
    "DescribeABPCommercialUsage": "Mô tả dự án bạn đang định phát triển dựa trên APB Commercial",
    "DiscountRequestCertifyInformationMessage": "Tôi xác nhận tất cả các thông tin là đúng sự thật và chính xác.",
    "DiscountRequestReceived": "Chúng tôi đã nhận được yêu cầu giảm giá của bạn.",
    "DiscountRequestStatusMessage": "Chúng tôi sẽ phản hồi bạn sau khi kiểm tra thông tin bạn đã cung cấp.",
    "MVCOrRazorPages": "MVC (Trang dao cạo)",
    "Angular": "Angular",
    "Blazor": "Blazor",
    "New": "Mới",
    "MongoDB": "MongoDB",
    "EBookDDD": "Thiết kế theo hướng miền sách điện tử",
    "PracticalGuideForImplementingDDD": "Cuốn sách này là hướng dẫn thực tế để triển khai Thiết kế theo hướng miền với Khung ABP.",
    "IntroducingDDD": "Giới thiệu thiết kế theo hướng miền",
    "DDDLayersAndCleanArchitecture": "Lớp DDD & Kiến trúc sạch",
    "LayeringOfADotnetSolution": "Phân lớp của Giải pháp .NET",
    "ImplementingDDDBuildingBlocks": "Triển khai khối xây dựng DDD",
    "DomainVsApplicationLogic": "Logic miền so với Logic ứng dụng",
    "SamplesAndDiscussions": "Mẫu & Thảo luận",
    "Free": "Miễn phí",
    "Download": "Tải xuống",
    "DDDEBook": "Sách điện tử DDD",
    "ImplementingDDD": "Triển khai thiết kế theo hướng miền",
    "DDDBookExplanation": "Hướng dẫn thực tế để triển khai Thiết kế theo hướng miền với Khung ABP.",
    "Overview": "Tổng quat",
    "DDDBookPracticalGuide": "Đây là hướng dẫn thực tế để triển khai Thiết kế theo hướng miền (DDD). Mặc dù chi tiết triển khai dựa trên cơ sở hạ tầng ABP Framework, nhưng các khái niệm, nguyên tắc và mẫu cốt lõi có thể áp dụng trong bất kỳ loại giải pháp nào, ngay cả khi nó không phải là giải pháp .NET.",
    "TableOfContents": "Mục lục",
    "IntroductionToImplementingDDD": "Giới thiệu về triển khai thiết kế theo hướng miền",
    "WhatIsDDD": "Thiết kế theo hướng miền là gì?",
    "Implementation": "Thực hiện",
    "TheBigPicture": "Bức tranh lớn",
    "TheBuildingBlock": "Khối xây dựng",
    "ExampleUseCase": "Trường hợp sử dụng mẫu",
    "DomainAndApplicationLogic": "Logic miền & Logic ứng dụng",
    "Author": "Tác giả",
    "PublishedOn": "Được xuất bản trên",
    "Page": "Trang",
    "FreeEBook": "Sách điện tử miễn phí",
    "EBookSignInForDownload": "Để tải xuống sách điện tử, hãy đăng nhập",
    "SignIn": "Đăng nhập",
    "Or": "Hoặc",
    "TellUsAboutYourself": "Hãy cho chúng tôi biết một chút về bạn",
    "Surname": "Họ",
    "DoYouAgreePrivacyPolicy": "Tôi đồng ý với <a href=\"/TermsConditions\"> Điều khoản & Điều kiện <a/> và <a href=\"/Privacy\"> Chính sách Bảo mật </a>.",
    "VolosoftMarketingInformationMessage": "Tôi muốn thông tin, thủ thuật và ưu đãi về Giải pháp cho Doanh nghiệp và Tổ chức cũng như các sản phẩm và dịch vụ khác của Volosoft.",
    "VolosoftSharingInformationMessage": "Tôi muốn Volosoft chia sẻ thông tin của tôi với một số đối tác để tôi có thể nhận được thông tin liên quan về các sản phẩm và dịch vụ của họ.",
    "WeWillSendYouADownloadLink": "Một liên kết để tải xuống sách điện tử đã được gửi tới {0}. <br/> Hãy kiểm tra hộp thư đến/hộp thư rác/hộp thư rác của bạn!",
    "InvalidFormInputs": "Vui lòng nhập thông tin hợp lệ được chỉ định trên biểu mẫu.",
    "DDDBookEmailBody": "Cảm ơn bạn. <br /> Để tải xuống sách của bạn, hãy <a href=\"{0}\"> nhấp vào đây </a>.",
    "FreeDDDEBook": "Sách điện tử DDD miễn phí",
    "StartFree": "Bắt đầu miễn phí",
    "FreeTrial": "Bản dùng thử miễn phí",
    "AcceptsMarketingCommunications": " Có, tôi muốn nhận thông báo tiếp thị thương mại của ABP.",
    "PurposeOfUsage": "Mục đích sử dụng",
    "Industry": "Ngành công nghiệp",
    "Choose": "- Lựa chọn -",
    "CompanyOrganizationName": "Tên của Công ty/Tổ chức",
    "CompanySize": "Quy mô công ty",
    "Next": "Kế tiếp",
    "StartTrial": "Bắt đầu bản dùng thử miễn phí của tôi",
    "ContactUsIssues": "Liên hệ với chúng tôi nếu bạn có bất kỳ vấn đề nào",
    "TrialActivatedWarning": "Kính gửi {0}, người dùng chỉ được phép có 1 thời gian dùng thử miễn phí. Bạn đã sử dụng thời gian dùng thử của mình.",
    "ActivationRequirement": "Bạn chỉ còn một bước nữa là bắt đầu dùng thử miễn phí. <br> Chúng tôi đã gửi email đến <b> {0} </b> để kích hoạt tài khoản của bạn. Kiểm tra hộp thư đến/hộp thư rác/hộp thư rác của bạn!",
    "SaveAndDownload": "Lưu và tải xuống",
    "CompanyNameValidationMessage": "Tên công ty quá dài!",
    "AddressValidationMessage": "Địa chỉ quá dài!",
    "TaxNoValidationMessage": "THUẾ/VAT Không quá dài!",
    "NotesValidationMessage": "Trường ghi chú quá dài!",
    "CheckYourBillingInfo": "Bạn chỉ có thể tạo hóa đơn một lần! Kiểm tra thông tin thanh toán của bạn trước khi tạo hóa đơn.",
    "Volo.AbpIo.Commercial:030000": "Bạn đã sử dụng thời gian dùng thử của mình.",
    "Volo.AbpIo.Commercial:030001": "Tên tổ chức này đã tồn tại.",
    "StartYourFreeTrial": "Bắt đầu bản dùng thử miễn phí của bạn",
    "TrialLicenseModelInvalidErrorMessage": "Một trong các trường sau không hợp lệ: Tên quốc gia, Quy mô công ty, Ngành hoặc Mục đích sử dụng.",
    "Trial": "Sự thử nghiệm",
    "Purchased": "Đã mua",
    "PurchaseLicense": "Giấy phép mua bán",
    "PurchaseTrialLicenseMessage": "Ngày hết hạn giấy phép của bạn là {0}. <br> Nếu bạn muốn tiếp tục sử dụng các dự án bạn đã tạo trong thời gian dùng thử miễn phí, bạn cần thay đổi khóa cấp phép trong các tệp <code> appsettings.secrets.json </code> của mình. Đây là khóa cấp phép của bạn:",
    "TrialLicenseExpireMessage": "Bạn đang sử dụng giấy phép dùng thử và giấy phép dùng thử của bạn sẽ hết hạn vào {0}.",
    "TryForFree": "Thử miễn phí",
    "TrialLicenseExpiredInfo": "Thời gian cấp phép dùng thử của bạn đã hết hạn!",
    "CommercialNewsletterConfirmationMessage": "Tôi đồng ý với <a href=\"https://commercial.abp.io/TermsConditions\"> Điều khoản & điều kiện </a> và <a href=\"https://commercial.abp.io/Privacy\"> Chính sách quyền riêng tư </a>."
  }
}